
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Проверим заполнение реквизита СчетОрганизации у создаваемых строк.
	Для Каждого ТекЗаявкиКИсполнению Из ЭтотОбъект.ЗаявкиКИсполнению Цикл
		Если ТекЗаявкиКИсполнению.Создавать Тогда
			Если НЕ ЗначениеЗаполнено(ТекЗаявкиКИсполнению.СчетОрганизации) Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнен Банковский счёт для заявки %Заявка%. Генерация отменена.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Заявка%", Строка(ТекЗаявкиКИсполнению.ЗаявкаНаОперацию));
				ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
				Отказ = Истина;
			Иначе
				// Проверка пройдена успешно.
			КонецЕсли;
		Иначе
			// Пропускаем строку.
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры
