&НаСервере
Процедура ЗагрузитьПериодичности()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Периодичность.Ссылка,
		|	Периодичность.Порядок КАК Порядок,
		|	ВЫБОР
		|		КОГДА Периодичность.Ссылка В (&СписокПериодичности)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Использование
		|ИЗ
		|	Перечисление.Периодичность КАК Периодичность
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	Запрос.УстановитьПараметр("СписокПериодичности", СписокПериодичностей);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ТаблицаПериодичностей.Добавить();
		НоваяСтрока.Использование = ВыборкаДетальныеЗаписи.Использование;
		НоваяСтрока.Периодичность = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокПериодичностей = Параметры.СписокПериодичностей;
	ЗагрузитьПериодичности();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанные(Команда)
	ПараметрыЗакрытия = Новый Массив;
	Для Каждого ТекТаблицаПериодичностей Из ТаблицаПериодичностей Цикл
		СтруктураПериодичности = Новый Структура;
		СтруктураПериодичности.Вставить("Периодичность", ТекТаблицаПериодичностей.Периодичность);
		СтруктураПериодичности.Вставить("Использование", ТекТаблицаПериодичностей.Использование);
		ПараметрыЗакрытия.Добавить(СтруктураПериодичности);
	КонецЦикла;
	ОповеститьОВыборе(ПараметрыЗакрытия);
КонецПроцедуры
