Функция ЗначениеНетиповойКонстанты(ИмяКонстанты) Экспорт
	
	Результат = Неопределено;
	Если ЗначениеЗаполнено(ИмяКонстанты) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	з.Значение КАК Значение
			|ИЗ
			|	(ВЫБРАТЬ
			|		Л3_КонстантыНетиповыхАлгоритмовСписок.Значение КАК Значение
			|	ИЗ
			|		Справочник.Л3_КонстантыНетиповыхАлгоритмов.Список КАК Л3_КонстантыНетиповыхАлгоритмовСписок
			|	ГДЕ
			|		Л3_КонстантыНетиповыхАлгоритмовСписок.Ссылка.Наименование = &Наименование
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Л3_КонстантыНетиповыхАлгоритмов.Значение
			|	ИЗ
			|		Справочник.Л3_КонстантыНетиповыхАлгоритмов КАК Л3_КонстантыНетиповыхАлгоритмов
			|	ГДЕ
			|		Л3_КонстантыНетиповыхАлгоритмов.Наименование = &Наименование) КАК з
			|ГДЕ
			|	з.Значение <> НЕОПРЕДЕЛЕНО";
		
		Запрос.УстановитьПараметр("Наименование", ИмяКонстанты);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() = 1 Тогда
			Результат = ТЗ[0].Значение;
		ИначеЕсли ТЗ.Количество() > 1 Тогда
			Результат = ТЗ.ВыгрузитьКолонку("Значение");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции