
#Область СлужебныйПрограммныйИнтерфейс

#Область ОМ_ДействияСогласованиеУХКлиент
	
Процедура ОбработкаОповещенияФормыСписка(ИмяСобытияВход, ЭлементСписокВход) Экспорт
	ДействияСогласованиеУХКлиент.ОбработкаОповещенияФормыСписка(ИмяСобытияВход, ЭлементСписокВход);
КонецПроцедуры

Процедура ИзменитьСостояниеЗаявкиКлиент(СтатусВход, Форма) Экспорт
	ДействияСогласованиеУХКлиент.ИзменитьСостояниеЗаявкиКлиент(СтатусВход, Форма);
КонецПроцедуры

Процедура ПринятьКСогласованию(Форма, Ссылка) Экспорт
	ДействияСогласованиеУХКлиент.ПринятьКСогласованию(Форма, Ссылка);	
КонецПроцедуры

Процедура ИсторияСогласования(Форма, Ссылка) Экспорт
	ДействияСогласованиеУХКлиент.ИсторияСогласования(Форма,Ссылка);
КонецПроцедуры

Процедура СогласоватьДокумент(Форма, СсылкаВход = Неопределено) Экспорт
	ДействияСогласованиеУХКлиент.СогласоватьДокумент(Форма, СсылкаВход);
КонецПроцедуры

Процедура ОтменитьСогласование(Форма = Неопределено, СсылкаВход = Неопределено) Экспорт
	ДействияСогласованиеУХКлиент.ОтменитьСогласование(Форма, СсылкаВход);
КонецПроцедуры

Процедура МаршрутСогласования(Форма, Ссылка) Экспорт
	ДействияСогласованиеУХКлиент.МаршрутСогласования(Форма, Ссылка);
КонецПроцедуры

#КонецОбласти 

#Область ОМ_ЦентрализованныеЗакупкиКлиентУХ

Процедура ЗафиксироватьТипНоменклатуры(Форма, ИмяКнопкиФиксации, ИмяКолонкиНоменклатура) Экспорт
	ЦентрализованныеЗакупкиКлиентУХ.ЗафиксироватьТипНоменклатуры(Форма,	ИмяКнопкиФиксации, ИмяКолонкиНоменклатура);
КонецПроцедуры

Процедура ОбработчикЕдиницаИзмеренияНачалоВыбора(ТекДанные, ДанныеВыбора) Экспорт
	ЦентрализованныеЗакупкиКлиентУХ.ОбработчикЕдиницаИзмеренияНачалоВыбора(ТекДанные, ДанныеВыбора);
КонецПроцедуры

#КонецОбласти 

// Процедура обрабатываем вызов общих команд Заявки*
Процедура ОткрытьФормуСпискаЗаявок(ПараметрыВыполненияКоманды) Экспорт
	
	Если ПараметрыВыполненияКоманды.НавигационнаяСсылка = "e1cib/command/ОбщаяКоманда.ЗаявкиНаОплату" Тогда
		ИмяФормы = "Документ.ЗаявкаНаРасходованиеДенежныхСредств.Форма.ФормаСпискаДокументов";
	ИначеЕсли ПараметрыВыполненияКоманды.НавигационнаяСсылка = "e1cib/command/ОбщаяКоманда.ПланируемыеПоступления" Тогда
		ИмяФормы = "Документ.ОжидаемоеПоступлениеДенежныхСредств.Форма.ФормаСписка";
	ИначеЕсли ПараметрыВыполненияКоманды.НавигационнаяСсылка = "e1cib/command/ОбщаяКоманда.ЗаявкиНаРасход" Тогда
		ИмяФормы = "Документ.ЗаявкаНаРасход.ФормаСписка";
	ИначеЕсли ПараметрыВыполненияКоманды.НавигационнаяСсылка = "e1cib/command/ОбщаяКоманда.ПланируемыеДоходы" Тогда
		ИмяФормы = "Документ.ПланируемыйДоход.ФормаСписка";
	Иначе
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормы, , , , ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти

