#Область СлужебныйПрограммныйИнтерфейс

// Добавляет записи в таблицу описания объектов бухгалтерского учета.
// 
// Параметры:
// 	ОбъектыБухгалтерскогоУчета - ТаблицаЗначений - Описание колонок:
//  * ОбъектУчета - ПеречислениеСсылка.ОбъектыБухгалтерскогоУчета - Ссылка объекта бухгалтерского учета
//  * ФункциональныеОпции - Массив из Строка - массив имен функциональных опций, управляющих ведением учета по объекту бух.учета
//  * ИсточникДанных - Строка - Имя регистра накопления, в котором ведется учет по объекту бух.учета
//  * ОтборДанных - Соответствие, Массив - Отбор данных регистра по объекту бух.учета. Условия отбора в Соответствии складываются по "И", в Массиве по "ИЛИ"
//  * ПутьКДаннымОбъектНастройки - Строка - Путь выборки данных регистра, соответствующих объектам настроек, в разрезе которых указываются счета учета. Указывается в случае отличия от аналогичного параметра регистра накопления
//  * ПутьКДаннымИдентификаторФинЗаписи - Строка - Путь выборки значения идентификатора записи регистра. Указывается в случае отличия от аналогичного параметра регистра накопления
//  * ПутьКДаннымНаправлениеДеятельности - Строка - Путь выборки значения направления деятельности из данных регистра. Указывается в случае отличия от аналогичного параметра регистра накопления
//  * ПутиКДаннымСубконто - Соответствие Из КлючИЗначение - Уточнение путей выборки субконто. Указывается в случае некорректного результата подбора значения субконто по источникам субконто регистра
//  	* Ключ - ПланВидовХарактеристикСсылка.ВидыСубконтоМеждународные - Вид субконто
//  	* Значение - Строка - Путь выборки значения субконто
//  * РесурсыУпр - Массив - Массив строк с именами ресурсов, хранящих сумму операции в валюте управленческого учета. Указывается в случае отличия от аналогичного параметра регистра накопления
//  * РесурсыРегл - Массив - Массив строк с именами ресурсов, хранящих сумму операции в валюте регламентированного учета. Указывается в случае отличия от аналогичного параметра регистра накопления
//  * РесурсыВал - Массив - Массив строк с именами ресурсов, хранящих валютную сумму операции. Указывается в случае отличия от аналогичного параметра регистра накопления
// 
Процедура ДобавитьОписаниеОбъектовБухгалтерскогоУчета(ОбъектыБухгалтерскогоУчета) Экспорт
	
	//++ Локализация
	
	СтрокаДенежныеДокументы = ОбъектыБухгалтерскогоУчета.Добавить();
	СтрокаДенежныеДокументы.ОбъектУчета = Перечисления.ОбъектыБухгалтерскогоУчета.ДенежныеДокументы;
	СтрокаДенежныеДокументы.ФункциональныеОпции.Добавить(Метаданные.ФункциональныеОпции.ИспользоватьРеглУчет.Имя);
	СтрокаДенежныеДокументы.ИсточникДанных = Метаданные.РегистрыНакопления.ДенежныеДокументы.Имя; 
	
	СтрокаРезервыПоВознаграждениям = ОбъектыБухгалтерскогоУчета.Добавить();
	СтрокаРезервыПоВознаграждениям.ОбъектУчета = Перечисления.ОбъектыБухгалтерскогоУчета.РезервыПоВознаграждениям;
	СтрокаРезервыПоВознаграждениям.ФункциональныеОпции.Добавить(Метаданные.ФункциональныеОпции.ИспользоватьРасчетРезервовОтпусков.Имя);
	СтрокаРезервыПоВознаграждениям.ИсточникДанных = Метаданные.РегистрыНакопления.ДвиженияПоПрочимАктивамПассивам.Имя;
	ОтборДанных = Новый Соответствие();
	ОтборДанных.Вставить("Статья", ПланыВидовХарактеристик.СтатьиАктивовПассивов.РезервыПоВознаграждениям);
	СтрокаРезервыПоВознаграждениям.ОтборДанных = ОтборДанных;
	
	СтрокаРезервыПоСтраховымВзносам = ОбъектыБухгалтерскогоУчета.Добавить();
	СтрокаРезервыПоСтраховымВзносам.ОбъектУчета = Перечисления.ОбъектыБухгалтерскогоУчета.РезервыПоСтраховымВзносам;
	СтрокаРезервыПоСтраховымВзносам.ФункциональныеОпции.Добавить(Метаданные.ФункциональныеОпции.ИспользоватьРасчетРезервовОтпусков.Имя);
	СтрокаРезервыПоСтраховымВзносам.ИсточникДанных = Метаданные.РегистрыНакопления.ДвиженияПоПрочимАктивамПассивам.Имя;
	СтрокаРезервыПоСтраховымВзносам.ПутьКДаннымОбъектНастройки = "Аналитика";
	ОтборДанных = Новый Соответствие();
	ОтборДанных.Вставить("Статья", ПланыВидовХарактеристик.СтатьиАктивовПассивов.РезервыПоСтраховымВзносам);
	СтрокаРезервыПоСтраховымВзносам.ОтборДанных = ОтборДанных;
	
	//-- Локализация
	
КонецПроцедуры

// Добавляет элементы в соответствие расширенного описания объектов бухгалтерского учета.
// 
// Параметры:
//  ОписаниеОбъектовУчетаДляНастройкиФорм - Соответствие Из КлючИЗначение - данные расширенного описания объектов бухгалтерского учета:
//  	* Ключ - ПеречислениеСсылка.ОбъектыБухгалтерскогоУчета - объект бухгалтерского учета
//  	* Значение - См. Перечисления.ОбъектыБухгалтерскогоУчета.ОписаниеОбъектаУчетаДляНастройкиФорм
//  ГруппыОбъектовУчета - Структура - См. Перечисления.ОбъектыБухгалтерскогоУчета.ГруппыОбъектовУчета
//
Процедура ДобавитьРасширенноеОписаниеОбъектовУчетаДляНастройки(ОписаниеОбъектовУчетаДляНастройкиФорм, ГруппыОбъектовУчета) Экспорт
	
	//++ Локализация
	
	ОписаниеОбъектаУчета = Перечисления.ОбъектыБухгалтерскогоУчета.ОписаниеОбъектаУчетаДляНастройкиФорм();
	ОписаниеОбъектаУчета.Группа = ГруппыОбъектовУчета.ДережныеСредства;
	ОписаниеОбъектаУчета.Представление = НСтр("ru = 'В денежных документах';
												|en = 'In financial documents'");
	ОписаниеОбъектаУчета.ЗаголовокТаблицыНастройкиСчетов = НСтр("ru = 'Счета учета денежных документов';
																|en = 'Ledger accounts of financial documents'");
	ОписаниеОбъектаУчета.ОписаниеТиповОбъектНастройки = Неопределено;
	ОписаниеОбъектаУчета.ОписаниеТиповМестоУчета = Новый ОписаниеТипов();
	ОписаниеОбъектовУчетаДляНастройкиФорм.Вставить(Перечисления.ОбъектыБухгалтерскогоУчета.ДенежныеДокументы, ОписаниеОбъектаУчета);
	
	ОписаниеОбъектаУчета = Перечисления.ОбъектыБухгалтерскогоУчета.ОписаниеОбъектаУчетаДляНастройкиФорм();
	ОписаниеОбъектаУчета.Группа = ГруппыОбъектовУчета.ПрочиеАктивыИОбязательства;
	ОписаниеОбъектаУчета.Представление = НСтр("ru = 'Резервы по вознаграждениям';
												|en = 'Remuneration provisions'");
	ОписаниеОбъектаУчета.ЗаголовокТаблицыНастройкиСчетов = НСтр("ru = 'Счета учета оценочных обязательств по вознаграждениям';
																|en = 'GL accounts of provisions for remunerations'");
	ОписаниеОбъектаУчета.ОписаниеТиповОбъектНастройки = Неопределено;
	ОписаниеОбъектаУчета.ОписаниеТиповМестоУчета = Новый ОписаниеТипов();
	ОписаниеОбъектовУчетаДляНастройкиФорм.Вставить(Перечисления.ОбъектыБухгалтерскогоУчета.РезервыПоВознаграждениям, ОписаниеОбъектаУчета);
	
	ОписаниеОбъектаУчета = Перечисления.ОбъектыБухгалтерскогоУчета.ОписаниеОбъектаУчетаДляНастройкиФорм();
	ОписаниеОбъектаУчета.Группа = ГруппыОбъектовУчета.ПрочиеАктивыИОбязательства;
	ОписаниеОбъектаУчета.Представление = НСтр("ru = 'Резервы по страховым взносам';
												|en = 'Insurance contribution provisions'");
	ОписаниеОбъектаУчета.ЗаголовокТаблицыНастройкиСчетов = НСтр("ru = 'Счета учета оценочных обязательств по страховым взносам';
																|en = 'GL accounts of provisions for insurance contributions'");
	ОписаниеОбъектаУчета.ОписаниеТиповОбъектНастройки = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНалогов");
	ОписаниеОбъектаУчета.ОтборОбъектовНастройки = Новый Структура("Ссылка", Перечисления.ТипыНалогов.ФССНС);
	ОписаниеОбъектаУчета.ОписаниеТиповМестоУчета = Новый ОписаниеТипов();
	ОписаниеОбъектовУчетаДляНастройкиФорм.Вставить(Перечисления.ОбъектыБухгалтерскогоУчета.РезервыПоСтраховымВзносам, ОписаниеОбъектаУчета);
	
	//-- Локализация
	
КонецПроцедуры

// Добавляет в переданный массив имена неиспользуемых документов
// 
// Параметры:
// 	ИменаДокументов - Массив из Строка - имена неиспользуемых документов
//
Процедура ДобавитьИменаНеиспользуемыхДокументов(ИменаДокументов) Экспорт
	
	//++ Локализация
	
	МетаданныеДокументы = Метаданные.Документы;
	
	ИменаДокументов.Добавить(МетаданныеДокументы.ВозвратМатериаловИзПроизводства.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ВыпускПродукции.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ПередачаМатериаловВПроизводство.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ПеремещениеМатериаловВПроизводстве.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.СписаниеЗатратНаВыпуск.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.АмортизацияНМА.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.АмортизацияОС.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ВводОстатковВнеоборотныхАктивов.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ВозвратОСИзАренды.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ИзменениеПараметровНМА.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ИзменениеПараметровОС.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ИзменениеСостоянияОС.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.МодернизацияОС.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ПередачаОСВАренду.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ПеремещениеОС.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ПереоценкаНМА.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ПереоценкаОС.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ПодготовкаКПередачеНМА.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ПодготовкаКПередачеОС.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ПринятиеКУчетуНМА.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.ПринятиеКУчетуОС.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.СписаниеНМА.Имя);
	ИменаДокументов.Добавить(МетаданныеДокументы.СписаниеОС.Имя);
	
	//-- Локализация
	
КонецПроцедуры

// Добавляет в переданный массив типы документов ввода начальных остатков
// 
// Параметры:
// 	ТипыДокументов - Массив из Тип - типы документов ввода начальных остатков
//
Процедура ДобавитьТипыДокументовВводаОстатков(ТипыДокументов) Экспорт
	
	//++ Локализация
	
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ВводОстатковНДСПредъявленного"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ВводОстатковРасходовПриУСН"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ВводОстатковТМЦВЭксплуатации"));
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти