
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму("Справочник.ПравилаОбработки.ФормаОбъекта", Новый Структура("Ключ", ПолучитьНастройкиПоУмолчанию(ПараметрКоманды)), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиПоУмолчанию(ВидОтчета)
	
	Возврат УправлениеОтчетамиУХ.НайтиПараметрОтчета(Перечисления.ЭлементыНастройкиОтчета.ПравилоОбработки, ВидОтчета);
	
КонецФункции