
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Сценарий", Параметры.Сценарий);
	Список.Параметры.УстановитьЗначениеПараметра("Период", Параметры.Период);
	Список.Параметры.УстановитьЗначениеПараметра("Инвестор", Параметры.Инвестор);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
	ОповеститьОВыборе(Новый Структура("Инвестиция,ДоляВладения", ТекСтрока.ОбъектИнвестирования, ТекСтрока.ЭффективнаяДоля));
КонецПроцедуры

&НаКлиенте
Процедура Выбор(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОповеститьОВыборе(Новый Структура("Инвестиция,ДоляВладения", Элементы.Список.ТекущиеДанные.ОбъектИнвестирования, Элементы.Список.ТекущиеДанные.ЭффективнаяДоля));
КонецПроцедуры
