#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	УстановкаРеквизитовИсторииПереходаНаНовыеФормулы();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	НепроверяемыеРеквизиты.Добавить("НастройкиЗаполненияСубконто.Выражение");
	
	Если Не ЭтоГруппа 
		И (РучноеУточнениеПроводки Или НеОтражаетсяВМеждународномУчете) Тогда
		НепроверяемыеРеквизиты.Добавить("СчетМеждународногоУчетаДт");
		НепроверяемыеРеквизиты.Добавить("СчетМеждународногоУчетаКт");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановкаРеквизитовИсторииПереходаНаНовыеФормулы()
	
	Если НЕ ЭтоГруппа Тогда
		
		Для Каждого СтрокаТЧ Из НастройкиЗаполненияСубконто Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ВыражениеИсторияПереходаНаНовыеФормулы)
				И ЗначениеЗаполнено(СтрокаТЧ.Выражение) Тогда
				СтрокаТЧ.ВыражениеИсторияПереходаНаНовыеФормулы = СтрокаТЧ.Выражение;
			КонецЕсли;
		КонецЦикла;
		УдалитьПереходНаНовыеФормулыВыполнен = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли