////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Определяет список объектов конфигурации, в модулях менеджеров которых предусмотрена процедура 
// ДобавитьКомандыСозданияНаОсновании, формирующая команды создания на основании объектов.
// Синтаксис процедуры ДобавитьКомандыСозданияНаОсновании см. в документации.
//
// см. ОбщийМодуль.СозданиеНаОснованииПереопределяемый.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании()
//   
Процедура ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты) Экспорт
	
	//Объекты.Добавить(Метаданные.Документы.АмортизацияНМА);
	
КонецПроцедуры


// Вызывается для формирования списка команд создания на основании КомандыСозданияНаОсновании, однократно для при первой
// необходимости, а затем результат кэшируется с помощью модуля с повторным использованием возвращаемых значений.
// Здесь можно определить команды создания на основании, общие для большинства объектов конфигурации.
//
// см. ОбщийМодуль.СозданиеНаОснованииПереопределяемый.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании()
//
Процедура ПередДобавлениемКомандСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры, СтандартнаяОбработка) Экспорт
	
	// Претензии
	Если ПравоДоступа("Просмотр", Метаданные.Документы.ИзменениеПретензии) Тогда
		ИсточникиПретензий = Метаданные.ОпределяемыеТипы.РасчетныйДокумент.Тип;
		Для Каждого СведенияОбОбъекте Из Параметры.Источники.Строки Цикл
			
			Если ТипЗнч(СведенияОбОбъекте.ТипСсылкиДанных) <> Тип("Тип") Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ИсточникиПретензий.СодержитТип(СведенияОбОбъекте.ТипСсылкиДанных) Тогда
				Продолжить;
			КонецЕсли;
			Команда = Документы.ИзменениеПретензии.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
			ДоописатьКоманду(СведенияОбОбъекте, Команда);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
	//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Текст процедуры заимствован из процедуры СозданиеНаОсновании.ПриДобавленииКомандСозданияНаОсновании(..)
Процедура ДоописатьКоманду(СведенияОбОбъекте, Команда)
			
	// Дополнить...
	Если Не ЗначениеЗаполнено(Команда.Менеджер) Тогда
		Команда.Менеджер = СведенияОбОбъекте.ПолноеИмя;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Команда.ТипПараметра) Тогда
		Команда.ТипПараметра = СведенияОбОбъекте.ТипСсылкиДанных;
	КонецЕсли;
	//Если ДопустимыеТипы <> Неопределено И Не ТипВМассиве(Команда.ТипПараметра, ДопустимыеТипы) Тогда
	//	Команды.Удалить(Команда);
	//	Продолжить;
	//КонецЕсли;
	//Найденные = Команды.НайтиСтроки(Новый Структура("Обработана, Представление", Истина, Команда.Менеджер));
	//Если Найденные.Количество() > 0 Тогда
	//	Найденные[0].ТипПараметра = ОбъединитьТипы(Найденные[0].ТипПараметра, Команда.ТипПараметра);
	//	Команды.Удалить(Команда);
	//	Продолжить;
	//КонецЕсли;
	Команда.Обработана = Истина;
	Если Не ЗначениеЗаполнено(Команда.Обработчик) И Не ЗначениеЗаполнено(Команда.ИмяФормы) Тогда
		Команда.ИмяФормы = "ФормаОбъекта";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Команда.ИмяПараметраФормы) Тогда
		Команда.ИмяПараметраФормы = "Основание";
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти
 