
// Вызываются процедуры и функции общих модулей:
//	- РасчетСебестоимостиПрикладныеАлгоритмы.
//	- РасчетСебестоимостиПроизводство
#Область ПрограммныйИнтерфейс

//++ НЕ УТ
#Область ЗапросыДляРасшифровки_2_2

// Получает данные для построения расшифровки базы распределения постатейных расходов.
//
// Параметры:
//		Период - Дата - период расчета
//		МассивОрганизаций - СправочникСсылка.Организации - массив организаций;
//		Регистратор - ДокументСсылка.РаспределениеПрочихЗатрат - документ распределения, для которого строится расшифровка
//		РасчетСебестоимостиВыполнен - Булево - принимает значение Истина, если расчет себестоимости за указанный период выполнен успешно.
//
// Возвращаемое значение:
//		МенеджерВременныхТаблиц - таблицы для построения отчета.
//
Функция ДанныеДляРасшифровкиДолейПроизводственныхРасходов(Период, МассивОрганизаций, Регистратор, РасчетСебестоимостиВыполнен) Экспорт
	
	ПараметрыРасчета = РасчетСебестоимостиПроизводство.ИнициализироватьПараметрыРасшифровкиРаспределения(
		Период,
		РасчетСебестоимостиПрикладныеАлгоритмы.СвязиОрганизацийПоСхемеИнтеркампани(Период, МассивОрганизаций),
		Регистратор);
	
	СостояниеРасчетаСебестоимости = РасчетСебестоимостиПрикладныеАлгоритмы.ТекущееСостояниеРасчета(
		Период,
		МассивОрганизаций,
		Перечисления.ОперацииЗакрытияМесяца.РасчетПартийИСебестоимости);
	
	Если СостояниеРасчетаСебестоимости = Перечисления.СостоянияОперацийЗакрытияМесяца.ВыполненоУспешно
	 ИЛИ СостояниеРасчетаСебестоимости = Перечисления.СостоянияОперацийЗакрытияМесяца.НеТребуется Тогда
		ПараметрыРасчета.Вставить("РасчетСебестоимостиВыполнен");
		РасчетСебестоимостиВыполнен = Истина;
	КонецЕсли;
	
	РаспределитьДолиПроизводственныхРасходов(ПараметрыРасчета);
	
	Возврат ПараметрыРасчета.МенеджерВременныхТаблиц;
	
КонецФункции

// Получает данные базы распределения расходов по прямым затратам.
//
// Параметры:
//		Период - Дата - период расчета
//		МассивОрганизаций - СправочникСсылка.Организации - массив организаций;
//		Регистратор - ДокументСсылка - документ распределения, для которого строится расшифровка
//
// Возвращаемое значение:
//		МенеджерВременныхТаблиц - таблица базы распределения по прямым затратам.
//
Функция ПодготовитьБазуПоПрямымЗатрат(Период, МассивОрганизаций, Регистратор = Неопределено) Экспорт
	
	ПараметрыРасчета = Неопределено;
	ПараметрыОтладки = Неопределено;
	
	ПараметрыЗапуска = Новый Структура(
		"Дата, МассивОрганизаций, ПолучениеСпискаПараметров",
		Период, МассивОрганизаций, Истина);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыОтладки(ПараметрыОтладки, ПараметрыЗапуска);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыРасчетаПартий(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	Т.ДокументДвижения				КАК ДокументДвижения,
		|	Т.Период						КАК Период,
		|
		|	Т.Организация					КАК Организация,
		|	Т.АналитикаУчетаНоменклатуры	КАК АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов					КАК ВидЗапасов,
		|	Т.РазделУчета					КАК РазделУчета,
		|	Т.Партия						КАК Партия,
		|	Т.АналитикаУчетаПартий			КАК АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета		КАК АналитикаФинансовогоУчета,
		|	Т.ВидДеятельностиНДС			КАК ВидДеятельностиНДС,
		|
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК Стоимость,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК СтоимостьБезНДС,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК СтоимостьЗабалансовая,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК СтоимостьДопРасходы,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК СтоимостьДопРасходыБезНДС,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК Трудозатраты,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК ПостатейныеПостоянныеСНДС,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК ПостатейныеПостоянныеБезНДС,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК ПостатейныеПеременныеСНДС,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК ПостатейныеПеременныеБезНДС,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК СтоимостьРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК СтоимостьЗабалансоваяРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК ПостояннаяРазница,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК ВременнаяРазница,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК ДопРасходыРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК ТрудозатратыРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК ПостатейныеПостоянныеРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК ПостатейныеПеременныеРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК СтоимостьУпр,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК ДопРасходыУпр,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК ТрудозатратыУпр,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК ПостатейныеПостоянныеУпр,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (31, 10))	КАК ПостатейныеПеременныеУпр
		|ПОМЕСТИТЬ ВТСтоимостьПартийТоваров
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК Т";
	Запрос.Выполнить();
	
	ПараметрыРасчета.Вставить("РасчетСебестоимостиВыполнен", Истина);
	ПараметрыРасчета.Вставить("Регистратор", Регистратор);
	
	Если Не РасчетСебестоимостиПрикладныеАлгоритмы.ВременнаяТаблицаСуществует(ПараметрыРасчета.МенеджерВременныхТаблиц, "ВтОВЗ") Тогда
		Запрос.Текст = РасчетСебестоимостиПостатейныеЗатраты.ТекстВТпоОВЗ();
		Запрос.Выполнить();
	КонецЕсли;
	
	Документы.РаспределениеПрочихЗатрат.ПодготовитьТаблицыКРасчету(ПараметрыРасчета);
	
	//++ НЕ УТКА
	ПараметрыПолученияПартий = ЗатратыСервер.ОписаниеПараметровПолученияАктивныхПартий();
	ПараметрыПолученияПартий.НачалоПериода = ПараметрыРасчета.РасчетныйПериод.НачалоПериода;
	ПараметрыПолученияПартий.ОкончаниеПериода = ПараметрыРасчета.РасчетныйПериод.КонецПериода;
	ПараметрыПолученияПартий.Организации = ПараметрыРасчета.МассивОрганизаций;
	
	ЗатратыСервер.ПоместитьАктивныеПартииБезСпецификаций(ПараметрыПолученияПартий, ПараметрыРасчета.МенеджерВременныхТаблиц);
	//-- НЕ УТКА
	
	// Подготовим запрос.
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.УстановитьПараметр("РасчетСебестоимостиВыполнен", Истина);
	Запрос.УстановитьПараметр("РасшифровкаРаспределения", Ложь);
	Запрос.УстановитьПараметр("ВключатьДанныеПроизводства21", Истина);
	Запрос.УстановитьПараметр("УчитыватьБудущиеВыпуски", Истина);
	
	ТекстЗапроса = 
		ТекстПоказателиРаспределенияПоПодразделениям()
		+ ТекстПодразделенияПоОтбору(ПараметрыРасчета)
		+ ТекстДанныеПоФактическимМатериальнымЗатратам(ПараметрыРасчета)
		+ ТекстДанныеПоПредварительнымМатериальнымЗатратам(ПараметрыРасчета)
		+ РасчетСебестоимостиПроизводство.ТекстДанныеПоТрудозатратам(ПараметрыРасчета)
		+ ТекстДанныеПоТрудозатратамСвернуто()
		+ РасчетСебестоимостиПроизводство.ТекстПартииПроизводства()
		+ РасчетСебестоимостиПроизводство.ТекстПустаяТаблицаПартииМатериаловВНЗП()
		+ РасчетСебестоимостиПроизводство.ТекстДолиСтоимостиПоПродукции()
		+ РасчетСебестоимостиПроизводство.ТекстДанныеПоВыпущеннойПродукции()
		+ ТекстДанныеПоВыпущеннойПродукцииСвернуто()
		+ ТекстБазаРаспределенияДолейПоЭтапам(ПараметрыРасчета)
		+ ТекстКоэффициентыБазПоЭтапам()
		+ ТекстБазаПоЭтапамСводно();
		
	Запрос.Текст = РасчетСебестоимостиПрикладныеАлгоритмы.ПодставитьШаблоныВесаИОбъемаВТекстЗапроса(ТекстЗапроса, "СН");
	
	Для Каждого КлючИЗначение Из ПараметрыРасчета.ДополнительныеПараметрыЗапросаЭтапа Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Запрос.Выполнить();
	
	Возврат ПараметрыРасчета;
	
КонецФункции

#КонецОбласти
//-- НЕ УТ
#Область ЭтапыРасчета

// Этап 10.1 Распределение отклонений в стоимости и разниц в корректировке приобретений прошлого периода.
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РаспределитьОтклоненияВСтоимости(ПараметрыРасчета) Экспорт
	
	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие
	 И НЕ ПараметрыРасчета.РаспределениеДопРасходовМеждуПартиямиИТоварами Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределениеОтклоненийВСтоимости");
	
	// Запомним существующие временные таблицы.
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		Неопределено,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя);
	
	// 2. Получение исходных данных для трансляции
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиСебестоимостьТоваров(ПараметрыРасчета);
	
	// 3. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует движения по регистру СебестоимостьТоваров.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
	// 4. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		Неопределено,
		Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя);
	
	// 5. Получение исходных данных для трансляции
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж(ПараметрыРасчета);
	
	// 6. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует движения по регистру ВыручкаИСебестоимостьПродаж.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
	// 7. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		Неопределено,
		Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя);
	
	// 8. Получение исходных данных для трансляции
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиПрочиеРасходы(ПараметрыРасчета);
	
	// 9. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует движения по регистру ПрочиеРасходы.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
	// 10. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		Неопределено,
		Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя);
	
	// 11. Получение исходных данных для трансляции
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиНоменклатураДоходыРасходы(ПараметрыРасчета);
	
	// 12. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует движения по регистру ДвиженияНоменклатураДоходыРасходы.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
	// Уничтожим вспомогательные временные таблицы, созданные в данном этапе расчета.
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета, СуществующиеВТ);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
КонецПроцедуры

// Этап 10.2 Распределение постатейных расходов на себестоимость товаров.
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РаспределениеДопРасходовМеждуПартиямиИТоварами(ПараметрыРасчета) Экспорт
	
	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие
	 И НЕ ПараметрыРасчета.РаспределениеДопРасходовМеждуПартиямиИТоварами Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределениеДопРасходовМеждуПартиямиИТоварами");
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		ТаблицаДляРаспределенияДополнительныхРасходов(ПараметрыРасчета),
		,
		"ДолиДополнительныхРасходов");
	
	// 2. Получение исходных данных для расчета
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляДополнительныхРасходов(ПараметрыРасчета);
	
	// 3. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует временную таблицу ДолиДополнительныхРасходов.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
КонецПроцедуры

//++ НЕ УТ

// Этап 7 (Контекст: "РасчетДолейРаспределенияПрочихЗатрат")
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РасчетДолейРаспределенияПрочихЗатрат(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РасчетДолейРаспределенияПрочихЗатрат");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, 
		"ВтДолиРаспределенияПрочихЗатрат");

	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	Запрос.Текст = ТекстЗапросаДляРасчетаДолейРаспределенияПрочихЗатрат();
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);

КонецПроцедуры


// Этап 14.2 (Контекст: "ОВЗ_РасчетТранзитовОВЗ")
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
// Формирует временные таблицы ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗ и ВтТранзитРасходовМеждуОВЗ.
//
Процедура РасчетТранзитовОВЗ(ПараметрыРасчета) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат") Тогда
		Возврат;
	КонецЕсли;

	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, 
		"ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗ,ВтТранзитРасходовМеждуОВЗ");
		
	Запрос = Новый Запрос;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = ТекстЗначенияПоказателейРаспределенияНаОВЗ();
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ЗначенияПоказателейОВЗ");
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РасчетТранзитовОВЗ");
	
	ТекстЗапросаИсхДанные =
	"ВЫБРАТЬ
	|	ДД.Ссылка КАК ДокументДвижения,
	|	ДД.УправленческийУчет КАК УправленческийУчет,
	|	ДД.РегламентированныйУчет КАК РегламентированныйУчет,
	|	ЕСТЬNULL(ДД.Показатель, &ПолеПоказатель) КАК Показатель,
	|	ВЫРАЗИТЬ(ДД.АналитикаРасходов КАК Справочник.ОбъектыВозникновенияЗатрат) КАК ОВЗ,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ДД.РаспределятьНаОВЗ И ДД.ДоляСтоимостиНаОВЗ = 0 ТОГДА 1 
	|			КОГДА ДД.РаспределятьНаОВЗ ТОГДА ДД.ДоляСтоимостиНаОВЗ 
	|			ИНАЧЕ 0 
	|		КОНЕЦ 
	|	КАК ЧИСЛО(28, 10)) КАК ДоляНаОВЗ,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ДД.РаспределятьНаСтатьи ТОГДА ДД.ДоляСтоимостиНаСтатьи 
	|			ИНАЧЕ 0 
	|		КОНЕЦ 
	|	КАК ЧИСЛО(28, 10)) КАК ДоляНаСтатьи,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ДД.ОставитьВНЗП ТОГДА ДД.ДоляСтоимостиНаНЗП 
	|			ИНАЧЕ 0 
	|		КОНЕЦ 
	|	КАК ЧИСЛО(28, 10)) КАК ДоляНаНЗП,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР 
	|			КОГДА ДД.РаспределятьНаОВЗ И ДД.ДоляСтоимостиНаОВЗ = 0 ТОГДА 1 
	|			КОГДА ДД.РаспределятьНаОВЗ ТОГДА ДД.ДоляСтоимостиНаОВЗ 
	|			ИНАЧЕ 0 
	|		КОНЕЦ 
	|		+ ВЫБОР 
	|			КОГДА ДД.РаспределятьНаСтатьи ТОГДА ДД.ДоляСтоимостиНаСтатьи 
	|			ИНАЧЕ 0 
	|		КОНЕЦ 
	|		+ ВЫБОР 
	|			КОГДА ДД.ОставитьВНЗП ТОГДА ДД.ДоляСтоимостиНаНЗП 
	|			ИНАЧЕ 0 
	|		КОНЕЦ 
	|	КАК ЧИСЛО(28, 10)) КАК СуммаДолей
	|ПОМЕСТИТЬ АктуальныеДанныеОВЗ
	|ИЗ 
	|	ВтОВЗ КАК Т
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.РаспределениеПрочихЗатрат КАК ДД
	|ПО
	|	ДД.АналитикаРасходов = Т.ОВЗ
	|	И ДД.Организация = Т.Организация
	|	И ДД.Подразделение = Т.Подразделение
	|ГДЕ 
	|	&УсловиеАктуальныеДанныеОВЗ И ДД.Проведен И НАЧАЛОПЕРИОДА(ДД.Дата, МЕСЯЦ) = &НачалоПериода
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	Т.СтатьяРасходов			КАК СтатьяРасходов
	|ПОМЕСТИТЬ промВТКэшНабораАналитик
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеРасходы КАК Т
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВтОВЗ КАК ВтОВЗ
	|ПО Т.АналитикаРасходов = ВтОВЗ.ОВЗ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|ПО
	|	Т.СтатьяРасходов = Статьи.Ссылка
	|ГДЕ 
	|	&УсловиеВТКэшНабораАналитик
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.КорНаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	Т.СтатьяРасходовСписания		КАК СтатьяРасходов
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВтОВЗ КАК ВтОВЗ
	|ПО Т.АналитикаРасходов = ВтОВЗ.ОВЗ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|ПО
	|	Т.СтатьяРасходовСписания = Статьи.Ссылка
	|ГДЕ 
	|	Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию) И
	|	&УсловиеВТКэшНабораАналитик
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АВТОНОМЕРЗАПИСИ()			КАК КлючДанных,
	|	Т.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	Т.СтатьяРасходов			КАК СтатьяРасходов
	|ПОМЕСТИТЬ ВТКэшНабораАналитик
	|ИЗ
	|	промВТКэшНабораАналитик КАК Т
	|;
	|
	|ВЫБРАТЬ 
	|	НаборАналитик.КлючДанных	КАК КлючДанных,
	|	ВтОВЗ.НомерУзла				КАК НомерУзла
	|ПОМЕСТИТЬ ВтРасходыКТранзитуМеждуОВЗИсх
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеРасходы КАК Т
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВтОВЗ КАК ВтОВЗ
	|ПО Т.АналитикаРасходов = ВтОВЗ.ОВЗ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВТКэшНабораАналитик КАК НаборАналитик
	|ПО НаборАналитик.СтатьяРасходов = Т.СтатьяРасходов
	|	И НаборАналитик.НаправлениеДеятельности = Т.НаправлениеДеятельности
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	НаборАналитик.КлючДанных	КАК КлючДанных,
	|	ВтОВЗ.НомерУзла				КАК НомерУзла
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВтОВЗ КАК ВтОВЗ
	|ПО Т.АналитикаРасходов = ВтОВЗ.ОВЗ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВТКэшНабораАналитик КАК НаборАналитик
	|ПО НаборАналитик.СтатьяРасходов = Т.СтатьяРасходовСписания
	|	И НаборАналитик.НаправлениеДеятельности = Т.КорНаправлениеДеятельности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючДанных,
	|	НомерУзла
	|;
	|
	|ВЫБРАТЬ 
	|	ДД.ДокументДвижения			КАК ДокументДвижения,
	|	ДД.ОВЗ						КАК ОВЗ_Источник,
	|	Источники.НомерУзла			КАК НомерУзлаИсточника,
	|	Т.ОВЗ						КАК ОВЗ_Приемник,
	|	Приемники.НомерУзла			КАК НомерУзлаПриемника,
	|	Т.ЗначениеПоказателя		КАК Вес
	|ПОМЕСТИТЬ ВтПолныйГрафОВЗ
	|ИЗ АктуальныеДанныеОВЗ КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияПоказателейОВЗ КАК Т
	|	ПО ДД.Показатель = Т.Показатель
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОВЗ КАК Источники
	|	ПО ДД.ОВЗ = Источники.ОВЗ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОВЗ КАК Приемники
	|	ПО Т.ОВЗ = Приемники.ОВЗ
	|ГДЕ Источники.Организация = Приемники.Организация
	|;
	|";
	
	ТекстЗапросаПолучитьТранзиты = "
	|ВЫБРАТЬ 
	|	Т.НомерИтерации,
	|	НастройкиОВЗ.ДокументДвижения,
	|	ИсхОВЗ.Организация,
	|	ИсхОВЗ.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ИсхОВЗ.ОВЗ КАК АналитикаРасходов,
	|	КорОВЗ.Организация КАК КорОрганизация,
	|	КорОВЗ.Подразделение КАК КорПодразделение,
	|	КорОВЗ.ОВЗ КАК КорАналитикаРасходов,
	|	ЗначенияПоказателейОВЗ.ЗначениеПоказателя КАК Вес,
	|	ЗначенияПоказателейОВЗ.ЗначениеПоказателя*НастройкиОВЗ.ДоляНаОВЗ КАК ПриведенныйВес
	|ПОМЕСТИТЬ промВтТранзитРасходовМеждуОВЗ
	|ИЗ ВтМаршрутыЗатрат КАК Т
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТКэшНабораАналитик КАК ДД
	|	ПО ДД.КлючДанных = Т.КлючДанных
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВтОВЗ КАК ИсхОВЗ
	|	ПО Т.НомерУзлаИсточника = ИсхОВЗ.НомерУзла
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВтОВЗ КАК КорОВЗ
	|	ПО Т.НомерУзлаПриемника = КорОВЗ.НомерУзла
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	АктуальныеДанныеОВЗ КАК НастройкиОВЗ
	|	ПО ИсхОВЗ.ОВЗ = НастройкиОВЗ.ОВЗ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ЗначенияПоказателейОВЗ КАК ЗначенияПоказателейОВЗ
	|	ПО НастройкиОВЗ.Показатель = ЗначенияПоказателейОВЗ.Показатель
	|	И КорОВЗ.ОВЗ = ЗначенияПоказателейОВЗ.ОВЗ
	|ГДЕ
	|	НастройкиОВЗ.ДоляНаОВЗ <> 0
	|;
	|
	|ВЫБРАТЬ
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	ДД.Вес,
	|	ДД.ПриведенныйВес
	|ПОМЕСТИТЬ промВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗ
	|ИЗ промВтТранзитРасходовМеждуОВЗ КАК ДД
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ДД.КорОрганизация,
	|	ДД.КорПодразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.КорАналитикаРасходов,
	|	0,
	|	0
	|ИЗ промВтТранзитРасходовМеждуОВЗ КАК ДД
	|;
	|
	|ВЫБРАТЬ
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	СУММА(ДД.Вес) КАК Вес,
	|	СУММА(ДД.ПриведенныйВес) КАК ПриведенныйВес
	|ПОМЕСТИТЬ ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗ
	|ИЗ промВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗ КАК ДД
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов
	|;
	|
	|ВЫБРАТЬ
	|	ДД.НомерИтерации,
	|	ДД.ДокументДвижения,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.КорОрганизация,
	|	ДД.КорПодразделение,
	|	ДД.КорАналитикаРасходов,
	|	ДД.Вес,
	|	ДД.ПриведенныйВес
	|ПОМЕСТИТЬ ВтТранзитРасходовМеждуОВЗ
	|ИЗ промВтТранзитРасходовМеждуОВЗ КАК ДД
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументДвижения,
	|	Организация,
	|	Подразделение,
	|	НаправлениеДеятельности,
	|	СтатьяРасходов,
	|	АналитикаРасходов";
	
	ПараметрыГрафа = Новый Структура("ТаблицаНачальныхДанных, ТаблицаИсточникаДанныхСвязей, ИмяТаблицыРезультата",
		Новый Структура("ИмяТаблицы, ИмяКолонкиНомераУзла, ИмяКолонкиКлючаДанных", 
			"ВтРасходыКТранзитуМеждуОВЗИсх",
			"НомерУзла",
			"КлючДанных"),
		Новый Структура("ИмяТаблицы, ИмяКолонкиНомераУзлаИсточника, ИмяКолонкиНомераУзлаПриемника", 
			"ВтПолныйГрафОВЗ",
			"НомерУзлаИсточника",
			"НомерУзлаПриемника"),
		"ВтМаршрутыЗатрат");

	// Упр
	ТекстЗапроса = ТекстЗапросаИсхДанные;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПоказатель", "Т.ПравилоРаспределенияРасходовУпр");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеАктуальныеДанныеОВЗ", "ДД.УправленческийУчет");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеВТКэшНабораАналитик",
		"ВтОВЗ.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат)
		|	И Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат)");
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	РасчетСебестоимостиПрикладныеАлгоритмы.МаршрутизацияДанныхПоГрафу(Запрос.МенеджерВременныхТаблиц, ПараметрыГрафа);
	
	ТекстЗапроса = ТекстЗапросаПолучитьТранзиты;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗ", 
		"ПОМЕСТИТЬ ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗУпр");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВтТранзитРасходовМеждуОВЗ", 
		"ПОМЕСТИТЬ ВтТранзитРасходовМеждуОВЗУпр");
	Запрос.Текст = ТекстЗапроса;
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, 
		"ВтТранзитРасходовМеждуОВЗУпр,ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗУпр");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"АктуальныеДанныеОВЗ, ВтПолныйГрафОВЗ, ВтРасходыКТранзитуМеждуОВЗИсх, ВтМаршрутыЗатрат, ВТКэшНабораАналитик, 
		|промВТКэшНабораАналитик, промВтТранзитРасходовМеждуОВЗ, промВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗ");
		
	// Регл
	ТекстЗапроса = ТекстЗапросаИсхДанные;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПоказатель", "Т.ПравилоРаспределенияРасходовРегл");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеАктуальныеДанныеОВЗ", "ДД.РегламентированныйУчет");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеВТКэшНабораАналитик",
		"ВтОВЗ.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат)
		|	И Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат)");
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	РасчетСебестоимостиПрикладныеАлгоритмы.МаршрутизацияДанныхПоГрафу(Запрос.МенеджерВременныхТаблиц, ПараметрыГрафа);
	
	ТекстЗапроса = ТекстЗапросаПолучитьТранзиты;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗ", 
		"ПОМЕСТИТЬ ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗРегл");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВтТранзитРасходовМеждуОВЗ", 
		"ПОМЕСТИТЬ ВтТранзитРасходовМеждуОВЗРегл");
	Запрос.Текст = ТекстЗапроса;
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, 
		"ВтТранзитРасходовМеждуОВЗРегл,ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗРегл");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВтПолныйГрафОВЗ, ВтРасходыКТранзитуМеждуОВЗИсх, ВтМаршрутыЗатрат, ВТКэшНабораАналитик, 
		|промВТКэшНабораАналитик, промВтТранзитРасходовМеждуОВЗ, промВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗ");
		
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерУзла,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	СУММА(ДД.Вес) КАК Вес,
	|	СУММА(ДД.ВесРегл) КАК ВесРегл,
	|	СУММА(ДД.ПриведенныйВес) КАК ПриведенныйВес,
	|	СУММА(ДД.ПриведенныйВесРегл) КАК ПриведенныйВесРегл
	|ПОМЕСТИТЬ ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗ
	|ИЗ (
	|	ВЫБРАТЬ
	|		ДД.Организация,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		ДД.Вес КАК Вес,
	|		0 КАК ВесРегл,
	|		ДД.ПриведенныйВес КАК ПриведенныйВес,
	|		0 КАК ПриведенныйВесРегл
	|	ИЗ ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗУпр КАК ДД
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ
	|		ДД.Организация,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		0 КАК Вес,
	|		0 КАК ВесРегл,
	|		ДД.Вес*(Т.ДоляНаСтатьи + Т.ДоляНаНЗП) КАК ПриведенныйВес,
	|		0 КАК ПриведенныйВесРегл
	|	ИЗ ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗУпр КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ АктуальныеДанныеОВЗ КАК Т
	|	ПО
	|		ДД.АналитикаРасходов = Т.ОВЗ И Т.УправленческийУчет
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ
	|		ДД.Организация,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		0 КАК Вес,
	|		ДД.Вес КАК ВесРегл,
	|		0 КАК ПриведенныйВес,
	|		ДД.ПриведенныйВес КАК ПриведенныйВесРегл
	|	ИЗ ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗРегл КАК ДД
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ
	|		ДД.Организация,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		0 КАК Вес,
	|		0 КАК ВесРегл,
	|		0 КАК ПриведенныйВес,
	|		ДД.Вес*(Т.ДоляНаСтатьи + Т.ДоляНаНЗП) КАК ПриведенныйВесРегл
	|	ИЗ ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗРегл КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ АктуальныеДанныеОВЗ КАК Т
	|	ПО
	|		ДД.АналитикаРасходов = Т.ОВЗ И Т.РегламентированныйУчет
	|) КАК ДД
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Подразделение,
	|	НаправлениеДеятельности,
	|	СтатьяРасходов,
	|	АналитикаРасходов
	|;
	|
	|ВЫБРАТЬ
	|	ДД.ДокументДвижения,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.КорОрганизация,
	|	ДД.КорПодразделение,
	|	ДД.КорАналитикаРасходов,
	|	СУММА(ДД.Вес) КАК Вес, 
	|	СУММА(ДД.ВесРегл) КАК ВесРегл,
	|	СУММА(ДД.ПриведенныйВес) КАК ПриведенныйВес,
	|	СУММА(ДД.ПриведенныйВесРегл) КАК ПриведенныйВесРегл
	|ПОМЕСТИТЬ ВтТранзитРасходовМеждуОВЗ
	|ИЗ (
	|	ВЫБРАТЬ
	|		ДД.ДокументДвижения,
	|		ДД.Организация,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		ДД.КорОрганизация,
	|		ДД.КорПодразделение,
	|		ДД.КорАналитикаРасходов,
	|		ДД.Вес КАК Вес,
	|		0 КАК ВесРегл,
	|		ДД.ПриведенныйВес КАК ПриведенныйВес,
	|		0 КАК ПриведенныйВесРегл
	|	ИЗ ВтТранзитРасходовМеждуОВЗУпр КАК ДД
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ
	|		ДД.ДокументДвижения,
	|		ДД.Организация,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		ДД.КорОрганизация,
	|		ДД.КорПодразделение,
	|		ДД.КорАналитикаРасходов,
	|		0,
	|		ДД.Вес,
	|		0 КАК ПриведенныйВес,
	|		ДД.ПриведенныйВес КАК ПриведенныйВесРегл
	|	ИЗ ВтТранзитРасходовМеждуОВЗРегл КАК ДД
	|) КАК ДД
	|СГРУППИРОВАТЬ ПО
	|	ДД.ДокументДвижения,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.КорОрганизация,
	|	ДД.КорПодразделение,
	|	ДД.КорАналитикаРасходов
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументДвижения,
	|	Организация,
	|	Подразделение,
	|	НаправлениеДеятельности,
	|	СтатьяРасходов,
	|	АналитикаРасходов
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, 
		"ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗ,ВтТранзитРасходовМеждуОВЗ");

	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"АктуальныеДанныеОВЗ, ВтРасходыКТранзитуМеждуОВЗУпр,ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗУпр, 
		|ВтРасходыКТранзитуМеждуОВЗРегл,ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗРегл,
		|ЗначенияПоказателейОВЗ");

КонецПроцедуры
//-- НЕ УТ

//++ НЕ УТ

// Этап 15 (Контекст: "РаспределитьДолиПроизводственныхРасходов").
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РаспределитьДолиПроизводственныхРасходов(ПараметрыРасчета) Экспорт
	
	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределитьДолиПроизводственныхРасходов");
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		ТаблицаДляРаспределенияДолейПроизводственныхРасходов(ПараметрыРасчета),
		,
		"ДолиПроизводственныхРасходов",
		"Организация, Подразделение, СтатьяРасходов, АналитикаРасходов",
		"ДанныеПоМатериальнымЗатратам,ДанныеПоТрудозатратам,ДанныеПоПродукции");
	
	// 2. Получение исходных данных для расчета
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляРаспределенияДолейПроизводственныхРасходов(ПараметрыРасчета);
	
	// 3. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует временную таблицу ДолиПроизводственныхРасходов.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
КонецПроцедуры
	
// Этап 15.1 (Контекст: "РаспределитьПрямыеПроизводственныеРасходы").
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РаспределитьПрямыеПроизводственныеРасходы(ПараметрыРасчета) Экспорт
	
	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределитьПрямыеПроизводственныеРасходы");
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		ТаблицаДляРаспределенияПрямыхРасходовНаПроизводство(ПараметрыРасчета),
		,
		"ПрямыеПроизводственныеРасходы");
	
	// 2. Получение исходных данных для расчета
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляРаспределенияПрямыхРасходовНаПроизводство(ПараметрыРасчета);
	
	// 3. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует временную таблицу ПрямыеПроизводственныеРасходы.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
КонецПроцедуры
	
// Этап 16 (Контекст: "РаспределениеПостатейныхРасходовНаВыходныеИзделия")
// ПУ 2.1: РассчитатьПрочиеРасходыНЗП(), область РасчетПрочихРасходовНезавершенногоПроизводства.
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РаспределениеПостатейныхРасходовНаВыходныеИзделия(ПараметрыРасчета) Экспорт
	
	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределениеПостатейныхРасходовНаВыходныеИзделия");
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		ТаблицаДляРаспределенияПрочихРасходовНЗП(ПараметрыРасчета),
		,
		"втПрочиеРасходыНезавершенногоПроизводства",
		"Регистратор",
		"ПартииДляОтнесенияРасходов, КоэффициентыПриведения");
	
	// 2. Получение исходных данных для трансляции
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляПрочихРасходовНЗП(ПараметрыРасчета);
	
	// 3. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует временную таблицу ПрочиеРасходыНезавершенногоПроизводства.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
КонецПроцедуры

//-- НЕ УТ

// Этап 18.1 (Контекст: "РаспределениеПостатейныхРасходовНаПродажу")
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РаспределениеПостатейныхРасходовНаПродажу(ПараметрыРасчета) Экспорт
	
	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределениеПостатейныхРасходовНаПродажу");
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		ТаблицаДляРаспределенияРасходовНаПродажу(ПараметрыРасчета),
		,
		"ВтРаспределениеРасходовНаПродажи",
		,
		"ВтОтборПродажПоРеализациямПрошлыхПериодов");
	
	// 2. Получение исходных данных для расчета
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляРаспределенияРасходовНаПродажу(ПараметрыРасчета);
	
	// 3. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует временную таблицу ВтРаспределениеРасходовНаПродажи_ПрочиеРасходы.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);

КонецПроцедуры
		
// Этап 18.2 (Контекст: "СформироватьДвиженияРасходыНаПродажу")
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура СформироватьДвиженияРасходыНаПродажу(ПараметрыРасчета) Экспорт

	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВтРаспределениеРасходовНаПродажи.Регистратор КАК Регистратор,
	|	ВтРаспределениеРасходовНаПродажи.Организация,
	|	ВтРаспределениеРасходовНаПродажи.ПодразделениеРасходов,
	|	ВтРаспределениеРасходовНаПродажи.НаправлениеДеятельности,
	|	ВтРаспределениеРасходовНаПродажи.СтатьяРасходов,
	|	ВтРаспределениеРасходовНаПродажи.АналитикаРасходов,
	|	ВтРаспределениеРасходовНаПродажи.АналитикаУчетаНоменклатуры,
	|	ВтРаспределениеРасходовНаПродажи.Период,
	|	ВтРаспределениеРасходовНаПродажи.Сторно,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимостьПродаж) КАК ХозяйственнаяОперация,
	|	СУММА(ВтРаспределениеРасходовНаПродажи.Сумма) КАК Сумма,
	|	СУММА(ВтРаспределениеРасходовНаПродажи.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(ВтРаспределениеРасходовНаПродажи.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ВтРаспределениеРасходовНаПродажи.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ВтРаспределениеРасходовНаПродажи.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(ВтРаспределениеРасходовНаПродажи.ВременнаяРазница) КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВтРаспределениеРасходовНаПродажи_ПрочиеРасходы
	|ИЗ
	|	ВтРаспределениеРасходовНаПродажи КАК ВтРаспределениеРасходовНаПродажи
	|СГРУППИРОВАТЬ ПО
	|	ВтРаспределениеРасходовНаПродажи.Регистратор,
	|	ВтРаспределениеРасходовНаПродажи.Организация,
	|	ВтРаспределениеРасходовНаПродажи.ПодразделениеРасходов,
	|	ВтРаспределениеРасходовНаПродажи.НаправлениеДеятельности,
	|	ВтРаспределениеРасходовНаПродажи.СтатьяРасходов,
	|	ВтРаспределениеРасходовНаПродажи.АналитикаРасходов,
	|	ВтРаспределениеРасходовНаПродажи.Период,
	|	ВтРаспределениеРасходовНаПродажи.Сторно,
	|	ВтРаспределениеРасходовНаПродажи.АналитикаУчетаНоменклатуры
	|ИНДЕКСИРОВАТЬ ПО Регистратор
	|;"
	+ ТекстЗапросаРегистраторыПрошлыхПериодов();
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);

	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьИдентификаторыВоВременнуюТаблицу(
		ПараметрыРасчета,
		ПараметрыРасчета.Движения[Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя],
		"ВтРаспределениеРасходовНаПродажи_ПрочиеРасходы");
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВтРаспределениеРасходовНаПродажи.Организация,
	|	ВтРаспределениеРасходовНаПродажи.ПодразделениеРасходов КАК Подразделение,
	|	ВтРаспределениеРасходовНаПродажи.НаправлениеДеятельности,
	|	ВтРаспределениеРасходовНаПродажи.СтатьяРасходов,
	|	ВтРаспределениеРасходовНаПродажи.АналитикаРасходов,
	|	ВтРаспределениеРасходовНаПродажи.АналитикаУчетаНоменклатуры,
	|	ВтРаспределениеРасходовНаПродажи.Период,
	|	ВтРаспределениеРасходовНаПродажи.Регистратор КАК ДокументДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимостьПродаж) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.РаспределениеРасходовНаСебестоимостьПродаж) КАК НастройкаХозяйственнойОперации,
	|	ВтРаспределениеРасходовНаПродажи.ИдентификаторФинЗаписи,
	|	ВтРаспределениеРасходовНаПродажи.Сторно,
	|	ИСТИНА КАК РасчетСебестоимости,
	|	ВтРаспределениеРасходовНаПродажи.Сумма,
	|	ВтРаспределениеРасходовНаПродажи.СуммаБезНДС,
	|	ВтРаспределениеРасходовНаПродажи.СуммаУпр,
	|	ВтРаспределениеРасходовНаПродажи.СуммаРегл,
	|	ВтРаспределениеРасходовНаПродажи.ПостояннаяРазница,
	|	ВтРаспределениеРасходовНаПродажи.ВременнаяРазница
	|ИЗ ВтРаспределениеРасходовНаПродажи_ПрочиеРасходы КАК ВтРаспределениеРасходовНаПродажи;
	|
	|ВЫБРАТЬ
	|	ВтРаспределениеРасходовНаПродажи.Период,
	|	ВтРаспределениеРасходовНаПродажи.Регистратор КАК ДокументДвижения,
	|	ВтРаспределениеРасходовНаПродажи.АналитикаУчетаНоменклатуры,
	|	ВтРаспределениеРасходовНаПродажи.ЗаказКлиента,
	|	ВтРаспределениеРасходовНаПродажи.АналитикаУчетаПоПартнерам,
	|	ВтРаспределениеРасходовНаПродажи.ПодразделениеВыручки КАК Подразделение,
	|	ВтРаспределениеРасходовНаПродажи.ТипЗапасов,
	|	ВтРаспределениеРасходовНаПродажи.ВидЗапасов,
	|	ВтРаспределениеРасходовНаПродажи.РазделУчета,
	|	ВтРаспределениеРасходовНаПродажи.Партия,
	|	ВтРаспределениеРасходовНаПродажи.АналитикаУчетаПартий,
	|	ВтРаспределениеРасходовНаПродажи.АналитикаФинансовогоУчета,
	|	ВтРаспределениеРасходовНаПродажи.ВидДеятельностиНДС,
	|	ВтРаспределениеРасходовНаПродажи.Менеджер,
	|	ВтРаспределениеРасходовНаПродажи.Склад,
	|	ВтРаспределениеРасходовНаПродажи.Соглашение,
	|	ВтРаспределениеРасходовНаПродажи.Договор,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимостьПродаж) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.РаспределениеРасходовНаСебестоимостьПродаж) КАК НастройкаХозяйственнойОперации,
	|	ВтРаспределениеРасходовНаПродажи.АналитикаУчетаНаборов,
	|	ВтРаспределениеРасходовНаПродажи.НаправлениеДеятельностиКонтрагента,
	|	ВтРаспределениеРасходовНаПродажи.НаправлениеДеятельностиНоменклатуры,
	|	ВтРаспределениеРасходовНаПродажи.НалогообложениеНДС,
	|	ВтРаспределениеРасходовНаПродажи.ВалютаВзаиморасчетов,
	|	ВтРаспределениеРасходовНаПродажи.ВалютаДокумента,
	|	ВтРаспределениеРасходовНаПродажи.ИсточникГФУНоменклатуры,
	|	ВтРаспределениеРасходовНаПродажи.Сторно,
	|	ИСТИНА КАК РасчетСебестоимости,
	|	ЛОЖЬ КАК РасчетПартий,
	|	ВтРаспределениеРасходовНаПродажи.Сумма КАК РасходыНаПродажуСНДС,
	|	ВтРаспределениеРасходовНаПродажи.СуммаБезНДС КАК РасходыНаПродажуБезНДС,
	|	ВтРаспределениеРасходовНаПродажи.СуммаУпр КАК РасходыНаПродажуУпр,
	|	ВтРаспределениеРасходовНаПродажи.СуммаРегл КАК РасходыНаПродажуРегл,
	|	Идентификаторы.ИдентификаторФинЗаписи
	|ИЗ
	|	ВтРаспределениеРасходовНаПродажи КАК ВтРаспределениеРасходовНаПродажи
	|ЛЕВОЕ СОЕДИНЕНИЕ ВтРаспределениеРасходовНаПродажи_ПрочиеРасходы КАК Идентификаторы
	|	ПО ВтРаспределениеРасходовНаПродажи.Регистратор = Идентификаторы.Регистратор
	|	И ВтРаспределениеРасходовНаПродажи.Организация = Идентификаторы.Организация
	|	И ВтРаспределениеРасходовНаПродажи.ПодразделениеРасходов = Идентификаторы.ПодразделениеРасходов
	|	И ВтРаспределениеРасходовНаПродажи.НаправлениеДеятельности = Идентификаторы.НаправлениеДеятельности
	|	И ВтРаспределениеРасходовНаПродажи.СтатьяРасходов = Идентификаторы.СтатьяРасходов
	|	И ВтРаспределениеРасходовНаПродажи.АналитикаРасходов = Идентификаторы.АналитикаРасходов
	|	И ВтРаспределениеРасходовНаПродажи.АналитикаУчетаНоменклатуры = Идентификаторы.АналитикаУчетаНоменклатуры;
	|";
	
	Выборки = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,
		Истина);
	
	ВыборкаПрочиеРасходы = Выборки[0];
	ВыборкаВыручка = Выборки[1];

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;

	Пока ВыборкаПрочиеРасходы.Следующий() Цикл
		Запись = РасчетСебестоимостиКорректировкаСтоимости.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета,
			ИмяРегистра, ВыборкаПрочиеРасходы);
		Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЦикла;
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя;

	Пока ВыборкаВыручка.Следующий() Цикл
		Запись = РасчетСебестоимостиКорректировкаСтоимости.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета,
			ИмяРегистра, ВыборкаВыручка);
	КонецЦикла;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап распределения расходов будущих периодов.
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РаспределитьРасходыБудущихПериодов(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределитьРасходыБудущихПериодов");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.УправленческийУчет
	|		 И Статья.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределитьУпр,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.РегламентированныйУчет
	|		 И Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределитьРегл,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.НалоговыйУчет
	|		 И Статья.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределитьНУ,
	|	
	|	СУММА(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И Статья.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|		 И ДД.УправленческийУчет
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиУпр,
	|	СУММА(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.РегламентированныйУчет
	|		 И Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиРегл,
	|	СУММА(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.НалоговыйУчет
	|		 И Статья.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиНУ
	|
	|ПОМЕСТИТЬ ВтРаспределенияРБП
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК Строки
	|		ПО Строки.Ссылка = ДД.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статья
	|		ПО Статья.Ссылка = ДД.СтатьяРасходов
	|ГДЕ
	|	ДД.Проведен
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		ИЛИ ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически))
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности
	|;
	//++ НЕ УТ
	|ВЫБРАТЬ
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.АналитикаРасходов,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.УправленческийУчет
	|		 И Статья.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределитьУпр,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.РегламентированныйУчет
	|		 И Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределитьРегл,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.НалоговыйУчет
	|		 И Статья.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределитьНУ,
	|	
	|	СУММА(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.УправленческийУчет
	|		 И Статья.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиУпр,
	|	СУММА(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.РегламентированныйУчет
	|		 И Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиРегл,
	|	СУММА(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.НалоговыйУчет
	|		 И Статья.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиНУ
	|
	|ПОМЕСТИТЬ ВтРаспределенияРБПОВЗ
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК Строки
	|		ПО Строки.Ссылка = ДД.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыВозникновенияЗатрат КАК Статья
	|		ПО Статья.Ссылка = ДД.АналитикаРасходов
	|ГДЕ
	|	ДД.Проведен
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		ИЛИ ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически))
	|	И ДД.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности
	|;
	//-- НЕ УТ
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	Расходы.Организация КАК Организация,
	|	Расходы.Подразделение КАК Подразделение,
	|	Расходы.СтатьяРасходов КАК СтатьяРасходов,
	|	Расходы.АналитикаРасходов КАК АналитикаРасходов,
	|	Расходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Расходы.Сумма КАК Сумма,
	|	Расходы.СуммаБезНДС КАК СуммаБезНДС,
	|	Расходы.СуммаУпр КАК СуммаУпр,
	|	Расходы.СуммаРегл КАК СуммаРегл,
	|	Расходы.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Расходы.ВременнаяРазница КАК ВременнаяРазница,
	|
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	Распределение.ДоляСтоимостиУпр КАК ДоляСтоимостиУпр,
	|	Распределение.ДоляСтоимостиРегл КАК ДоляСтоимостиРегл,
	|	Распределение.ДоляСтоимостиНУ КАК ДоляСтоимостиНУ,
	|	ДАТАВРЕМЯ(1,1,1) КАК Период,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеПолучатель,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовПолучатель,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходовПолучатель,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторФинЗаписи,
	|	НЕОПРЕДЕЛЕНО КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходы КАК Расходы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРаспределенияРБП КАК Распределение
	|		ПО Распределение.Организация = Расходы.Организация
	|		И Распределение.Подразделение = Расходы.Подразделение
	|		И Распределение.СтатьяРасходов = Расходы.СтатьяРасходов
	|		И Распределение.АналитикаРасходов = Расходы.АналитикаРасходов
	|		И Распределение.НаправлениеДеятельности = Расходы.НаправлениеДеятельности
	|ГДЕ
	|	Расходы.СлужебноеВидДвиженияПриход
	//++ НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	Расходы.Организация КАК Организация,
	|	Расходы.Подразделение КАК Подразделение,
	|	Расходы.СтатьяРасходов КАК СтатьяРасходов,
	|	Расходы.АналитикаРасходов КАК АналитикаРасходов,
	|	Расходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Расходы.Сумма КАК Сумма,
	|	Расходы.СуммаБезНДС КАК СуммаБезНДС,
	|	Расходы.СуммаУпр КАК СуммаУпр,
	|	Расходы.СуммаРегл КАК СуммаРегл,
	|	Расходы.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Расходы.ВременнаяРазница КАК ВременнаяРазница,
	|
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	Распределение.ДоляСтоимостиУпр КАК ДоляСтоимостиУпр,
	|	Распределение.ДоляСтоимостиРегл КАК ДоляСтоимостиРегл,
	|	Распределение.ДоляСтоимостиНУ КАК ДоляСтоимостиНУ,
	|	ДАТАВРЕМЯ(1,1,1) КАК Период,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеПолучатель,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовПолучатель,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходовПолучатель,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторФинЗаписи,
	|	НЕОПРЕДЕЛЕНО КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходы КАК Расходы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРаспределенияРБПОВЗ КАК Распределение
	|		ПО Распределение.Организация = Расходы.Организация
	|		И Распределение.Подразделение = Расходы.Подразделение
	|		И Распределение.АналитикаРасходов = Расходы.АналитикаРасходов
	|ГДЕ
	|	Расходы.СлужебноеВидДвиженияПриход
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	Расходы.Организация,
	|	Расходы.Подразделение,
	|	Расходы.СтатьяРасходов,
	|	Расходы.АналитикаРасходов,
	|	Расходы.НаправлениеДеятельности,
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|
	|	ДД.Ссылка КАК ДокументДвижения,
	|	(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.УправленческийУчет
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиУпр,
	|	(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.РегламентированныйУчет
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиРегл,
	|	(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.НалоговыйУчет
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиНУ,
	|	Строки.Дата КАК Период,
	|	Строки.Подразделение КАК ПодразделениеПолучатель,
	|	Строки.СтатьяРасходов КАК СтатьяРасходовПолучатель,
	|	Строки.АналитикаРасходов КАК АналитикаРасходовПолучатель,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРБП) КАК ХозяйственнаяОперация,
	|	Строки.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.РаспределениеРБП) КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходы КАК Расходы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов КАК ДД
	|		ПО ДД.Организация = Расходы.Организация
	|		И ДД.Подразделение = Расходы.Подразделение
	|		И ДД.АналитикаРасходов = Расходы.АналитикаРасходов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК Строки
	|		ПО Строки.Ссылка = ДД.Ссылка
	|ГДЕ
	|	ДД.Проведен
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		ИЛИ ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически))
	|	И ДД.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	//-- НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|
	|	ДД.Ссылка КАК ДокументДвижения,
	|	(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.УправленческийУчет
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиУпр,
	|	(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.РегламентированныйУчет
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиРегл,
	|	(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.НалоговыйУчет
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиНУ,
	|	Строки.Дата КАК Период,
	|	Строки.Подразделение КАК ПодразделениеПолучатель,
	|	Строки.СтатьяРасходов КАК СтатьяРасходовПолучатель,
	|	Строки.АналитикаРасходов КАК АналитикаРасходовПолучатель,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРБП) КАК ХозяйственнаяОперация,
	|	Строки.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.РаспределениеРБП) КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК Строки
	|		ПО Строки.Ссылка = ДД.Ссылка
	|ГДЕ
	|	ДД.Проведен
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		ИЛИ ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Подразделение,
	|	СтатьяРасходов,
	|	АналитикаРасходов,
	|	НаправлениеДеятельности,
	|	Порядок ВОЗР,
	|	ДокументДвижения,
	|	Период ВОЗР
	|";
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	СтрокаОстатка = Новый Структура;
	СуммовыеРесурсы = Новый Структура;
	
	Для Каждого Колонка Из Выборка.Владелец().Колонки Цикл
		СтрокаОстатка.Вставить(Колонка.Имя);
		Если Колонка.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			СуммовыеРесурсы.Вставить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	СтрокаОстатка.Вставить("СуммаНУ");
	СуммовыеРесурсы.Вставить("СуммаНУ");
	
	// Формируются движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			СтрокаОстатка.СуммаНУ = СтрокаОстатка.СуммаРегл - СтрокаОстатка.ПостояннаяРазница - СтрокаОстатка.ВременнаяРазница;
			Если Выборка.ДоляСтоимостиУпр = 0 Тогда
				СтрокаОстатка.Сумма = 0; 
				СтрокаОстатка.СуммаБезНДС = 0; 
				СтрокаОстатка.СуммаУпр = 0; 
			КонецЕсли;
			Если Выборка.ДоляСтоимостиРегл = 0 Тогда
				СтрокаОстатка.СуммаРегл = 0; 
			КонецЕсли;
			Если Выборка.ДоляСтоимостиНУ = 0 Тогда
				СтрокаОстатка.СуммаНУ = 0; 
				СтрокаОстатка.ПостояннаяРазница = 0; 
			КонецЕсли;
			
		ИначеЕсли СтрокаОстатка.Организация = Выборка.Организация
		 И СтрокаОстатка.Подразделение = Выборка.Подразделение
		 И СтрокаОстатка.СтатьяРасходов = Выборка.СтатьяРасходов
		 И СтрокаОстатка.АналитикаРасходов = Выборка.АналитикаРасходов
		 И СтрокаОстатка.НаправлениеДеятельности = Выборка.НаправлениеДеятельности Тогда
		
		 	Если СтрокаОстатка.ДоляСтоимостиУпр <= Выборка.ДоляСтоимостиУпр Тогда
			    ЗаполнитьЗначенияСвойств(СуммовыеРесурсы, СтрокаОстатка, "Сумма, СуммаБезНДС, СуммаУпр");
				СтрокаОстатка.ДоляСтоимостиУпр = 0;
			Иначе
				Если СтрокаОстатка.ДоляСтоимостиУпр <> 0 Тогда
					СуммовыеРесурсы.Сумма = 
						Окр(Выборка.ДоляСтоимостиУпр * СтрокаОстатка.Сумма / СтрокаОстатка.ДоляСтоимостиУпр, 2, 1);
					СуммовыеРесурсы.СуммаБезНДС = 
						Окр(Выборка.ДоляСтоимостиУпр * СтрокаОстатка.СуммаБезНДС / СтрокаОстатка.ДоляСтоимостиУпр, 2, 1);
					СуммовыеРесурсы.СуммаУпр = 
						Окр(Выборка.ДоляСтоимостиУпр * СтрокаОстатка.СуммаУпр / СтрокаОстатка.ДоляСтоимостиУпр, 2, 1);
				КонецЕсли;
				СтрокаОстатка.ДоляСтоимостиУпр = СтрокаОстатка.ДоляСтоимостиУпр - Выборка.ДоляСтоимостиУпр;
			КонецЕсли;
				
			Если СтрокаОстатка.ДоляСтоимостиРегл <= Выборка.ДоляСтоимостиРегл Тогда
				ЗаполнитьЗначенияСвойств(СуммовыеРесурсы, СтрокаОстатка, "СуммаРегл");
				СтрокаОстатка.ДоляСтоимостиРегл = 0;
			Иначе	
				Если СтрокаОстатка.ДоляСтоимостиРегл <> 0 Тогда
					СуммовыеРесурсы.СуммаРегл = 
						Окр(Выборка.ДоляСтоимостиРегл * СтрокаОстатка.СуммаРегл / СтрокаОстатка.ДоляСтоимостиРегл, 2, 1);
				КонецЕсли;
				СтрокаОстатка.ДоляСтоимостиРегл = СтрокаОстатка.ДоляСтоимостиРегл - Выборка.ДоляСтоимостиРегл;
			КонецЕсли;
			
			Если СтрокаОстатка.ДоляСтоимостиНУ <= Выборка.ДоляСтоимостиНУ Тогда
				ЗаполнитьЗначенияСвойств(СуммовыеРесурсы, СтрокаОстатка, "СуммаНУ, ПостояннаяРазница");
				СтрокаОстатка.ДоляСтоимостиНУ = 0;
			Иначе	
				Если СтрокаОстатка.ДоляСтоимостиНУ <> 0 Тогда
					СуммовыеРесурсы.ПостояннаяРазница = 
						Окр(Выборка.ДоляСтоимостиНУ * СтрокаОстатка.ПостояннаяРазница / СтрокаОстатка.ДоляСтоимостиНУ, 2, 1);
					СуммовыеРесурсы.СуммаНУ = 
						Окр(Выборка.ДоляСтоимостиНУ * СтрокаОстатка.СуммаНУ / СтрокаОстатка.ДоляСтоимостиНУ, 2, 1);
				КонецЕсли;
				СтрокаОстатка.ДоляСтоимостиНУ = СтрокаОстатка.ДоляСтоимостиНУ - Выборка.ДоляСтоимостиНУ;
			КонецЕсли;
			
			СуммовыеРесурсы.ВременнаяРазница = СуммовыеРесурсы.СуммаРегл - СуммовыеРесурсы.СуммаНУ - СуммовыеРесурсы.ПостояннаяРазница;
			
			СтрокаОстатка.Сумма = СтрокаОстатка.Сумма - СуммовыеРесурсы.Сумма;
			СтрокаОстатка.СуммаБезНДС = СтрокаОстатка.СуммаБезНДС - СуммовыеРесурсы.СуммаБезНДС;
			СтрокаОстатка.СуммаУпр = СтрокаОстатка.СуммаУпр - СуммовыеРесурсы.СуммаУпр;
			СтрокаОстатка.СуммаРегл = СтрокаОстатка.СуммаРегл - СуммовыеРесурсы.СуммаРегл;
			СтрокаОстатка.СуммаНУ = СтрокаОстатка.СуммаНУ - СуммовыеРесурсы.СуммаНУ;
			СтрокаОстатка.ПостояннаяРазница = СтрокаОстатка.ПостояннаяРазница - СуммовыеРесурсы.ПостояннаяРазница;
			
			// Формируются движения по регистрам:
			// - ПрочиеРасходы
			СформироватьДвиженияРаспределениеРБП(ПараметрыРасчета, Выборка, СуммовыеРесурсы);
		КонецЕсли;
		
	КонецЦикла;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтРаспределенияРБП");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Служебная, этап 4.5
Процедура СформироватьДвиженияРаспределениеРБП(ПараметрыРасчета, ДанныеДвижения, Суммы)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля = "Период, Организация, Подразделение, СтатьяРасходов, АналитикаРасходов, НаправлениеДеятельности,
		|ХозяйственнаяОперация, ИдентификаторФинЗаписи, НастройкаХозяйственнойОперации";

	// Добавим движение расход и заполним его основные свойства
	ЗаписьРасход = РасчетСебестоимостиКорректировкаСтоимости.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения расход
	ЗаписьРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
	ЗаполнитьЗначенияСвойств(ЗаписьРасход, Суммы, "Сумма, СуммаБезНДС, СуммаУпр, СуммаРегл, ПостояннаяРазница, ВременнаяРазница");
	ЗаписьРасход.КорПодразделение 	  = ДанныеДвижения.ПодразделениеПолучатель;
	ЗаписьРасход.КорСтатьяРасходов    = ДанныеДвижения.СтатьяРасходовПолучатель;
	ЗаписьРасход.КорАналитикаРасходов = ДанныеДвижения.АналитикаРасходовПолучатель;
	
	// Добавим движение приход и заполним его основные свойства
	ЗаписьПриход = РасчетСебестоимостиКорректировкаСтоимости.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения приход
	ЗаписьПриход.ВидДвижения 	   = ВидДвиженияНакопления.Приход;
	ЗаписьПриход.Подразделение 	   = ДанныеДвижения.ПодразделениеПолучатель;
	ЗаписьПриход.СтатьяРасходов    = ДанныеДвижения.СтатьяРасходовПолучатель;
	ЗаписьПриход.АналитикаРасходов = ДанныеДвижения.АналитикаРасходовПолучатель;
	ЗаписьПриход.КорПодразделение 	  = ДанныеДвижения.Подразделение;
	ЗаписьПриход.КорСтатьяРасходов    = ДанныеДвижения.СтатьяРасходов;
	ЗаписьПриход.КорАналитикаРасходов = ДанныеДвижения.АналитикаРасходов;
	
	ЗаполнитьЗначенияСвойств(ЗаписьПриход, Суммы, "Сумма, СуммаБезНДС, СуммаУпр, СуммаРегл, ПостояннаяРазница, ВременнаяРазница");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыЭтапа_РаспределитьОтклоненияВСтоимости

// Выборка данных

Процедура ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиСебестоимостьТоваров(ПараметрыРасчета)
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстРаспределенияОтклоненийВСтоимостиСебестоимостьТоваров(),
		,
		Ложь,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя);
	
КонецПроцедуры

Процедура ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж(ПараметрыРасчета)
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстРаспределенияОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж(),
		,
		Ложь,
		Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя);
	
КонецПроцедуры

Процедура ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиПрочиеРасходы(ПараметрыРасчета)
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстРаспределенияОтклоненийВСтоимостиПрочиеРасходы(),
		,
		Ложь,
		Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя);
	
КонецПроцедуры

Процедура ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиНоменклатураДоходыРасходы(ПараметрыРасчета)
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстРаспределенияОтклоненийВСтоимостиНоменклатураДоходыРасходы(),
		,
		Ложь,
		Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя);
	
КонецПроцедуры

// Тексты запросов

// ... общий

Функция ТекстРаспределенияОтклоненийВСтоимостиСебестоимостьТоваров(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстыПодготовкиДанных = Новый Массив;
	ТекстыПодготовкиДанных.Добавить(ТекстКорректировкиТоваровВПутиПрошлыеПериоды());
	ТекстыПодготовкиДанных.Добавить(ТекстПриемникиПоТоварамПрошлыхПериодовОтклоненийВСтоимости());
	ТекстыПодготовкиДанных.Добавить(ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов());
	
	ТекстЗапроса = ""
		+ СтрСоединить(ТекстыПодготовкиДанных, ОбщегоНазначения.РазделительПакетаЗапросов())
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		// выборка данных
		+ ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиСебестоимостьТоваров()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДвижениеРасходОтклоненийВСтоимостиСебестоимостьТоваров()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДвижениеПриходОтклоненийВСтоимостиСебестоимостьТоваров()
		+ "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстРаспределенияОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса = ""
		// выборка данных
		+ ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДвижениеОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж() // результаты распределения в ВТ РаспределениеРасходов
		+ "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстРаспределенияОтклоненийВСтоимостиПрочиеРасходы(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса = ""
		// выборка данных
		+ ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиПрочиеРасходы()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДвижениеПриходОтклоненийВСтоимостиПрочиеРасходы() // результаты распределения в ВТ РаспределениеРасходов
		+ "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстРаспределенияОтклоненийВСтоимостиНоменклатураДоходыРасходы(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса = ""
		// выборка данных
		+ ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиНоменклатураДоходыРасходы()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДвижениеОтклоненийВСтоимостиНоменклатураДоходыРасходы() // результаты распределения в ВТ РаспределениеРасходов
		+ "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// ... описания данных

Функция ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиСебестоимостьТоваров()
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ТипЗаписи,
		|	ДД.ДокументДвижения,
		|
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	ДД.АналитикаУчетаПоПартнерам,
		|	ДД.Подразделение,
		|	ДД.АналитикаРасходов,
		|	ДД.СтатьяРасходовСписания,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|
		|	ДД.КорОрганизация,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорРазделУчета,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаУчетаПартий,
		|
		|	0 КАК ДопРасходы,
		|	0 КАК ДопРасходыБезНДС,
		|	0 КАК ДопРасходыРегл,
		|	0 КАК ДопРасходыУпр,
		|	0 КАК НДСРегл,
		|	0 КАК НДСУпр,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК ДД
		|";
		
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж()
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) КАК ЗапросИсточник,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ДокументДвижения,
		|
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	ДД.АналитикаУчетаПоПартнерам,
		|	ДД.ЗаказКлиента,
		|	ДД.Подразделение,
		|	ДД.ХозяйственнаяОперация,
		|
		|	ДД.Менеджер,
		|	ДД.Склад,
		|	ДД.Соглашение,
		|	ДД.Договор,
		|	ДД.ТипЗапасов,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.ИсточникГФУНоменклатуры,
		|	ДД.ИсточникГФУРасчетов,
		|
		|	0 КАК ДопРасходы,
		|	0 КАК ДопРасходыБезНДС,
		|	0 КАК ДопРасходыРегл,
		|	0 КАК ДопРасходыУпр,
		|	0 КАК НДСРегл,
		|	0 КАК НДСУпр,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДД
		|";
		
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиПрочиеРасходы()
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.Регистратор КАК ДокументДвижения,
		|
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		
		|	ДД.ХозяйственнаяОперация,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|
		|	0 КАК Сумма,
		|	0 КАК СуммаБезНДС,
		|	0 КАК СуммаРегл,
		|	0 КАК СуммаУпр,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.ПрочиеРасходы КАК ДД
		|";
		
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиНоменклатураДоходыРасходы()
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) КАК ЗапросИсточник,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ДокументДвижения,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельностиНоменклатуры,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.Склад,
		|	ДД.ТипЗапасов,
		|	ДД.ВидЗапасов,
		|	ДД.СтатьяДоходовРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.НаправлениеДеятельностиСтатьи,
		|	ДД.ИсточникГФУНоменклатуры,
		|
		|	0 КАК ДопРасходы,
		|	0 КАК ДопРасходыБезНДС,
		|	0 КАК ДопРасходыРегл,
		|	0 КАК ДопРасходыУпр,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.ДвиженияНоменклатураДоходыРасходы КАК ДД
		|";
		
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;
	
КонецФункции

// ... выборки данных

Функция ТекстКорректировкиТоваровВПутиПрошлыеПериоды()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация КАК Организация,
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов КАК ВидЗапасов,
	|	ДД.РазделУчета КАК РазделУчета,
	|	ДД.Партия КАК Партия,
	|	ДД.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС
	|ПОМЕСТИТЬ ВТОстаткиТоваровВПути
	|ИЗ
	|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	&РаспределениеДопРасходовПоВыбывшимТоварам
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
	|	И ДД.Количество <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.Период КАК Период,
	|	ДД.Организация КАК Организация,
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов КАК ВидЗапасов,
	|	ДД.РазделУчета КАК РазделУчета,
	|	ДД.Партия КАК Партия,
	|	ДД.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ДД.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДД.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДД.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДД.ДокументИсточник КАК ДокументИсточник,
	|	ДД.ТипЗаписи КАК ТипЗаписи,
	|	ДД.АналитикаУчетаПоПартнерам,
	|	ДД.АналитикаРасходов,
	|	ДД.СтатьяРасходовСписания,
	|
	|	ДД.ДопРасходы КАК ДопРасходы,
	|	ДД.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	ДД.ДопРасходыРегл КАК ДопРасходыРегл,
	|	ДД.ДопРасходыУпр КАК ДопРасходыУпр,
	|	ДД.НДСРегл КАК НДСРегл,
	|	ДД.НДСУпр КАК НДСУпр,
	|	ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	ДД.ВременнаяРазница КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВТКорректировкиТоваровВПутиПрошлыеПериоды
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиТоваровВПути КАК Остатки
	|		ПО ДД.АналитикаУчетаНоменклатуры = Остатки.АналитикаУчетаНоменклатуры
	|			И ДД.Организация = Остатки.Организация
	|			И ДД.Партия = Остатки.Партия
	|			И ДД.РазделУчета = Остатки.РазделУчета
	|			И ДД.ВидЗапасов = Остатки.ВидЗапасов
	|			И ДД.АналитикаУчетаПартий = Остатки.АналитикаУчетаПартий
	|			И ДД.АналитикаФинансовогоУчета = Остатки.АналитикаФинансовогоУчета
	|			И ДД.ВидДеятельностиНДС = Остатки.ВидДеятельностиНДС
	|ГДЕ
	|	&РаспределениеДопРасходовПоВыбывшимТоварам
	|	И ДД.СлужебноеВидДвиженияПриход
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
	|	И ДД.ТипЗаписи В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии))
	|	И ДД.Количество = 0
	|	И Остатки.Организация ЕСТЬ NULL
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Корректировки.Регистратор КАК Регистратор,
	|	ДД.Регистратор КАК ДокументПоступления,
	|	Корректировки.Период КАК Период,
	|	Корректировки.Организация КАК Организация,
	|	ДД.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДД.КорВидЗапасов КАК ВидЗапасов,
	|	ДД.КорРазделУчета КАК РазделУчета,
	|	ДД.КорПартия КАК Партия,
	|	ДД.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ДД.КорАналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ДД.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Корректировки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Корректировки.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	Корректировки.Подразделение КАК Подразделение,
	|	Корректировки.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	Корректировки.ДокументИсточник КАК ДокументИсточник,
	|	Корректировки.ТипЗаписи КАК ТипЗаписи,
	|	Корректировки.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	Корректировки.ВидЗапасов КАК КорВидЗапасов,
	|	Корректировки.Партия КАК КорПартия,
	|	Корректировки.АналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|	Корректировки.ВидДеятельностиНДС КАК КорВидДеятельностиНДС,
	|	Корректировки.АналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
	|	Корректировки.РазделУчета КАК КорРазделУчета,
	|	Корректировки.АналитикаУчетаПоПартнерам,
	|	Корректировки.АналитикаРасходов,
	|	Корректировки.СтатьяРасходовСписания,
	|
	|	Корректировки.ДопРасходы КАК ДопРасходы,
	|	Корректировки.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	Корректировки.ДопРасходыРегл КАК ДопРасходыРегл,
	|	Корректировки.ДопРасходыУпр КАК ДопРасходыУпр,
	|	Корректировки.НДСРегл КАК НДСРегл,
	|	Корректировки.НДСУпр КАК НДСУпр,
	|	Корректировки.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Корректировки.ВременнаяРазница КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВТПоступленияТоваровВПутиПрошлыеПериоды
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровНаСклад КАК Поступления
	|		ПО ДД.Регистратор = Поступления.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКорректировкиТоваровВПутиПрошлыеПериоды КАК Корректировки
	|		ПО ДД.АналитикаУчетаНоменклатуры = Корректировки.АналитикаУчетаНоменклатуры
	|			И ДД.РазделУчета = Корректировки.РазделУчета
	|			И ДД.ВидЗапасов = Корректировки.ВидЗапасов
	|			И ДД.Организация = Корректировки.Организация
	|			И ДД.Партия = Корректировки.Партия
	|			И ДД.АналитикаУчетаПартий = Корректировки.АналитикаУчетаПартий
	|			И ДД.АналитикаФинансовогоУчета = Корректировки.АналитикаФинансовогоУчета
	|			И ДД.ВидДеятельностиНДС = Корректировки.ВидДеятельностиНДС
	|ГДЕ
	|	&РаспределениеДопРасходовПоВыбывшимТоварам
	|	И ДД.Период < &НачалоПериода
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
	|	И ДД.Количество <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация,
	|	Партия,
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор
	|ПОМЕСТИТЬ ДокументыКорректировкиТоваровВПути
	|ИЗ
	|	ВТПоступленияТоваровВПутиПрошлыеПериоды КАК ДД
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстПриемникиПоТоварамПрошлыхПериодовОтклоненийВСтоимости()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Источник.Регистратор,
		|	Источник.Период,
		|	Источник.ТипЗаписи,
		|	Источник.АналитикаУчетаНоменклатуры,
		|	Источник.РазделУчета,
		|	Источник.ВидЗапасов,
		|	Источник.Организация,
		|	Источник.Партия,
		|	Источник.АналитикаУчетаПартий,
		|	Источник.АналитикаФинансовогоУчета,
		|	Источник.ВидДеятельностиНДС,
		|	МАКСИМУМ(Источник.ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи,
		|	Источник.НастройкаХозяйственнойОперации,
		|	0 КАК КоличествоКРаспределению,
		|	0 КАК СтоимостьКРаспределению,
		|	0 КАК СтоимостьБезНДСКРаспределению,
		|	0 КАК СтоимостьРеглКРаспределению,
		|	0 КАК СтоимостьУпрКРаспределению,
		|
		|	СУММА(Источник.ДопРасходы) КАК ДопРасходыСНДСКРаспределению,
		|	СУММА(Источник.ДопРасходыБезНДС) КАК ДопРасходыБезНДСКРаспределению,
		|	СУММА(Источник.ДопРасходыРегл) КАК ДопРасходыРеглНДСКРаспределению,
		|	СУММА(Источник.ДопРасходыУпр) КАК ДопРасходыУпрНДСКРаспределению,
		|	СУММА(Источник.НДСРегл) КАК НДСРеглКРаспределению,
		|	СУММА(Источник.НДСУпр) КАК НДСУпрКРаспределению,
		|	СУММА(Источник.ПостояннаяРазница) КАК ПостояннаяРазницаКРаспределению,
		|	СУММА(Источник.ВременнаяРазница) КАК ВременнаяРазницаКРаспределению,
		|
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(
		|		ВЫБОР КОГДА Реестр.ДатаДокументаИБ ЕСТЬ NULL ИЛИ Реестр.ДатаДокументаИБ < &ДатаПереходаНаПартионныйУчетВерсии22
		|			ТОГДА &ДатаПереходаНаПартионныйУчетВерсии22
		|			ИНАЧЕ Реестр.ДатаДокументаИБ
		|		КОНЕЦ, МЕСЯЦ)) КАК ПериодПоступления
		|ПОМЕСТИТЬ ПриемникиПоТоварамПрошлыхПериодов
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Источник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
		|		ПО Реестр.Ссылка = ВЫБОР
		|			КОГДА Источник.Партия <> НЕОПРЕДЕЛЕНО ТОГДА Источник.Партия
		|			КОГДА Источник.ДокументИсточник <> НЕОПРЕДЕЛЕНО ТОГДА Источник.ДокументИсточник
		|			ИНАЧЕ NULL КОНЕЦ
		|		И НЕ Реестр.ДополнительнаяЗапись
		|ГДЕ
		|	&РаспределениеДопРасходовПоВыбывшимТоварам
		|	И Источник.СлужебноеВидДвиженияПриход
		|	И Источник.РазделУчета В (
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыПереданныеПартнерам),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты))
		|	И Источник.ТипЗаписи В
		|		(ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
		|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
		|	И НЕ (Источник.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		И Источник.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
		|	И (Источник.ДопРасходы <> 0
		|		ИЛИ Источник.ДопРасходыБезНДС <> 0
		|		ИЛИ Источник.ДопРасходыРегл <> 0
		|		ИЛИ Источник.ДопРасходыУпр <> 0
		|		ИЛИ Источник.ПостояннаяРазница <> 0
		|		ИЛИ Источник.ВременнаяРазница <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	Источник.Регистратор,
		|	Источник.Период,
		|	Источник.ТипЗаписи,
		|	Источник.АналитикаУчетаНоменклатуры,
		|	Источник.РазделУчета,
		|	Источник.ВидЗапасов,
		|	Источник.Организация,
		|	Источник.Партия,
		|	Источник.АналитикаУчетаПартий,
		|	Источник.АналитикаФинансовогоУчета,
		|	Источник.ВидДеятельностиНДС,
		|	Источник.НастройкаХозяйственнойОперации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ТипЗаписи,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|	0 КАК КоличествоКРаспределению,
		|	0 КАК СтоимостьКРаспределению,
		|	0 КАК СтоимостьБезНДСКРаспределению,
		|	0 КАК СтоимостьРеглКРаспределению,
		|	0 КАК СтоимостьУпрКРаспределению,
		|
		|	ДД.ДопРасходы КАК ДопРасходыСНДСКРаспределению,
		|	ДД.ДопРасходыБезНДС КАК ДопРасходыБезНДСКРаспределению,
		|	ДД.ДопРасходыРегл КАК ДопРасходыРеглНДСКРаспределению,
		|	ДД.ДопРасходыУпр КАК ДопРасходыУпрНДСКРаспределению,
		|	ДД.НДСРегл КАК НДСРеглКРаспределению,
		|	ДД.НДСУпр КАК НДСУпрКРаспределению,
		|	ДД.ПостояннаяРазница КАК ПостояннаяРазницаКРаспределению,
		|	ДД.ВременнаяРазница КАК ВременнаяРазницаКРаспределению,
		|
		|	НАЧАЛОПЕРИОДА(
		|		ВЫБОР КОГДА Реестр.ДатаДокументаИБ ЕСТЬ NULL ИЛИ Реестр.ДатаДокументаИБ < &ДатаПереходаНаПартионныйУчетВерсии22
		|			ТОГДА &ДатаПереходаНаПартионныйУчетВерсии22
		|			ИНАЧЕ Реестр.ДатаДокументаИБ
		|		КОНЕЦ, МЕСЯЦ) КАК ПериодПоступления
		|ИЗ
		|	ВТПоступленияТоваровВПутиПрошлыеПериоды КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		|		ПО Аналитика.Ссылка = ДД.АналитикаУчетаНоменклатуры
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
		|		ПО Реестр.Ссылка = ДД.ДокументИсточник
		|		И НЕ Реестр.ДополнительнаяЗапись
		|";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстДвижениеРасходОтклоненийВСтоимостиСебестоимостьТоваров()
	Возврат 
		"ВЫБРАТЬ
		|	""ТекстДвижениеРасходОтклоненийВСтоимостиСебестоимостьТоваров"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ТипЗаписи,
		|	ДД.Регистратор КАК ДокументДвижения,
		|
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	ДД.АналитикаУчетаПоПартнерам,
		|	ДД.Подразделение,
		|	ДД.АналитикаРасходов,
		|	ДД.СтатьяРасходовСписания,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|
		|	ВЫБОР КОГДА ДД.Организация = ДД.КорОрганизация
		|		ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|		ИНАЧЕ ДД.КорОрганизация
		|	КОНЕЦ КАК КорОрганизация,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорРазделУчета,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаУчетаПартий,
		|
		|	СУММА(ДД.ДопРасходы)        КАК ДопРасходы,
		|	СУММА(ДД.ДопРасходыБезНДС)  КАК ДопРасходыБезНДС,
		|	СУММА(ДД.ДопРасходыРегл)    КАК ДопРасходыРегл,
		|	СУММА(ДД.ДопРасходыУпр)     КАК ДопРасходыУпр,
		|	СУММА(ДД.НДСРегл)           КАК НДСРегл,
		|	СУММА(ДД.НДСУпр)            КАК НДСУпр,
		|	СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
		|	СУММА(ДД.ВременнаяРазница)  КАК ВременнаяРазница
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДД.Регистратор,
		|		ДД.Период,
		|		ДД.ТипЗаписи,
		|
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаУчетаНоменклатуры, ДД.АналитикаУчетаНоменклатуры) КАК АналитикаУчетаНоменклатуры,
		|		ЕСТЬNULL(ТоварыВПути.КорРазделУчета, ДД.РазделУчета) КАК РазделУчета,
		|		ЕСТЬNULL(ТоварыВПути.КорВидЗапасов, ДД.ВидЗапасов) КАК ВидЗапасов,
		|		ДД.Организация,
		|		ДД.КорОрганизация,
		|		ЕСТЬNULL(ТоварыВПути.КорПартия, ДД.Партия) КАК Партия,
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаУчетаПартий, ДД.АналитикаУчетаПартий) КАК АналитикаУчетаПартий,
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаФинансовогоУчета, ДД.АналитикаФинансовогоУчета) КАК АналитикаФинансовогоУчета,
		|		ЕСТЬNULL(ТоварыВПути.КорВидДеятельностиНДС, ДД.ВидДеятельностиНДС) КАК ВидДеятельностиНДС,
		|
		|		ДД.АналитикаУчетаПоПартнерам,
		|		ДД.Подразделение,
		|		ДД.АналитикаРасходов,
		|		ДД.СтатьяРасходовСписанияУпр КАК СтатьяРасходовСписания,
		|		ДД.КорНаправлениеДеятельности,
		|		ДД.ХозяйственнаяОперация,
		|		ДД.ИдентификаторФинЗаписи,
		|		ДД.НастройкаХозяйственнойОперации,
		|
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.АналитикаУчетаНоменклатуры, ДД.КорАналитикаУчетаНоменклатуры)
		|		КОНЕЦ КАК КорАналитикаУчетаНоменклатуры,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.ВидЗапасов, ДД.КорВидЗапасов)
		|		КОНЕЦ КАК КорВидЗапасов,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.АналитикаФинансовогоУчета, ДД.КорАналитикаФинансовогоУчета)
		|		КОНЕЦ КАК КорАналитикаФинансовогоУчета,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.ВидДеятельностиНДС, ДД.КорВидДеятельностиНДС)
		|		КОНЕЦ КАК КорВидДеятельностиНДС,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.РазделУчета, ДД.КорРазделУчета)
		|		КОНЕЦ КАК КорРазделУчета,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.Партия, ДД.КорПартия)
		|		КОНЕЦ КАК КорПартия,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.АналитикаУчетаПартий, ДД.КорАналитикаУчетаПартий)
		|		КОНЕЦ КАК КорАналитикаУчетаПартий,
		|
		|		ДД.ДопРасходыСНДС   КАК ДопРасходы,
		|		ДД.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
		|		0                   КАК ДопРасходыРегл,
		|		ДД.ДопРасходыУпр    КАК ДопРасходыУпр,
		|		0                   КАК НДСРегл,
		|		ДД.НДСУпр           КАК НДСУпр,
		|		0                   КАК ПостояннаяРазница,
		|		0                   КАК ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоступленияТоваровВПутиПрошлыеПериоды КАК ТоварыВПути
		|		ПО ДД.АналитикаУчетаНоменклатуры = ТоварыВПути.АналитикаУчетаНоменклатуры
		|			И ДД.Организация = ТоварыВПути.Организация
		|			И ДД.Партия = ТоварыВПути.Партия
		|			И ДД.Регистратор = ТоварыВПути.Регистратор
		|			И ДД.РазделУчета = ТоварыВПути.РазделУчета
		|			И ДД.ВидЗапасов = ТоварыВПути.ВидЗапасов
		|			И ДД.АналитикаУчетаПартий = ТоварыВПути.АналитикаУчетаПартий
		|			И ДД.АналитикаФинансовогоУчета = ТоварыВПути.АналитикаФинансовогоУчета
		|			И ДД.ВидДеятельностиНДС = ТоварыВПути.ВидДеятельностиНДС
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		ДД.Период,
		|		ДД.ТипЗаписи,
		|
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаУчетаНоменклатуры, ДД.АналитикаУчетаНоменклатуры) КАК АналитикаУчетаНоменклатуры,
		|		ЕСТЬNULL(ТоварыВПути.КорРазделУчета, ДД.РазделУчета) КАК РазделУчета,
		|		ЕСТЬNULL(ТоварыВПути.КорВидЗапасов, ДД.ВидЗапасов) КАК ВидЗапасов,
		|		ДД.Организация,
		|		ДД.КорОрганизация,
		|		ЕСТЬNULL(ТоварыВПути.КорПартия, ДД.Партия) КАК Партия,
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаУчетаПартий, ДД.АналитикаУчетаПартий) КАК АналитикаУчетаПартий,
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаФинансовогоУчета, ДД.АналитикаФинансовогоУчета) КАК АналитикаФинансовогоУчета,
		|		ЕСТЬNULL(ТоварыВПути.КорВидДеятельностиНДС, ДД.ВидДеятельностиНДС) КАК ВидДеятельностиНДС,
		|
		|		ДД.АналитикаУчетаПоПартнерам,
		|		ДД.Подразделение,
		|		ДД.АналитикаРасходов,
		|		ДД.СтатьяРасходовСписанияРегл КАК СтатьяРасходовСписания,
		|		ДД.КорНаправлениеДеятельности,
		|		ДД.ХозяйственнаяОперация,
		|		ДД.ИдентификаторФинЗаписи,
		|		ДД.НастройкаХозяйственнойОперации,
		|
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.АналитикаУчетаНоменклатуры, ДД.КорАналитикаУчетаНоменклатуры)
		|		КОНЕЦ КАК КорАналитикаУчетаНоменклатуры,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.ВидЗапасов, ДД.КорВидЗапасов)
		|		КОНЕЦ КАК КорВидЗапасов,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.АналитикаФинансовогоУчета, ДД.КорАналитикаФинансовогоУчета)
		|		КОНЕЦ КАК КорАналитикаФинансовогоУчета,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.ВидДеятельностиНДС, ДД.КорВидДеятельностиНДС)
		|		КОНЕЦ КАК КорВидДеятельностиНДС,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.РазделУчета, ДД.КорРазделУчета)
		|		КОНЕЦ КАК КорРазделУчета,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.Партия, ДД.КорПартия)
		|		КОНЕЦ КАК КорПартия,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.АналитикаУчетаПартий, ДД.КорАналитикаУчетаПартий)
		|		КОНЕЦ КАК КорАналитикаУчетаПартий,
		|
		|		0 КАК ДопРасходы,
		|		0 КАК ДопРасходыБезНДС,
		|		ДД.ДопРасходыРегл,
		|		0 КАК ДопРасходыУпр,
		|		ДД.НДСРегл,
		|		0 КАК НДСУпр,
		|		ДД.ПостояннаяРазница,
		|		ДД.ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоступленияТоваровВПутиПрошлыеПериоды КАК ТоварыВПути
		|		ПО ДД.АналитикаУчетаНоменклатуры = ТоварыВПути.АналитикаУчетаНоменклатуры
		|			И ДД.Организация = ТоварыВПути.Организация
		|			И ДД.Партия = ТоварыВПути.Партия
		|			И ДД.Регистратор = ТоварыВПути.Регистратор
		|			И ДД.РазделУчета = ТоварыВПути.РазделУчета
		|			И ДД.ВидЗапасов = ТоварыВПути.ВидЗапасов
		|			И ДД.АналитикаУчетаПартий = ТоварыВПути.АналитикаУчетаПартий
		|			И ДД.АналитикаФинансовогоУчета = ТоварыВПути.АналитикаФинансовогоУчета
		|			И ДД.ВидДеятельностиНДС = ТоварыВПути.ВидДеятельностиНДС
		|	) КАК ДД
		|ГДЕ
		|	НЕ (ДД.АналитикаУчетаНоменклатуры = ДД.КорАналитикаУчетаНоменклатуры
		|		И ДД.РазделУчета = ДД.КорРазделУчета
		|		И ДД.ВидЗапасов = ДД.КорВидЗапасов
		|		И ДД.АналитикаФинансовогоУчета = ДД.КорАналитикаФинансовогоУчета
		|		И ДД.ВидДеятельностиНДС = ДД.КорВидДеятельностиНДС)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ТипЗаписи,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ВЫБОР КОГДА ДД.Организация = ДД.КорОрганизация
		|		ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|		ИНАЧЕ ДД.КорОрганизация
		|	КОНЕЦ,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорАналитикаУчетаПартий,
		|	ДД.АналитикаУчетаПоПартнерам,
		|	ДД.Подразделение,
		|	ДД.АналитикаРасходов,
		|	ДД.СтатьяРасходовСписания,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.КорПартия,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорРазделУчета";
		
КонецФункции

Функция ТекстДвижениеПриходОтклоненийВСтоимостиСебестоимостьТоваров()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстДвижениеПриходОтклоненийВСтоимостиСебестоимостьТоваров"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ТипЗаписи,
		|	ДД.Регистратор КАК ДокументДвижения,
		|
		|	ДД.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ДД.КорРазделУчета КАК РазделУчета,
		|	ДД.КорВидЗапасов КАК ВидЗапасов,
		|	ДД.КорОрганизация КАК Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.КорАналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|	ДД.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовСписания,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|
		|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаПартий,
		|
		|	СУММА(ДД.ДопРасходыСНДС)    КАК ДопРасходы,
		|	СУММА(ДД.ДопРасходыБезНДС)  КАК ДопРасходыБезНДС,
		|	СУММА(ДД.ДопРасходыРегл)    КАК ДопРасходыРегл,
		|	СУММА(ДД.ДопРасходыУпр)     КАК ДопРасходыУпр,
		|	СУММА(ДД.НДСРегл)           КАК НДСРегл,
		|	СУММА(ДД.НДСУпр)            КАК НДСУпр,
		|	СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
		|	СУММА(ДД.ВременнаяРазница)  КАК ВременнаяРазница
		|ИЗ
		|	ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|ГДЕ
		|	НЕ ДД.ЭтоВыбытие
		|	И НЕ (ДД.АналитикаУчетаНоменклатуры = ДД.КорАналитикаУчетаНоменклатуры
		|		И ДД.РазделУчета = ДД.КорРазделУчета
		|		И ДД.ВидЗапасов = ДД.КорВидЗапасов
		|		И ДД.АналитикаФинансовогоУчета = ДД.КорАналитикаФинансовогоУчета
		|		И ДД.ВидДеятельностиНДС = ДД.КорВидДеятельностиНДС)
		|	ИЛИ
		|		(НЕ ДД.ЭтоВыбытие
		|		И ДД.Регистратор В (ВЫБРАТЬ Отбор.Регистратор ИЗ ДокументыКорректировкиТоваровВПути КАК Отбор))
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ТипЗаписи,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.КорРазделУчета,
		|	ДД.КорВидЗапасов,
		|	ДД.КорОрганизация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорАналитикаУчетаПартий,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.КорВидДеятельностиНДС";
		
КонецФункции

Функция ТекстДвижениеОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстДвижениеОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж"" КАК ЗапросИсточник,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.Регистратор КАК ДокументДвижения,
		|
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	ДД.АналитикаУчетаПоПартнерам,
		|	ДД.ЗаказКлиента,
		|	ДД.Подразделение,
		|	ДД.ХозяйственнаяОперация,
		|
		|	ДД.Менеджер,
		|	ДД.Склад,
		|	ДД.Соглашение,
		|	ДД.Договор,
		|	ДД.ТипЗапасов,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.ИсточникГФУНоменклатуры,
		|	ДД.ИсточникГФУРасчетов,
		|
		|	СУММА(ДД.ДопРасходыСНДС)    КАК ДопРасходы,
		|	СУММА(ДД.ДопРасходыБезНДС)  КАК ДопРасходыБезНДС,
		|	СУММА(ДД.ДопРасходыРегл)    КАК ДопРасходыРегл,
		|	СУММА(ДД.ДопРасходыУпр)     КАК ДопРасходыУпр,
		|	СУММА(ДД.НДСРегл)           КАК НДСРегл,
		|	СУММА(ДД.НДСУпр)            КАК НДСУпр,
		|	СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
		|	СУММА(ДД.ВременнаяРазница)  КАК ВременнаяРазница
		|ИЗ
		|	ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|ГДЕ
		|	НЕ ДД.АналитикаУчетаПоПартнерам = НЕОПРЕДЕЛЕНО
		|	И ДД.ЭтоВыбытие
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПоПартнерам,
		|	ДД.ЗаказКлиента,
		|	ДД.Подразделение,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.Менеджер,
		|	ДД.Склад,
		|	ДД.Соглашение,
		|	ДД.Договор,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.ТипЗапасов,
		|	ДД.ИсточникГФУНоменклатуры,
		|	ДД.ИсточникГФУРасчетов
		|";
КонецФункции

Функция ТекстДвижениеПриходОтклоненийВСтоимостиПрочиеРасходы()
	// Условия для заполнения ресурсов регистра аналогичны условиям в функции ТекстЗапросаТаблицаВтПрочиеРасходы() модуля менеджера регистра ПрочиеРасходы
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстДвижениеПриходОтклоненийВСтоимостиПрочиеРасходы"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.Регистратор КАК ДокументДвижения,
		|
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|
		|	СУММА(ДД.Сумма)             КАК Сумма,
		|	СУММА(ДД.СуммаБезНДС)       КАК СуммаБезНДС,
		|	СУММА(ДД.СуммаРегл)         КАК СуммаРегл,
		|	СУММА(ДД.СуммаУпр)          КАК СуммаУпр,
		|	СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
		|	СУММА(ДД.ВременнаяРазница)  КАК ВременнаяРазница
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДД.Период,
		|		ДД.Регистратор,
		|
		|		ДД.Организация,
		|		ДД.Подразделение,
		|		ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|		ДД.СтатьяРасходовСписанияУпр КАК СтатьяРасходов,
		|		ДД.АналитикаРасходов,
		|
		|		ДД.ХозяйственнаяОперация,
		|		ДД.АналитикаУчетаНоменклатуры,
		|		ДД.ИдентификаторФинЗаписи,
		|		ДД.НастройкаХозяйственнойОперации,
		|
		|		ДД.ДопРасходыСНДС КАК Сумма,
		|		ВЫБОР
		|			КОГДА СтатьиРасходов.ВариантРаспределенияРасходовУпр <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
		|				ТОГДА 0
		|			ИНАЧЕ
		|				ДД.ДопРасходыБезНДС
		|		КОНЕЦ КАК СуммаБезНДС,
		|		0 КАК СуммаРегл,
		|		ДД.ДопРасходыУпр КАК СуммаУпр,
		|		0 КАК ПостояннаяРазница,
		|		0 КАК ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|			ПО ДД.СтатьяРасходовСписанияУпр = СтатьиРасходов.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК СпрАналитикаНоменклатуры
		|			ПО ДД.АналитикаУчетаНоменклатуры = СпрАналитикаНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
		|			ПО СпрАналитикаНоменклатуры.Назначение = СпрНазначения.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Период,
		|		ДД.Регистратор,
		|
		|		ДД.Организация,
		|		ДД.Подразделение,
		|		ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|		ДД.СтатьяРасходовСписанияРегл КАК СтатьяРасходов,
		|		ДД.АналитикаРасходов,
		|
		|		ДД.ХозяйственнаяОперация,
		|		ДД.АналитикаУчетаНоменклатуры,
		|		ДД.ИдентификаторФинЗаписи,
		|		ДД.НастройкаХозяйственнойОперации,
		|
		|		0 КАК Сумма,
		|		0 КАК СуммаБезНДС,
		|		ВЫБОР 
		|			КОГДА НЕ &ИспользоватьУчетПрочихДоходовРасходовРегл
		|				ТОГДА 0
		|			КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
		|				ТОГДА 0
		|			КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
		|				И НЕ &ИспользуетсяУправлениеВНА_2_4
		|				ТОГДА 0
		|			ИНАЧЕ ДД.ДопРасходыРегл КОНЕЦ КАК СуммаРегл,
		|		0 КАК СуммаУпр,
		|		ДД.ПостояннаяРазница КАК ПостояннаяРазница,
		|		ДД.ВременнаяРазница  КАК ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|			ПО ДД.СтатьяРасходовСписанияРегл = СтатьиРасходов.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК СпрАналитикаНоменклатуры
		|			ПО ДД.АналитикаУчетаНоменклатуры = СпрАналитикаНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
		|			ПО СпрАналитикаНоменклатуры.Назначение = СпрНазначения.Ссылка) КАК ДД
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ДД.АналитикаУчетаНоменклатуры";
		
КонецФункции

Функция ТекстДвижениеОтклоненийВСтоимостиНоменклатураДоходыРасходы()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстДвижениеОтклоненийВСтоимостиНоменклатураДоходыРасходы"" КАК ЗапросИсточник,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.Регистратор КАК ДокументДвижения,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельностиНоменклатуры,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.Склад,
		|	ДД.ТипЗапасов,
		|	ДД.ВидЗапасов,
		|	ДД.СтатьяДоходовРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.НаправлениеДеятельностиСтатьи,
		|	ДД.ИсточникГФУНоменклатуры,
		|
		|	СУММА(ДД.ДопРасходы) КАК ДопРасходы,
		|	СУММА(ДД.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
		|	СУММА(ДД.ДопРасходыРегл) КАК ДопРасходыРегл,
		|	СУММА(ДД.ДопРасходыУпр) КАК ДопРасходыУпр,
		|	СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
		|	СУММА(ДД.ВременнаяРазница)  КАК ВременнаяРазница
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДД.Регистратор,
		|		ДД.Период,
		|
		|		ДД.ХозяйственнаяОперация,
		|		ДД.Организация,
		|		ДД.Подразделение,
		|		ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
		|			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельностиНоменклатуры,
		|		ДД.АналитикаУчетаНоменклатуры,
		|		СпрАналитикаНоменклатуры.МестоХранения КАК Склад,
		|		ДД.ТипЗапасов,
		|		ДД.ВидЗапасов,
		|		ДД.СтатьяРасходовСписанияУпр КАК СтатьяДоходовРасходов,
		|		ДД.АналитикаРасходов,
		|		ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельностиСтатьи, 
		|		ДД.ИсточникГФУНоменклатуры,
		|
		|		ДД.ДопРасходыСНДС   КАК ДопРасходы,
		|		ДД.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
		|		0                   КАК ДопРасходыРегл,
		|		ДД.ДопРасходыУпр    КАК ДопРасходыУпр,
		|		0                   КАК ПостояннаяРазница,
		|		0                   КАК ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|			ПО ДД.СтатьяРасходовСписанияУпр = СтатьиРасходов.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК СпрАналитикаНоменклатуры
		|			ПО ДД.АналитикаУчетаНоменклатуры = СпрАналитикаНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
		|			ПО СпрАналитикаНоменклатуры.Назначение = СпрНазначения.Ссылка
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		ДД.Период,
		|
		|		ДД.ХозяйственнаяОперация,
		|		ДД.Организация,
		|		ДД.Подразделение,
		|		ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
		|			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
		|		ДД.АналитикаУчетаНоменклатуры,
		|		СпрАналитикаНоменклатуры.МестоХранения,
		|		ДД.ТипЗапасов,
		|		ДД.ВидЗапасов,
		|		ДД.СтатьяРасходовСписанияУпр,
		|		ДД.АналитикаРасходов,
		|		ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельностиСтатьи,
		|		ДД.ИсточникГФУНоменклатуры,
		|
		|		0,
		|		0,
		|		ДД.ДопРасходыРегл,
		|		0,
		|		ДД.ПостояннаяРазница,
		|		ДД.ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|			ПО ДД.СтатьяРасходовСписанияРегл = СтатьиРасходов.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК СпрАналитикаНоменклатуры
		|			ПО ДД.АналитикаУчетаНоменклатуры = СпрАналитикаНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
		|			ПО СпрАналитикаНоменклатуры.Назначение = СпрНазначения.Ссылка) КАК ДД
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельностиНоменклатуры,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.Склад,
		|	ДД.ТипЗапасов,
		|	ДД.ВидЗапасов,
		|	ДД.СтатьяДоходовРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.НаправлениеДеятельностиСтатьи,
		|	ДД.ИсточникГФУНоменклатуры";
		
КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапа10_РаспределениеДопРасходовМеждуПартиямиИТоварами

Функция ТаблицаДляРаспределенияДополнительныхРасходов(ПараметрыРасчета)
	
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ТаблицаДляРаспределенияПартий(ПараметрыРасчета,
		ТекстОписаниеДанныхДляРаспределенияДополнительныхРасходов());
	
КонецФункции

Функция ТекстОписаниеДанныхДляРаспределенияДополнительныхРасходов() Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) КАК ЗапросИсточник,
		|	СТ.Регистратор КАК Регистратор,
		// Приемник СебестоимостьТоваров
		|	СТ.РазделУчета КАК КорРазделУчета,
		|	СТ.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	СТ.ВидЗапасов КАК КорВидЗапасов,
		|	СТ.Организация КАК КорОрганизация,
		|	СТ.Партия КАК КорПартия,
		|	СТ.АналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
		|	СТ.АналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
		|	СТ.ВидДеятельностиНДС КАК КорВидДеятельностиНДС,
		|	СТ.ХозяйственнаяОперация,
		|	СТ.ТипЗаписи,
		// Приемник Прочие расходы/Прочие активы
		|	ПР.СтатьяРасходов КАК КорСтатьяРасходов,
		|	ПР.АналитикаРасходов КАК КорАналитикаРасходов,
		|	ПАП.Статья КАК КорСтатьяАктивовПассивов,
		|	ПАП.Аналитика КАК КорАналитикаАктивовПассивов,
		|	ПР.Подразделение КАК КорПодразделение,
		|	ПР.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
		//Приемник Выручка и себестоимость
		|	ВСП.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	ВСП.ЗаказКлиента КАК ЗаказКлиента,
		|	ВСП.Менеджер КАК Менеджер,
		|	ВСП.Склад КАК Склад,
		|	ВСП.Соглашение КАК Соглашение,
		|	ВСП.Договор КАК Договор,
		|	ВСП.ТипЗапасов КАК ТипЗапасов,
		|	ВСП.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
		|	ВСП.ИсточникГФУРасчетов КАК ИсточникГФУРасчетов,
		// Показатели приемника
		|	СТ.Количество КАК Количество,
		|	0 КАК ДоляСтоимости,
		|	0 КАК ДоляСтоимостиБезНДС,
		|	0 КАК ДоляСтоимостиРегл,
		|	0 КАК ДоляСтоимостиУпр
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК СТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК ПР
		|		ПО ИСТИНА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеАктивыПассивы КАК ПАП
		|		ПО ИСТИНА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВСП
		|		ПО ИСТИНА";
		
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;
	
КонецФункции

// Выборка данных и формирование движений

Процедура ПолучитьДанныеДляДополнительныхРасходов(ПараметрыРасчета) Экспорт
	
	ДляРасшифровки = РасчетСебестоимостиПрикладныеАлгоритмы.РасчетВызванДляРасшифровки(ПараметрыРасчета);
	
	ДопПараметры = ПараметрыРасчета.ДополнительныеПараметрыЗапросаЭтапа;
	ДопПараметры.Вставить("РасчетСебестоимостиВыполнен",  ПараметрыРасчета.Свойство("РасчетСебестоимостиВыполнен"));
	ДопПараметры.Вставить("РасшифровкаРаспределения", 	  ДляРасшифровки);
	
	ПодготовитьДополнительныеРасходыКРаспределению(ПараметрыРасчета);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаДляРаспределенияДополнительныхРасходов(ПараметрыРасчета),
		,
		НЕ ДляРасшифровки);
	
КонецПроцедуры

Процедура ПодготовитьДополнительныеРасходыКРаспределению(ПараметрыРасчета)
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	Запрос.УстановитьПараметр("ВариантыРаспределенияРасходов", 
		ОбщегоНазначенияУТКлиентСервер.Массив(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров));
	Запрос.УстановитьПараметр("Регистратор",
		?(ПараметрыРасчета.Свойство("Регистратор"), ПараметрыРасчета.Регистратор, Неопределено));
	
	Запрос.Текст = Документы.РаспределениеПрочихЗатрат.ТекстЗапросаПоступилоПрочихРасходов(, Ложь);
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, 
		,,,НСтр("ru = 'Получение дополнительных расходов для распределения.';
				|en = 'Getting additional expenses for allocation.'"));

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДД.Ссылка,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.БазаРаспределенияПоПартиям,
		|	ДД.НастройкиБазыРаспределенияПоПартиям,
		|	ДД.УправленческийУчет,
		|	ДД.РегламентированныйУчет,
		|	ДД.НалоговыйУчет
		|ПОМЕСТИТЬ Регистраторы
		|ИЗ
		|	Документ.РаспределениеПрочихЗатрат КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасходыКРаспределению КАК Т
		|		ПО (Т.Организация = ДД.Организация)
		|			И (Т.Подразделение = ДД.Подразделение)
		|			И (Т.СтатьяРасходов = ДД.СтатьяРасходов)
		|			И (Т.АналитикаРасходов = ДД.АналитикаРасходов)
		|			И (Т.НаправлениеДеятельности = ДД.НаправлениеДеятельности)
		|ГДЕ
		|	ДД.НазначениеНастройкиРаспределения = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаСебестоимостьТоваров)
		|	И ДД.Дата МЕЖДУ &НачалоПериода И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
		|	И ДД.Организация В(&МассивОрганизаций)
		|	И ДД.Проведен
		|	И (ДД.Ссылка = &Регистратор
		|			ИЛИ &Регистратор = НЕОПРЕДЕЛЕНО)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,
		,,,НСтр("ru = 'Инициализация служебных таблиц для распределения затрат.';
				|en = 'Initializing internal tables for cost allocation.'"));
	
КонецПроцедуры

// Тексты запросов

// ... для таблицы РасчетныеПартииПоЗаказам в ПолучитьДанныеДляДопРасходов()

Функция ТекстЗапросаДляРаспределенияДополнительныхРасходов(ПараметрыРасчета)
	
	ТекстыПодготовкиДанных = Новый Массив;
	ТекстыПодготовкиДанных.Добавить(ТекстАналитикиЗаказов());
	ТекстыПодготовкиДанных.Добавить(ТекстПриобретенияПоТаможеннымДекларациям());
	ТекстыПодготовкиДанных.Добавить(ТекстПервичныеПриемникиДополнительныхРасходов(ПараметрыРасчета));
	ТекстыПодготовкиДанных.Добавить(КорректировкаПриемниковПоРегистраторам());
	ТекстыПодготовкиДанных.Добавить(ТекстПриемникиПоТоварамПрошлыхПериодовДополнительныхРасходов());
	ТекстыПодготовкиДанных.Добавить(ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов());
	
	ТекстыВыборкиДанных = Новый Массив;
	ТекстыВыборкиДанных.Добавить(ТекстОписаниеДанныхДляРаспределенияДополнительныхРасходов());
	ТекстыВыборкиДанных.Добавить(РасчетСебестоимостиПрикладныеАлгоритмы.ПодставитьШаблоныВесаИОбъемаВТекстЗапроса(
		ТекстДолиДополнительныхРасходов(), "СН"));
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ОбъединитьТексты(ТекстыПодготовкиДанных, ОбщегоНазначенияУТ.РазделительЗапросовВПакете()));
	ТекстыЗапросов.Добавить(ОбъединитьТексты(ТекстыВыборкиДанных));
	
	Возврат ОбъединитьТексты(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	
КонецФункции

Функция ТекстАналитикиЗаказов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.РегистраторСебестоимости,
		|	ДД.АналитикаРасходов,
		|	ДД.Организация,
		|	ДД.Номенклатура,
		|	ДД.Характеристика,
		|	(ВЫБОР
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям ТОГДА ДД.Назначение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КОНЕЦ) КАК Назначение,
		|	ДД.Склад
		|ПОМЕСТИТЬ АналитикиЗаказов
		|ИЗ (
		|	ВЫБРАТЬ
		|		ДД.Регистратор КАК РегистраторСебестоимости,
		|		Регистраторы.АналитикаРасходов КАК АналитикаРасходов,
		|		Регистраторы.Организация,
		|		ДД.Номенклатура,
		|		ДД.Характеристика,
		|		ТоварыДокумента.Назначение,
		|		(ВЫБОР
		|			КОГДА Заказ.ХозяйственнаяОперация В (
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути),
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути),
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути))
		|				ТОГДА Заказ.Договор
		|			ИНАЧЕ ДД.Склад КОНЕЦ) КАК Склад
		|	ИЗ
		|		Регистраторы КАК Регистраторы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам КАК ДД
		|			ПО Регистраторы.АналитикаРасходов = ДД.ЗаказПоставщику
		|		
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК Заказ
		|			ПО Заказ.Ссылка = ДД.ЗаказПоставщику
		|			
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ТоварыДокумента
		|			ПО ТоварыДокумента.Ссылка = ДД.ЗаказПоставщику
		|				И ТоварыДокумента.КодСтроки = ДД.КодСтроки
		|				И Регистраторы.НаправлениеДеятельности = 
		|					ЕСТЬNULL(ТоварыДокумента.Назначение.НаправлениеДеятельности,
		|						ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению КАК КПоступлению
		|			ПО КПоступлению.ДокументПоступления = Заказ.Ссылка
		|				И КПоступлению.Период <= &КонецПериода
		|				И КПоступлению.Активность
		|				И КПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И КПоступлению.КОформлениюПоступленийПоРаспоряжению <> 0
		|				И КПоступлению.ХозяйственнаяОперация В (
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути),
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути),
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути))
		|	ГДЕ
		|		ДД.Период <= &КонецПериода
		|		И ДД.Активность
		|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И КПоступлению.Регистратор ЕСТЬ NULL
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		Регистраторы.АналитикаРасходов,
		|		Регистраторы.Организация,
		|		ДД.Номенклатура,
		|		ДД.Характеристика,
		|		ТоварыДокумента.Назначение,
		|		(ВЫБОР
		|			КОГДА Заказ.ХозяйственнаяОперация В (
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути),
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути),
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути))
		|				ТОГДА Заказ.Договор
		|			ИНАЧЕ ДД.Склад КОНЕЦ)
		|	ИЗ
		|		РегистрНакопления.ЗаказыПоставщикам КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК Заказ
		|			ПО Заказ.Ссылка = ДД.ЗаказПоставщику
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ТоварыДокумента
		|			ПО ДД.ЗаказПоставщику = ТоварыДокумента.Ссылка
		|			И ДД.КодСтроки = ТоварыДокумента.КодСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
		|			ПО Регистраторы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
		|			И Регистраторы.Организация = Заказ.Организация
		|			И Регистраторы.НаправлениеДеятельности = 
		|				ЕСТЬNULL(ТоварыДокумента.Назначение.НаправлениеДеятельности,
		|					ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению КАК КПоступлению
		|			ПО КПоступлению.ДокументПоступления = Заказ.Ссылка
		|			И КПоступлению.Период <= &КонецПериода
		|			И КПоступлению.Активность
		|			И КПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			И КПоступлению.КОформлениюПоступленийПоРаспоряжению <> 0
		|			И КПоступлению.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути))
		|	ГДЕ
		|		ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|		И ДД.Активность
		|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И КПоступлению.Регистратор ЕСТЬ NULL
		|
		// Поступления товаров по неотфактурованным поставкам и товарам в пути
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		Регистраторы.АналитикаРасходов,
		|		Регистраторы.Организация,
		|		ДД.Номенклатура,
		|		ДД.Характеристика,
		|		ДД.Назначение,
		|		ДД.Склад
		|	ИЗ
		|		Регистраторы КАК Регистраторы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению КАК ДД
		|			ПО Регистраторы.АналитикаРасходов = ДД.ДокументПоступления
		|			И Регистраторы.НаправлениеДеятельности =
		|				ЕСТЬNULL(ДД.Назначение.НаправлениеДеятельности,
		|					ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК Заказ
		|			ПО Заказ.Ссылка = ДД.ДокументПоступления
		|	ГДЕ
		|		ДД.Период <= &КонецПериода
		|		И ДД.Активность
		|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И ДД.КОформлениюПоступленийПоРаспоряжению <> 0
		|		И Заказ.ХозяйственнаяОперация В (
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути))
		|
		// Расходы по заказам на перемещение
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		Регистраторы.АналитикаРасходов,
		|		Регистраторы.Организация,
		|		ДД.Номенклатура,
		|		ДД.Характеристика,
		|		ТоварыДокумента.Назначение,
		|		Заказ.СкладПолучатель
		|	ИЗ
		|		Регистраторы КАК Регистраторы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыНаПеремещение КАК ДД
		|			ПО Регистраторы.АналитикаРасходов = ДД.ЗаказНаПеремещение
		|
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК Заказ
		|			ПО Заказ.Ссылка = ДД.ЗаказНаПеремещение
		|
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение.Товары КАК ТоварыДокумента
		|			ПО ДД.ЗаказНаПеремещение = ТоварыДокумента.Ссылка
		|				И ДД.КодСтроки = ТоварыДокумента.КодСтроки
		|				И Регистраторы.НаправлениеДеятельности =
		|						ЕСТЬNULL(ТоварыДокумента.Назначение.НаправлениеДеятельности,
		|							ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|	ГДЕ
		|		ДД.Период <= &КонецПериода
		|		И ДД.Активность
		|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		Регистраторы.АналитикаРасходов,
		|		Регистраторы.Организация,
		|		ДД.Номенклатура,
		|		ДД.Характеристика,
		|		ТоварыДокумента.Назначение,
		|		Заказ.СкладПолучатель
		|	ИЗ
		|		РегистрНакопления.ЗаказыНаПеремещение КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК Заказ
		|			ПО Заказ.Ссылка = ДД.ЗаказНаПеремещение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение.Товары КАК ТоварыДокумента
		|			ПО ДД.ЗаказНаПеремещение = ТоварыДокумента.Ссылка
		|			И ДД.КодСтроки = ТоварыДокумента.КодСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
		|			ПО Регистраторы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка)
		|			И Регистраторы.Организация = Заказ.Организация
		|			И Регистраторы.НаправлениеДеятельности = 
		|				ЕСТЬNULL(ТоварыДокумента.Назначение.НаправлениеДеятельности,
		|					ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|	ГДЕ
		|		ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|		И ДД.Активность
		|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		// Расходы по заказам на сборку
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		Регистраторы.АналитикаРасходов,
		|		Регистраторы.Организация,
		|		ДД.Номенклатура,
		|		ДД.Характеристика,
		|		(ВЫБОР
		|			КОГДА Заказ.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
		|				ТОГДА Заказ.Назначение
		|			ИНАЧЕ ЗаказТовары.Назначение КОНЕЦ) КАК Назначение,
		|		Заказ.Склад КАК Склад
		|	ИЗ
		|		Регистраторы КАК Регистраторы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыНаСборку КАК ДД
		|			ПО Регистраторы.АналитикаРасходов = ДД.ЗаказНаСборку
		|
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку КАК Заказ
		|			ПО Заказ.Ссылка = ДД.ЗаказНаСборку
		|
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку.Товары КАК ЗаказТовары
		|			ПО ЗаказТовары.Ссылка = ДД.ЗаказНаСборку
		|				И ЗаказТовары.КодСтроки = ДД.КодСтроки
		|				И Регистраторы.НаправлениеДеятельности =
		|					(ВЫБОР
		|						КОГДА Заказ.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
		|							ТОГДА ЕСТЬNULL(Заказ.Назначение.НаправлениеДеятельности,
		|									ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|						ИНАЧЕ
		|							ЕСТЬNULL(ЗаказТовары.Назначение.НаправлениеДеятельности,
		|								ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|					КОНЕЦ)
		|	ГДЕ
		|		ДД.Период <= &КонецПериода
		|		И ДД.Активность
		|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И ДД.ТипСборки = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияЗапасов.Поступление)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		Регистраторы.АналитикаРасходов,
		|		Регистраторы.Организация,
		|		ДД.Номенклатура,
		|		ДД.Характеристика,
		|		(ВЫБОР
		|			КОГДА Заказ.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
		|				ТОГДА Заказ.Назначение
		|			ИНАЧЕ ЗаказТовары.Назначение КОНЕЦ),
		|		Заказ.Склад
		|	ИЗ
		|		РегистрНакопления.ЗаказыНаСборку КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку КАК Заказ
		|			ПО Заказ.Ссылка = ДД.ЗаказНаСборку
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку.Товары КАК ЗаказТовары
		|			ПО ЗаказТовары.Ссылка = ДД.ЗаказНаСборку
		|			И ЗаказТовары.КодСтроки = ДД.КодСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
		|			ПО Регистраторы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказНаСборку.ПустаяСсылка)
		|			И Регистраторы.Организация = Заказ.Организация
		|			И Регистраторы.НаправлениеДеятельности = 
		|			(ВЫБОР
		|				КОГДА Заказ.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
		|					ТОГДА ЕСТЬNULL(Заказ.Назначение.НаправлениеДеятельности,
		|						ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|				ИНАЧЕ
		|					ЕСТЬNULL(ЗаказТовары.Назначение.НаправлениеДеятельности,
		|						ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|				КОНЕЦ)
		|	ГДЕ
		|		ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|		И ДД.Активность
		|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И ДД.ТипСборки = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияЗапасов.Поступление)
		|) КАК ДД
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаРасходов";
		
	Возврат ТекстЗапроса;
		
КонецФункции

Функция ТекстПриобретенияПоТаможеннымДекларациям()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ТоварыОрганизаций.Организация КАК Организация,
		|	ТоварыОрганизаций.ВидЗапасов КАК ВидЗапасов,
		|	ТоварыОрганизаций.Регистратор КАК Регистратор,
		|	ТоварыОрганизаций.Количество КАК Количество
		|ПОМЕСТИТЬ ТоварыОрганизацийПоДекларациям
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
		|ГДЕ
		|	ТоварыОрганизаций.Период < ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 1)
		|	И ТИПЗНАЧЕНИЯ(ТоварыОрганизаций.Регистратор) = ТИП(Документ.ТаможеннаяДекларацияИмпорт)
		|	И ТоварыОрганизаций.Активность
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаНоменклатуры,
		|	Организация,
		|	ВидЗапасов,
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТоварыПоДекларациям.Декларация КАК Декларация,
		|	ТоварыПоДекларациям.РегистраторСебестоимости КАК РегистраторСебестоимости,
		|	ТоварыПоДекларациям.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ТоварыПоДекларациям.РазделУчета КАК РазделУчета,
		|	ТоварыПоДекларациям.ВидЗапасов КАК ВидЗапасов,
		|	ТоварыПоДекларациям.Организация КАК Организация,
		|	ТоварыПоДекларациям.Партия КАК Партия,
		|	ТоварыПоДекларациям.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	ТоварыПоДекларациям.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|	ТоварыПоДекларациям.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	ТоварыПоДекларациям.Количество КАК Количество
		|ПОМЕСТИТЬ ПриобретенияПоДекларациям
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДД.АналитикаРасходов КАК Декларация,
		|		Себестоимость.ДокументИсточник КАК РегистраторСебестоимости,
		|		Себестоимость.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|		Себестоимость.РазделУчета КАК РазделУчета,
		|		Себестоимость.ВидЗапасов КАК ВидЗапасов,
		|		Себестоимость.Организация КАК Организация,
		|		Себестоимость.Партия КАК Партия,
		|		Себестоимость.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|		Себестоимость.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|		Себестоимость.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|		ЕСТЬNULL(ТоварыОрганизацийПоДекларациям.Количество, 0) КАК Количество
		|	ИЗ
		|		Регистраторы КАК ДД
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
		|				ЛЕВОЕ СОЕДИНЕНИЕ ТоварыОрганизацийПоДекларациям КАК ТоварыОрганизацийПоДекларациям
		|				ПО Себестоимость.АналитикаУчетаНоменклатуры = ТоварыОрганизацийПоДекларациям.АналитикаУчетаНоменклатуры
		|					И Себестоимость.Организация = ТоварыОрганизацийПоДекларациям.Организация
		|					И Себестоимость.ВидЗапасов = ТоварыОрганизацийПоДекларациям.ВидЗапасов
		|					И Себестоимость.Регистратор = ТоварыОрганизацийПоДекларациям.Регистратор
		|			ПО (Себестоимость.Период < &НачалоПериода)
		|				И ДД.АналитикаРасходов = Себестоимость.Регистратор
		|	ГДЕ
		|		ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов) = ТИП(Документ.ТаможеннаяДекларацияИмпорт)
		|		И Себестоимость.Активность
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДД.АналитикаРасходов,
		|		Себестоимость.ДокументИсточник,
		|		Себестоимость.АналитикаУчетаНоменклатуры,
		|		Себестоимость.РазделУчета,
		|		Себестоимость.ВидЗапасов,
		|		Себестоимость.Организация,
		|		Себестоимость.Партия,
		|		Себестоимость.АналитикаУчетаПартий,
		|		Себестоимость.АналитикаФинансовогоУчета,
		|		Себестоимость.ВидДеятельностиНДС,
		|		ЕСТЬNULL(ТоварыОрганизацийПоДекларациям.Количество, 0) КАК Количество
		|	ИЗ
		|		Регистраторы КАК ДД
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
		|				ЛЕВОЕ СОЕДИНЕНИЕ ТоварыОрганизацийПоДекларациям КАК ТоварыОрганизацийПоДекларациям
		|				ПО Себестоимость.АналитикаУчетаНоменклатуры = ТоварыОрганизацийПоДекларациям.АналитикаУчетаНоменклатуры
		|					И Себестоимость.Организация = ТоварыОрганизацийПоДекларациям.Организация
		|					И Себестоимость.ВидЗапасов = ТоварыОрганизацийПоДекларациям.ВидЗапасов
		|					И Себестоимость.Регистратор = ТоварыОрганизацийПоДекларациям.Регистратор
		|			ПО ДД.АналитикаРасходов = Себестоимость.Регистратор
		|	ГДЕ
		|		ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов) = ТИП(Документ.ТаможеннаяДекларацияИмпорт)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДД.АналитикаРасходов,
		|		Себестоимость.ДокументИсточник,
		|		Себестоимость.АналитикаУчетаНоменклатуры,
		|		Себестоимость.РазделУчета,
		|		Себестоимость.ВидЗапасов,
		|		Себестоимость.Организация,
		|		Себестоимость.Партия,
		|		Себестоимость.АналитикаУчетаПартий,
		|		Себестоимость.АналитикаФинансовогоУчета,
		|		Себестоимость.ВидДеятельностиНДС,
		|		ЕСТЬNULL(ТоварыОрганизацийПоДекларациям.Количество, 0) КАК Количество
		|	ИЗ
		|		Регистраторы КАК ДД
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
		|				ЛЕВОЕ СОЕДИНЕНИЕ ТоварыОрганизацийПоДекларациям КАК ТоварыОрганизацийПоДекларациям
		|				ПО Себестоимость.АналитикаУчетаНоменклатуры = ТоварыОрганизацийПоДекларациям.АналитикаУчетаНоменклатуры
		|					И Себестоимость.Организация = ТоварыОрганизацийПоДекларациям.Организация
		|					И Себестоимость.ВидЗапасов = ТоварыОрганизацийПоДекларациям.ВидЗапасов
		|					И Себестоимость.Регистратор = ТоварыОрганизацийПоДекларациям.Регистратор
		|			ПО ДД.Организация = Себестоимость.Организация
		|				И (ТИПЗНАЧЕНИЯ(Себестоимость.Регистратор) = ТИП(Документ.ТаможеннаяДекларацияИмпорт))
		|	ГДЕ
		|		ДД.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ТаможеннаяДекларацияИмпорт.ПустаяСсылка)) КАК ТоварыПоДекларациям
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТоварыОрганизацийПоДекларациям";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ШаблонТекстаПервичныеПриемникиДополнительныхРасходов(ТипАналитикиРасходов)
	
	Если ТипАналитикиРасходов = Тип("Неопределено") Тогда
		Шаблон = "";
		
	ИначеЕсли ТипАналитикиРасходов = Тип("ДокументСсылка.ЗаказПоставщику")
		Или ТипАналитикиРасходов = Тип("ДокументСсылка.ЗаказНаСборку")
		Или ТипАналитикиРасходов = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		Шаблон = ШаблонТекстаПервичныеПриемникиПоЗаказам();
		
	ИначеЕсли ТипАналитикиРасходов = Тип("ДокументСсылка.ТаможеннаяДекларацияИмпорт") Тогда
		Шаблон = ШаблонТекстаПервичныеПриемникиПоДекларациям();

	ИначеЕсли РасчетСебестоимостиУниверсальныеАлгоритмы.ОписаниеТиповДокументов().СодержитТип(ТипАналитикиРасходов) Тогда
		
		Шаблон = ШаблонТекстаПервичныеПриемникиПоДокументам();
		Шаблон = СтрЗаменить(Шаблон, "&ПустоеЗначение", 
			"ЗНАЧЕНИЕ(Документ." + Метаданные.НайтиПоТипу(ТипАналитикиРасходов).Имя + ".ПустаяСсылка)");
		
	ИначеЕсли ТипАналитикиРасходов = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Шаблон = ШаблонТекстаПервичныеПриемникиПоСправочникам();
		Шаблон = СтрЗаменить(Шаблон, "&ПустоеЗначение", "ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)");
		Шаблон = СтрЗаменить(Шаблон, "&ПолеИсточник", "ИсточникБазы.АналитикаУчетаНоменклатуры.Номенклатура");

	ИначеЕсли ТипАналитикиРасходов = Тип("СправочникСсылка.Склады") Тогда
		
		Шаблон = ШаблонТекстаПервичныеПриемникиПоСправочникам();
		Шаблон = СтрЗаменить(Шаблон, "&ПустоеЗначение", "ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)");
		Шаблон = СтрЗаменить(Шаблон, "&ПолеИсточник", "ИсточникБазы.АналитикаУчетаНоменклатуры.МестоХранения");
		

	КонецЕсли;

	Возврат Шаблон;
	
КонецФункции

Функция ШаблонТекстаПервичныеПриемникиПоЗаказам()
	
	Шаблон = 
		"ВЫБРАТЬ
		|	""ТекстРаспределенияДополнительныхРасходов"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ИСТИНА                                     КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикиЗаказов КАК АналитикиЗаказов
		|		ПО ДД.АналитикаРасходов = АналитикиЗаказов.АналитикаРасходов
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК ИсточникБазы
		|		ПО АналитикиЗаказов.РегистраторСебестоимости = ИсточникБазы.Регистратор
		|			И АналитикиЗаказов.Номенклатура = ИсточникБазы.АналитикаУчетаНоменклатуры.Номенклатура
		|			И АналитикиЗаказов.Характеристика = ИсточникБазы.АналитикаУчетаНоменклатуры.Характеристика
		|			И АналитикиЗаказов.Назначение = ИсточникБазы.АналитикаУчетаНоменклатуры.Назначение
		|			И АналитикиЗаказов.Склад = ИсточникБазы.АналитикаУчетаНоменклатуры.МестоХранения
		|			И ИсточникБазы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			И ИсточникБазы.Период < &НачалоПериода
		|			И ИсточникБазы.Организация = ДД.Организация
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|
		|ГДЕ
		|	НЕ ИсточникБазы.Количество = 0
		|	И (&УсловиеСоединения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ТекстРаспределенияДополнительныхРасходов"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ЛОЖЬ                                       КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикиЗаказов КАК АналитикиЗаказов
		|		ПО ДД.АналитикаРасходов = АналитикиЗаказов.АналитикаРасходов
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ИсточникБазы
		|		ПО АналитикиЗаказов.РегистраторСебестоимости = ИсточникБазы.Регистратор
		|			И АналитикиЗаказов.Номенклатура = ИсточникБазы.АналитикаУчетаНоменклатуры.Номенклатура
		|			И АналитикиЗаказов.Характеристика = ИсточникБазы.АналитикаУчетаНоменклатуры.Характеристика
		|			И АналитикиЗаказов.Назначение = ИсточникБазы.АналитикаУчетаНоменклатуры.Назначение
		|			И АналитикиЗаказов.Склад = ИсточникБазы.АналитикаУчетаНоменклатуры.МестоХранения
		|			И ИсточникБазы.СлужебноеВидДвиженияПриход
		|			И ИсточникБазы.Организация = ДД.Организация
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|ГДЕ
		|	НЕ ИсточникБазы.Количество = 0
		|	И (&УсловиеСоединения)";
	
	Возврат Шаблон;
	
КонецФункции

Функция ШаблонТекстаПервичныеПриемникиПоДекларациям()
	
	Шаблон = 
		"ВЫБРАТЬ
		|	""ТекстРаспределенияДополнительныхРасходов"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ИСТИНА                                     КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	Приобретения.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК СтоимостьУпр
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриобретенияПоДекларациям КАК Приобретения
		|		ПО ДД.АналитикаРасходов = Приобретения.Декларация
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК ИсточникБазы
		|		ПО Приобретения.РегистраторСебестоимости = ИсточникБазы.Регистратор
		|			И Приобретения.АналитикаУчетаНоменклатуры = ИсточникБазы.АналитикаУчетаНоменклатуры
		|			И Приобретения.РазделУчета = ИсточникБазы.РазделУчета
		|			И Приобретения.ВидЗапасов = ИсточникБазы.ВидЗапасов
		|			И Приобретения.Организация = ИсточникБазы.Организация
		|			И Приобретения.Партия = ИсточникБазы.Партия
		|			И Приобретения.АналитикаУчетаПартий = ИсточникБазы.АналитикаУчетаПартий
		|			И Приобретения.АналитикаФинансовогоУчета = ИсточникБазы.АналитикаФинансовогоУчета
		|			И Приобретения.ВидДеятельностиНДС = ИсточникБазы.ВидДеятельностиНДС
		|			И ИсточникБазы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			И ИсточникБазы.Период < &НачалоПериода
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|
		|ГДЕ
		|	НЕ ИсточникБазы.Количество = 0
		|	И (&УсловиеСоединения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ТекстРаспределенияДополнительныхРасходов"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ЛОЖЬ                                       КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	Приобретения.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК СтоимостьУпр
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриобретенияПоДекларациям КАК Приобретения
		|		ПО ДД.АналитикаРасходов = Приобретения.Декларация
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ИсточникБазы
		|		ПО Приобретения.РегистраторСебестоимости = ИсточникБазы.Регистратор
		|			И Приобретения.АналитикаУчетаНоменклатуры = ИсточникБазы.АналитикаУчетаНоменклатуры
		|			И Приобретения.РазделУчета = ИсточникБазы.РазделУчета
		|			И Приобретения.ВидЗапасов = ИсточникБазы.ВидЗапасов
		|			И Приобретения.Организация = ИсточникБазы.Организация
		|			И Приобретения.Партия = ИсточникБазы.Партия
		|			И Приобретения.АналитикаУчетаПартий = ИсточникБазы.АналитикаУчетаПартий
		|			И Приобретения.АналитикаФинансовогоУчета = ИсточникБазы.АналитикаФинансовогоУчета
		|			И Приобретения.ВидДеятельностиНДС = ИсточникБазы.ВидДеятельностиНДС
		|			И ИсточникБазы.СлужебноеВидДвиженияПриход
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|ГДЕ
		|	НЕ ИсточникБазы.Количество = 0
		|	И (&УсловиеСоединения)";
	
	Возврат Шаблон;
	
КонецФункции

Функция ШаблонТекстаПервичныеПриемникиПоДокументам()
	
	Шаблон = 
		"ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоДокументам_1"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ИСТИНА                                      КАК ЭтоПартияПрошлогоПериода,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорРазделУчета
		|		ИНАЧЕ ИсточникБазы.РазделУчета КОНЕЦ)  КАК РазделУчета,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорАналитикаУчетаНоменклатуры
		|		ИНАЧЕ ИсточникБазы.АналитикаУчетаНоменклатуры КОНЕЦ)  КАК АналитикаУчетаНоменклатуры,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорВидЗапасов
		|		ИНАЧЕ ИсточникБазы.ВидЗапасов КОНЕЦ)   КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорПартия
		|		ИНАЧЕ ИсточникБазы.Партия КОНЕЦ)       КАК Партия,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорАналитикаУчетаПартий
		|		ИНАЧЕ ИсточникБазы.АналитикаУчетаПартий КОНЕЦ) КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрСторно
		|		ПО РеестрСторно.СторнируемыйДокумент = ДД.АналитикаРасходов
		|			И РеестрСторно.Организация = ДД.Организация
		|			И НЕ РеестрСторно.ДополнительнаяЗапись
		|			И РеестрСторно.СторноИсправление
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрИсправление
		|		ПО РеестрИсправление.ИсправляемыйДокумент = ДД.АналитикаРасходов
		|			И РеестрИсправление.Организация = ДД.Организация
		|			И НЕ РеестрИсправление.ДополнительнаяЗапись
		|			И РеестрИсправление.СторноИсправление
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения КАК Корректировка
		|		ПО Корректировка.Организация = ДД.Организация
		|			И Корректировка.ДокументОснование = ДД.АналитикаРасходов
		|			И Корректировка.Проведен
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК ИсточникБазы
		|		ПО ИсточникБазы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			И ИсточникБазы.Период < &НачалоПериода
		|			И ИсточникБазы.Организация = ДД.Организация
		|			И (ИсточникБазы.Регистратор = ДД.АналитикаРасходов
		|				ИЛИ ИсточникБазы.Регистратор = РеестрСторно.Ссылка
		|				ИЛИ ИсточникБазы.Регистратор = РеестрИсправление.Ссылка
		|				ИЛИ ИсточникБазы.Регистратор = Корректировка.Ссылка)
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|ГДЕ
		|	НЕ ИсточникБазы.Количество = 0
		//++ НЕ УТ
		|	И (НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) В (
		|		ТИП(Документ.ПроизводствоБезЗаказа)
		//++ НЕ УТКА
		|		, ТИП(Документ.ЭтапПроизводства2_2)
		//-- НЕ УТКА
		|		)
		|		ИЛИ ИсточникБазы.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|			И НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Партия) = ТИП(Справочник.ПартииПроизводства))
		//-- НЕ УТ
		|	И (&УсловиеСоединения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоДокументам_2"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	(ВЫБОР
		|		КОГДА НЕ РеестрПартии.ДатаДокументаИБ ЕСТЬ NULL И РеестрПартии.ДатаДокументаИБ < &НачалоПериода
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ) 					   КАК ЭтоПартияПрошлогоПериода,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорРазделУчета
		|		ИНАЧЕ ИсточникБазы.РазделУчета КОНЕЦ)  КАК РазделУчета,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорАналитикаУчетаНоменклатуры
		|		ИНАЧЕ ИсточникБазы.АналитикаУчетаНоменклатуры КОНЕЦ)  КАК АналитикаУчетаНоменклатуры,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорВидЗапасов
		|		ИНАЧЕ ИсточникБазы.ВидЗапасов КОНЕЦ)   КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорПартия
		|		ИНАЧЕ ИсточникБазы.Партия КОНЕЦ)       КАК Партия,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорАналитикаУчетаПартий
		|		ИНАЧЕ ИсточникБазы.АналитикаУчетаПартий КОНЕЦ) КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрСторно
		|		ПО РеестрСторно.СторнируемыйДокумент = ДД.АналитикаРасходов
		|			И РеестрСторно.Организация = ДД.Организация
		|			И НЕ РеестрСторно.ДополнительнаяЗапись
		|			И РеестрСторно.СторноИсправление
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрИсправление
		|		ПО РеестрИсправление.ИсправляемыйДокумент = ДД.АналитикаРасходов
		|			И РеестрИсправление.Организация = ДД.Организация
		|			И НЕ РеестрИсправление.ДополнительнаяЗапись
		|			И РеестрИсправление.СторноИсправление
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения КАК Корректировка
		|		ПО Корректировка.Организация = ДД.Организация
		|			И Корректировка.ДокументОснование = ДД.АналитикаРасходов
		|			И Корректировка.Проведен
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ИсточникБазы
		|		ПО ИсточникБазы.СлужебноеВидДвиженияПриход
		|			И ИсточникБазы.Организация = ДД.Организация
		|			И (ИсточникБазы.Регистратор = ДД.АналитикаРасходов
		|				ИЛИ ИсточникБазы.Регистратор = РеестрСторно.Ссылка
		|				ИЛИ ИсточникБазы.Регистратор = РеестрИсправление.Ссылка
		|				ИЛИ ИсточникБазы.Регистратор = Корректировка.Ссылка)
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрПартии
		|		ПО РеестрПартии.Ссылка = ВЫБОР
		|			КОГДА ИсточникБазы.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия) ТОГДА NULL
		|			КОГДА ИсточникБазы.Партия <> НЕОПРЕДЕЛЕНО ТОГДА ИсточникБазы.Партия
		|			КОГДА ИсточникБазы.ДокументИсточник <> НЕОПРЕДЕЛЕНО ТОГДА ИсточникБазы.ДокументИсточник
		|			ИНАЧЕ NULL КОНЕЦ
		|		И НЕ РеестрПартии.ДополнительнаяЗапись
		|ГДЕ
		|	НЕ ИсточникБазы.Количество = 0
		//++ НЕ УТ
		|	И (НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) В (
		|		ТИП(Документ.ПроизводствоБезЗаказа)
		//++ НЕ УТКА
		|		, ТИП(Документ.ЭтапПроизводства2_2)
		//-- НЕ УТКА
		|		)
		|		ИЛИ ИсточникБазы.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|			И НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Партия) = ТИП(Справочник.ПартииПроизводства))
		//-- НЕ УТ
		|	И (&УсловиеСоединения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоДокументам_3"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	(ВЫБОР
		|		КОГДА НЕ РеестрПартии.ДатаДокументаИБ ЕСТЬ NULL И РеестрПартии.ДатаДокументаИБ < &НачалоПериода
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ) 					   КАК ЭтоПартияПрошлогоПериода,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорРазделУчета
		|		ИНАЧЕ ИсточникБазы.РазделУчета КОНЕЦ)  КАК РазделУчета,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорАналитикаУчетаНоменклатуры
		|		ИНАЧЕ ИсточникБазы.АналитикаУчетаНоменклатуры КОНЕЦ)  КАК АналитикаУчетаНоменклатуры,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорВидЗапасов
		|		ИНАЧЕ ИсточникБазы.ВидЗапасов КОНЕЦ)   КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорПартия
		|		ИНАЧЕ ИсточникБазы.Партия КОНЕЦ)       КАК Партия,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорАналитикаУчетаПартий
		|		ИНАЧЕ ИсточникБазы.АналитикаУчетаПартий КОНЕЦ) КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ИсточникБазы
		|		ПО ДД.Организация = ИсточникБазы.Организация
		|			И ИсточникБазы.СлужебноеВидДвиженияПриход
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
		|		ПО Реестр.Ссылка = ИсточникБазы.Регистратор
		|			И Реестр.Организация = ДД.Организация
		|			И НЕ Реестр.ДополнительнаяЗапись
		|			И Реестр.СторноИсправление
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения КАК Корректировка
		|		ПО Корректировка.Ссылка = ИсточникБазы.Регистратор
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрПартии
		|		ПО РеестрПартии.Ссылка = ВЫБОР
		|			КОГДА ИсточникБазы.Партия <> НЕОПРЕДЕЛЕНО ТОГДА ИсточникБазы.Партия
		|			КОГДА ИсточникБазы.ДокументИсточник <> НЕОПРЕДЕЛЕНО ТОГДА ИсточникБазы.ДокументИсточник
		|			ИНАЧЕ NULL КОНЕЦ
		|		И НЕ РеестрПартии.ДополнительнаяЗапись
		|ГДЕ
		|	ДД.АналитикаРасходов = &ПустоеЗначение
		|	И (ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов)
		|		ИЛИ ТИПЗНАЧЕНИЯ(Реестр.СторнируемыйДокумент) = ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов) 
		|		ИЛИ ТИПЗНАЧЕНИЯ(Реестр.ИсправляемыйДокумент) = ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов)
		|		ИЛИ ТИПЗНАЧЕНИЯ(Корректировка.ДокументОснование) = ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов)
		|		)
		//++ НЕ УТ
		|	И (НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) В (
		|		ТИП(Документ.ПроизводствоБезЗаказа)
		//++ НЕ УТКА
		|		, ТИП(Документ.ЭтапПроизводства2_2)
		//-- НЕ УТКА
		|		)
		|		ИЛИ ИсточникБазы.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|			И НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Партия) = ТИП(Справочник.ПартииПроизводства))
		//-- НЕ УТ
		|	И НЕ ИсточникБазы.Количество = 0
		|	И (&УсловиеСоединения)";
	
	Возврат Шаблон;
	
КонецФункции

Функция ШаблонТекстаПервичныеПриемникиПоСправочникам()
	
	Шаблон = 
		"ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоСправочникам_1"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ЛОЖЬ                                       КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ИсточникБазы
		|		ПО ДД.Организация = ИсточникБазы.Организация
		|			И ИсточникБазы.СлужебноеВидДвиженияПриход
		|			И ДД.АналитикаРасходов = &ПолеИсточник
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК РеквизитыСклада
		|		ПО АналитикаОтбора.МестоХранения = РеквизитыСклада.Ссылка
		|ГДЕ
		|	(ИсточникБазы.ТипЗаписи В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
		//++ НЕ УТ
		|		ИЛИ ИсточникБазы.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика
		//-- НЕ УТ
		|		)
		|	И НЕ ИсточникБазы.Количество = 0
		|	И НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИП(Документ.ПеремещениеТоваров)
		|	И НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИП(Документ.СборкаТоваров)
		|	И НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИП(Документ.ПередачаТоваровМеждуОрганизациями)
		|	И (ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
		|		ИЛИ ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		ИЛИ ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|		И (АналитикаОтбора.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|			ИЛИ ЕСТЬNULL(РеквизитыСклада.ЦеховаяКладовая, ЛОЖЬ)
		//++ НЕ УТКА
		|			ИЛИ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИП(Документ.ЭтапПроизводства2_2)
		//-- НЕ УТКА
		//++ НЕ УТ
		|			ИЛИ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИП(Документ.ПроизводствоБезЗаказа)
		//-- НЕ УТ
		|			))
		|	И НЕ (ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
		|			И АналитикаОтбора.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер))
		|   И (&УсловиеСоединения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоСправочникам_2"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ЛОЖЬ                                       КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ИсточникБазы
		|		ПО ДД.Организация = ИсточникБазы.Организация
		|			И ИсточникБазы.СлужебноеВидДвиженияПриход
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК РеквизитыСклада
		|		ПО АналитикаОтбора.МестоХранения = РеквизитыСклада.Ссылка
		|ГДЕ
		|	ДД.АналитикаРасходов = &ПустоеЗначение
		|	И НЕ ИсточникБазы.Количество = 0
		|	И (ИсточникБазы.ТипЗаписи В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
		//++ НЕ УТ
		|		ИЛИ ИсточникБазы.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика
		//-- НЕ УТ
		|		)
		|	И НЕ ИсточникБазы.Количество = 0
		|	И НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИП(Документ.ПеремещениеТоваров)
		|	И НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИП(Документ.СборкаТоваров)
		|	И НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИП(Документ.ПередачаТоваровМеждуОрганизациями)
		|	И (ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
		|		ИЛИ ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		ИЛИ ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|		И (АналитикаОтбора.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|			ИЛИ ЕСТЬNULL(РеквизитыСклада.ЦеховаяКладовая, ЛОЖЬ)
		//++ НЕ УТКА
		|			ИЛИ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИП(Документ.ЭтапПроизводства2_2)
		//-- НЕ УТКА
		//++ НЕ УТ
		|			ИЛИ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИП(Документ.ПроизводствоБезЗаказа)
		//-- НЕ УТ
		|			))
		|	И НЕ (ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
		|			И АналитикаОтбора.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер))
		|   И (&УсловиеСоединения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоСправочникам_3"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ЛОЖЬ                                       КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.КоличествоОстаток             КАК Количество,
		|	ИсточникБазы.СтоимостьОстаток              КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДСОстаток        КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРеглОстаток          КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпрОстаток           КАК СтоимостьУпр
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
		|			Организация В (&МассивОрганизаций) И 
		|			(РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
		|				И НЕ АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер)
		|			ИЛИ РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|				И (ТИПЗНАЧЕНИЯ(АналитикаУчетаНоменклатуры.МестоХранения) = ТИП(Справочник.Склады)
		|					ИЛИ АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)))) КАК ИсточникБазы
		|		ПО ДД.Организация = ИсточникБазы.Организация
		|			И ДД.АналитикаРасходов = &ПолеИсточник
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|ГДЕ
		|	НЕ ИсточникБазы.КоличествоОстаток = 0
		|	И (&УсловиеСоединения)";
	
	Возврат Шаблон;
	
КонецФункции

Функция ТекстПервичныеПриемникиДополнительныхРасходов(ПараметрыРасчета)
	
	ИмяВременнойТаблицыГруппыОбъектов = "ГруппыОбъектовДополнительныхРасходов";
	ТекстПолученияОбъектов = 
		"ВЫБРАТЬ
		|	Регистраторы.Ссылка,
		|	Регистраторы.БазаРаспределенияПоПартиям КАК ТипБазыРаспределения,
		|	Регистраторы.НастройкиБазыРаспределенияПоПартиям КАК НастройкиСхемы,
		|	ТИПЗНАЧЕНИЯ(Регистраторы.АналитикаРасходов) КАК ТипАналитикиРасходов
		|ИЗ
		|	Регистраторы КАК Регистраторы";

	ОписаниеГрупп = ПолучитьОписаниеГруппОбъектовПоНастройкамОтбора(ТекстПолученияОбъектов, ПараметрыРасчета, ИмяВременнойТаблицыГруппыОбъектов);
	
	ГотовыеТекстыЗапросов = Новый Массив;
	ГотовыеТекстыЗапросов.Добавить(ТекстПомещенияГруппыОбъектовВоВременнуюТаблицу(ИмяВременнойТаблицыГруппыОбъектов));
	ТекстОписаниеДанных =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	""ТекстОписаниеДанныхДляРаспределенияДополнительныхРасходов"" КАК ЗапросИсточник,
		|	ДД.Регистратор                   КАК Регистратор,
		|	ЛОЖЬ                             КАК ЭтоПартияПрошлогоПериода,
		|	ДД.РазделУчета                   КАК РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов                    КАК ВидЗапасов,
		|	ДД.Организация                   КАК Организация,
		|	ДД.Партия                        КАК Партия,
		|	ДД.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	0                                КАК Количество,
		|	0                                КАК Стоимость,
		|	0                                КАК СтоимостьБезНДС,
		|	0                                КАК СтоимостьРегл,
		|	0                                КАК СтоимостьУпр
		|ПОМЕСТИТЬ ОписаниеДанных
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК ДД
		|ГДЕ
		|	ЛОЖЬ";
	ГотовыеТекстыЗапросов.Добавить(ТекстОписаниеДанных);
	ДополнитьТекстамиПоОписаниюГрупп(ГотовыеТекстыЗапросов, ОписаниеГрупп, ИмяВременнойТаблицыГруппыОбъектов);
	
	ТекстыФормированияИтоговойТаблицы = Новый Массив;
	ТекстПервичныеПриемники = 
		"ВЫБРАТЬ
		|	Т.ЗапросИсточник,
		|	Т.Регистратор,
		|	Т.ЭтоПартияПрошлогоПериода,
		|	Т.РазделУчета,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.Организация,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.ВидДеятельностиНДС,
		|	Т.Количество,
		|	Т.Стоимость,
		|	Т.СтоимостьБезНДС,
		|	Т.СтоимостьРегл,
		|	Т.СтоимостьУпр
		|ПОМЕСТИТЬ ПервичныеПриемники
		|ИЗ
		|	ОписаниеДанных КАК Т";
	ТекстыФормированияИтоговойТаблицы.Добавить(ТекстПервичныеПриемники);
	
	ТекстПервичныеПриемники = СтрЗаменить(ТекстПервичныеПриемники, "ПОМЕСТИТЬ ПервичныеПриемники", "");
	Для Каждого ОписаниеГруппы Из ОписаниеГрупп Цикл
		Если НЕ ОписаниеГруппы.Используется Тогда
			Продолжить
		КонецЕсли;
		ТекстыФормированияИтоговойТаблицы.Добавить(
			СтрЗаменить(ТекстПервичныеПриемники, 
				"ОписаниеДанных",
				СтрШаблон("ТаблицаДанных%1",
					Формат(ОписаниеГруппы.НомерГруппы, "ЧН=0; ЧГ=0"))));
	КонецЦикла;
			
	ГотовыеТекстыЗапросов.Добавить(ОбъединитьТексты(ТекстыФормированияИтоговойТаблицы));
	
	ГотовыеТекстыЗапросов.Добавить("УНИЧТОЖИТЬ ОписаниеДанных");
	Для Каждого ОписаниеГруппы Из ОписаниеГрупп Цикл
		Если НЕ ОписаниеГруппы.Используется Тогда
			Продолжить
		КонецЕсли;
		ГотовыеТекстыЗапросов.Добавить(
			СтрШаблон("УНИЧТОЖИТЬ ТаблицаДанных%1",
				Формат(ОписаниеГруппы.НомерГруппы, "ЧН=0; ЧГ=0")));
	КонецЦикла;
	
	Возврат ОбъединитьТексты(ГотовыеТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	
КонецФункции

Функция КорректировкаПриемниковПоРегистраторам()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Т.Регистратор,
		|	Т.ЭтоПартияПрошлогоПериода,
		|	Т.РазделУчета,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.Организация,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.ВидДеятельностиНДС,
		|	СУММА(Т.Количество) КАК Количество,
		|	СУММА(Т.Стоимость) КАК Стоимость,
		|	СУММА(Т.СтоимостьБезНДС) КАК СтоимостьБезНДС,
		|	СУММА(Т.СтоимостьРегл) КАК СтоимостьРегл,
		|	СУММА(Т.СтоимостьУпр) КАК СтоимостьУпр
		|
		|ПОМЕСТИТЬ ПриемникиПоТоварам
		|ИЗ
		|	(ВЫБРАТЬ
		|		Источник.Регистратор,
		|		Источник.ЭтоПартияПрошлогоПериода,
		|		Источник.АналитикаУчетаНоменклатуры,
		|		Источник.РазделУчета,
		|		Источник.ВидЗапасов,
		|		Источник.Организация,
		|		Источник.Партия,
		|		Источник.АналитикаУчетаПартий,
		|		Источник.АналитикаФинансовогоУчета,
		|		Источник.ВидДеятельностиНДС,
		|		Источник.Количество КАК Количество,
		|		Источник.Стоимость КАК Стоимость,
		|		Источник.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|		Источник.СтоимостьРегл КАК СтоимостьРегл,
		|		Источник.СтоимостьУпр КАК СтоимостьУпр
		|	ИЗ
		|		ПервичныеПриемники КАК Источник
		|	ГДЕ
		|		НЕ Источник.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		ИЛИ &РаспределениеДопРасходовНаТоварыВПутиОтПоставщиков
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Источник.Регистратор,
		|		(Данные.Период < &НачалоПериода),
		|		Данные.КорАналитикаУчетаНоменклатуры,
		|		Данные.КорРазделУчета,
		|		Данные.КорВидЗапасов,
		|		ВЫБОР
		|			КОГДА Данные.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА Данные.Организация
		|			ИНАЧЕ
		|				Данные.КорОрганизация
		|		КОНЕЦ,
		|		Данные.КорПартия,
		|		Данные.КорАналитикаУчетаПартий,
		|		Данные.КорАналитикаФинансовогоУчета,
		|		Данные.КорВидДеятельностиНДС,
		|		Данные.Количество,
		|		Данные.Стоимость КАК Стоимость,
		|		Данные.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|		Данные.СтоимостьРегл КАК СтоимостьРегл,
		|		Данные.СтоимостьУпр КАК СтоимостьУпр
		|	ИЗ
		|		ПервичныеПриемники КАК Источник
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Данные
		|			ПО Источник.АналитикаУчетаНоменклатуры = Данные.АналитикаУчетаНоменклатуры
		|				И Источник.РазделУчета = Данные.РазделУчета
		|				И Источник.ВидЗапасов = Данные.ВидЗапасов
		|				И Источник.Организация = Данные.Организация
		|				И Источник.Партия = Данные.Партия
		|				И Источник.АналитикаУчетаПартий = Данные.АналитикаУчетаПартий
		|				И Источник.АналитикаФинансовогоУчета = Данные.АналитикаФинансовогоУчета
		|				И Источник.ВидДеятельностиНДС = Данные.ВидДеятельностиНДС
		|				И Данные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И Данные.Период < &НачалоПериода
		|	ГДЕ
		|		Источник.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		И НЕ &РаспределениеДопРасходовНаТоварыВПутиОтПоставщиков
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Источник.Регистратор,
		|		(Данные.Период < &НачалоПериода),
		|		Данные.КорАналитикаУчетаНоменклатуры,
		|		Данные.КорРазделУчета,
		|		Данные.КорВидЗапасов,
		|		ВЫБОР
		|			КОГДА Данные.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА Данные.Организация
		|			ИНАЧЕ
		|				Данные.КорОрганизация
		|		КОНЕЦ,
		|		Данные.КорПартия,
		|		Данные.КорАналитикаУчетаПартий,
		|		Данные.КорАналитикаФинансовогоУчета,
		|		Данные.КорВидДеятельностиНДС,
		|		Данные.Количество,
		|		Данные.Стоимость КАК Стоимость,
		|		Данные.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|		Данные.СтоимостьРегл КАК СтоимостьРегл,
		|		Данные.СтоимостьУпр КАК СтоимостьУпр
		|	ИЗ
		|		ПервичныеПриемники КАК Источник
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Данные
		|			ПО Источник.АналитикаУчетаНоменклатуры = Данные.АналитикаУчетаНоменклатуры
		|				И Источник.РазделУчета = Данные.РазделУчета
		|				И Источник.ВидЗапасов = Данные.ВидЗапасов
		|				И Источник.Организация = Данные.Организация
		|				И Источник.Партия = Данные.Партия
		|				И Источник.АналитикаУчетаПартий = Данные.АналитикаУчетаПартий
		|				И Источник.АналитикаФинансовогоУчета = Данные.АналитикаФинансовогоУчета
		|				И Источник.ВидДеятельностиНДС = Данные.ВидДеятельностиНДС
		|				И НЕ Данные.СлужебноеВидДвиженияПриход
		|	ГДЕ
		|		Источник.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		И НЕ &РаспределениеДопРасходовНаТоварыВПутиОтПоставщиков
		|	) КАК Т
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Регистратор,
		|	Т.ЭтоПартияПрошлогоПериода,
		|	Т.РазделУчета,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.Организация,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.ВидДеятельностиНДС";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстПриемникиПоТоварамПрошлыхПериодовДополнительныхРасходов()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Источник.Регистратор,
		|	Реквизиты.Дата КАК Период,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка) КАК ТипЗаписи,
		|	Источник.АналитикаУчетаНоменклатуры,
		|	Источник.РазделУчета,
		|	Источник.ВидЗапасов,
		|	Источник.Организация,
		|	Источник.Партия,
		|	Источник.АналитикаУчетаПартий,
		|	Источник.АналитикаФинансовогоУчета,
		|	Источник.ВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК ИдентификаторФинЗаписи,
		|	НЕОПРЕДЕЛЕНО КАК НастройкаХозяйственнойОперации,
		|	Источник.Количество КАК КоличествоКРаспределению,
		|	Источник.Стоимость КАК СтоимостьКРаспределению,
		|	Источник.СтоимостьБезНДС КАК СтоимостьБезНДСКРаспределению,
		|	Источник.СтоимостьРегл КАК СтоимостьРеглКРаспределению,
		|	Источник.СтоимостьУпр КАК СтоимостьУпрКРаспределению,
		|
		|	0 КАК ДопРасходыСНДСКРаспределению,
		|	0 КАК ДопРасходыБезНДСКРаспределению,
		|	0 КАК ДопРасходыРеглНДСКРаспределению,
		|	0 КАК ДопРасходыУпрНДСКРаспределению,
		|	0 КАК НДСРеглКРаспределению,
		|	0 КАК НДСУпрКРаспределению,
		|	0 КАК ПостояннаяРазницаКРаспределению,
		|	0 КАК ВременнаяРазницаКРаспределению,
		|	
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(
		|		ВЫБОР КОГДА Реестр.ДатаДокументаИБ ЕСТЬ NULL ИЛИ Реестр.ДатаДокументаИБ < &ДатаПереходаНаПартионныйУчетВерсии22
		|			ТОГДА &ДатаПереходаНаПартионныйУчетВерсии22
		|			ИНАЧЕ Реестр.ДатаДокументаИБ
		|		КОНЕЦ, МЕСЯЦ)) КАК ПериодПоступления
		|ПОМЕСТИТЬ ПриемникиПоТоварамПрошлыхПериодов
		|ИЗ
		|	ПриемникиПоТоварам КАК Источник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
		|		ПО Источник.Регистратор = Реквизиты.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
		|		ПО Реестр.Ссылка = ВЫБОР
		|			КОГДА Источник.Партия <> НЕОПРЕДЕЛЕНО ТОГДА Источник.Партия
		|			КОГДА Реквизиты.АналитикаРасходов <> НЕОПРЕДЕЛЕНО ТОГДА Реквизиты.АналитикаРасходов
		|			ИНАЧЕ NULL КОНЕЦ
		|		И НЕ Реестр.ДополнительнаяЗапись
		|ГДЕ
		|	Источник.ЭтоПартияПрошлогоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	Источник.Регистратор,
		|	Реквизиты.Дата,
		|	Источник.АналитикаУчетаНоменклатуры,
		|	Источник.РазделУчета,
		|	Источник.ВидЗапасов,
		|	Источник.Организация,
		|	Источник.Партия,
		|	Источник.АналитикаУчетаПартий,
		|	Источник.АналитикаФинансовогоУчета,
		|	Источник.ВидДеятельностиНДС,
		|	Источник.Количество,
		|	Источник.Стоимость,
		|	Источник.СтоимостьБезНДС,
		|	Источник.СтоимостьРегл,
		|	Источник.СтоимостьУпр
		|";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДД.Организация КАК Организация,
		|	ДД.Партия КАК Партия,
		|	ДД.ВидЗапасов КАК ВидЗапасов,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ДД.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ДД.АналитикаУчетаНоменклатуры.Серия КАК Серия,
		|	МИНИМУМ(ДД.ПериодПоступления) КАК ПериодПоступления
		|ПОМЕСТИТЬ ВТОтборАналитикДляПеремещенийМеждуОрганизациями
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодов КАК ДД
		|СГРУППИРОВАТЬ ПО
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.ВидЗапасов,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ДД.АналитикаУчетаНоменклатуры.Характеристика,
		|	ДД.АналитикаУчетаНоменклатуры.Серия
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.КорОрганизация КАК Организация,
		|	ДД.КорПартия КАК Партия,
		|	ДД.КорВидЗапасов КАК ВидЗапасов,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ДД.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ДД.АналитикаУчетаНоменклатуры.Серия КАК Серия
		|ПОМЕСТИТЬ ВТПеремещенияМеждуОрганизациями
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК Перемещения
		|		ПО ДД.Регистратор = Перемещения.Ссылка
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикДляПеремещенийМеждуОрганизациями КАК Отбор
		|		ПО ДД.Партия = Отбор.Партия
		|		И ДД.АналитикаУчетаНоменклатуры.Номенклатура = Отбор.Номенклатура
		|		И ДД.АналитикаУчетаНоменклатуры.Характеристика = Отбор.Характеристика
		|		И (ДД.АналитикаУчетаНоменклатуры.Серия = Отбор.Серия
		|			ИЛИ ДД.АналитикаУчетаНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
		//++ НЕ УТ
		|		И ДД.АналитикаУчетаНоменклатуры.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
		//-- НЕ УТ
		|ГДЕ
		|	&РаспределениеДопРасходовПоВыбывшимТоварам
		|	И ДД.Период МЕЖДУ Отбор.ПериодПоступления И &КонецПредыдущегоПериода
		|	И ДД.Организация В(&МассивОрганизаций)
		|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ДД.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	И ДД.КорПартия <> НЕОПРЕДЕЛЕНО
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.Организация КАК Организация,
		|	ДД.Партия КАК Партия,
		|	ДД.ВидЗапасов КАК ВидЗапасов,
		|	ДД.Номенклатура КАК Номенклатура,
		|	ДД.Характеристика КАК Характеристика,
		|	ДД.Серия КАК Серия
		|ИЗ
		|	ВТОтборАналитикДляПеремещенийМеждуОрганизациями КАК ДД
		|
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.Партия
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК Партия,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.АналитикаУчетаПартий
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КОНЕЦ) КАК АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	Движения.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	Движения.РазделУчета КАК КорРазделУчета,
		|	Движения.ВидЗапасов КАК КорВидЗапасов,
		|	Движения.Организация КАК КорОрганизация,
		|
		|	МИНИМУМ(ДД.ПериодПоступления) КАК ПериодПоступления
		|
		|ПОМЕСТИТЬ ВозможныеАналитикиПриемниковПоТоварамПрошлыхПериодов
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодов КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		|		ПО Аналитика.Ссылка = ДД.АналитикаУчетаНоменклатуры
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПеремещенияМеждуОрганизациями КАК Перемещения
		|		ПО ДД.Партия = Перемещения.Партия
		|		И Перемещения.Номенклатура = Аналитика.Номенклатура
		|		И Перемещения.Характеристика = Аналитика.Характеристика
		|		И (Перемещения.Серия = Аналитика.Серия
		|			ИЛИ Перемещения.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Движения
		|		ПО Движения.Период МЕЖДУ ДД.ПериодПоступления И &КонецПредыдущегоПериода
		// Условия по разделу учета должны быть одинаковые с функией ШаблонТекстаПервичныеПриемникиПоДокументам().
		|		И НЕ Движения.РазделУчета В (
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение))
		|		И Движения.Партия = ДД.Партия
		|		И Движения.Организация = Перемещения.Организация
		|		И Движения.ВидЗапасов = Перемещения.ВидЗапасов
		// При подборе аналитик номенклатуры склад не учитываем - соединяемся с аналитиками по всем складам.
		|		И Движения.АналитикаУчетаНоменклатуры.Номенклатура = Аналитика.Номенклатура
		|		И Движения.АналитикаУчетаНоменклатуры.Характеристика = Аналитика.Характеристика
		|		И (Движения.АналитикаУчетаНоменклатуры.Серия = Аналитика.Серия
		|			ИЛИ Движения.АналитикаУчетаНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
		|		ПО ИСТИНА
		|ГДЕ
		|	ВЫБОР
		|		КОГДА НЕ Константы.УчитыватьСебестоимостьТоваровПоНазначениям
		|		  ИЛИ ДД.ПериодПоступления < Константы.ДатаВключенияОбособленногоУчетаСебестоимостиПоНазначениям
		|			ТОГДА Движения.АналитикаУчетаНоменклатуры.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.Партия
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ),
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.АналитикаУчетаПартий
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КОНЕЦ),
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	Движения.АналитикаУчетаНоменклатуры,
		|	Движения.РазделУчета,
		|	Движения.ВидЗапасов,
		|	Движения.Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка),
		|	ДД.Организация,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.Партия
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК Партия,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.АналитикаУчетаПартий
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КОНЕЦ) КАК АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	Движения.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	Движения.РазделУчета КАК КорРазделУчета,
		|	Движения.ВидЗапасов КАК КорВидЗапасов,
		|	Движения.Организация КАК КорОрганизация,
		|
		|	МИНИМУМ(ДД.ПериодПоступления) КАК ПериодПоступления
		|
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодов КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		|		ПО Аналитика.Ссылка = ДД.АналитикаУчетаНоменклатуры
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПеремещенияМеждуОрганизациями КАК Перемещения
		|		ПО ДД.Партия = Перемещения.Партия
		|		И Перемещения.Номенклатура = Аналитика.Номенклатура
		|		И Перемещения.Характеристика = Аналитика.Характеристика
		|		И (Перемещения.Серия = Аналитика.Серия
		|			ИЛИ Перемещения.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Движения
		|		ПО Движения.Период МЕЖДУ ДД.ПериодПоступления И &КонецПредыдущегоПериода
		// Условия по разделу учета должны быть одинаковые с функией ШаблонТекстаПервичныеПриемникиПоДокументам().
		|		И НЕ Движения.РазделУчета В (
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение))
		|		И Движения.Партия = ДД.Партия
		|		И Движения.Организация = Перемещения.Организация
		|		И Движения.ВидЗапасов = Перемещения.ВидЗапасов
		// При подборе аналитик номенклатуры склад не учитываем - соединяемся с аналитиками по всем складам.
		|		И Движения.АналитикаУчетаНоменклатуры.Номенклатура = Аналитика.Номенклатура
		|		И Движения.АналитикаУчетаНоменклатуры.Характеристика = Аналитика.Характеристика
		|		И (Движения.АналитикаУчетаНоменклатуры.Серия = Аналитика.Серия
		|			ИЛИ Движения.АналитикаУчетаНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
		|		ПО ИСТИНА
		|ГДЕ
		|	НЕ ДД.ВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
		|	И ВЫБОР
		|		КОГДА НЕ Константы.УчитыватьСебестоимостьТоваровПоНазначениям
		|		  ИЛИ ДД.ПериодПоступления < Константы.ДатаВключенияОбособленногоУчетаСебестоимостиПоНазначениям
		|			ТОГДА Движения.АналитикаУчетаНоменклатуры.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.Организация,
		|	Перемещения.Организация,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.Партия
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ),
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.АналитикаУчетаПартий
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КОНЕЦ),
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	Движения.АналитикаУчетаНоменклатуры,
		|	Движения.РазделУчета,
		|	Движения.ВидЗапасов,
		|	Движения.Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка),
		|	ДД.Организация,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.Партия
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК Партия,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.АналитикаУчетаПартий
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КОНЕЦ) КАК АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	Остатки.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	Остатки.РазделУчета КАК КорРазделУчета,
		|	Остатки.ВидЗапасов КАК КорВидЗапасов,
		|	Остатки.Организация КАК КорОрганизация,
		|
		|	&КонецПредыдущегоПериода КАК ПериодПоступления
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодов КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		|		ПО Аналитика.Ссылка = ДД.АналитикаУчетаНоменклатуры
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПеремещенияМеждуОрганизациями КАК Перемещения
		|		ПО ДД.Партия = Перемещения.Партия
		|		И Перемещения.Номенклатура = Аналитика.Номенклатура
		|		И Перемещения.Характеристика = Аналитика.Характеристика
		|		И (Перемещения.Серия = Аналитика.Серия
		|			ИЛИ Перемещения.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Остатки
		|		ПО Остатки.Организация = Перемещения.Организация
		|		И Остатки.Партия = ДД.Партия
		|		И Остатки.ВидЗапасов = Перемещения.ВидЗапасов
		// Условия по разделу учета должны быть одинаковые с функией ШаблонТекстаПервичныеПриемникиПоДокументам().
		|		И НЕ Остатки.РазделУчета В (
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение))
		// При подборе аналитик номенклатуры склад не учитываем - соединяемся с аналитиками по всем складам.
		|		И Остатки.АналитикаУчетаНоменклатуры.Номенклатура = Аналитика.Номенклатура
		|		И Остатки.АналитикаУчетаНоменклатуры.Характеристика = Аналитика.Характеристика
		|		И (Остатки.АналитикаУчетаНоменклатуры.Серия = Аналитика.Серия
		|			ИЛИ Остатки.АналитикаУчетаНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
		|		ПО ИСТИНА
		|ГДЕ
		|	НЕ ДД.ВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
		|	И ВЫБОР
		|		КОГДА НЕ Константы.УчитыватьСебестоимостьТоваровПоНазначениям
		|		  ИЛИ ДД.ПериодПоступления < Константы.ДатаВключенияОбособленногоУчетаСебестоимостиПоНазначениям
		|			ТОГДА Остатки.АналитикаУчетаНоменклатуры.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.Организация,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.Партия
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ),
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.АналитикаУчетаПартий
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КОНЕЦ),
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	Остатки.АналитикаУчетаНоменклатуры,
		|	Остатки.РазделУчета,
		|	Остатки.ВидЗапасов,
		|	Остатки.Организация
		|;
		|
		|ВЫБРАТЬ
		|	Аналитики.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Аналитики.КорРазделУчета КАК РазделУчета,
		|	Аналитики.КорВидЗапасов КАК ВидЗапасов,
		|	Аналитики.КорОрганизация КАК Организация,
		|	Аналитики.Партия,
		|	Аналитики.АналитикаУчетаПартий,
		|
		|	МИНИМУМ(Аналитики.ПериодПоступления) КАК ПериодПоступления
		|ПОМЕСТИТЬ АналитикиПриемниковПоТоварамПрошлыхПериодов
		|ИЗ
		|	ВозможныеАналитикиПриемниковПоТоварамПрошлыхПериодов КАК Аналитики
		|
		|СГРУППИРОВАТЬ ПО
		|	Аналитики.КорАналитикаУчетаНоменклатуры,
		|	Аналитики.КорРазделУчета,
		|	Аналитики.КорВидЗапасов,
		|	Аналитики.КорОрганизация,
		|	Аналитики.Партия,
		|	Аналитики.АналитикаУчетаПартий
		|;
		|
		|ВЫБРАТЬ
		|	ДД.Регистратор,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.ХозяйственнаяОперация,
		|	МАКСИМУМ(ДД.ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|
		|	ВЫБОР
		|		КОГДА ДД.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|			ТОГДА ДД.Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.СтруктураПредприятия
		|			ТОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.Склады
		|			ТОГДА ВЫРАЗИТЬ(ДД.КорАналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.Склады).Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.Партнеры
		|			ТОГДА ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.Склады).Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.ДоговорыКонтрагентов).Подразделение
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|	КОНЕЦ КАК Подразделение,
		|	ДД.СтатьяРасходовСписания,
		|	ДД.АналитикаРасходов,
		|	ДД.КорНаправлениеДеятельности,
		|	СУММА(ДД.Количество) КАК Количество
		|
		|ПОМЕСТИТЬ ПрошлыеВыбытияТоваров
		|ИЗ
		|	АналитикиПриемниковПоТоварамПрошлыхПериодов КАК Аналитики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК ДД
		|		ПО Аналитики.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|			И Аналитики.РазделУчета = ДД.РазделУчета
		|			И Аналитики.ВидЗапасов = ДД.ВидЗапасов
		|			И Аналитики.Организация = ДД.Организация
		|			И Аналитики.Партия = ДД.Партия
		|			И Аналитики.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|
		|ГДЕ
		|	&РаспределениеДопРасходовПоВыбывшимТоварам
		|	И ДД.Период МЕЖДУ Аналитики.ПериодПоступления И &КонецПредыдущегоПериода
		|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ДД.РазделУчета В (
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты))
		|	И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВПроизводство)
		|	И НЕ ДД.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|	И НЕ ДД.Регистратор ССЫЛКА Документ.КорректировкаНазначенияТоваров
		|	И НЕ ДД.Регистратор ССЫЛКА Документ.ПередачаТоваровХранителю
		//++ НЕ УТ
		|	И НЕ ДД.Регистратор ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
		//++ Устарело_Производство21
		|	И НЕ ДД.Регистратор ССЫЛКА Документ.ПередачаМатериаловВПроизводство
		|	И НЕ ДД.Регистратор ССЫЛКА Документ.ВозвратМатериаловИзПроизводства
		//-- Устарело_Производство21
		//-- НЕ УТ
		|	И ДД.Активность
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ВЫБОР
		|		КОГДА ДД.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|			ТОГДА ДД.Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.СтруктураПредприятия
		|			ТОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.Склады
		|			ТОГДА ВЫРАЗИТЬ(ДД.КорАналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.Склады).Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.Партнеры
		|			ТОГДА ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.Склады).Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.ДоговорыКонтрагентов).Подразделение
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|	КОНЕЦ,
		|	ДД.СтатьяРасходовСписания,
		|	ДД.АналитикаРасходов,
		|	ДД.КорНаправлениеДеятельности
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ДД.Количество) = 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.Организация,
		|	ДД.Партия
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоВыбытие,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	ДД.Подразделение,
		|	ВЫБОР КОГДА Выручка.Регистратор ЕСТЬ NULL И (СтатьиРасходов.Ссылка ЕСТЬ NULL
		|		ИЛИ СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
		|		И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ВыбытияТоваровВПрошлыхПериодах)
		|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПроизводственныеРасходыПрошлыхПериодов)
		|		ИНАЧЕ ДД.СтатьяРасходовСписания
		|	КОНЕЦ КАК СтатьяРасходовСписанияРегл,
		|	ВЫБОР КОГДА Выручка.Регистратор ЕСТЬ NULL И (СтатьиРасходов.Ссылка ЕСТЬ NULL
		|		ИЛИ СтатьиРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
		|		И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ВыбытияТоваровВПрошлыхПериодах)
		|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПроизводственныеРасходыПрошлыхПериодов)
		|		ИНАЧЕ ДД.СтатьяРасходовСписания
		|	КОНЕЦ КАК СтатьяРасходовСписанияУпр,
		|	ДД.АналитикаРасходов КАК АналитикаРасходов,
		|	ДД.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
		|	ДД.ХозяйственнаяОперация,
		|	МАКСИМУМ(ДД.ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|
		|	ЕСТЬNULL(Выручка.АналитикаУчетаПоПартнерам, НЕОПРЕДЕЛЕНО) КАК АналитикаУчетаПоПартнерам,
		|	ЕСТЬNULL(Выручка.ЗаказКлиента, НЕОПРЕДЕЛЕНО) КАК ЗаказКлиента,
		|	ЕСТЬNULL(Выручка.Менеджер, НЕОПРЕДЕЛЕНО) КАК Менеджер,
		|	ЕСТЬNULL(Выручка.Склад, НЕОПРЕДЕЛЕНО) КАК Склад,
		|	ЕСТЬNULL(Выручка.Соглашение, НЕОПРЕДЕЛЕНО) КАК Соглашение,
		|	ЕСТЬNULL(Выручка.Договор, НЕОПРЕДЕЛЕНО) КАК Договор,
		|	ЕСТЬNULL(Выручка.ТипЗапасов, НЕОПРЕДЕЛЕНО) КАК ТипЗапасов,
		|	ЕСТЬNULL(Выручка.ИсточникГФУНоменклатуры, НЕОПРЕДЕЛЕНО) КАК ИсточникГФУНоменклатуры,
		|	ЕСТЬNULL(Выручка.ИсточникГФУРасчетов, НЕОПРЕДЕЛЕНО) КАК ИсточникГФУРасчетов,
		|
		|	СУММА(ЕСТЬNULL(Выручка.Количество, ДД.Количество)) КАК Количество
		|
		|ПОМЕСТИТЬ ПрошлыеВыбытияТоваровДетальные
		|ИЗ
		|	ПрошлыеВыбытияТоваров КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Выручка
		|		ПО ДД.Регистратор = Выручка.Регистратор
		|		И ДД.АналитикаУчетаНоменклатуры = Выручка.АналитикаУчетаНоменклатуры
		|		И ДД.РазделУчета = Выручка.РазделУчета
		|		И ДД.ВидЗапасов = Выручка.ВидЗапасов
		|		И ДД.Партия = Выручка.Партия
		|		И ДД.АналитикаУчетаПартий = Выручка.АналитикаУчетаПартий
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК Отбор
		|		ПО Выручка.АналитикаУчетаПоПартнерам = Отбор.КлючАналитики
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|		ПО ДД.СтатьяРасходовСписания = СтатьиРасходов.Ссылка
		|ГДЕ
		|	Выручка.Регистратор ЕСТЬ NULL
		|	ИЛИ НЕ Отбор.КлючАналитики ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.Подразделение,
		|	ВЫБОР КОГДА Выручка.Регистратор ЕСТЬ NULL И (СтатьиРасходов.Ссылка ЕСТЬ NULL
		|		ИЛИ СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
		|		И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ВыбытияТоваровВПрошлыхПериодах)
		|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПроизводственныеРасходыПрошлыхПериодов)
		|		ИНАЧЕ ДД.СтатьяРасходовСписания
		|	КОНЕЦ,
		|	ВЫБОР КОГДА Выручка.Регистратор ЕСТЬ NULL И (СтатьиРасходов.Ссылка ЕСТЬ NULL
		|		ИЛИ СтатьиРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
		|		И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ВыбытияТоваровВПрошлыхПериодах)
		|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПроизводственныеРасходыПрошлыхПериодов)
		|		ИНАЧЕ ДД.СтатьяРасходовСписания
		|	КОНЕЦ,
		|	ДД.АналитикаРасходов,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ЕСТЬNULL(Выручка.АналитикаУчетаПоПартнерам, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.ЗаказКлиента, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.Менеджер, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.Склад, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.Соглашение, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.Договор, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.ТипЗапасов, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.ИсточникГФУНоменклатуры, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.ИсточникГФУРасчетов, НЕОПРЕДЕЛЕНО)
		|ИМЕЮЩИЕ
		|	СУММА(ЕСТЬNULL(Выручка.Количество, ДД.Количество)) > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК ЭтоВыбытие,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,

		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовСписанияРегл,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовСписанияУпр,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО КАК ИдентификаторФинЗаписи,
		|	НЕОПРЕДЕЛЕНО КАК НастройкаХозяйственнойОперации,
		|
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
		|	НЕОПРЕДЕЛЕНО КАК Менеджер,
		|	НЕОПРЕДЕЛЕНО КАК Склад,
		|	НЕОПРЕДЕЛЕНО КАК Соглашение,
		|	НЕОПРЕДЕЛЕНО КАК Договор,
		|	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
		|
		|	ДД.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров.Остатки(
		|		&ГраницаКонецПредыдущегоПериода,
		|		(АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация, Партия, АналитикаУчетаПартий) В
		|			(ВЫБРАТЬ
		|				Т.АналитикаУчетаНоменклатуры, Т.РазделУчета, Т.ВидЗапасов, Т.Организация, Т.Партия, Т.АналитикаУчетаПартий
		|			 ИЗ
		|				АналитикиПриемниковПоТоварамПрошлыхПериодов КАК Т)
		|	) КАК ДД
		|ГДЕ
		|	ДД.КоличествоОстаток > 0
		|;
		|
		|ВЫБРАТЬ
		|	Источник.Регистратор,
		|	Источник.АналитикаУчетаНоменклатуры,
		|	Источник.РазделУчета,
		|	Источник.ВидЗапасов,
		|	Источник.Организация,
		|	Источник.Партия,
		|	Источник.АналитикаУчетаПартий,
		|	Источник.АналитикаФинансовогоУчета,
		|	Источник.ВидДеятельностиНДС,
		|
		|	СУММА(ВыбытиеДетально.Количество) КАК Количество
		|
		|ПОМЕСТИТЬ ВыбытиеСводно
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодов КАК Источник
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВозможныеАналитикиПриемниковПоТоварамПрошлыхПериодов КАК ВозможныеАналитики
		|		ПО Источник.АналитикаУчетаНоменклатуры   = ВозможныеАналитики.АналитикаУчетаНоменклатуры
		|			И Источник.РазделУчета               = ВозможныеАналитики.РазделУчета
		|			И Источник.Организация               = ВозможныеАналитики.Организация
		|			И Источник.Партия                    = ВозможныеАналитики.Партия
		|			И Источник.АналитикаУчетаПартий      = ВозможныеАналитики.АналитикаУчетаПартий
		|			И Источник.АналитикаФинансовогоУчета = ВозможныеАналитики.АналитикаФинансовогоУчета
		|			И Источник.ВидДеятельностиНДС        = ВозможныеАналитики.ВидДеятельностиНДС
		|			И (Источник.ВидЗапасов = ВозможныеАналитики.ВидЗапасов
		|				ИЛИ ВозможныеАналитики.ВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка))
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПрошлыеВыбытияТоваровДетальные КАК ВыбытиеДетально
		|		ПО ВозможныеАналитики.КорАналитикаУчетаНоменклатуры = ВыбытиеДетально.АналитикаУчетаНоменклатуры
		|			И ВозможныеАналитики.КорРазделУчета = ВыбытиеДетально.РазделУчета
		|			И ВозможныеАналитики.КорВидЗапасов = ВыбытиеДетально.ВидЗапасов
		|			И ВозможныеАналитики.КорОрганизация = ВыбытиеДетально.Организация
		|			И ВозможныеАналитики.Партия = ВыбытиеДетально.Партия
		|			И ВозможныеАналитики.АналитикаУчетаПартий = ВыбытиеДетально.АналитикаУчетаПартий
		|
		|СГРУППИРОВАТЬ ПО
		|	Источник.Регистратор,
		|	Источник.АналитикаУчетаНоменклатуры,
		|	Источник.РазделУчета,
		|	Источник.ВидЗапасов,
		|	Источник.Организация,
		|	Источник.Партия,
		|	Источник.АналитикаУчетаПартий,
		|	Источник.АналитикаФинансовогоУчета,
		|	Источник.ВидДеятельностиНДС
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ВыбытиеДетально.Количество) = 0
		|;
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВыбытиеДетально.ЭтоВыбытие, ЛОЖЬ) КАК ЭтоВыбытие,
		|
		|	Источник.Регистратор,
		|	Источник.Период,
		|	Источник.ТипЗаписи,
		// Аналитика распределения отклонения в стоимости, распределения по выбывшим товарам.
		// Для дополнительных расходов не применимо, т.к. источником дополнительных расходов являются расходы.
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК АналитикаУчетаНоменклатуры,
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.РазделУчета
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК РазделУчета,
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.ВидЗапасов
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ВидЗапасов,
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.Организация
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Организация,
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.Партия
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Партия,
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.АналитикаУчетаПартий
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК АналитикаУчетаПартий,
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.АналитикаФинансовогоУчета
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК АналитикаФинансовогоУчета,
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.ВидДеятельностиНДС
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ВидДеятельностиНДС,
		|
		|	ЕСТЬNULL(ВыбытиеДетально.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) КАК КорАналитикаУчетаНоменклатуры,
		|	ЕСТЬNULL(ВыбытиеДетально.РазделУчета, НЕОПРЕДЕЛЕНО) КАК КорРазделУчета,
		|	ЕСТЬNULL(ВыбытиеДетально.ВидЗапасов, НЕОПРЕДЕЛЕНО) КАК КорВидЗапасов,
		|	ЕСТЬNULL(ВыбытиеДетально.Организация, НЕОПРЕДЕЛЕНО) КАК КорОрганизация,
		|	ЕСТЬNULL(ВыбытиеДетально.Партия, НЕОПРЕДЕЛЕНО) КАК КорПартия,
		|	ЕСТЬNULL(ВыбытиеДетально.АналитикаУчетаПартий, НЕОПРЕДЕЛЕНО) КАК КорАналитикаУчетаПартий,
		|	ЕСТЬNULL(ВыбытиеДетально.АналитикаФинансовогоУчета, НЕОПРЕДЕЛЕНО) КАК КорАналитикаФинансовогоУчета,
		|	ЕСТЬNULL(ВыбытиеДетально.ВидДеятельностиНДС, НЕОПРЕДЕЛЕНО) КАК КорВидДеятельностиНДС,
		|
		|	ЕСТЬNULL(ВыбытиеДетально.Подразделение, НЕОПРЕДЕЛЕНО) КАК Подразделение,
		|	ЕСТЬNULL(ВыбытиеДетально.СтатьяРасходовСписанияРегл, НЕОПРЕДЕЛЕНО) КАК СтатьяРасходовСписанияРегл,
		|	ЕСТЬNULL(ВыбытиеДетально.СтатьяРасходовСписанияУпр, НЕОПРЕДЕЛЕНО) КАК СтатьяРасходовСписанияУпр,
		|	ЕСТЬNULL(ВыбытиеДетально.АналитикаРасходов, НЕОПРЕДЕЛЕНО) КАК АналитикаРасходов,
		|	ЕСТЬNULL(ВыбытиеДетально.КорНаправлениеДеятельности, НЕОПРЕДЕЛЕНО) КАК КорНаправлениеДеятельности,
		|	ЕСТЬNULL(ВыбытиеДетально.ХозяйственнаяОперация, НЕОПРЕДЕЛЕНО) КАК ХозяйственнаяОперация,
		|	ЕСТЬNULL(ВыбытиеДетально.ИдентификаторФинЗаписи, НЕОПРЕДЕЛЕНО) КАК ИдентификаторФинЗаписи,
		|	ЕСТЬNULL(ВыбытиеДетально.НастройкаХозяйственнойОперации, НЕОПРЕДЕЛЕНО) КАК НастройкаХозяйственнойОперации,
		|
		|	ЕСТЬNULL(ВыбытиеДетально.АналитикаУчетаПоПартнерам, НЕОПРЕДЕЛЕНО) КАК АналитикаУчетаПоПартнерам,
		|	ЕСТЬNULL(ВыбытиеДетально.ЗаказКлиента, НЕОПРЕДЕЛЕНО) КАК ЗаказКлиента,
		|	ЕСТЬNULL(ВыбытиеДетально.Менеджер, НЕОПРЕДЕЛЕНО) КАК Менеджер,
		|	ЕСТЬNULL(ВыбытиеДетально.Склад, НЕОПРЕДЕЛЕНО) КАК Склад,
		|	ЕСТЬNULL(ВыбытиеДетально.Соглашение, НЕОПРЕДЕЛЕНО) КАК Соглашение,
		|	ЕСТЬNULL(ВыбытиеДетально.Договор, НЕОПРЕДЕЛЕНО) КАК Договор,
		|	ЕСТЬNULL(ВыбытиеДетально.ТипЗапасов, НЕОПРЕДЕЛЕНО) КАК ТипЗапасов,
		|	ЕСТЬNULL(ВыбытиеДетально.ИсточникГФУНоменклатуры, НЕОПРЕДЕЛЕНО) КАК ИсточникГФУНоменклатуры,
		|	ЕСТЬNULL(ВыбытиеДетально.ИсточникГФУРасчетов, НЕОПРЕДЕЛЕНО) КАК ИсточникГФУРасчетов,
		|
		|	Источник.СтоимостьКРаспределению
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КАК СтоимостьСНДС,
		|	Источник.СтоимостьБезНДСКРаспределению
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КАК СтоимостьБезНДС,
		|	Источник.СтоимостьРеглКРаспределению
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КАК СтоимостьРегл,
		|	Источник.СтоимостьУпрКРаспределению
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КАК СтоимостьУпр,
		|	Источник.КоличествоКРаспределению
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КАК Количество,
		|	Источник.ДопРасходыСНДСКРаспределению
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КАК ДопРасходыСНДС,
		|	Источник.ДопРасходыБезНДСКРаспределению
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КАК ДопРасходыБезНДС,
		|	Источник.ДопРасходыРеглНДСКРаспределению
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КАК ДопРасходыРегл,
		|	Источник.ДопРасходыУпрНДСКРаспределению
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КАК ДопРасходыУпр,
		|	Источник.НДСРеглКРаспределению
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КАК НДСРегл,
		|	Источник.НДСУпрКРаспределению
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КАК НДСУпр,
		|	Источник.ПостояннаяРазницаКРаспределению
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КАК ПостояннаяРазница,
		|	Источник.ВременнаяРазницаКРаспределению
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КАК ВременнаяРазница
		|	
		|ПОМЕСТИТЬ ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодов КАК Источник
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбытиеСводно КАК ВыбылоСводно
		|		ПО Источник.Регистратор                  = ВыбылоСводно.Регистратор
		|			И Источник.АналитикаУчетаНоменклатуры   = ВыбылоСводно.АналитикаУчетаНоменклатуры
		|			И Источник.РазделУчета               = ВыбылоСводно.РазделУчета
		|			И Источник.ВидЗапасов                = ВыбылоСводно.ВидЗапасов
		|			И Источник.Организация               = ВыбылоСводно.Организация
		|			И Источник.Партия                    = ВыбылоСводно.Партия
		|			И Источник.АналитикаУчетаПартий      = ВыбылоСводно.АналитикаУчетаПартий
		|			И Источник.АналитикаФинансовогоУчета = ВыбылоСводно.АналитикаФинансовогоУчета
		|			И Источник.ВидДеятельностиНДС        = ВыбылоСводно.ВидДеятельностиНДС
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВозможныеАналитикиПриемниковПоТоварамПрошлыхПериодов КАК ВозможныеАналитики
		|		ПО Источник.АналитикаУчетаНоменклатуры   = ВозможныеАналитики.АналитикаУчетаНоменклатуры
		|			И Источник.РазделУчета               = ВозможныеАналитики.РазделУчета
		|			И Источник.Организация               = ВозможныеАналитики.Организация
		|			И Источник.Партия                    = ВозможныеАналитики.Партия
		|			И Источник.АналитикаУчетаПартий      = ВозможныеАналитики.АналитикаУчетаПартий
		|			И Источник.АналитикаФинансовогоУчета = ВозможныеАналитики.АналитикаФинансовогоУчета
		|			И Источник.ВидДеятельностиНДС        = ВозможныеАналитики.ВидДеятельностиНДС
		|			И (Источник.ВидЗапасов = ВозможныеАналитики.ВидЗапасов
		|				ИЛИ ВозможныеАналитики.ВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка))
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПрошлыеВыбытияТоваровДетальные КАК ВыбытиеДетально
		|		ПО ВозможныеАналитики.КорАналитикаУчетаНоменклатуры = ВыбытиеДетально.АналитикаУчетаНоменклатуры
		|			И ВозможныеАналитики.КорРазделУчета = ВыбытиеДетально.РазделУчета
		|			И ВозможныеАналитики.КорВидЗапасов = ВыбытиеДетально.ВидЗапасов
		|			И ВозможныеАналитики.КорОрганизация = ВыбытиеДетально.Организация
		|			И ВозможныеАналитики.Партия = ВыбытиеДетально.Партия
		|			И ВозможныеАналитики.АналитикаУчетаПартий = ВыбытиеДетально.АналитикаУчетаПартий
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
		|		ПО Источник.Регистратор = Реквизиты.Ссылка";
	
	Возврат ТекстЗапроса;
		
КонецФункции

Функция ТекстДолиДополнительныхРасходов()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	""ТекстДолиДополнительныхРасходов_1"" КАК ЗапросИсточник,
		|	Регистраторы.Ссылка КАК Регистратор,
		// Приемник СебестоимостьТоваров
		|	ПриемникиПоТоварам.РазделУчета КАК КорРазделУчета,
		|	ПриемникиПоТоварам.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	ПриемникиПоТоварам.ВидЗапасов КАК КорВидЗапасов,
		|	ПриемникиПоТоварам.Организация КАК КорОрганизация,
		|	ПриемникиПоТоварам.Партия КАК КорПартия,
		|	ПриемникиПоТоварам.АналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
		|	ПриемникиПоТоварам.АналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
		|	ПриемникиПоТоварам.ВидДеятельностиНДС КАК КорВидДеятельностиНДС,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимость),
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		// Приемник Прочие расходы/Прочие активы
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяАктивовПассивов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаАктивовПассивов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		//Приемник Выручка и себестоимость
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
		|	НЕОПРЕДЕЛЕНО КАК Менеджер,
		|	НЕОПРЕДЕЛЕНО КАК Склад,
		|	НЕОПРЕДЕЛЕНО КАК Соглашение,
		|	НЕОПРЕДЕЛЕНО КАК Договор,
		|	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
		// Показатели приемника
		|	ПриемникиПоТоварам.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|		 ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА (ВЫБОР 
		|				КОГДА ПриемникиПоТоварам.Стоимость <> 0
		|					ТОГДА ПриемникиПоТоварам.Стоимость
		|				ИНАЧЕ ПриемникиПоТоварам.Количество * ЕСТЬNULL(Цены.Стоимость, 0) КОНЕЦ)
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * ПриемникиПоТоварам.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ КАК ДоляСтоимости,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|		 ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА (ВЫБОР 
		|				КОГДА ПриемникиПоТоварам.СтоимостьБезНДС <> 0
		|					ТОГДА ПриемникиПоТоварам.СтоимостьБезНДС
		|				ИНАЧЕ ПриемникиПоТоварам.Количество * ЕСТЬNULL(Цены.СтоимостьБезНДС, 0) КОНЕЦ)
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * ПриемникиПоТоварам.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ КАК ДоляСтоимостиБезНДС,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|		 ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА (ВЫБОР 
		|				КОГДА ПриемникиПоТоварам.СтоимостьРегл <> 0
		|					ТОГДА ПриемникиПоТоварам.СтоимостьРегл
		|				ИНАЧЕ ПриемникиПоТоварам.Количество * ЕСТЬNULL(Цены.СтоимостьРегл, 0) КОНЕЦ)
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * ПриемникиПоТоварам.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ КАК ДоляСтоимостиРегл,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|		 ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА (ВЫБОР 
		|				КОГДА ПриемникиПоТоварам.СтоимостьУпр <> 0
		|					ТОГДА ПриемникиПоТоварам.СтоимостьУпр
		|				ИНАЧЕ ПриемникиПоТоварам.Количество * ЕСТЬNULL(Цены.СтоимостьУпр, 0) КОНЕЦ)
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * ПриемникиПоТоварам.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ КАК ДоляСтоимостиУпр
		|ИЗ
		|	Регистраторы КАК Регистраторы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПриемникиПоТоварам КАК ПриемникиПоТоварам
		|		ПО Регистраторы.Ссылка = ПриемникиПоТоварам.Регистратор
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтоимостьПартийТоваров КАК Цены
		|		ПО Цены.Организация = ПриемникиПоТоварам.Организация
		|			И Цены.Период = НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ)
		|			И Цены.АналитикаУчетаНоменклатуры = ПриемникиПоТоварам.АналитикаУчетаНоменклатуры
		|			И Цены.ВидЗапасов = ПриемникиПоТоварам.ВидЗапасов
		|			И Цены.РазделУчета = ПриемникиПоТоварам.РазделУчета
		|			И Цены.Партия = ПриемникиПоТоварам.Партия
		|			И Цены.АналитикаУчетаПартий = ПриемникиПоТоварам.АналитикаУчетаПартий
		|			И Цены.АналитикаФинансовогоУчета = ПриемникиПоТоварам.АналитикаФинансовогоУчета
		|			И Цены.ВидДеятельностиНДС = ПриемникиПоТоварам.ВидДеятельностиНДС
		|			
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СН
		|		ПО СН.Ссылка = ПриемникиПоТоварам.АналитикаУчетаНоменклатуры.Номенклатура
		|ГДЕ
		|	НЕ ПриемникиПоТоварам.ЭтоПартияПрошлогоПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ТекстДолиДополнительныхРасходов_2"" КАК ЗапросИсточник,
		|	Показатели.Регистратор КАК Регистратор,
		// Приемник СебестоимостьТоваров
		|	Показатели.КорРазделУчета КАК КорРазделУчета,
		|	Показатели.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	Показатели.КорВидЗапасов КАК КорВидЗапасов,
		|	Показатели.КорОрганизация КАК КорОрганизация,
		|	Показатели.КорПартия КАК КорПартия,
		|	Показатели.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
		|	Показатели.КорАналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
		|	Показатели.КорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
		|	(ВЫБОР
		|		КОГДА Показатели.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
		|		 ИЛИ Показатели.ХозяйственнаяОперация = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимость)
		|		ИНАЧЕ Показатели.ХозяйственнаяОперация КОНЕЦ) КАК ХозяйственнаяОперация,
		|	(ВЫБОР
		|		КОГДА Показатели.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
		|		 ИЛИ Показатели.ХозяйственнаяОперация = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам) КОНЕЦ) КАК ТипЗаписи,
		// Приемник Прочие расходы/Прочие активы
		|	Показатели.СтатьяРасходовСписанияРегл КАК СтатьяРасходов,
		|	Показатели.АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяАктивовПассивов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
		|	Показатели.Подразделение,
		|	Показатели.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		//Приемник Выручка и себестоимость
		|	Показатели.АналитикаУчетаПоПартнерам,
		|	Показатели.ЗаказКлиента,
		|	Показатели.Менеджер,
		|	Показатели.Склад,
		|	Показатели.Соглашение,
		|	Показатели.Договор,
		|	Показатели.ТипЗапасов,
		|	Показатели.ИсточникГФУНоменклатуры,
		|	Показатели.ИсточникГФУРасчетов,
		// Показатели приемника
		|	Показатели.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|			ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА Показатели.СтоимостьСНДС
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * Показатели.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|			ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА Показатели.СтоимостьБезНДС
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * Показатели.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|			ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА Показатели.СтоимостьРегл
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * Показатели.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|			ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА Показатели.СтоимостьУпр
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * Показатели.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ
		|ИЗ
		|	ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК Показатели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
		|		ПО Показатели.Регистратор = Регистраторы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СН
		|		ПО СН.Ссылка = Показатели.КорАналитикаУчетаНоменклатуры.Номенклатура
		|ГДЕ
		|	НЕ Показатели.Количество = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ТекстДолиДополнительныхРасходов_3"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		// Приемник Себестоимость товаров
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	ИсточникБазы.Организация КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеНДСНалоговымАгентом) КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		// Приемник Прочие расходы/Прочие активы
		|	ИсточникБазы.СтатьяРасходов                                         КАК СтатьяРасходов,
		|	ИсточникБазы.АналитикаРасходов                                      КАК АналитикаРасходов,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка) КАК СтатьяАктивовПассивов,
		|	НЕОПРЕДЕЛЕНО                                                        КАК АналитикаАктивовПассивов,
		|	ИсточникБазы.Подразделение                                          КАК Подразделение,
		|	ИсточникБазы.НаправлениеДеятельности                                КАК НаправлениеДеятельности,
		//Приемник Выручка и себестоимость
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
		|	НЕОПРЕДЕЛЕНО КАК Менеджер,
		|	НЕОПРЕДЕЛЕНО КАК Склад,
		|	НЕОПРЕДЕЛЕНО КАК Соглашение,
		|	НЕОПРЕДЕЛЕНО КАК Договор,
		|	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
		// Показатели приемника
		|	0 КАК Количество,
		|	ИсточникБазы.Сумма,
		|	ИсточникБазы.СуммаБезНДС,
		|	ИсточникБазы.СуммаРегл,
		|	ИсточникБазы.СуммаУпр
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК ИсточникБазы
		|		ПО ДД.АналитикаРасходов = ИсточникБазы.Регистратор
		|			И ИсточникБазы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			И ИсточникБазы.Период <= &КонецПериода
		|ГДЕ
		|	ДД.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ТекстДолиДополнительныхРасходов_4"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		// Приемник Себестоимость товаров
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	ИсточникБазы.Организация КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеНДСНалоговымАгентом) КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		// Приемник Прочие расходы/Прочие активы
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО                                                 КАК АналитикаРасходов,
		|	ИсточникБазы.Статья                                          КАК СтатьяАктивовПассивов,
		|	ИсточникБазы.Аналитика                                       КАК АналитикаАктивовПассивов,
		|	ИсточникБазы.Подразделение                                   КАК Подразделение,
		|	ИсточникБазы.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
		//Приемник Выручка и себестоимость
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
		|	НЕОПРЕДЕЛЕНО КАК Менеджер,
		|	НЕОПРЕДЕЛЕНО КАК Склад,
		|	НЕОПРЕДЕЛЕНО КАК Соглашение,
		|	НЕОПРЕДЕЛЕНО КАК Договор,
		|	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
		// Показатели приемника
		|	0 КАК Количество,
		|	ИсточникБазы.Сумма,
		|	ИсточникБазы.Сумма,
		|	ИсточникБазы.Сумма,
		|	ИсточникБазы.Сумма
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеАктивыПассивы КАК ИсточникБазы
		|		ПО ДД.АналитикаРасходов = ИсточникБазы.Регистратор
		|			И ИсточникБазы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			И ИсточникБазы.Период <= &КонецПериода
		|			И ИсточникБазы.ВидИсточника = ЗНАЧЕНИЕ(Перечисление.ВидыИсточниковДвижений.ПустаяСсылка)
		|ГДЕ
		|	ДД.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)";
		
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

//++ НЕ УТ

#Область ПроцедурыЭтапа7_РасчетДолейРаспределенияПрочихЗатрат

Функция ТекстЗапросаДляРасчетаДолейРаспределенияПрочихЗатрат()
	Возврат "ВЫБРАТЬ
	|	ДД.Ссылка,
	|	ДД.Ссылка КАК Документ,
	|	ДД.Дата,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.УправленческийУчет,
	|	ДД.РегламентированныйУчет,
	|	ДД.НазначениеНастройкиРаспределения,
	|	ДД.СтатьяКалькуляции,
	|	ДД.РаспределятьПоПартиям,
	|	ДД.РаспределятьНаОВЗ,
	|	ДД.РаспределятьНаСтатьи,
	|	ДД.ОставитьВНЗП,
	|	ВЫБОР 
	|		КОГДА ДД.РаспределятьПоПартиям И ДД.ДоляСтоимостиНаПроизводство = 0 ТОГДА 1
	|		КОГДА ДД.РаспределятьПоПартиям ТОГДА ДД.ДоляСтоимостиНаПроизводство	
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК ДоляСтоимостиНаПроизводство,
	|	ВЫБОР 
	|		КОГДА ДД.РаспределятьНаОВЗ И ДД.ДоляСтоимостиНаОВЗ = 0 ТОГДА 1
	|		КОГДА ДД.РаспределятьНаОВЗ ТОГДА ДД.ДоляСтоимостиНаОВЗ	
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК ДоляСтоимостиНаОВЗ,
	|	ВЫБОР 
	|		КОГДА ДД.РаспределятьНаСтатьи ТОГДА ДД.ДоляСтоимостиНаСтатьи	
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК ДоляСтоимостиНаСтатьи,
	|	ВЫБОР 
	|		КОГДА ДД.ОставитьВНЗП ТОГДА ДД.ДоляСтоимостиНаНЗП
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК ДоляСтоимостиНаНЗП,
	|	ВЫБОР 
	|		КОГДА ДД.РаспределятьПоПартиям И ДД.ДоляСтоимостиНаПроизводство = 0 ТОГДА 1
	|		КОГДА ДД.РаспределятьПоПартиям ТОГДА ДД.ДоляСтоимостиНаПроизводство	
	|		ИНАЧЕ 0 
	|	КОНЕЦ +
	|	ВЫБОР 
	|		КОГДА ДД.РаспределятьНаОВЗ И ДД.ДоляСтоимостиНаОВЗ = 0 ТОГДА 1
	|		КОГДА ДД.РаспределятьНаОВЗ ТОГДА ДД.ДоляСтоимостиНаОВЗ	
	|		ИНАЧЕ 0 
	|	КОНЕЦ +
	|	ВЫБОР 
	|		КОГДА ДД.РаспределятьНаСтатьи ТОГДА ДД.ДоляСтоимостиНаСтатьи	
	|		ИНАЧЕ 0 
	|	КОНЕЦ +
	|	ВЫБОР 
	|		КОГДА ДД.ОставитьВНЗП ТОГДА ДД.ДоляСтоимостиНаНЗП
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК ОбщаяДоляСтоимости
	|ПОМЕСТИТЬ ВтДолиРаспределенияПрочихЗатрат
	|ИЗ Документ.РаспределениеПрочихЗатрат КАК ДД
	|ГДЕ
	|	ДД.Проведен
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Организация В(&МассивОрганизаций)
	|	И НЕ ДД.НазначениеНастройкиРаспределения = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеСтатейРасходовПоПодразделениям)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ";
КонецФункции

Функция ТекстОписаниеДанныхДляРасчетаДолейРаспределенияПрочихЗатрат() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	ДД.Ссылка,
	|	ДД.Ссылка КАК Документ,
	|	ДД.Дата,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.УправленческийУчет,
	|	ДД.РегламентированныйУчет,
	|	ДД.НазначениеНастройкиРаспределения,
	|	ДД.СтатьяКалькуляции,
	|	ДД.РаспределятьПоПартиям,
	|	ДД.РаспределятьНаОВЗ,
	|	ДД.РаспределятьНаСтатьи,
	|	ДД.ОставитьВНЗП,
	|	0 КАК ДоляСтоимостиНаПроизводство,
	|	0 КАК ДоляСтоимостиНаОВЗ,
	|	0 КАК ДоляСтоимостиНаСтатьи,
	|	0 КАК ДоляСтоимостиНаНЗП,
	|	0 КАК ОбщаяДоляСтоимости
	|ПОМЕСТИТЬ Данные
	|ИЗ Документ.РаспределениеПрочихЗатрат КАК ДД
	|";
	
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапа15_РаспределениеДолейПроизводственныхРасходов

Функция ТаблицаДляРаспределенияДолейПроизводственныхРасходов(ПараметрыРасчета)
	
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ТаблицаДляРаспределенияПартий(ПараметрыРасчета,
		ТекстОписаниеДанныхДляРаспределенияДолейПроизводственныхРасходов());
	
КонецФункции

// Выборка данных

Процедура ПолучитьДанныеДляРаспределенияДолейПроизводственныхРасходов(ПараметрыРасчета)
	
	ДляРасшифровки = РасчетСебестоимостиПрикладныеАлгоритмы.РасчетВызванДляРасшифровки(ПараметрыРасчета);
	
	ДопПараметры = ПараметрыРасчета.ДополнительныеПараметрыЗапросаЭтапа;
	ДопПараметры.Вставить("РасчетСебестоимостиВыполнен",  ПараметрыРасчета.Свойство("РасчетСебестоимостиВыполнен"));
	ДопПараметры.Вставить("РасшифровкаРаспределения", 	  ДляРасшифровки);
	ДопПараметры.Вставить("ВключатьДанныеПроизводства21", Истина);
	ДопПараметры.Вставить("УчитыватьБудущиеВыпуски", 	  Истина);
			
	//++ НЕ УТКА
	Если ДляРасшифровки Тогда
			
		ПараметрыПолученияПартий = ЗатратыСервер.ОписаниеПараметровПолученияАктивныхПартий();
		ПараметрыПолученияПартий.НачалоПериода = ПараметрыРасчета.РасчетныйПериод.НачалоПериода;
		ПараметрыПолученияПартий.ОкончаниеПериода = ПараметрыРасчета.РасчетныйПериод.КонецПериода;
		ПараметрыПолученияПартий.Организации = ПараметрыРасчета.МассивОрганизаций;
		
		ЗатратыСервер.ПоместитьАктивныеПартииБезСпецификаций(ПараметрыПолученияПартий, ПараметрыРасчета.МенеджерВременныхТаблиц);
		
	КонецЕсли;
	//-- НЕ УТКА

	ПодготовитьПроизводственныеРасходыКРаспределению(ПараметрыРасчета);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаДляРаспределенияДолейПроизводственныхРасходов(ПараметрыРасчета),
		,
		НЕ ДляРасшифровки);
	
КонецПроцедуры

// Тексты запросов

// ... общий

Функция ТекстЗапросаДляРаспределенияДолейПроизводственныхРасходов(ПараметрыРасчета) Экспорт
	
	ДляРасшифровки = РасчетСебестоимостиПрикладныеАлгоритмы.РасчетВызванДляРасшифровки(ПараметрыРасчета);
	
	ТекстЗапроса = ""
		+ ТекстПоказателиРаспределенияПоПодразделениям()
		+ ТекстПодразделенияПоОтбору(ПараметрыРасчета)
		+ ТекстДанныеПоФактическимМатериальнымЗатратам(ПараметрыРасчета)
		+ ТекстДанныеПоПредварительнымМатериальнымЗатратам(ПараметрыРасчета)
		+ РасчетСебестоимостиПроизводство.ТекстДанныеПоТрудозатратам(ПараметрыРасчета)
		+ ТекстДанныеПоТрудозатратамСвернуто()
		
		+ ?(ДляРасшифровки, РасчетСебестоимостиПроизводство.ТекстПартииПроизводства(),"")
		+ ?(ДляРасшифровки, РасчетСебестоимостиПроизводство.ТекстПустаяТаблицаПартииМатериаловВНЗП(),"")
		+ ?(ДляРасшифровки, РасчетСебестоимостиПроизводство.ТекстДолиСтоимостиПоПродукции(),"")
		
		+ РасчетСебестоимостиПроизводство.ТекстДанныеПоВыпущеннойПродукции()
		+ ТекстДанныеПоВыпущеннойПродукцииСвернуто()
		+ ТекстБазаРаспределенияДолейПоЭтапам(ПараметрыРасчета)
		+ ТекстКоэффициентыБазПоЭтапам()
		+ ТекстБазаПоЭтапамСводно()
		+ ТекстИтогиБазыПоЭтапам()
		+ ТекстБазаРаспределенияДолейПоПодразделениям(ПараметрыРасчета)
		+ ТекстБазаПоПодразделениямСводно()
		+ ТекстИтогиБазыПоПодразделениям()
		// выборка данных
		+ ТекстОписаниеДанныхДляРаспределенияДолейПроизводственныхРасходов()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстРаспределениеМеждуПартиями()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстРаспределениеНаДругиеСтатьи()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстНераспределяемыеДоли()
		+ "";
		
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ПодставитьШаблоныВесаИОбъемаВТекстЗапроса(ТекстЗапроса, "СН");
	
КонецФункции

// ... описания данных

Функция ТекстОписаниеДанныхДляРаспределенияДолейПроизводственныхРасходов() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	""ТекстОписаниеДанныхДляРаспределенияДолейПроизводственныхРасходов""    КАК ЗапросИсточник,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)                   КАК ТипЗаписи,
	|	ЛОЖЬ                                                                    КАК РасчетЗавершен,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)    КАК РазделУчета,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                                  КАК ВидДвижения,
	|	ДД.Период                                                               КАК Период,
	|	ДД.Регистратор                                                          КАК Регистратор,
	|	ДД.Организация                                                          КАК Организация,
	|	ДД.Подразделение                                                        КАК Подразделение,
	|	ДД.НаправлениеДеятельности                                              КАК НаправлениеДеятельности,
	|	ДД.СтатьяРасходов                                                       КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                                    КАК АналитикаРасходов,
	|	ДД.ХозяйственнаяОперация                                                КАК ХозяйственнаяОперация,
	|	ДД.ГруппаПродукции                                                      КАК ГруппаПродукции,
	|	ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка)            КАК ПравилоОтнесенияНаВыпуск,
	|	0                                                                       КАК ДоляСтоимости,
	|	0                                                                       КАК ДоляСтоимостиБезНДС,
	|	0                                                                       КАК ДоляСтоимостиРегл,
	|	0                                                                       КАК ДоляСтоимостиУпр,
	|	ДД.КорСтатьяРасходов                                                    КАК КорСтатьяРасходов,
	|	ДД.КорАналитикаРасходов                                                 КАК КорАналитикаРасходов,
	|	АП.Статья                                                               КАК КорСтатьяАктивовПассивов,
	|	АП.Аналитика                                                            КАК КорАналитикаАктивовПассивов,
	|	ДД.КорПодразделение                                                     КАК КорПодразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)               КАК КорНаправлениеДеятельности,
	|	НЗП.ПартияПроизводства                                                  КАК ПартияПроизводства,
	|	НЗП.ЗаказНаПроизводство                                                 КАК ЗаказНаПроизводство,
	|	НЗП.КодСтрокиПродукция                                                  КАК КодСтрокиПродукция,
	|	ДД.КорСтатьяКалькуляции                                                 КАК СтатьяКалькуляции,
	|	ДД.ИдентификаторСтроки                                                  КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК НЗП
	|		ПО ИСТИНА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеАктивыПассивы КАК АП
	|		ПО ИСТИНА
	|";
	
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;
	
КонецФункции

// ... формирования временные таблиц

Процедура ПодготовитьПроизводственныеРасходыКРаспределению(ПараметрыРасчета)
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	Запрос.УстановитьПараметр("ВариантыРаспределенияРасходов", 
		ОбщегоНазначенияУТКлиентСервер.Массив(Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты));
	Запрос.УстановитьПараметр("Регистратор",
		?(ПараметрыРасчета.Свойство("Регистратор"), ПараметрыРасчета.Регистратор, Неопределено));
	
	Запрос.Текст = Документы.РаспределениеПрочихЗатрат.ТекстЗапросаПоступилоПрочихРасходов(?(ПараметрыРасчета.Свойство("Регистратор"),Неопределено,"ФактическийРасчет"), Ложь);
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, 
		,,,НСтр("ru = 'Получение постатейных затрат для распределения.';
				|en = 'Receiving itemized costs for allocation.'"));

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.СтатьяРасходов,
		|	Т.АналитикаРасходов,
		|	Т.НаправлениеДеятельности
		|ПОМЕСТИТЬ СтатьиРасходовПоОВЗ
		|ИЗ РасходыКРаспределению КАК Т
		|ГДЕ Т.ЭтоРасходОВЗ;
		|
		|ВЫБРАТЬ
		|	ДД.Ссылка КАК Регистратор,
		|	ДД.Дата КАК Дата,
		|	ДД.НазначениеНастройкиРаспределения,
		|	ДД.Организация,
		|	ДД.НаправлениеРаспределения,
		|	ДД.БазаРаспределенияПоПодразделениям,
		|	ДД.БазаРаспределенияПоПартиям,
		|	ДД.Подразделение,
		|	ВЫБОР 
		|		КОГДА Т.ЭтоРасходОВЗ ТОГДА Т.НаправлениеДеятельности 
		|		ИНАЧЕ ДД.НаправлениеДеятельности 
		|	КОНЕЦ КАК НаправлениеДеятельности,
		|	Т.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	Т.ЭтоРасходОВЗ,
		|	ВЫБОР 
		|		КОГДА Т.СтатьяРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат) 
		|			И НЕ ВтОВЗ.ВариантРаспределенияРасходовУпр ЕСТЬ NULL 
		|		ТОГДА ВтОВЗ.ВариантРаспределенияРасходовУпр 
		|		ИНАЧЕ Т.СтатьяРасходов.ВариантРаспределенияРасходовУпр
		|	КОНЕЦ КАК ВариантРаспределенияРасходовУпр,
		|	ВЫБОР 
		|		КОГДА Т.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат) 
		|			И НЕ ВтОВЗ.ВариантРаспределенияРасходовРегл ЕСТЬ NULL 
		|		ТОГДА ВтОВЗ.ВариантРаспределенияРасходовРегл 
		|		ИНАЧЕ Т.СтатьяРасходов.ВариантРаспределенияРасходовРегл
		|	КОНЕЦ КАК ВариантРаспределенияРасходовРегл,
		|	ВЫБОР 
		|		КОГДА Т.СтатьяРасходов.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат) 
		|			И НЕ ВтОВЗ.ВариантРаспределенияРасходовНУ ЕСТЬ NULL 
		|		ТОГДА ВтОВЗ.ВариантРаспределенияРасходовНУ 
		|		ИНАЧЕ Т.СтатьяРасходов.ВариантРаспределенияРасходовНУ
		|	КОНЕЦ КАК ВариантРаспределенияРасходовНУ,
		|	ДД.Показатель,
		|	ДД.НаЛюбыеНаправлениеДеятельности,
		|	ДД.СтатьяКалькуляции,
		|	ДД.РаспределятьПоПартиям,
		|	ДД.РаспределятьПоПодразделениям,
		|	ДД.РаспределятьНаСтатьи,
		|	ДД.ОставитьВНЗП,
		|	ДД.НаВыпускТекущегоМесяца,
		|	ДД.ПартииУказаныВручную,
		|	ДД.ПодразделенияУказаныВручную,
		|	ДД.РегламентированныйУчет,
		|	ДД.УправленческийУчет,
		|	ДД.ДоляСтоимостиНаПроизводство,
		|	ДД.ДоляСтоимостиНаНЗП,
		|	ДД.ДоляСтоимостиНаСтатьи,
		|	ДД.ВсегоДолейСтоимости,
		|	ДД.РаспределятьНаОВЗ,
		|	ДД.ДоляСтоимостиНаОВЗ,
		|	ВЫБОР 
		|		КОГДА ДД.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхИТрудозатрат)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымИТрудозатратам)
		|		КОГДА ДД.БазаРаспределенияПоПартиям В (ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаРасходовНаОплатуТруда),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоРаботУказанныхВидов),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.НормативыОплатыТруда))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоТрудозатратам)
		|		КОГДА ДД.БазаРаспределенияПоПартиям В (ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхЗатрат),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.НормативРасходаМатериала),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоУказанныхМатериалов),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемУказанныхМатериалов),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесУказанныхМатериалов))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымЗатратам)
		|		КОГДА ДД.БазаРаспределенияПоПартиям В (ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоПродукции),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесПродукции),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемПродукции),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ПлановаяСтоимостьПродукции))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукции)
		|		КОГДА ДД.БазаРаспределенияПоПартиям В (ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоПродукцииСУчетомБудущихВыпусков),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемПродукцииСУчетомБудущихВыпусков),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесПродукцииСУчетомБудущихВыпусков),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ПлановаяСтоимостьПродукцииСУчетомБудущихВыпусков))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукцииСУчетомБудущихВыпусков)
		|	КОНЕЦ КАК ПравилоОтнесенияНаВыпуск
		|ПОМЕСТИТЬ Регистраторы
		|ИЗ
		|	Документ.РаспределениеПрочихЗатрат КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОВЗ КАК ВтОВЗ
		|		ПО ДД.АналитикаРасходов = ВтОВЗ.ОВЗ
		|			И ДД.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасходыКРаспределению КАК Т
		|		ПО (Т.Организация = ДД.Организация)
		|			И (Т.Подразделение = ДД.Подразделение)
		|			И (Т.ЭтоРасходОВЗ ИЛИ Т.СтатьяРасходов = ДД.СтатьяРасходов)
		|			И (Т.АналитикаРасходов = ДД.АналитикаРасходов)
		|			И (Т.ЭтоРасходОВЗ ИЛИ Т.НаправлениеДеятельности = ДД.НаправлениеДеятельности)
		|ГДЕ
		|	ДД.НазначениеНастройкиРаспределения = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеСтатейРасходовПоЭтапамПроизводства)
		|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ДД.Организация В(&МассивОрганизаций)
		|	И ДД.Проведен
		|	И (ДД.Ссылка = &Регистратор
		|			ИЛИ &Регистратор = НЕОПРЕДЕЛЕНО)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.Ссылка КАК Регистратор,
		|	ДД.Дата,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.Показатель,
		|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	ДД.БазаРаспределенияПоПодразделениям КАК БазаРаспределенияПоПодразделениям,
		|	ДД.БазаРаспределенияПоПартиям КАК БазаРаспределенияПоПартиям,
		|	ДД.ДоляСтоимостиНаПроизводство КАК ДоляСтоимости,
		|	ДД.ПодразделенияУказаныВручную,
		|	Регистраторы.ВариантРаспределенияРасходовУпр,
		|	Регистраторы.ВариантРаспределенияРасходовРегл,
		|	Регистраторы.ВариантРаспределенияРасходовНУ
		|ПОМЕСТИТЬ РаспределитьПоПодразделениям
		|ИЗ
		|	Документ.РаспределениеПрочихЗатрат КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
		|		ПО (Регистраторы.Регистратор = ДД.Ссылка)
		|ГДЕ
		|	ДД.РаспределятьПоПодразделениям
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДД.Регистратор,
		|	ДД.Дата,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.БазаРаспределенияПоПартиям КАК БазаРаспределенияПоПартиям,
		|	ДД.ВариантРаспределенияРасходовУпр,
		|	ДД.ВариантРаспределенияРасходовРегл,
		|	ДД.ВариантРаспределенияРасходовНУ
		|ПОМЕСТИТЬ РаспределитьПоЭтапам
		|ИЗ
		|	Регистраторы КАК ДД
		|ГДЕ
		|	ДД.РаспределятьПоПартиям
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.Регистратор,
		|	ДД.Дата,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.ВариантРаспределенияРасходовУпр,
		|	ДД.ВариантРаспределенияРасходовРегл,
		|	ДД.ВариантРаспределенияРасходовНУ,
		// Кор. часть
		|	Списание.ИдентификаторСтроки 		КАК ИдентификаторСтроки,
		|	Списание.НаправлениеДеятельности 	КАК КорНаправлениеДеятельности,
		|	Списание.Подразделение 				КАК КорПодразделение,
		|	Списание.СтатьяРасходов 			КАК КорСтатьяРасходов,
		|	Списание.АналитикаРасходов 			КАК КорАналитикаРасходов,
		|	Списание.АналитикаАктивовПассивов 	КАК КорАналитикаАктивовПассивов,
		// Расчет доли стоимости.
		// Формула расчета предполагает приведение к единому знаменателю доли списания на расходы
		// и базы распределения по партиям.
		// В тех случаях, когда распределения по партиям нет, то доли стоимости
		// уже имеют общий знаменатель, и приводить его не требуется.
		|	Списание.ДоляСтоимости / ВЫБОР 
		|		КОГДА НЕ ДД.РаспределятьПоПартиям ТОГДА
		|			1
		|		ИНАЧЕ
		|			ДД.ДоляСтоимостиНаПроизводство
		|	КОНЕЦ КАК ДоляСтоимости
		|ПОМЕСТИТЬ РаспределитьНаДругиеСтатьи
		|ИЗ
		|	Регистраторы КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат.Списание КАК Списание
		|		ПО ДД.Регистратор = Списание.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.Регистратор,
		|	ДД.Дата,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.ВариантРаспределенияРасходовУпр,
		|	ДД.ВариантРаспределенияРасходовРегл,
		|	ДД.ВариантРаспределенияРасходовНУ,
		|	ДД.ДоляСтоимостиНаНЗП / ВЫБОР 
		|		КОГДА НЕ ДД.РаспределятьПоПартиям ТОГДА
		|			1
		|		ИНАЧЕ
		|			ДД.ДоляСтоимостиНаПроизводство
		|	КОНЕЦ КАК ДоляСтоимости
		|ПОМЕСТИТЬ ОставитьВНЗП
		|ИЗ
		|	Регистраторы КАК ДД
		|ГДЕ
		|	ДД.ОставитьВНЗП
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,
		,,,НСтр("ru = 'Инициализация служебных таблиц для распределения затрат.';
				|en = 'Initializing internal tables for cost allocation.'"));
	
КонецПроцедуры

Функция ШаблонТекстаОтбораПоПодразделениям()
	
	Возврат
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Группа.НомерГруппы,
		|	ИсточникБазы.Ссылка КАК Подразделение
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	ГруппыОбъектовПоНаправлениюРаспределения КАК Группа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК ИсточникБазы
		|		ПО &УсловиеСоединения
		|ГДЕ
		|	Группа.НомерГруппы = &НомерГруппы";

КонецФункции

Функция ТекстПодразделенияПоОтбору(ПараметрыРасчета)

	ИмяВременнойТаблицыГруппыОбъектов = "ГруппыОбъектовПоНаправлениюРаспределения";
	ТекстПолученияОбъектов = 
		"ВЫБРАТЬ
		|	Реквизиты.Ссылка КАК Ссылка,
		|	Реквизиты.Подразделение КАК Подразделение,
		|	Реквизиты.Подразделение.Родитель КАК ПодразделениеРодитель,
		|	Реквизиты.АналитикаРасходов КАК АналитикаРасходов,
		|	Реквизиты.НаправлениеРаспределения КАК ТипБазыРаспределения,
		|	Реквизиты.НастройкиНаправленияРаспределения КАК НастройкиСхемы
		|ИЗ
		|	Документ.РаспределениеПрочихЗатрат КАК Реквизиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
		|		ПО Реквизиты.Ссылка = Регистраторы.Регистратор
		|ГДЕ
		|	Реквизиты.НастройкиНаправленияРаспределенияИзменены";

	ОписаниеГрупп = ПолучитьОписаниеГруппОбъектовПоНастройкамОтбора(ТекстПолученияОбъектов, ПараметрыРасчета, ИмяВременнойТаблицыГруппыОбъектов);
	
	ТекстЗапросаОписаниеДанных = 
		"ВЫБРАТЬ
		|	-1 КАК НомерГруппы,
		|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение
		|ПОМЕСТИТЬ ОписаниеДанных
		|ГДЕ
		|	ЛОЖЬ";
	
	ГотовыеТекстыЗапросов = Новый Массив;
	ГотовыеТекстыЗапросов.Добавить(ТекстПомещенияГруппыОбъектовВоВременнуюТаблицу(ИмяВременнойТаблицыГруппыОбъектов));
	ГотовыеТекстыЗапросов.Добавить(ТекстЗапросаОписаниеДанных);
	ДополнитьТекстамиПоОписаниюГрупп(ГотовыеТекстыЗапросов, ОписаниеГрупп, ИмяВременнойТаблицыГруппыОбъектов);
	
	ТекстыФормированияИтоговойТаблицы = Новый Массив;
	ТекстПодразделенияПоГруппам = 
		"ВЫБРАТЬ
		|	Т.НомерГруппы,
		|	Т.Подразделение
		|ПОМЕСТИТЬ ПодразделенияПоГруппам
		|ИЗ
		|	ОписаниеДанных КАК Т";
	ТекстыФормированияИтоговойТаблицы.Добавить(ТекстПодразделенияПоГруппам);
	
	ТекстПодразделенияПоГруппам = СтрЗаменить(ТекстПодразделенияПоГруппам, "ПОМЕСТИТЬ ПодразделенияПоГруппам", "");
	Для Каждого ОписаниеГруппы Из ОписаниеГрупп Цикл
		ТекстыФормированияИтоговойТаблицы.Добавить(
			СтрЗаменить(ТекстПодразделенияПоГруппам, 
				"ОписаниеДанных",
				СтрШаблон("ТаблицаДанных%1",
					Формат(ОписаниеГруппы.НомерГруппы, "ЧН=0; ЧГ=0"))));
	КонецЦикла;
			
	ГотовыеТекстыЗапросов.Добавить(ОбъединитьТексты(ТекстыФормированияИтоговойТаблицы));
	
	ГотовыеТекстыЗапросов.Добавить("УНИЧТОЖИТЬ ОписаниеДанных");
	Для Каждого ОписаниеГруппы Из ОписаниеГрупп Цикл
		ГотовыеТекстыЗапросов.Добавить(
			СтрШаблон("УНИЧТОЖИТЬ ТаблицаДанных%1",
				Формат(ОписаниеГруппы.НомерГруппы, "ЧН=0; ЧГ=0")));
	КонецЦикла;
	
	// Подразделения указанные вручную, по показателю.
	ТекстПодразделенияВручную =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаспределитьПоПодразделениям.Регистратор,
		|	ЕСТЬNULL(Т.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение
		|ПОМЕСТИТЬ ПодразделенияУказанныеВручную
		|ИЗ
		|	РаспределитьПоПодразделениям КАК РаспределитьПоПодразделениям
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат.ПоБазе КАК Т
		|		ПО Т.Ссылка = РаспределитьПоПодразделениям.Регистратор
		|ГДЕ
		|	РаспределитьПоПодразделениям.ПодразделенияУказаныВручную
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаспределитьПоПодразделениям.Регистратор,
		|	ЕСТЬNULL(ЗначенияПоказателей.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение
		|ИЗ
		|	РаспределитьПоПодразделениям КАК РаспределитьПоПодразделениям
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПоказателей КАК ЗначенияПоказателей
		|		ПО ЗначенияПоказателей.Показатель = РаспределитьПоПодразделениям.Показатель
		|ГДЕ
		|	РаспределитьПоПодразделениям.БазаРаспределенияПоПодразделениям В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно))";

	ГотовыеТекстыЗапросов.Добавить(ТекстПодразделенияВручную);
	
	Возврат ОбъединитьТексты(ГотовыеТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете())
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
	
КонецФункции

// Таблицы: ДанныеПоФактическимМатериальнымЗатратам
Функция ТекстДанныеПоФактическимМатериальнымЗатратам(ПараметрыРасчета = Неопределено)
	
	РасчетСебестоимостиВыполнен = РасчетСебестоимостиПрикладныеАлгоритмы.РасчетСебестоимостиВыполненДляРасшифровки(ПараметрыРасчета);
	РасшифровкаРаспределения = РасчетСебестоимостиПрикладныеАлгоритмы.РасчетВызванДляРасшифровки(ПараметрыРасчета);
	Если Не РасчетСебестоимостиВыполнен
		И РасшифровкаРаспределения Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстыЗапросов = Новый Массив;
	
	// Материалы производства версии 2.2: этапы, производство без заказов, отчеты.
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДД.Организация                                           КАК Организация,
		|	Аналитика.МестоХранения                                  КАК Подразделение,
		|	Аналитика.СтатьяКалькуляции                              КАК СтатьяКалькуляции,
		|	Аналитика.Номенклатура                                   КАК Материал,
		|	ВЫБОР
		|		КОГДА ДД.КорАналитикаФинансовогоУчета = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
		|		ИНАЧЕ ДД.КорАналитикаФинансовогоУчета
		|	КОНЕЦ                                                    КАК ГруппаПродукции,
		|	ТИПЗНАЧЕНИЯ(ДД.Партия) В (
		//++ Локализация
		//++ Устарело_Производство21
		|		ТИП(Документ.ВыпускПродукции),
		//-- Устарело_Производство21
		//-- Локализация
		//++ НЕ УТКА
		|		ТИП(Документ.ЭтапПроизводства2_2),
		//-- НЕ УТКА
		|		ТИП(Документ.ПроизводствоБезЗаказа))           КАК ЭтоПолуфабрикатСобственный,
		|	ТИПЗНАЧЕНИЯ(ДД.Партия) В (
		|		ТИП(Документ.ОтчетПереработчика))              КАК ЭтоПолуфабрикатПереработчика,
		|	ДД.КорПартия                                             КАК ПартияПроизводства,
		|	НЕОПРЕДЕЛЕНО                                             КАК ЗаказНаПроизводство,
		|	0                                                        КАК КодСтрокиПродукция,
		|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
		|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
		|
		|	СУММА((ВЫБОР
		|		КОГДА ДД.Стоимость + ДД.ДопРасходы <> 0 ИЛИ &РасчетСебестоимостиВыполнен
		|			ТОГДА ДД.Стоимость + ДД.ДопРасходы
		|		ИНАЧЕ ДД.Количество *
		|			(ЕСТЬNULL(Цены.Стоимость, 0) + ЕСТЬNULL(Цены.СтоимостьДопРасходы, 0))
		|		КОНЕЦ))                                              КАК Стоимость,
		|	СУММА((ВЫБОР
		|		КОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС <> 0 ИЛИ &РасчетСебестоимостиВыполнен
		|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС
		|		ИНАЧЕ ДД.Количество *
		|			(ЕСТЬNULL(Цены.СтоимостьБезНДС, 0) + ЕСТЬNULL(Цены.СтоимостьДопРасходыБезНДС, 0))
		|		КОНЕЦ))                                              КАК СтоимостьБезНДС,
		|	СУММА((ВЫБОР
		|		КОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл <> 0 ИЛИ &РасчетСебестоимостиВыполнен
		|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл
		|		ИНАЧЕ ДД.Количество *
		|			(ЕСТЬNULL(Цены.СтоимостьРегл, 0) + ЕСТЬNULL(Цены.ДопРасходыРегл, 0))
		|		КОНЕЦ))                                              КАК СтоимостьРегл,
		//++ Локализация
		|	СУММА((ВЫБОР
		|		КОГДА ДД.ПостояннаяРазница <> 0 ИЛИ &РасчетСебестоимостиВыполнен
		|			ТОГДА ДД.ПостояннаяРазница
		|		ИНАЧЕ ДД.Количество * ЕСТЬNULL(Цены.ПостояннаяРазница, 0)
		|		КОНЕЦ))                                              КАК ПостояннаяРазница,
		|	СУММА((ВЫБОР
		|		КОГДА ДД.ВременнаяРазница <> 0 ИЛИ &РасчетСебестоимостиВыполнен
		|			ТОГДА ДД.ВременнаяРазница
		|		ИНАЧЕ ДД.Количество * ЕСТЬNULL(Цены.ВременнаяРазница, 0)
		|		КОНЕЦ))                                              КАК ВременнаяРазница,
		//-- Локализация
		|	СУММА((ВЫБОР
		|		КОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр <> 0 ИЛИ &РасчетСебестоимостиВыполнен
		|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр
		|		ИНАЧЕ ДД.Количество *
		|			(ЕСТЬNULL(Цены.СтоимостьУпр, 0) + ЕСТЬNULL(Цены.ДопРасходыУпр, 0))
		|		КОНЕЦ))                                              КАК СтоимостьУпр,
		|	СУММА(ДД.Количество)                                     КАК Количество,
		|	СУММА(&Объем * ДД.Количество)                            КАК Объем,
		|	СУММА(&Вес * ДД.Количество)                              КАК Вес
		|ПОМЕСТИТЬ ДанныеПоМатериальнымЗатратам
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		|		ПО (Аналитика.Ссылка = ДД.КорАналитикаУчетаНоменклатуры)
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СН
		|		ПО СН.Ссылка = Аналитика.Номенклатура
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
		|		ПО СпрПартииПроизводства.Ссылка = ДД.КорПартия
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтоимостьПартийТоваров КАК Цены
		|		ПО Цены.Организация = ДД.Организация
		|			И Цены.Партия = ДД.КорПартия
		|			И Цены.АналитикаУчетаПартий = ДД.КорАналитикаУчетаПартий
		|			И Цены.АналитикаФинансовогоУчета = ДД.КорАналитикаФинансовогоУчета
		|			И Цены.ВидДеятельностиНДС = ДД.КорВидДеятельностиНДС
		|			И Цены.АналитикаУчетаНоменклатуры = ДД.КорАналитикаУчетаНоменклатуры
		|			И Цены.ВидЗапасов = ДД.КорВидЗапасов
		|			И Цены.РазделУчета = ДД.КорРазделУчета
		|
		|	ГДЕ
		|		(&РасчетСебестоимостиВыполнен ИЛИ НЕ &РасшифровкаРаспределения)
		|		И ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|		И ДД.Организация В(&МассивОрганизаций)
		|		И НЕ ДД.СлужебноеВидДвиженияПриход
		|		И (ДД.Количество > 0 
		|			ИЛИ (ДД.Стоимость + ДД.ДопРасходы) > 0
		|			ИЛИ (ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС) > 0
		|			ИЛИ (ДД.СтоимостьРегл + ДД.ДопРасходыРегл) > 0
		|			ИЛИ (ДД.СтоимостьУпр + ДД.ДопРасходыУпр) > 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Организация,
		|	Аналитика.МестоХранения,
		|	Аналитика.СтатьяКалькуляции,
		|	Аналитика.Номенклатура,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.КорПартия,
		|	ТИПЗНАЧЕНИЯ(ДД.Партия) В (
		//++ Локализация
		//++ Устарело_Производство21
		|		ТИП(Документ.ВыпускПродукции),
		//-- Устарело_Производство21
		//-- Локализация
		//++ НЕ УТКА
		|		ТИП(Документ.ЭтапПроизводства2_2),
		//-- НЕ УТКА
		|		ТИП(Документ.ПроизводствоБезЗаказа)),
		|	ТИПЗНАЧЕНИЯ(ДД.Партия) В (
		|		ТИП(Документ.ОтчетПереработчика)),
		|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
		|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))";
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	РасчетСебестоимостиЛокализация.ДополнитьЗапросФактическимиМатериальнымЗатратам(ТекстыЗапросов);
	
	ТекстЗапроса = ОбъединитьТексты(ТекстыЗапросов)
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
	
	Если РасчетСебестоимостиВыполнен Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"ВТКэшРасчетныеОборотыСебестоимостьТоваров",
			"РегистрНакопления.СебестоимостьТоваров");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"НЕ ДД.СлужебноеВидДвиженияПриход",
			"ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И ДД.Активность");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"ДД.СлужебноеВидДвиженияПриход",
			"ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ДД.Активность");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Таблицы: ДанныеПоФактическимМатериальнымЗатратам
Функция ТекстДанныеПоПредварительнымМатериальнымЗатратам(ПараметрыРасчета)
	
	РасчетСебестоимостиВыполнен = РасчетСебестоимостиПрикладныеАлгоритмы.РасчетСебестоимостиВыполненДляРасшифровки(ПараметрыРасчета);
	РасшифровкаРаспределения = РасчетСебестоимостиПрикладныеАлгоритмы.РасчетВызванДляРасшифровки(ПараметрыРасчета);

	Если Не РасшифровкаРаспределения
		Или РасчетСебестоимостиВыполнен Тогда
		Возврат "";
	КонецЕсли;

	ТекстыЗапросов = Новый Массив;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДД.Организация                        КАК Организация,
		|	Аналитика.СтатьяКалькуляции           КАК СтатьяКалькуляции,
		|	Аналитика.Номенклатура                КАК Номенклатура,
		|	Аналитика.Характеристика              КАК Характеристика,
		|	Аналитика.МестоХранения               КАК Склад,
		|	Аналитика.Назначение                  КАК Назначение,
		|	ДД.РазделУчета                        КАК РазделУчета,
		|	СРЕДНЕЕ(ДД.Стоимость)                 КАК Стоимость,
		|	СРЕДНЕЕ(ДД.СтоимостьДопРасходы)       КАК СтоимостьДопРасходы,
		|	СРЕДНЕЕ(ДД.СтоимостьБезНДС)           КАК СтоимостьБезНДС,
		|	СРЕДНЕЕ(ДД.СтоимостьДопРасходыБезНДС) КАК СтоимостьДопРасходыБезНДС,
		|	СРЕДНЕЕ(ДД.СтоимостьРегл)             КАК СтоимостьРегл,
		//++ Локализация
		|	СРЕДНЕЕ(ДД.ПостояннаяРазница)         КАК ПостояннаяРазница,
		|	СРЕДНЕЕ(ДД.ВременнаяРазница)          КАК ВременнаяРазница,
		//-- Локализация
		|	СРЕДНЕЕ(ДД.ДопРасходыРегл)            КАК ДопРасходыРегл,
		|	СРЕДНЕЕ(ДД.СтоимостьУпр)              КАК СтоимостьУпр,
		|	СРЕДНЕЕ(ДД.ДопРасходыУпр)             КАК ДопРасходыУпр
		|ПОМЕСТИТЬ ВТСредняяСтоимость
		|ИЗ
		|	РегистрСведений.СтоимостьТоваров.СрезПоследних(&КонецПериода, ) КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
		|ГДЕ
		|	(&РасшифровкаРаспределения И НЕ &РасчетСебестоимостиВыполнен)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	Аналитика.СтатьяКалькуляции,
		|	Аналитика.Номенклатура,
		|	Аналитика.Характеристика,
		|	Аналитика.МестоХранения,
		|	Аналитика.Назначение
		|
		|;
		|
		// производство версии 2.2, распределение материалов, производство без заказов
		|ВЫБРАТЬ
		|	ДД.Организация                                 КАК Организация,
		|	Аналитика.МестоХранения                        КАК Подразделение,
		|	Аналитика.СтатьяКалькуляции                    КАК СтатьяКалькуляции,
		|	Аналитика.Номенклатура                         КАК Материал,
		|	ВЫБОР
		|		КОГДА ДД.КорАналитикаФинансовогоУчета = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
		|		ИНАЧЕ ДД.КорАналитикаФинансовогоУчета
		|	КОНЕЦ                                          КАК ГруппаПродукции,
		|	ТИПЗНАЧЕНИЯ(ДД.Партия) В (
		//++ Локализация
		//++ Устарело_Производство21
		|		ТИП(Документ.ВыпускПродукции),
		//-- Устарело_Производство21
		//-- Локализация
		//++ НЕ УТКА
		|		ТИП(Документ.ЭтапПроизводства2_2),
		//-- НЕ УТКА
		|		ТИП(Документ.ПроизводствоБезЗаказа)) КАК ЭтоПолуфабрикатСобственный,
		|	ТИПЗНАЧЕНИЯ(ДД.Партия) В (
		|		ТИП(Документ.ОтчетПереработчика))    КАК ЭтоПолуфабрикатПереработчика,
		|	ДД.КорПартия                                      КАК ПартияПроизводства,
		|	НЕОПРЕДЕЛЕНО                                   КАК ЗаказНаПроизводство,
		|	0                                              КАК КодСтрокиПродукция,
		|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
		|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
		|
		|	СУММА(ДД.Количество *
		|		(ЕСТЬNULL(Цены.Стоимость, 0) + ЕСТЬNULL(Цены.СтоимостьДопРасходы, 0))) КАК Стоимость,
		|	СУММА(ДД.Количество *
		|		(ЕСТЬNULL(Цены.СтоимостьБезНДС, 0) + ЕСТЬNULL(Цены.СтоимостьДопРасходыБезНДС, 0))) КАК СтоимостьБезНДС,
		|	СУММА(ДД.Количество *
		|		(ЕСТЬNULL(Цены.СтоимостьРегл, 0) + ЕСТЬNULL(Цены.ДопРасходыРегл, 0))) КАК СтоимостьРегл,
		//++ Локализация
		|	СУММА(ДД.Количество *
		|		ЕСТЬNULL(Цены.ПостояннаяРазница, 0)) КАК ПостояннаяРазница,
		|	СУММА(ДД.Количество *
		|		ЕСТЬNULL(Цены.ВременнаяРазница, 0)) КАК ВременнаяРазница,
		//-- Локализация
		|	СУММА(ДД.Количество *
		|		(ЕСТЬNULL(Цены.СтоимостьУпр, 0) + ЕСТЬNULL(Цены.ДопРасходыУпр, 0))) КАК СтоимостьУпр,
		|	СУММА(ДД.Количество)                КАК Количество,
		|	СУММА(&Объем * ДД.Количество)       КАК Объем,
		|	СУММА(&Вес * ДД.Количество)         КАК Вес
		|ПОМЕСТИТЬ ДанныеПоМатериальнымЗатратам
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		|		ПО (Аналитика.Ссылка = ДД.КорАналитикаУчетаНоменклатуры)
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СН
		|		ПО СН.Ссылка = Аналитика.Номенклатура
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
		|		ПО СпрПартииПроизводства.Ссылка = ДД.КорПартия
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСредняяСтоимость КАК Цены
		|		ПО Цены.Организация = ДД.Организация
		|			И Цены.РазделУчета = ДД.КорРазделУчета
		|			И Цены.Номенклатура = Аналитика.Номенклатура
		|			И Цены.Характеристика = Аналитика.Характеристика
		|			И Цены.Склад = Аналитика.МестоХранения
		|			И Цены.Назначение = Аналитика.Назначение
		|
		|ГДЕ
		|	(&РасшифровкаРаспределения И НЕ &РасчетСебестоимостиВыполнен)
		|	И ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ДД.Организация В(&МассивОрганизаций)
		|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И НЕ ДД.РасчетПартий
		|	И НЕ ДД.РасчетСебестоимости
		|	И ДД.Активность
		|	И ДД.Количество > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Организация,
		|	Аналитика.СтатьяКалькуляции,
		|	Аналитика.МестоХранения,
		|	Аналитика.Номенклатура,
		|	ТИПЗНАЧЕНИЯ(ДД.Партия) В (
		//++ Локализация
		//++ Устарело_Производство21
		|		ТИП(Документ.ВыпускПродукции),
		//-- Устарело_Производство21
		//-- Локализация
		//++ НЕ УТКА
		|		ТИП(Документ.ЭтапПроизводства2_2),
		//-- НЕ УТКА
		|		ТИП(Документ.ПроизводствоБезЗаказа)),
		|	ТИПЗНАЧЕНИЯ(ДД.Партия) В (
		|		ТИП(Документ.ОтчетПереработчика)),
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.КорПартия,
		|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
		|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))";
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	РасчетСебестоимостиЛокализация.ДополнитьЗапросПредварительнымиМатериальнымЗатратам(ТекстыЗапросов);
	
	Возврат ОбъединитьТексты(ТекстыЗапросов)
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
		
КонецФункции

// вт ЗначенияПоказателей
Функция ТекстПоказателиРаспределенияПоПодразделениям() 
	Возврат "
	|ВЫБРАТЬ
	|	ДД.Показатель
	|ПОМЕСТИТЬ ПостоянныеПоказатели
	|ИЗ
	|	РаспределитьПоПодразделениям КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаРаспределенияРасходов КАК Правила
	|		ПО ДД.Показатель = Правила.Ссылка
	|		И Правила.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДД.Показатель
	|;
	|
	|ВЫБРАТЬ
	|	Т.Показатель,
	|	Т.Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении) КАК БазаРаспределения,
	|	Т.ЗначениеПоказателя
	|ПОМЕСТИТЬ ЗначенияПоказателей
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходов.СрезПоследних(
	|			&НачалоПериода,
	|			Показатель В
	|				(ВЫБРАТЬ
	|					ДД.Показатель
	|				ИЗ
	|					ПостоянныеПоказатели КАК ДД)) КАК Т
	|ГДЕ
	|	Т.ЗначениеПоказателя > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДД.Показатель,
	|	Т.Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно) КАК БазаРаспределения,
	|	Т.ЗначениеПоказателя
	|ИЗ
	|	РаспределитьПоПодразделениям КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаРаспределенияРасходов КАК Правила
	|		ПО Правила.Ссылка = ДД.Показатель	
	|		И Правила.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходов КАК Т
	|		ПО ДД.Показатель = Т.Показатель
	|		И Т.Период = &НачалоПериода
	|ГДЕ
	|	Т.ЗначениеПоказателя > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Показатель
	|////////////////////////////////////////////////////////////////////////////////
	|;
	|";
	
КонецФункции

Функция ШаблонТекстаБазыРаспределенияПоПартиям(ПоказательБазыРаспределения)
	
	ПараметрыБазы = ПараметрыБазыРаспределения(ПоказательБазыРаспределения);
	
	Шаблон = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.Организация
		|ПОМЕСТИТЬ ДоступныеОрганизации
		|ИЗ
		|	Регистраторы КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовРаспределенияПоПартиям КАК Группа
		|		ПО ДД.Регистратор = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|;
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсточникБазы.Подразделение КАК Подразделение,
		|	ИсточникБазы.НаправлениеДеятельности КАК НаправлениеДеятельности
		|ПОМЕСТИТЬ ИсходныеПодразделенияИНаправленияДеятельности
		|ИЗ
		|	ДоступныеОрганизации КАК ДоступныеОрганизации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмяТаблицыБазыРаспределения КАК ИсточникБазы
		|		ПО ИсточникБазы.Организация = ДоступныеОрганизации.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДД.Регистратор КАК Регистратор,
		|	ИсходныеАналитики.Подразделение КАК Подразделение,
		|	ИсходныеАналитики.НаправлениеДеятельности КАК НаправлениеДеятельности
		|ПОМЕСТИТЬ ДоступныеПодразделенияИНаправленияДеятельности
		|ИЗ
		|	Регистраторы КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГруппыОбъектовПоНаправлениюРаспределения КАК ГруппаНР
		|		ПО ДД.Регистратор = ГруппаНР.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПодразделенияПоГруппам КАК ПодразделенияГруппы
		|		ПО (ГруппаНР.НомерГруппы = ПодразделенияГруппы.НомерГруппы)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПодразделенияУказанныеВручную КАК ПодразделенияУказанныеВручную
		|		ПО ДД.Регистратор = ПодразделенияУказанныеВручную.Регистратор
		|			И (ПодразделенияГруппы.Подразделение ЕСТЬ NULL
		|				ИЛИ ПодразделенияГруппы.Подразделение = ПодразделенияУказанныеВручную.Подразделение)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсходныеПодразделенияИНаправленияДеятельности КАК ИсходныеАналитики
		|		ПО (ПодразделенияУказанныеВручную.Регистратор ЕСТЬ NULL
		|					И ПодразделенияГруппы.Подразделение ЕСТЬ NULL
		|				ИЛИ ЕСТЬNULL(ПодразделенияУказанныеВручную.Подразделение, ПодразделенияГруппы.Подразделение) = ИсходныеАналитики.Подразделение)
		|			И (ДД.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|				ИЛИ ДД.НаЛюбыеНаправлениеДеятельности
		|				ИЛИ ДД.НаправлениеДеятельности = ИсходныеАналитики.НаправлениеДеятельности)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДД.Регистратор							КАК Регистратор,
		|	ДД.Дата									КАК Дата,
		|	ДД.СтатьяКалькуляции					КАК СтатьяКалькуляции,
		|	ИсточникБазы.Подразделение				КАК Подразделение,
		|	ИсточникБазы.ПартияПроизводства			КАК ПартияПроизводства,
		|	ИсточникБазы.ЗаказНаПроизводство		КАК ЗаказНаПроизводство,
		|	ИсточникБазы.КодСтрокиПродукция			КАК КодСтрокиПродукция,
		|	ИсточникБазы.НаправлениеДеятельности	КАК НаправлениеДеятельности,
		|	ИсточникБазы.ГруппаПродукции			КАК ГруппаПродукции,
		|	ДД.ПравилоОтнесенияНаВыпуск				КАК ПравилоОтнесенияНаВыпуск,
		|	ВЫБОР
		|		КОГДА &РасшифровкаРаспределения
		|			ТОГДА &ВидПоказателя
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ									КАК ВидПоказателя,
		|	ВЫБОР
		|		КОГДА &РасшифровкаРаспределения
		|			ТОГДА ИсточникБазы.Показатель
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ									КАК Показатель,
		|	СУММА(&ЗначениеСНДС)					КАК Стоимость,
		|	СУММА(&ЗначениеБезНДС)					КАК СтоимостьБезНДС,
		|	СУММА(&ЗначениеРегл)					КАК СтоимостьРегл,
		|	СУММА(&ЗначениеУпр)						КАК СтоимостьУпр
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	ГруппыОбъектовРаспределенияПоПартиям КАК Группа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК ДД
		|		ПО ДД.Регистратор = Группа.Объект
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДоступныеПодразделенияИНаправленияДеятельности КАК Отбор
		|		ПО ДД.Регистратор = Отбор.Регистратор
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмяТаблицыБазыРаспределения КАК ИсточникБазы
		|		ПО ИсточникБазы.Организация = ДД.Организация
		|			И ИсточникБазы.Подразделение = Отбор.Подразделение
		|			И ИсточникБазы.НаправлениеДеятельности = Отбор.НаправлениеДеятельности
		|			И (&УсловиеСоединения)
		|ГДЕ
		|	Группа.НомерГруппы = &НомерГруппы
		|	И (&УсловиеЗапроса)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.Дата,
		|	ДД.СтатьяКалькуляции,
		|	ДД.ПравилоОтнесенияНаВыпуск,
		|	ИсточникБазы.Подразделение,
		|	ИсточникБазы.ПартияПроизводства,
		|	ИсточникБазы.ЗаказНаПроизводство,
		|	ИсточникБазы.КодСтрокиПродукция,
		|	ИсточникБазы.НаправлениеДеятельности,
		|	ВЫБОР
		|		КОГДА &РасшифровкаРаспределения
		|			ТОГДА &ВидПоказателя
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &РасшифровкаРаспределения
		|			ТОГДА ИсточникБазы.Показатель
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ИсточникБазы.ГруппаПродукции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ИсходныеПодразделенияИНаправленияДеятельности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДоступныеПодразделенияИНаправленияДеятельности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДоступныеОрганизации";

	Шаблон = СтрЗаменить(Шаблон, "&ВидПоказателя", """" + ПараметрыБазы.ВидПоказателя + """");
	Шаблон = СтрЗаменить(Шаблон, "ИсточникБазы.Показатель", СтрШаблон("ИсточникБазы.%1", ПараметрыБазы.ВидПоказателя));
	Шаблон = СтрЗаменить(Шаблон, "ИмяТаблицыБазыРаспределения", ПараметрыБазы.ИмяТаблицыБазыРаспределения);
	Шаблон = СтрЗаменить(Шаблон, "&ЗначениеСНДС", ПараметрыБазы.ЗначениеСНДС);
	Шаблон = СтрЗаменить(Шаблон,
		"&ЗначениеБезНДС",
		?(ПараметрыБазы.Свойство("ЗначениеБезНДС"), ПараметрыБазы.ЗначениеБезНДС, ПараметрыБазы.ЗначениеСНДС));
	Шаблон = СтрЗаменить(Шаблон,
		"&ЗначениеРегл",
		?(ПараметрыБазы.Свойство("ЗначениеРегл"), ПараметрыБазы.ЗначениеРегл, ПараметрыБазы.ЗначениеСНДС));
	Шаблон = СтрЗаменить(Шаблон,
		"&ЗначениеУпр",
		?(ПараметрыБазы.Свойство("ЗначениеУпр"), ПараметрыБазы.ЗначениеУпр, ПараметрыБазы.ЗначениеСНДС));
	Шаблон = СтрЗаменить(Шаблон, 
		"&УсловиеЗапроса", 
		?(ПараметрыБазы.Свойство("УсловиеЗапроса"), ПараметрыБазы.УсловиеЗапроса, "ИСТИНА"));
	
	Возврат Шаблон;
	
КонецФункции

// Вт БазаПоЭтапамДетально, БазаПоЭтапам,
// Использует РаспределитьПоЭтапам, ДанныеПоФактическимМатериальнымЗатратам, ДанныеПоТрудозатратам, ДанныеПоПродукции, ОтборыБаз.
Функция ТекстБазаРаспределенияДолейПоЭтапам(ПараметрыРасчета)
	
	ИмяВременнойТаблицыГруппыОбъектов = "ГруппыОбъектовРаспределенияПоПартиям";
	ТекстПолученияОбъектов = 
		"ВЫБРАТЬ
		|	РеквизитыРаспределения.Ссылка,
		|	ВЫБОР
		|		КОГДА РеквизитыРаспределения.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхИТрудозатрат)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхЗатрат)
		|		ИНАЧЕ
		|			РеквизитыРаспределения.БазаРаспределенияПоПартиям
		|	КОНЕЦ КАК ТипБазыРаспределения,
		|	РеквизитыРаспределения.НастройкиБазыРаспределенияПоПартиям КАК НастройкиСхемы
		|ИЗ
		|	Документ.РаспределениеПрочихЗатрат КАК РеквизитыРаспределения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспределитьПоЭтапам КАК РаспределениеПоЭтапам
		|		ПО РеквизитыРаспределения.Ссылка = РаспределениеПоЭтапам.Регистратор
		|ГДЕ
		|	НЕ РеквизитыРаспределения.ПартииУказаныВручную
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеквизитыРаспределения.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаРасходовНаОплатуТруда) КАК ТипБазыРаспределения,
		|	РеквизитыРаспределения.НастройкиБазыРаспределенияПоПартиям КАК НастройкиСхемы
		|ИЗ
		|	Документ.РаспределениеПрочихЗатрат КАК РеквизитыРаспределения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспределитьПоЭтапам КАК РаспределениеПоЭтапам
		|		ПО РеквизитыРаспределения.Ссылка = РаспределениеПоЭтапам.Регистратор
		|ГДЕ
		|	РеквизитыРаспределения.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхИТрудозатрат)";

	ОписаниеГрупп = ПолучитьОписаниеГруппОбъектовПоНастройкамОтбора(ТекстПолученияОбъектов, ПараметрыРасчета, ИмяВременнойТаблицыГруппыОбъектов);
	
	ТекстЗапросаОписаниеДанных = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка)			КАК Регистратор,
		|	ДатаВремя(1, 1, 1)													КАК Дата,
		|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)					КАК СтатьяКалькуляции,
		|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)				КАК Подразделение,
		|	ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)				КАК ПартияПроизводства,
		|	НЕОПРЕДЕЛЕНО														КАК ЗаказНаПроизводство,
		|	0																	КАК КодСтрокиПродукция,
		|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)			КАК НаправлениеДеятельности,
		|	ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка) КАК ГруппаПродукции,
		|	ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка)		КАК ПравилоОтнесенияНаВыпуск,
		|	НЕОПРЕДЕЛЕНО														КАК ВидПоказателя,
		|	НЕОПРЕДЕЛЕНО														КАК Показатель,
		|	0																	КАК Стоимость,
		|	0																	КАК СтоимостьБезНДС,
		|	0																	КАК СтоимостьРегл,
		|	0																	КАК СтоимостьУпр
		|ПОМЕСТИТЬ ОписаниеДанных
		|ГДЕ
		|	ЛОЖЬ";
	
	ГотовыеТекстыЗапросов = Новый Массив;
	ГотовыеТекстыЗапросов.Добавить(ТекстПомещенияГруппыОбъектовВоВременнуюТаблицу(ИмяВременнойТаблицыГруппыОбъектов));
	ГотовыеТекстыЗапросов.Добавить(ТекстЗапросаОписаниеДанных);
	ДополнитьТекстамиПоОписаниюГрупп(ГотовыеТекстыЗапросов, ОписаниеГрупп, ИмяВременнойТаблицыГруппыОбъектов);
	
	ТекстыФормированияИтоговойТаблицы = Новый Массив;
	ТекстБазаПоЭтапамДетально = 
		"ВЫБРАТЬ
		|	Т.Регистратор,
		|	Т.Дата,
		|	Т.СтатьяКалькуляции,
		|	Т.Подразделение,
		|	Т.ПартияПроизводства,
		|	Т.ЗаказНаПроизводство,
		|	Т.КодСтрокиПродукция,
		|	Т.НаправлениеДеятельности,
		|	Т.ГруппаПродукции,
		|	Т.ПравилоОтнесенияНаВыпуск,
		|	Т.ВидПоказателя,
		|	Т.Показатель,
		|	Т.Стоимость,
		|	Т.СтоимостьБезНДС,
		|	Т.СтоимостьРегл,
		|	Т.СтоимостьУпр
		|ПОМЕСТИТЬ БазаПоЭтапамДетально
		|ИЗ
		|	ОписаниеДанных КАК Т";
	ТекстыФормированияИтоговойТаблицы.Добавить(ТекстБазаПоЭтапамДетально);
	
	ТекстБазаПоЭтапамДетально = СтрЗаменить(ТекстБазаПоЭтапамДетально, "ПОМЕСТИТЬ БазаПоЭтапамДетально", "");
	Для Каждого ОписаниеГруппы Из ОписаниеГрупп Цикл
		ТекстыФормированияИтоговойТаблицы.Добавить(
			СтрЗаменить(ТекстБазаПоЭтапамДетально, 
				"ОписаниеДанных", СтрШаблон("ТаблицаДанных%1",
				Формат(ОписаниеГруппы.НомерГруппы, "ЧН=0; ЧГ=0"))));
	КонецЦикла;
			
	// Тексты запросов распределяемых вручную.
	ТекстРаспределяемыеВручную = 
		"ВЫБРАТЬ
		|	ДД.Регистратор,
		|	ДД.Дата,
		|	Данные.СтатьяКалькуляции,
		|	Данные.Подразделение,
		|	Данные.ПартияПроизводства,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	Аналитики.НаправлениеДеятельности,
		|	Аналитики.АналитикаФинансовогоУчета,
		|	ВЫБОР КОГДА ДД.НаВыпускТекущегоМесяца ТОГДА
		|		ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукции)
		|	ИНАЧЕ
		|		ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукцииСУчетомБудущихВыпусков)
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	Данные.ДоляСтоимости,
		|	Данные.ДоляСтоимости,
		|	Данные.ДоляСтоимости,
		|	Данные.ДоляСтоимости
		|ИЗ
		|	Документ.РаспределениеПрочихЗатрат.ПартииПроизводства КАК Данные
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК ДД
		|		ПО ДД.Регистратор = Данные.Ссылка
		|		И ДД.ПартииУказаныВручную
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПартииПроизводстваСводно КАК Аналитики
		|		ПО Данные.ПартияПроизводства = Аналитики.ПартияПроизводства";
	ТекстыФормированияИтоговойТаблицы.Добавить(ТекстРаспределяемыеВручную);
	
	РасчетСебестоимостиЛокализация.ДополнитьЗапросБазамиРаспределенияДолейПоЭтапам(ТекстыФормированияИтоговойТаблицы);
	
	ГотовыеТекстыЗапросов.Добавить(ОбъединитьТексты(ТекстыФормированияИтоговойТаблицы));
	ГотовыеТекстыЗапросов.Добавить("УНИЧТОЖИТЬ ОписаниеДанных");
	Для Каждого ОписаниеГруппы Из ОписаниеГрупп Цикл
		ГотовыеТекстыЗапросов.Добавить(
			СтрШаблон("УНИЧТОЖИТЬ ТаблицаДанных%1",
				Формат(ОписаниеГруппы.НомерГруппы, "ЧН=0; ЧГ=0")));
	КонецЦикла;
	
	Возврат ОбъединитьТексты(ГотовыеТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете())
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
	
КонецФункции

Функция ТекстКоэффициентыБазПоЭтапам()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДД.Регистратор,
		// Для корректного расчета цены итоговая сумма базы распределения не должна превышать 1 000
		// расчет выполнен следующим образом: при распределении 100 рублей цена должна содержать все знаки после запятой.
		|	ВЫБОР
		|		КОГДА СУММА(ДД.Стоимость) > 1000000000
		|	 		ТОГДА 1000000
		|		КОГДА СУММА(ДД.Стоимость) > 100000000
		|	 		ТОГДА 100000
		|		КОГДА СУММА(ДД.Стоимость) > 10000000
		|	 		ТОГДА 10000
		|		КОГДА СУММА(ДД.Стоимость) > 1000000
		|	 		ТОГДА 1000
		|		КОГДА СУММА(ДД.Стоимость) > 100000
		|	 		ТОГДА 100
		|		КОГДА СУММА(ДД.Стоимость) > 10000
		|	 		ТОГДА 10
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Коэффициент,
		|	ВЫБОР
		|		КОГДА СУММА(ДД.СтоимостьБезНДС) > 1000000000
		|	 		ТОГДА 1000000
		|		КОГДА СУММА(ДД.СтоимостьБезНДС) > 100000000
		|	 		ТОГДА 100000
		|		КОГДА СУММА(ДД.СтоимостьБезНДС) > 10000000
		|	 		ТОГДА 10000
		|		КОГДА СУММА(ДД.СтоимостьБезНДС) > 1000000
		|	 		ТОГДА 1000
		|		КОГДА СУММА(ДД.СтоимостьБезНДС) > 100000
		|	 		ТОГДА 100
		|		КОГДА СУММА(ДД.СтоимостьБезНДС) > 10000
		|	 		ТОГДА 10
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентБезНДС,
		|	ВЫБОР
		|		КОГДА СУММА(ДД.СтоимостьРегл) > 1000000000
		|	 		ТОГДА 1000000
		|		КОГДА СУММА(ДД.СтоимостьРегл) > 100000000
		|	 		ТОГДА 100000
		|		КОГДА СУММА(ДД.СтоимостьРегл) > 10000000
		|	 		ТОГДА 10000
		|		КОГДА СУММА(ДД.СтоимостьРегл) > 1000000
		|	 		ТОГДА 1000
		|		КОГДА СУММА(ДД.СтоимостьРегл) > 100000
		|	 		ТОГДА 100
		|		КОГДА СУММА(ДД.СтоимостьРегл) > 10000
		|	 		ТОГДА 10
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентРегл,
		|	ВЫБОР
		|		КОГДА СУММА(ДД.СтоимостьУпр) > 1000000000
		|	 		ТОГДА 1000000
		|		КОГДА СУММА(ДД.СтоимостьУпр) > 100000000
		|	 		ТОГДА 100000
		|		КОГДА СУММА(ДД.СтоимостьУпр) > 10000000
		|	 		ТОГДА 10000
		|		КОГДА СУММА(ДД.СтоимостьУпр) > 1000000
		|	 		ТОГДА 1000
		|		КОГДА СУММА(ДД.СтоимостьУпр) > 100000
		|	 		ТОГДА 100
		|		КОГДА СУММА(ДД.СтоимостьУпр) > 10000
		|	 		ТОГДА 10
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентУпр
		|ПОМЕСТИТЬ КоэффициентыПриведенияБазыРаспределения
		|ИЗ
		|	БазаПоЭтапамДетально КАК ДД
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор";

	Возврат ТекстЗапроса
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
		
КонецФункции

Функция ТекстБазаПоЭтапамСводно()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДД.Регистратор,
		|	ДД.Дата,
		|	ДД.СтатьяКалькуляции,
		|	ДД.Подразделение,
		|	ДД.ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция,
		|	ДД.НаправлениеДеятельности,
		|	ДД.ГруппаПродукции,
		|	ДД.ПравилоОтнесенияНаВыпуск,
		|	ВЫРАЗИТЬ(СУММА(ДД.Стоимость) / МАКСИМУМ(КоэффициентыПриведения.Коэффициент) КАК ЧИСЛО (23,10)) КАК Стоимость,
		|	ВЫРАЗИТЬ(СУММА(ДД.СтоимостьБезНДС) / МАКСИМУМ(КоэффициентыПриведения.КоэффициентБезНДС) КАК ЧИСЛО (23,10)) КАК СтоимостьБезНДС,
		|	ВЫРАЗИТЬ(СУММА(ДД.СтоимостьРегл) / МАКСИМУМ(КоэффициентыПриведения.КоэффициентРегл) КАК ЧИСЛО (23,10)) КАК СтоимостьРегл,
		|	ВЫРАЗИТЬ(СУММА(ДД.СтоимостьУпр) / МАКСИМУМ(КоэффициентыПриведения.КоэффициентУпр) КАК ЧИСЛО (23,10)) КАК СтоимостьУпр
		|ПОМЕСТИТЬ БазаПоЭтапам
		|ИЗ
		|	БазаПоЭтапамДетально КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыПриведенияБазыРаспределения КАК КоэффициентыПриведения
		|		ПО ДД.Регистратор = КоэффициентыПриведения.Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.Дата,
		|	ДД.СтатьяКалькуляции,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция,
		|	ДД.ГруппаПродукции,
		|	ДД.ПравилоОтнесенияНаВыпуск
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.Подразделение";
	
	Возврат ТекстЗапроса
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();

КонецФункции

// Вт ИтогиБазыПоЭтапамПодразделений, ИтогиБазыПоЭтапамВсехПодразделений,
// использует БазаПоЭтапам.
Функция ТекстИтогиБазыПоЭтапам()
	Возврат "
	|ВЫБРАТЬ
	|	ДД.Регистратор,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	СУММА(ДД.Стоимость) КАК Стоимость,
	|	СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(ДД.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(ДД.СтоимостьУпр) КАК СтоимостьУпр
	|ПОМЕСТИТЬ ИтогиБазыПоЭтапамПодразделений
	|ИЗ
	|	БазаПоЭтапам КАК ДД
	|СГРУППИРОВАТЬ ПО
	|	ДД.Регистратор,
	|	ДД.Подразделение
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДД.Стоимость) > 0
	|	ИЛИ СУММА(ДД.СтоимостьБезНДС) > 0
	|	ИЛИ СУММА(ДД.СтоимостьРегл) > 0
	|	ИЛИ СУММА(ДД.СтоимостьУпр) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДД.Регистратор,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	СУММА(ДД.Стоимость) КАК Стоимость,
	|	СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(ДД.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(ДД.СтоимостьУпр) КАК СтоимостьУпр
	|ИЗ
	|	БазаПоЭтапам КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы
	|	ПО ДД.Регистратор = Регистраторы.Регистратор И НЕ Регистраторы.ПартииУказаныВручную
	|ГДЕ 
	|	ДД.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ДД.Регистратор,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДД.Стоимость) > 0
	|	ИЛИ СУММА(ДД.СтоимостьБезНДС) > 0
	|	ИЛИ СУММА(ДД.СтоимостьРегл) > 0
	|	ИЛИ СУММА(ДД.СтоимостьУпр) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Подразделение,
	|	НаправлениеДеятельности
	|;
	|
	|ВЫБРАТЬ
	|	ДД.Регистратор,
	|	СУММА(ДД.Стоимость) КАК Стоимость,
	|	СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(ДД.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(ДД.СтоимостьУпр) КАК СтоимостьУпр
	|ПОМЕСТИТЬ ИтогиБазыПоЭтапамВсехПодразделений
	|ИЗ
	|	БазаПоЭтапам КАК ДД
	|СГРУППИРОВАТЬ ПО
	|	ДД.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|";
КонецФункции

Функция ШаблонТекстаБазыРаспределенияПоПодразделениям(ПоказательБазыРаспределения)
	
	ПараметрыБазы = ПараметрыБазыРаспределения(ПоказательБазыРаспределения);
	
	Шаблон = 
		"ВЫБРАТЬ
		|	ДД.Регистратор							КАК Регистратор,
		|	ДД.СтатьяКалькуляции					КАК СтатьяКалькуляции,
		|	ИсточникБазы.Подразделение					КАК КорПодразделение,
		|	ИсточникБазы.ПартияПроизводства				КАК ПартияПроизводства,
		|	ИсточникБазы.ЗаказНаПроизводство			КАК ЗаказНаПроизводство,
		|	ИсточникБазы.КодСтрокиПродукция				КАК КодСтрокиПродукция,
		|	ИсточникБазы.ГруппаПродукции				КАК ГруппаПродукции,
		|	ВЫБОР
		|		КОГДА &РасшифровкаРаспределения
		|			ТОГДА ИсточникБазы.Показатель
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ									КАК Показатель,
		|	СУММА(&ЗначениеСНДС)					КАК Стоимость,
		|	СУММА(&ЗначениеБезНДС)					КАК СтоимостьБезНДС,
		|	СУММА(&ЗначениеРегл)					КАК СтоимостьРегл,
		|	СУММА(&ЗначениеУпр)						КАК СтоимостьУпр
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовРаспределенияПоПодразделениям КАК Группа
		|		ПО ДД.Регистратор = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГруппыОбъектовПоНаправлениюРаспределения КАК ГруппаНР
		|		ПО ДД.Регистратор = ГруппаНР.Объект
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПодразделенияПоГруппам КАК ПодразделенияГруппы
		|		ПО ГруппаНР.НомерГруппы = ПодразделенияГруппы.НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмяТаблицыБазыРаспределения КАК ИсточникБазы
		|		ПО ИсточникБазы.Организация = ДД.Организация
		|			И &УсловиеСоединения
		|			И (ПодразделенияГруппы.Подразделение ЕСТЬ NULL
		|				ИЛИ ПодразделенияГруппы.Подразделение = ИсточникБазы.Подразделение)
		|			И (ДД.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|				ИЛИ ДД.НаЛюбыеНаправлениеДеятельности
		|				ИЛИ ДД.НаправлениеДеятельности = ИсточникБазы.НаправлениеДеятельности)
		|ГДЕ
		|	&УсловиеЗапроса
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.Дата,
		|	ДД.СтатьяКалькуляции,
		|	ДД.ПравилоОтнесенияНаВыпуск,
		|	ИсточникБазы.Подразделение,
		|	ИсточникБазы.ПартияПроизводства,
		|	ИсточникБазы.ЗаказНаПроизводство,
		|	ИсточникБазы.КодСтрокиПродукция,
		|	ИсточникБазы.НаправлениеДеятельности,
		|	ВЫБОР
		|		КОГДА &РасшифровкаРаспределения
		|			ТОГДА &ВидПоказателя
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &РасшифровкаРаспределения
		|			ТОГДА ИсточникБазы.Показатель
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ИсточникБазы.ГруппаПродукции";

	Шаблон = СтрЗаменить(Шаблон, "&ВидПоказателя", """" + ПараметрыБазы.ВидПоказателя + """");
	Шаблон = СтрЗаменить(Шаблон, ".Показатель", СтрШаблон(".%1", ПараметрыБазы.ВидПоказателя));
	Шаблон = СтрЗаменить(Шаблон, "ИмяТаблицыБазыРаспределения", ПараметрыБазы.ИмяТаблицыБазыРаспределения);
	Шаблон = СтрЗаменить(Шаблон, "&ЗначениеСНДС", 
		СтрЗаменить(ПараметрыБазы.ЗначениеСНДС, "БазаРаспределенияПоПартиям", "БазаРаспределенияПоПодразделениям"));
	Шаблон = СтрЗаменить(Шаблон,
		"&ЗначениеБезНДС",
		СтрЗаменить(?(ПараметрыБазы.Свойство("ЗначениеБезНДС"),
			ПараметрыБазы.ЗначениеБезНДС,
			ПараметрыБазы.ЗначениеСНДС), "БазаРаспределенияПоПартиям", "БазаРаспределенияПоПодразделениям"));
	Шаблон = СтрЗаменить(Шаблон,
		"&ЗначениеРегл",
		СтрЗаменить(?(ПараметрыБазы.Свойство("ЗначениеРегл"), 
			ПараметрыБазы.ЗначениеРегл,
			ПараметрыБазы.ЗначениеСНДС), "БазаРаспределенияПоПартиям", "БазаРаспределенияПоПодразделениям"));
	Шаблон = СтрЗаменить(Шаблон,
		"&ЗначениеУпр",
		СтрЗаменить(?(ПараметрыБазы.Свойство("ЗначениеУпр"),
			ПараметрыБазы.ЗначениеУпр,
			ПараметрыБазы.ЗначениеСНДС), "БазаРаспределенияПоПартиям", "БазаРаспределенияПоПодразделениям"));
	Шаблон = СтрЗаменить(Шаблон, 
		"&УсловиеЗапроса", 
		?(ПараметрыБазы.Свойство("УсловиеЗапроса"), ПараметрыБазы.УсловиеЗапроса, "ИСТИНА"));
	
	Возврат Шаблон;
	
КонецФункции

Функция ПараметрыБазыРаспределения(ПоказательБазыРаспределения)
	
	Параметры = Новый Структура;
	
	Если ПоказательБазыРаспределения = "МатериальныеЗатраты" Тогда
		
		Параметры.Вставить("ВидПоказателя", "Материал");
		Параметры.Вставить("ИмяТаблицыБазыРаспределения", "ДанныеПоМатериальнымЗатратам");
		Параметры.Вставить("ЗначениеСНДС", "ВЫБОР ДД.БазаРаспределенияПоПартиям
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхЗатрат)
											|		ТОГДА ИсточникБазы.Стоимость
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхИТрудозатрат)
											|		ТОГДА ИсточникБазы.Стоимость
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесУказанныхМатериалов)
											|		ТОГДА ИсточникБазы.Вес
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоУказанныхМатериалов)
											|		ТОГДА ИсточникБазы.Количество
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемУказанныхМатериалов)
											|		ТОГДА ИсточникБазы.Объем
											|КОНЕЦ");
		Параметры.Вставить("ЗначениеБезНДС", "ВЫБОР ДД.БазаРаспределенияПоПартиям
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхЗатрат)
											|		ТОГДА ИсточникБазы.СтоимостьБезНДС
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхИТрудозатрат)
											|		ТОГДА ИсточникБазы.СтоимостьБезНДС
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесУказанныхМатериалов)
											|		ТОГДА ИсточникБазы.Вес
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоУказанныхМатериалов)
											|		ТОГДА ИсточникБазы.Количество
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемУказанныхМатериалов)
											|		ТОГДА ИсточникБазы.Объем
											|КОНЕЦ");
		Параметры.Вставить("ЗначениеРегл", "ВЫБОР ДД.БазаРаспределенияПоПартиям
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхЗатрат)
											|		ТОГДА ИсточникБазы.СтоимостьРегл
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхИТрудозатрат)
											|		ТОГДА ИсточникБазы.СтоимостьРегл
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесУказанныхМатериалов)
											|		ТОГДА ИсточникБазы.Вес
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоУказанныхМатериалов)
											|		ТОГДА ИсточникБазы.Количество
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемУказанныхМатериалов)
											|		ТОГДА ИсточникБазы.Объем
											|КОНЕЦ");
		Параметры.Вставить("ЗначениеУпр", "ВЫБОР ДД.БазаРаспределенияПоПартиям
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхЗатрат)
											|		ТОГДА ИсточникБазы.СтоимостьУпр
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхИТрудозатрат)
											|		ТОГДА ИсточникБазы.СтоимостьУпр
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесУказанныхМатериалов)
											|		ТОГДА ИсточникБазы.Вес
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоУказанныхМатериалов)
											|		ТОГДА ИсточникБазы.Количество
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемУказанныхМатериалов)
											|		ТОГДА ИсточникБазы.Объем
											|КОНЕЦ");
		
	ИначеЕсли ПоказательБазыРаспределения = "Трудозатраты" Тогда
		
		Параметры.Вставить("ВидПоказателя", "ВидРабот");
		Параметры.Вставить("ИмяТаблицыБазыРаспределения", "ДанныеПоТрудозатратамСвернуто");
		Параметры.Вставить("ЗначениеСНДС", "ВЫБОР ДД.БазаРаспределенияПоПартиям
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаРасходовНаОплатуТруда)
											|		ТОГДА ИсточникБазы.Стоимость
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхИТрудозатрат)
											|		ТОГДА ИсточникБазы.Стоимость
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоРаботУказанныхВидов)
											|		ТОГДА ИсточникБазы.Количество
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.НормативыОплатыТруда)
											|		ТОГДА ИсточникБазы.НормативнаяСтоимость
											|КОНЕЦ");
		Параметры.Вставить("ЗначениеРегл", "ВЫБОР ДД.БазаРаспределенияПоПартиям
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаРасходовНаОплатуТруда)
											|		ТОГДА ИсточникБазы.СтоимостьРегл
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхИТрудозатрат)
											|		ТОГДА ИсточникБазы.СтоимостьРегл
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоРаботУказанныхВидов)
											|		ТОГДА ИсточникБазы.Количество
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.НормативыОплатыТруда)
											|		ТОГДА ИсточникБазы.НормативнаяСтоимость
											|КОНЕЦ");
		
	ИначеЕсли ПоказательБазыРаспределения = "Продукция" Тогда
		
		
		Параметры.Вставить("ВидПоказателя", "Продукция");
		Параметры.Вставить("ИмяТаблицыБазыРаспределения", "ДанныеПоПродукцииСвернуто");
		Параметры.Вставить("ЗначениеСНДС", "ВЫБОР ДД.БазаРаспределенияПоПартиям
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоПродукции)
											|		ТОГДА ИсточникБазы.Количество
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемПродукции)
											|		ТОГДА ИсточникБазы.Объем
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесПродукции)
											|		ТОГДА ИсточникБазы.Вес
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ПлановаяСтоимостьПродукции)
											|		ТОГДА ИсточникБазы.Стоимость
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоПродукцииСУчетомБудущихВыпусков)
											|		ТОГДА ИсточникБазы.КоличествоПлан + ИсточникБазы.Количество
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемПродукцииСУчетомБудущихВыпусков)
											|		ТОГДА ИсточникБазы.ОбъемПлан + ИсточникБазы.Объем
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесПродукцииСУчетомБудущихВыпусков)
											|		ТОГДА ИсточникБазы.ВесПлан + ИсточникБазы.Вес
											|	КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ПлановаяСтоимостьПродукцииСУчетомБудущихВыпусков)
											|		ТОГДА ИсточникБазы.СтоимостьПлан + ИсточникБазы.Стоимость
											|КОНЕЦ");
		
		Параметры.Вставить("УсловиеЗапроса", 
			"(ДД.БазаРаспределенияПоПартиям В (ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоПродукции),
			|									ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемПродукции),
			|									ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесПродукции),
			|									ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ПлановаяСтоимостьПродукции))
			|	И ИсточникБазы.ДатаПроизводства МЕЖДУ &НачалоПериода И &КонецПериода)
			|   ИЛИ ДД.БазаРаспределенияПоПартиям В (ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоПродукцииСУчетомБудущихВыпусков),
			|										ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемПродукцииСУчетомБудущихВыпусков),
			|										ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесПродукцииСУчетомБудущихВыпусков),
			|										ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ПлановаяСтоимостьПродукцииСУчетомБудущихВыпусков))");

	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

// Вт БазаПоПодразделениямДетально, БазаПоПодразделениям,
// Использует БазаПоЭтапам, РаспределитьПоПодразделениям, ДанныеПоФактическимМатериальнымЗатратам,
// ДанныеПоТрудозатратам, ЗначенияПоказателей.
Функция ТекстБазаРаспределенияДолейПоПодразделениям(ПараметрыРасчета)
		
	ИмяВременнойТаблицыГруппыОбъектов = "ГруппыОбъектовРаспределенияПоПодразделениям";
	ТекстПолученияОбъектов = 
		"ВЫБРАТЬ
		|	РеквизитыРаспределения.Ссылка,
		|	ВЫБОР
		|		КОГДА РеквизитыРаспределения.БазаРаспределенияПоПодразделениям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхИТрудозатрат)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхЗатрат)
		|		ИНАЧЕ
		|			РеквизитыРаспределения.БазаРаспределенияПоПодразделениям
		|	КОНЕЦ КАК ТипБазыРаспределения,
		|	РеквизитыРаспределения.НастройкиБазыРаспределенияПоПартиям КАК НастройкиСхемы
		|ИЗ
		|	Документ.РаспределениеПрочихЗатрат КАК РеквизитыРаспределения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспределитьПоПодразделениям КАК РаспределениеПоПодразделениям
		|		ПО РеквизитыРаспределения.Ссылка = РаспределениеПоПодразделениям.Регистратор
		|ГДЕ
		|	РеквизитыРаспределения.БазаРаспределенияПоПодразделениям В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхИТрудозатрат),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхЗатрат),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаРасходовНаОплатуТруда))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеквизитыРаспределения.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаРасходовНаОплатуТруда) КАК ТипБазыРаспределения,
		|	РеквизитыРаспределения.НастройкиБазыРаспределенияПоПартиям КАК НастройкиСхемы
		|ИЗ
		|	Документ.РаспределениеПрочихЗатрат КАК РеквизитыРаспределения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспределитьПоПодразделениям КАК РаспределениеПоПодразделениям
		|		ПО РеквизитыРаспределения.Ссылка = РаспределениеПоПодразделениям.Регистратор
		|ГДЕ
		|	РеквизитыРаспределения.БазаРаспределенияПоПодразделениям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхИТрудозатрат)";

	НедоступныеПоля = Новый Массив;
	НедоступныеПоля.Добавить("Материал");
	НедоступныеПоля.Добавить("ВидРабот");
	НедоступныеПоля.Добавить("Продукция");
	ОписаниеГрупп = ПолучитьОписаниеГруппОбъектовПоНастройкамОтбора(ТекстПолученияОбъектов, ПараметрыРасчета,
		ИмяВременнойТаблицыГруппыОбъектов, НедоступныеПоля);
		
	ТекстЗапросаОписаниеДанных = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка)			КАК Регистратор,
		|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)					КАК СтатьяКалькуляции,
		|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)				КАК КорПодразделение,
		|	ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)				КАК ПартияПроизводства,
		|	НЕОПРЕДЕЛЕНО														КАК ЗаказНаПроизводство,
		|	0																	КАК КодСтрокиПродукция,
		|	НЕОПРЕДЕЛЕНО														КАК ГруппаПродукции,
		|	НЕОПРЕДЕЛЕНО														КАК Показатель,
		|	0																	КАК Стоимость,
		|	0																	КАК СтоимостьБезНДС,
		|	0																	КАК СтоимостьРегл,
		|	0																	КАК СтоимостьУпр
		|ПОМЕСТИТЬ ОписаниеДанных
		|ГДЕ
		|	ЛОЖЬ";
	
	ГотовыеТекстыЗапросов = Новый Массив;
	ГотовыеТекстыЗапросов.Добавить(ТекстПомещенияГруппыОбъектовВоВременнуюТаблицу(ИмяВременнойТаблицыГруппыОбъектов));
	ГотовыеТекстыЗапросов.Добавить(ТекстЗапросаОписаниеДанных);
	ДополнитьТекстамиПоОписаниюГрупп(ГотовыеТекстыЗапросов, ОписаниеГрупп, ИмяВременнойТаблицыГруппыОбъектов);
	
	ТекстыФормированияИтоговойТаблицы = Новый Массив;
	ТекстБазаПоПодразделениямДетально = 
		"ВЫБРАТЬ
		|	Т.Регистратор,
		|	Т.СтатьяКалькуляции,
		|	Т.КорПодразделение,
		|	Т.ПартияПроизводства,
		|	Т.ЗаказНаПроизводство,
		|	Т.КодСтрокиПродукция,
		|	Т.ГруппаПродукции,
		|	Т.Показатель,
		|	Т.Стоимость,
		|	Т.СтоимостьБезНДС,
		|	Т.СтоимостьРегл,
		|	Т.СтоимостьУпр
		|ПОМЕСТИТЬ БазаПоПодразделениямДетально
		|ИЗ
		|	ОписаниеДанных КАК Т";
	ТекстыФормированияИтоговойТаблицы.Добавить(ТекстБазаПоПодразделениямДетально);
	
	ТекстБазаПоПодразделениямДетально = СтрЗаменить(ТекстБазаПоПодразделениямДетально, "ПОМЕСТИТЬ БазаПоПодразделениямДетально", "");
	Для Каждого ОписаниеГруппы Из ОписаниеГрупп Цикл
		ТекстыФормированияИтоговойТаблицы.Добавить(
			СтрЗаменить(ТекстБазаПоПодразделениямДетально, 
				"ОписаниеДанных", СтрШаблон("ТаблицаДанных%1",
				Формат(ОписаниеГруппы.НомерГруппы, "ЧН=0; ЧГ=0"))));
	КонецЦикла;
			
	// Тексты запросов распределяемых вручную.
	ТекстРаспределяемыеВручную = 
		"ВЫБРАТЬ
		|	ДД.Регистратор              КАК Регистратор,
		|	Данные.СтатьяКалькуляции    КАК СтатьяКалькуляции,
		|	Данные.Подразделение        КАК КорПодразделение,
		|	ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка) КАК ПартияПроизводства,
		|	НЕОПРЕДЕЛЕНО                КАК ЗаказНаПроизводство,
		|	0                           КАК КодСтрокиПродукция,
		|	НЕОПРЕДЕЛЕНО                КАК ГруппаПродукции,
		|	НЕОПРЕДЕЛЕНО                КАК МатериалВидРабот,
		|	Данные.ДоляСтоимости 		КАК Стоимость,
		|	Данные.ДоляСтоимости 		КАК СтоимостьБезНДС,
		|	Данные.ДоляСтоимости 		КАК СтоимостьРегл,
		|	Данные.ДоляСтоимости 		КАК СтоимостьУпр
		|ИЗ
		|	РаспределитьПоПодразделениям КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат.ПоБазе КАК Данные
		|		ПО Данные.Ссылка = ДД.Регистратор
		|ГДЕ
		|	ДД.ПодразделенияУказаныВручную";
	ТекстыФормированияИтоговойТаблицы.Добавить(ТекстРаспределяемыеВручную);
	
	// По показателям.
	ТекстПоПоказателям = 
		"ВЫБРАТЬ
		|	ДД.Регистратор				КАК Регистратор,
		|	ДД.СтатьяКалькуляции		КАК СтатьяКалькуляции,
		|	Данные.Подразделение		КАК КорПодразделение,
		|	ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка) КАК ПартияПроизводства,
		|	НЕОПРЕДЕЛЕНО				КАК ЗаказНаПроизводство,
		|	0							КАК КодСтрокиПродукция,
		|	НЕОПРЕДЕЛЕНО				КАК ГруппаПродукции,
		|	НЕОПРЕДЕЛЕНО				КАК МатериалВидРабот,
		|	Данные.ЗначениеПоказателя	КАК Стоимость,
		|	Данные.ЗначениеПоказателя	КАК СтоимостьБезНДС,
		|	Данные.ЗначениеПоказателя	КАК СтоимостьРегл,
		|	Данные.ЗначениеПоказателя	КАК СтоимостьУпр
		|ИЗ
		|	РаспределитьПоПодразделениям КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГруппыОбъектовПоНаправлениюРаспределения КАК ГруппаНР
		|		ПО ДД.Регистратор = ГруппаНР.Объект
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПодразделенияПоГруппам КАК ПодразделенияГруппы
		|		ПО ГруппаНР.НомерГруппы = ПодразделенияГруппы.НомерГруппы
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПоказателей КАК Данные
		|		ПО Данные.Показатель = ДД.Показатель
		|			И (ПодразделенияГруппы.Подразделение ЕСТЬ NULL
		|				ИЛИ ПодразделенияГруппы.Подразделение = Данные.Подразделение)
		|
		|ГДЕ
		|	НЕ Данные.ЗначениеПоказателя ЕСТЬ NULL
		|	И (ДД.БазаРаспределенияПоПодразделениям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении)
		|	ИЛИ ДД.БазаРаспределенияПоПодразделениям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно))";
	ТекстыФормированияИтоговойТаблицы.Добавить(ТекстПоПоказателям);
	
	ГотовыеТекстыЗапросов.Добавить(ОбъединитьТексты(ТекстыФормированияИтоговойТаблицы));
	ГотовыеТекстыЗапросов.Добавить("УНИЧТОЖИТЬ ОписаниеДанных");
	Для Каждого ОписаниеГруппы Из ОписаниеГрупп Цикл
		ГотовыеТекстыЗапросов.Добавить(
			СтрШаблон("УНИЧТОЖИТЬ ТаблицаДанных%1",
				Формат(ОписаниеГруппы.НомерГруппы, "ЧН=0; ЧГ=0")));
	КонецЦикла;
	
	Возврат ОбъединитьТексты(ГотовыеТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете())
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
	
КонецФункции

Функция ТекстБазаПоПодразделениямСводно()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДД.Регистратор,
		|	ВЫБОР
		|		КОГДА СУММА(ДД.Стоимость) > 1000000000
		|	 		ТОГДА 1000000
		|		КОГДА СУММА(ДД.Стоимость) > 100000000
		|	 		ТОГДА 100000
		|		КОГДА СУММА(ДД.Стоимость) > 10000000
		|	 		ТОГДА 10000
		|		КОГДА СУММА(ДД.Стоимость) > 1000000
		|	 		ТОГДА 1000
		|		КОГДА СУММА(ДД.Стоимость) > 100000
		|	 		ТОГДА 100
		|		КОГДА СУММА(ДД.Стоимость) > 10000
		|	 		ТОГДА 10
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Коэффициент,
		|	ВЫБОР
		|		КОГДА СУММА(ДД.СтоимостьБезНДС) > 1000000000
		|	 		ТОГДА 1000000
		|		КОГДА СУММА(ДД.СтоимостьБезНДС) > 100000000
		|	 		ТОГДА 100000
		|		КОГДА СУММА(ДД.СтоимостьБезНДС) > 10000000
		|	 		ТОГДА 10000
		|		КОГДА СУММА(ДД.СтоимостьБезНДС) > 1000000
		|	 		ТОГДА 1000
		|		КОГДА СУММА(ДД.СтоимостьБезНДС) > 100000
		|	 		ТОГДА 100
		|		КОГДА СУММА(ДД.СтоимостьБезНДС) > 10000
		|	 		ТОГДА 10
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентБезНДС,
		|	ВЫБОР
		|		КОГДА СУММА(ДД.СтоимостьРегл) > 1000000000
		|	 		ТОГДА 1000000
		|		КОГДА СУММА(ДД.СтоимостьРегл) > 100000000
		|	 		ТОГДА 100000
		|		КОГДА СУММА(ДД.СтоимостьРегл) > 10000000
		|	 		ТОГДА 10000
		|		КОГДА СУММА(ДД.СтоимостьРегл) > 1000000
		|	 		ТОГДА 1000
		|		КОГДА СУММА(ДД.СтоимостьРегл) > 100000
		|	 		ТОГДА 100
		|		КОГДА СУММА(ДД.СтоимостьРегл) > 10000
		|	 		ТОГДА 10
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентРегл,
		|	ВЫБОР
		|		КОГДА СУММА(ДД.СтоимостьУпр) > 1000000000
		|	 		ТОГДА 1000000
		|		КОГДА СУММА(ДД.СтоимостьУпр) > 100000000
		|	 		ТОГДА 100000
		|		КОГДА СУММА(ДД.СтоимостьУпр) > 10000000
		|	 		ТОГДА 10000
		|		КОГДА СУММА(ДД.СтоимостьУпр) > 1000000
		|	 		ТОГДА 1000
		|		КОГДА СУММА(ДД.СтоимостьУпр) > 100000
		|	 		ТОГДА 100
		|		КОГДА СУММА(ДД.СтоимостьУпр) > 10000
		|	 		ТОГДА 10
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентУпр
		|ПОМЕСТИТЬ КоэффициентыПриведенияБазыПоПодразделениям
		|ИЗ
		|	БазаПоПодразделениямДетально КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтогиБазыПоЭтапамПодразделений КАК ИтогиПоЭтапам
		|			ПО ДД.Регистратор = ИтогиПоЭтапам.Регистратор
		|			И ДД.КорПодразделение = ИтогиПоЭтапам.Подразделение
		|			И ИтогиПоЭтапам.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДД.Регистратор
		|;
		|
		|ВЫБРАТЬ
		|	ДД.Регистратор				КАК Регистратор,
		|	ДД.КорПодразделение			КАК КорПодразделение,
		|	ДД.СтатьяКалькуляции		КАК СтатьяКалькуляции,
		|
		|	СУММА(ДД.Стоимость) / МАКСИМУМ(Коэффициенты.Коэффициент)				КАК Стоимость,
		|	СУММА(ДД.СтоимостьБезНДС) / МАКСИМУМ(Коэффициенты.КоэффициентБезНДС)	КАК СтоимостьБезНДС,
		|	СУММА(ДД.СтоимостьРегл) / МАКСИМУМ(Коэффициенты.КоэффициентРегл)		КАК СтоимостьРегл,
		|	СУММА(ДД.СтоимостьУпр) / МАКСИМУМ(Коэффициенты.КоэффициентУпр)			КАК СтоимостьУпр
		|ПОМЕСТИТЬ БазаПоПодразделениям
		|ИЗ
		|	БазаПоПодразделениямДетально КАК ДД
		// Подразделение включается в базу только если есть база для распределения по этапам этого подразделения.
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтогиБазыПоЭтапамПодразделений КАК ИтогиПоЭтапам
		|		ПО ДД.Регистратор = ИтогиПоЭтапам.Регистратор
		|			И ДД.КорПодразделение = ИтогиПоЭтапам.Подразделение
		|			И ИтогиПоЭтапам.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоэффициентыПриведенияБазыПоПодразделениям КАК Коэффициенты
		|		ПО ДД.Регистратор = Коэффициенты.Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.КорПодразделение,
		|	ДД.СтатьяКалькуляции
		|
		|ИМЕЮЩИЕ
		|	СУММА(ДД.Стоимость) > 0
		|	ИЛИ СУММА(ДД.СтоимостьБезНДС) > 0
		|	ИЛИ СУММА(ДД.СтоимостьРегл) > 0
		|	ИЛИ СУММА(ДД.СтоимостьУпр) > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	КорПодразделение";
	
	Возврат ТекстЗапроса
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
		
КонецФункции
// Вт ИтогиБазыПоПодразделениям
// Использует БазаПоПодразделениям.
Функция ТекстИтогиБазыПоПодразделениям()
	Возврат "
	|ВЫБРАТЬ
	|	ДД.Регистратор,
	|	СУММА(ДД.Стоимость) 		КАК Стоимость,
	|	СУММА(ДД.СтоимостьБезНДС) 	КАК СтоимостьБезНДС,
	|	СУММА(ДД.СтоимостьРегл) 	КАК СтоимостьРегл,
	|	СУММА(ДД.СтоимостьУпр) 		КАК СтоимостьУпр
	|ПОМЕСТИТЬ ИтогиБазыПоПодразделениям
	|ИЗ
	|	БазаПоПодразделениям КАК ДД
	|СГРУППИРОВАТЬ ПО
	|	ДД.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|";
КонецФункции

// Таблицы: ДанныеПоТрудозатратамСвернуто
Функция ТекстДанныеПоТрудозатратамСвернуто()
	
	Возврат "
	|ВЫБРАТЬ
	|	ДД.Организация						КАК Организация,
	|	ДД.Подразделение					КАК Подразделение,
	|	ДД.СтатьяКалькуляции				КАК СтатьяКалькуляции,
	|	ДД.ВидРабот                         КАК ВидРабот,
	|	ДД.ГруппаПродукции					КАК ГруппаПродукции,
	|	ДД.ПартияПроизводства               КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство              КАК ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция				КАК КодСтрокиПродукция,
	|	ДД.НаправлениеДеятельности          КАК НаправлениеДеятельности,
	|	СУММА(ДД.Количество)				КАК Количество,
	|	СУММА(ДД.НормативнаяСтоимость)		КАК НормативнаяСтоимость,
	|	СУММА(ДД.Стоимость)					КАК Стоимость,
	|	СУММА(ДД.СтоимостьРегл)				КАК СтоимостьРегл
	|ПОМЕСТИТЬ ДанныеПоТрудозатратамСвернуто
	|ИЗ
	|	ДанныеПоТрудозатратам КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.СтатьяКалькуляции,
	|	ДД.ВидРабот,
	|	ДД.ГруппаПродукции,
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция,
	|	ДД.НаправлениеДеятельности
	|
	|;
	|";
	
КонецФункции

// Таблицы: ДанныеПоПродукцииСвернуто
Функция ТекстДанныеПоВыпущеннойПродукцииСвернуто()
	
	Возврат "
	|ВЫБРАТЬ
	|	ДД.Организация                  КАК Организация,
	|	НАЧАЛОПЕРИОДА(ДД.ДатаПроизводства, МЕСЯЦ) КАК ДатаПроизводства,
	|	ДД.Подразделение                КАК Подразделение,
	|	ДД.СтатьяКалькуляции            КАК СтатьяКалькуляции,
	|	ДД.Продукция                    КАК Продукция,
	|	ДД.ГруппаПродукции              КАК ГруппаПродукции,
	|	ДД.ПартияПроизводства           КАК ПартияПроизводства,
	|	ДД.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|	ДД.ЗаказНаПроизводство          КАК ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция           КАК КодСтрокиПродукция,
	|	СУММА(ДД.Количество)            КАК Количество,
	|	СУММА(ДД.КоличествоПлан)        КАК КоличествоПлан,
	|	СУММА(ДД.Объем)                 КАК Объем,
	|	СУММА(ДД.ОбъемПлан)             КАК ОбъемПлан,
	|	СУММА(ДД.Вес)                   КАК Вес,
	|	СУММА(ДД.ВесПлан)               КАК ВесПлан,
	|	СУММА(ДД.Стоимость)             КАК Стоимость,
	|	СУММА(ДД.СтоимостьПлан)         КАК СтоимостьПлан
	|ПОМЕСТИТЬ ДанныеПоПродукцииСвернуто
	|ИЗ
	|	ДанныеПоПродукции КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	НАЧАЛОПЕРИОДА(ДД.ДатаПроизводства, МЕСЯЦ),
	|	ДД.СтатьяКалькуляции,
	|	ДД.Подразделение,
	|	ДД.Продукция,
	|	ДД.ГруппаПродукции,
	|	ДД.ПартияПроизводства,
	|	ДД.НаправлениеДеятельности,
	|	ДД.ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция
	|;
	|";
	
КонецФункции

// ... выборки данных

Функция ТекстНераспределяемыеДоли() // использует ОставитьВНЗП, ИтогиБазыПоЭтапамВсехПодразделений
	Возврат "
	|ВЫБРАТЬ
	|	""ТекстНераспределяемыеДоли""                                           КАК ЗапросИсточник,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.НЗП)                            КАК ТипЗаписи,
	|	ИСТИНА                                                                  КАК РасчетЗавершен,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)    КАК РазделУчета,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                                  КАК ВидДвижения,
	|	ДД.Дата                                                                 КАК Период,
	|	ДД.Регистратор                                                          КАК Регистратор,
	|	ДД.Организация                                                          КАК Организация,
	|	ДД.Подразделение                                                        КАК Подразделение,
	|	ДД.НаправлениеДеятельности                                              КАК НаправлениеДеятельности,
	|	ДД.СтатьяРасходов                                                       КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                                    КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО                                                            КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО                                                            КАК ГруппаПродукции,
	|	НЕОПРЕДЕЛЕНО                                                            КАК ПравилоОтнесенияНаВыпуск,
	|	ВЫБОР 
	|		КОГДА НЕ ДД.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ НЕ Регистраторы.УправленческийУчет
	|			ТОГДА 0
	|		ИНАЧЕ 
		// Если база распределения отсутствует, то в доле стоимости хранится целое число,
		// на которое никак не может повлиять единица.
	|			ВЫРАЗИТЬ(ДД.ДоляСтоимости 
	|				* ЕСТЬNULL(ИтогиБазыПоПодразделениям.Стоимость, 
	|					ЕСТЬNULL(ИтогиБазыПоЭтапам.Стоимость, 1)) КАК ЧИСЛО(28, 10))
	|	КОНЕЦ																	КАК ДоляСтоимости,
	|	ВЫБОР 
	|		КОГДА НЕ ДД.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ НЕ Регистраторы.УправленческийУчет
	|			ТОГДА 0
	|		ИНАЧЕ 
	|			ВЫРАЗИТЬ(ДД.ДоляСтоимости 
	|				* ЕСТЬNULL(ИтогиБазыПоПодразделениям.СтоимостьБезНДС, 
	|					ЕСТЬNULL(ИтогиБазыПоЭтапам.СтоимостьБезНДС, 1)) КАК ЧИСЛО(28, 10))
	|	КОНЕЦ																	КАК ДоляСтоимостиБезНДС,
	|	ВЫБОР 
	|		КОГДА НЕ ДД.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ НЕ Регистраторы.РегламентированныйУчет
	|			ТОГДА 0
	|		ИНАЧЕ 
	|			ВЫРАЗИТЬ(ДД.ДоляСтоимости 
	|				* ЕСТЬNULL(ИтогиБазыПоПодразделениям.СтоимостьРегл, 
	|					ЕСТЬNULL(ИтогиБазыПоЭтапам.СтоимостьРегл, 1)) КАК ЧИСЛО(28, 10))
	|	КОНЕЦ																	КАК ДоляСтоимостиРегл,
	|	ВЫБОР 
	|		КОГДА НЕ ДД.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ НЕ Регистраторы.УправленческийУчет
	|			ТОГДА 0
	|		ИНАЧЕ 
	|			ВЫРАЗИТЬ(ДД.ДоляСтоимости 
	|				* ЕСТЬNULL(ИтогиБазыПоПодразделениям.СтоимостьУпр, 
	|					ЕСТЬNULL(ИтогиБазыПоЭтапам.СтоимостьУпр, 1)) КАК ЧИСЛО(28, 10))
	|	КОНЕЦ																	КАК ДоляСтоимостиУпр,
	|	НЕОПРЕДЕЛЕНО                                                            КАК КорСтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО                                                            КАК КорАналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО                                                            КАК КорСтатьяАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО                                                            КАК КорАналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО                                                        	КАК КорПодразделение,
	|	НЕОПРЕДЕЛЕНО                                                            КАК КорНаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)                    КАК ПартияПроизводства,
	|	НЕОПРЕДЕЛЕНО                                                            КАК ЗаказНаПроизводство,
	|	0                                                                       КАК КодСтрокиПродукция,
	|	НЕОПРЕДЕЛЕНО                                                            КАК СтатьяКалькуляции,
	|	НЕОПРЕДЕЛЕНО                                                            КАК ИдентификаторСтроки
	|ИЗ
	|	ОставитьВНЗП КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	|		ПО Регистраторы.Регистратор = ДД.Регистратор
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогиБазыПоЭтапамВсехПодразделений КАК ИтогиБазыПоЭтапам
	|		ПО ИтогиБазыПоЭтапам.Регистратор = ДД.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогиБазыПоПодразделениям КАК ИтогиБазыПоПодразделениям
	|		ПО ИтогиБазыПоПодразделениям.Регистратор = ДД.Регистратор
	|";
	
КонецФункции

Функция ТекстРаспределениеМеждуПартиями()
	
	Возврат "
	|ВЫБРАТЬ
	|	""ТекстРаспределениеМеждуПартиями""                             		КАК ЗапросИсточник,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)		            КАК ТипЗаписи,
	|	ИСТИНА                                                                  КАК РасчетЗавершен,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)    КАК РазделУчета,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                                  КАК ВидДвижения,
	|	ПоПартиям.Дата                                                          КАК Период,
	|	ПоПартиям.Регистратор                                                   КАК Регистратор,
	|	ПоПартиям.Организация                                                   КАК Организация,
	|	ПоПартиям.Подразделение                                              	КАК Подразделение,
	|	ПоПартиям.НаправлениеДеятельности                                    	КАК НаправлениеДеятельности,
	|	ПоПартиям.СтатьяРасходов                                                КАК СтатьяРасходов,
	|	ПоПартиям.АналитикаРасходов                                             КАК АналитикаРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства) КАК ХозяйственнаяОперация,
	|	БазаПоЭтапам.ГруппаПродукции                                            КАК ГруппаПродукции,
	|	БазаПоЭтапам.ПравилоОтнесенияНаВыпуск                                   КАК ПравилоОтнесенияНаВыпуск,
	|	ВЫБОР 
	|		КОГДА НЕ ПоПартиям.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ НЕ Регистраторы.УправленческийУчет
	|			ТОГДА 0
	|		КОГДА ИтогиБазыПоЭтапамПодразделений.Стоимость = 0
	|			ИЛИ ИтогиБазыПоПодразделениям.Стоимость = 0
	// База по подразделениям будет равна 0 только если базы распределения действительно нет.
	// При отсутствии распределения на подразделения итог по базы по подразделению будет равен NULL.
	|			ТОГДА 0
	|		КОГДА ПоПодразделениям.Регистратор ЕСТЬ NULL
	// Не распределяется между подразделениями.
	|			ТОГДА БазаПоЭтапам.Стоимость
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ(ЕСТЬNULL(БазаПоПодразделениям.Стоимость, 0) 
	|				* (БазаПоЭтапам.Стоимость 
	|				/ ИтогиБазыПоЭтапамПодразделений.Стоимость) КАК ЧИСЛО(28, 10))
	|	КОНЕЦ КАК ДоляСтоимости,
	|	ВЫБОР 
	|		КОГДА НЕ ПоПартиям.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ НЕ Регистраторы.УправленческийУчет
	|			ТОГДА 0
	|		КОГДА ИтогиБазыПоЭтапамПодразделений.СтоимостьБезНДС = 0
	|			ИЛИ ИтогиБазыПоПодразделениям.СтоимостьБезНДС = 0
	|			ТОГДА 0
	|		КОГДА ПоПодразделениям.Регистратор ЕСТЬ NULL
	|			ТОГДА БазаПоЭтапам.СтоимостьБезНДС
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ(ЕСТЬNULL(БазаПоПодразделениям.СтоимостьБезНДС, 0) 
	|				* (БазаПоЭтапам.СтоимостьБезНДС 
	|				/ ИтогиБазыПоЭтапамПодразделений.СтоимостьБезНДС) КАК ЧИСЛО(28, 10))
	|	КОНЕЦ КАК ДоляСтоимостиБезНДС,
	|	ВЫБОР 
	|		КОГДА НЕ ПоПартиям.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ НЕ Регистраторы.РегламентированныйУчет
	|			ТОГДА 0
	|		КОГДА ИтогиБазыПоЭтапамПодразделений.СтоимостьРегл = 0
	|			ИЛИ ИтогиБазыПоПодразделениям.СтоимостьРегл = 0
	|			ТОГДА 0
	|		КОГДА ПоПодразделениям.Регистратор ЕСТЬ NULL
	|			ТОГДА БазаПоЭтапам.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ(ЕСТЬNULL(БазаПоПодразделениям.СтоимостьРегл, 0) 
	|				* (БазаПоЭтапам.СтоимостьРегл 
	|				/ ИтогиБазыПоЭтапамПодразделений.СтоимостьРегл) КАК ЧИСЛО(28, 10))
	|	КОНЕЦ КАК ДоляСтоимостиРегл,
	|	ВЫБОР 
	|		КОГДА НЕ ПоПартиям.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ НЕ Регистраторы.УправленческийУчет
	|			ТОГДА 0
	|		КОГДА ИтогиБазыПоЭтапамПодразделений.СтоимостьУпр = 0
	|			ИЛИ ИтогиБазыПоПодразделениям.СтоимостьУпр = 0
	|			ТОГДА 0
	|		КОГДА ПоПодразделениям.Регистратор ЕСТЬ NULL
	|			ТОГДА БазаПоЭтапам.СтоимостьУпр
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ(ЕСТЬNULL(БазаПоПодразделениям.СтоимостьУпр, 0) 
	|				* (БазаПоЭтапам.СтоимостьУпр 
	|				/ ИтогиБазыПоЭтапамПодразделений.СтоимостьУпр) КАК ЧИСЛО(28, 10))
	|	КОНЕЦ КАК ДоляСтоимостиУпр,
	|	НЕОПРЕДЕЛЕНО                                                            КАК КорСтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО                                                            КАК КорАналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО                                                            КАК КорСтатьяАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО                                                            КАК КорАналитикаАктивовПассивов,
	|	БазаПоЭтапам.Подразделение                                              КАК КорПодразделение,
	|	БазаПоЭтапам.НаправлениеДеятельности                                    КАК КорНаправлениеДеятельности,
	|	БазаПоЭтапам.ПартияПроизводства                                         КАК ПартияПроизводства,
	|	БазаПоЭтапам.ЗаказНаПроизводство                                        КАК ЗаказНаПроизводство,
	|	БазаПоЭтапам.КодСтрокиПродукция                                         КАК КодСтрокиПродукция,
	|	ВЫБОР
	|		КОГДА НЕ ПоПодразделениям.Регистратор ЕСТЬ NULL ТОГДА
	|			БазаПоПодразделениям.СтатьяКалькуляции
	|		ИНАЧЕ
	|			БазаПоЭтапам.СтатьяКалькуляции
	|	КОНЕЦ КАК СтатьяКалькуляции,
	|	НЕОПРЕДЕЛЕНО                                                            КАК ИдентификаторСтроки
	|ИЗ
	|	РаспределитьПоЭтапам КАК ПоПартиям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	|		ПО	Регистраторы.Регистратор = ПоПартиям.Регистратор
	|		И	Регистраторы.СтатьяРасходов = ПоПартиям.СтатьяРасходов
	|		И	Регистраторы.НаправлениеДеятельности = ПоПартиям.НаправлениеДеятельности
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазаПоЭтапам КАК БазаПоЭтапам
	|		ПО	ПоПартиям.Регистратор = БазаПоЭтапам.Регистратор
	|			И (ПоПартиям.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|				ИЛИ Регистраторы.ПартииУказаныВручную ИЛИ Регистраторы.НаЛюбыеНаправлениеДеятельности
	|				ИЛИ ПоПартиям.НаправлениеДеятельности = БазаПоЭтапам.НаправлениеДеятельности)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтогиБазыПоЭтапамПодразделений КАК ИтогиБазыПоЭтапамПодразделений
	|		ПО ПоПартиям.Регистратор = ИтогиБазыПоЭтапамПодразделений.Регистратор
	|			И БазаПоЭтапам.Подразделение = ИтогиБазыПоЭтапамПодразделений.Подразделение
	|			И (Регистраторы.ПартииУказаныВручную ИЛИ Регистраторы.НаЛюбыеНаправлениеДеятельности
	|				ИЛИ ПоПартиям.НаправлениеДеятельности = ИтогиБазыПоЭтапамПодразделений.НаправлениеДеятельности)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределитьПоПодразделениям КАК ПоПодразделениям
	|		ПО ПоПартиям.Регистратор = ПоПодразделениям.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ БазаПоПодразделениям КАК БазаПоПодразделениям
	|		ПО ПоПодразделениям.Регистратор = БазаПоПодразделениям.Регистратор
	|			И БазаПоЭтапам.Подразделение = БазаПоПодразделениям.КорПодразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогиБазыПоПодразделениям КАК ИтогиБазыПоПодразделениям
	|		ПО ИтогиБазыПоПодразделениям.Регистратор = ПоПодразделениям.Регистратор
	|";
	
	
КонецФункции

Функция ТекстРаспределениеНаДругиеСтатьи() // использует РаспределитьНаДругиеСтатьи, ИтогиБазыПоЭтапамВсехПодразделений
	Возврат "
	|ВЫБРАТЬ
	|	""ТекстДолиКРаспределениюНаДругиеСтатьи""                               КАК ЗапросИсточник,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписаниеНаРасходы)              КАК ТипЗаписи,
	|	ИСТИНА                                                                  КАК РасчетЗавершен,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)    КАК РазделУчета,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                                  КАК ВидДвижения,
	|	ДД.Дата                                                                 КАК Период,
	|	ДД.Регистратор                                                          КАК Регистратор,
	|	ДД.Организация                                                          КАК Организация,
	|	ДД.Подразделение                                                        КАК Подразделение,
	|	ДД.НаправлениеДеятельности                                              КАК НаправлениеДеятельности,
	|	ДД.СтатьяРасходов                                                       КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                                    КАК АналитикаРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов)     КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО                                                            КАК ГруппаПродукции,
	|	НЕОПРЕДЕЛЕНО                                                            КАК ПравилоОтнесенияНаВыпуск,
	|	ВЫБОР 
	|		КОГДА НЕ ДД.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ НЕ Регистраторы.УправленческийУчет
	|			ТОГДА 0
	|		ИНАЧЕ 
		// Если база распределения отсутствует, то в доле стоимости хранится целое число,
		// на которое никак не может повлиять единица.
	|			ВЫРАЗИТЬ(ДД.ДоляСтоимости 
	|				* ЕСТЬNULL(ИтогиБазыПоПодразделениям.Стоимость, 
	|					ЕСТЬNULL(ИтогиБазыПоЭтапам.Стоимость, 1)) КАК ЧИСЛО(28, 10))
	|	КОНЕЦ																	КАК ДоляСтоимости,
	|	ВЫБОР 
	|		КОГДА НЕ ДД.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ НЕ Регистраторы.УправленческийУчет
	|			ТОГДА 0
	|		ИНАЧЕ 
	|			ВЫРАЗИТЬ(ДД.ДоляСтоимости 
	|				* ЕСТЬNULL(ИтогиБазыПоПодразделениям.СтоимостьБезНДС, 
	|					ЕСТЬNULL(ИтогиБазыПоЭтапам.СтоимостьБезНДС, 1)) КАК ЧИСЛО(28, 10))
	|	КОНЕЦ																	КАК ДоляСтоимостиБезНДС,
	|	ВЫБОР 
	|		КОГДА НЕ ДД.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ НЕ Регистраторы.РегламентированныйУчет
	|			ТОГДА 0
	|		ИНАЧЕ 
	|			ВЫРАЗИТЬ(ДД.ДоляСтоимости 
	|				* ЕСТЬNULL(ИтогиБазыПоПодразделениям.СтоимостьРегл, 
	|					ЕСТЬNULL(ИтогиБазыПоЭтапам.СтоимостьРегл, 1)) КАК ЧИСЛО(28, 10))
	|	КОНЕЦ																	КАК ДоляСтоимостиРегл,
	|	ВЫБОР 
	|		КОГДА НЕ ДД.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ НЕ Регистраторы.УправленческийУчет
	|			ТОГДА 0
	|		ИНАЧЕ 
	|			ВЫРАЗИТЬ(ДД.ДоляСтоимости 
	|				* ЕСТЬNULL(ИтогиБазыПоПодразделениям.СтоимостьУпр, 
	|					ЕСТЬNULL(ИтогиБазыПоЭтапам.СтоимостьУпр, 1)) КАК ЧИСЛО(28, 10))
	|	КОНЕЦ																	КАК ДоляСтоимостиУпр,
	|	ВЫБОР
	|		КОГДА ДД.КорСтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|			ТОГДА ДД.КорСтатьяРасходов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                                                   КАК КорСтатьяРасходов,
	|	ДД.КорАналитикаРасходов                                             	КАК КорАналитикаРасходов,
	|	ВЫБОР
	|		КОГДА ДД.КорСтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|			ТОГДА ДД.КорСтатьяРасходов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                                                   КАК КорСтатьяАктивовПассивов,
	|	ДД.КорАналитикаАктивовПассивов                                          КАК КорАналитикаАктивовПассивов,
	|	ДД.КорПодразделение                                                     КАК КорПодразделение,
	|	ДД.КорНаправлениеДеятельности                                          	КАК КорНаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                                                            КАК ПартияПроизводства,
	|	НЕОПРЕДЕЛЕНО                                                            КАК ЗаказНаПроизводство,
	|	0                                                                       КАК КодСтрокиПродукция,
	|	НЕОПРЕДЕЛЕНО                                                            КАК СтатьяКалькуляции,
	|	ДД.ИдентификаторСтроки                                              	КАК ИдентификаторСтроки
	|ИЗ
	|	РаспределитьНаДругиеСтатьи КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	|		ПО Регистраторы.Регистратор = ДД.Регистратор
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогиБазыПоЭтапамВсехПодразделений КАК ИтогиБазыПоЭтапам
	|		ПО ИтогиБазыПоЭтапам.Регистратор = ДД.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогиБазыПоПодразделениям КАК ИтогиБазыПоПодразделениям
	|		ПО ИтогиБазыПоПодразделениям.Регистратор = ДД.Регистратор
	|";
	
КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапа15_1_РаспределениеПрямыхРасходовНаПроизводство

Функция ТаблицаДляРаспределенияПрямыхРасходовНаПроизводство(ПараметрыРасчета)
	
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ТаблицаДляРаспределенияПартий(ПараметрыРасчета,
		ТекстОписаниеДанныхДляРаспределенияПрямыхРасходовНаПроизводство());
	
КонецФункции

// Выборка данных

Процедура ПолучитьДанныеДляРаспределенияПрямыхРасходовНаПроизводство(ПараметрыРасчета)
	
	ДопПараметры = ПараметрыРасчета.ДополнительныеПараметрыЗапросаЭтапа;
	ДопПараметры.Вставить("РасчетСебестоимостиВыполнен",  ПараметрыРасчета.Свойство("РасчетСебестоимостиВыполнен"));
	ДопПараметры.Вставить("РасшифровкаРаспределения", 	  Ложь);
	ДопПараметры.Вставить("ВключатьДанныеПроизводства21", Истина);
			
	ПодготовитьПрямыеРасходыКРаспределению(ПараметрыРасчета);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаДляРаспределенияПрямыхРасходовНаПроизводство(ПараметрыРасчета));
	
КонецПроцедуры

// Тексты запросов

// ... общий

Функция ТекстЗапросаБазыРаспределенияПрямыхРасходовНаПроизводство() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхЗатрат) КАК БазаРаспределенияПоПартиям,
	|	Т.Подразделение,
	|	ДД.ГруппаРаспределения,
	|	ДД.ПартияПроизводства,
	|	Т.Стоимость КАК База,
	|	Т.СтоимостьБезНДС КАК БазаБезНДС,
	|	Т.СтоимостьРегл КАК БазаРегл,
	|	Т.СтоимостьУпр КАК БазаУпр
	|ПОМЕСТИТЬ ВтБазыПрямыхРасходов
	|ИЗ ВтГруппыРаспределения КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоМатериальнымЗатратам КАК Т
	|ПО 
	|	ДД.ПартияПроизводства = Т.ПартияПроизводства
	|	И ДД.Подразделение = Т.Подразделение
	|	И ДД.Организация = Т.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаРасходовНаОплатуТруда),
	|	Т.Подразделение,
	|	ДД.ГруппаРаспределения,
	|	ДД.ПартияПроизводства,
	|	Т.Стоимость КАК База,
	|	Т.Стоимость КАК БазаБезНДС,
	|	Т.СтоимостьРегл КАК БазаРегл,
	|	Т.Стоимость КАК БазаУпр
	|ИЗ ВтГруппыРаспределения КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоТрудозатратам КАК Т
	|ПО 
	|	ДД.ПартияПроизводства = Т.ПартияПроизводства
	|	И ДД.Подразделение = Т.Подразделение
	|	И ДД.Организация = Т.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.НормативыОплатыТруда),
	|	Т.Подразделение,
	|	ДД.ГруппаРаспределения,
	|	ДД.ПартияПроизводства,
	|	Т.НормативнаяСтоимость КАК База,
	|	Т.НормативнаяСтоимость КАК БазаБезНДС,
	|	Т.НормативнаяСтоимость КАК БазаРегл,
	|	Т.НормативнаяСтоимость КАК БазаУпр
	|ИЗ ВтГруппыРаспределения КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоТрудозатратам КАК Т
	|ПО 
	|	ДД.ПартияПроизводства = Т.ПартияПроизводства
	|	И ДД.Подразделение = Т.Подразделение
	|	И ДД.Организация = Т.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхИТрудозатрат),
	|	Т.Подразделение,
	|	ДД.ГруппаРаспределения,
	|	ДД.ПартияПроизводства,
	|	Т.Стоимость КАК База,
	|	Т.СтоимостьБезНДС КАК БазаБезНДС,
	|	Т.СтоимостьРегл КАК БазаРегл,
	|	Т.СтоимостьУпр КАК БазаУпр
	|ИЗ ВтГруппыРаспределения КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоМатериальнымЗатратам КАК Т
	|ПО 
	|	ДД.ПартияПроизводства = Т.ПартияПроизводства
	|	И ДД.Подразделение = Т.Подразделение
	|	И ДД.Организация = Т.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхИТрудозатрат),
	|	Т.Подразделение,
	|	ДД.ГруппаРаспределения,
	|	ДД.ПартияПроизводства,
	|	Т.Стоимость КАК База,
	|	Т.Стоимость КАК БазаБезНДС,
	|	Т.СтоимостьРегл КАК БазаРегл,
	|	Т.Стоимость КАК БазаУпр
	|ИЗ ВтГруппыРаспределения КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоТрудозатратам КАК Т
	|ПО 
	|	ДД.ПартияПроизводства = Т.ПартияПроизводства
	|	И ДД.Подразделение = Т.Подразделение
	|	И ДД.Организация = Т.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоПродукции),
	|	Т.Подразделение,
	|	ДД.ГруппаРаспределения,
	|	ДД.ПартияПроизводства,
	|	Т.Количество КАК База,
	|	Т.Количество КАК БазаБезНДС,
	|	Т.Количество КАК БазаРегл,
	|	Т.Количество КАК БазаУпр
	|ИЗ ВтГруппыРаспределения КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоПродукции КАК Т
	|ПО 
	|	ДД.ПартияПроизводства = Т.ПартияПроизводства
	|	И ДД.Подразделение = Т.Подразделение
	|	И ДД.Организация = Т.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоПродукцииСУчетомБудущихВыпусков),
	|	Т.Подразделение,
	|	ДД.ГруппаРаспределения,
	|	ДД.ПартияПроизводства,
	|	Т.Количество + Т.КоличествоПлан КАК База,
	|	Т.Количество + Т.КоличествоПлан КАК БазаБезНДС,
	|	Т.Количество + Т.КоличествоПлан КАК БазаРегл,
	|	Т.Количество + Т.КоличествоПлан КАК БазаУпр
	|ИЗ ВтГруппыРаспределения КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоПродукции КАК Т
	|ПО 
	|	ДД.ПартияПроизводства = Т.ПартияПроизводства
	|	И ДД.Подразделение = Т.Подразделение
	|	И ДД.Организация = Т.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесПродукции),
	|	Т.Подразделение,
	|	ДД.ГруппаРаспределения,
	|	ДД.ПартияПроизводства,
	|	Т.Вес КАК База,
	|	Т.Вес КАК БазаБезНДС,
	|	Т.Вес КАК БазаРегл,
	|	Т.Вес КАК БазаУпр
	|ИЗ ВтГруппыРаспределения КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоПродукции КАК Т
	|ПО 
	|	ДД.ПартияПроизводства = Т.ПартияПроизводства
	|	И ДД.Подразделение = Т.Подразделение
	|	И ДД.Организация = Т.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесПродукцииСУчетомБудущихВыпусков),
	|	Т.Подразделение,
	|	ДД.ГруппаРаспределения,
	|	ДД.ПартияПроизводства,
	|	Т.Вес + Т.ВесПлан КАК База,
	|	Т.Вес + Т.ВесПлан КАК БазаБезНДС,
	|	Т.Вес + Т.ВесПлан КАК БазаРегл,
	|	Т.Вес + Т.ВесПлан КАК БазаУпр
	|ИЗ ВтГруппыРаспределения КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоПродукции КАК Т
	|ПО 
	|	ДД.ПартияПроизводства = Т.ПартияПроизводства
	|	И ДД.Подразделение = Т.Подразделение
	|	И ДД.Организация = Т.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемПродукции),
	|	Т.Подразделение,
	|	ДД.ГруппаРаспределения,
	|	ДД.ПартияПроизводства,
	|	Т.Объем КАК База,
	|	Т.Объем КАК БазаБезНДС,
	|	Т.Объем КАК БазаРегл,
	|	Т.Объем КАК БазаУпр
	|ИЗ ВтГруппыРаспределения КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоПродукции КАК Т
	|ПО 
	|	ДД.ПартияПроизводства = Т.ПартияПроизводства
	|	И ДД.Подразделение = Т.Подразделение
	|	И ДД.Организация = Т.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемПродукцииСУчетомБудущихВыпусков),
	|	Т.Подразделение,
	|	ДД.ГруппаРаспределения,
	|	ДД.ПартияПроизводства,
	|	Т.Объем + Т.ОбъемПлан КАК База,
	|	Т.Объем + Т.ОбъемПлан КАК БазаБезНДС,
	|	Т.Объем + Т.ОбъемПлан КАК БазаРегл,
	|	Т.Объем + Т.ОбъемПлан КАК БазаУпр
	|ИЗ ВтГруппыРаспределения КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоПродукции КАК Т
	|ПО 
	|	ДД.ПартияПроизводства = Т.ПартияПроизводства
	|	И ДД.Подразделение = Т.Подразделение
	|	И ДД.Организация = Т.Организация
	|ИНДЕКСИРОВАТЬ ПО
	|	БазаРаспределенияПоПартиям,
	|	ГруппаРаспределения;
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции
	
Функция ТекстЗапросаДляРаспределенияПрямыхРасходовНаПроизводство(ПараметрыРасчета) Экспорт
	
	ТекстЗапроса = ""
		+ ТекстЗапросаБазыРаспределенияПрямыхРасходовНаПроизводство()
		// выборка данных
		+ ТекстОписаниеДанныхДляРаспределенияПрямыхРасходовНаПроизводство()
		+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	""ТекстЗапросаДляРаспределенияПрямыхРасходовНаПроизводство""            КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)                   КАК ТипЗаписи,
		|	ИСТИНА                                                                  КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)    КАК РазделУчета,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                                  КАК ВидДвижения,
		|	&КонецПериода                                                           КАК Период,
		|	ДД.Регистратор                                                          КАК Регистратор,
		|	ДД.Организация                                                          КАК Организация,
		|	ДД.Подразделение                                                        КАК Подразделение,
		|	ДД.НаправлениеДеятельности                                              КАК НаправлениеДеятельности,
		|	ДД.СтатьяРасходов                                                       КАК СтатьяРасходов,
		|	ДД.АналитикаРасходов                                                    КАК АналитикаРасходов,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимостьПроизводства) КАК ХозяйственнаяОперация,
		|	Партии.ГруппаПродукции                                                  КАК ГруппаПродукции,
		|	ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукцииСУчетомБудущихВыпусков) КАК ПравилоОтнесенияНаВыпуск,
		|	ВЫБОР 
		|		КОГДА НЕ ДД.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства)
		|			ТОГДА 0
		|		ИНАЧЕ
		|			1
		|	КОНЕЦ КАК ДоляСтоимости,
		|	ВЫБОР 
		|		КОГДА НЕ ДД.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства)
		|			ТОГДА 0
		|		ИНАЧЕ
		|			1
		|	КОНЕЦ КАК ДоляСтоимостиБезНДС,
		|	ВЫБОР 
		|		КОГДА НЕ ДД.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства)
		|			И НЕ ДД.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства)
		|			ТОГДА 0
		|		ИНАЧЕ
		|			1
		|	КОНЕЦ КАК ДоляСтоимостиРегл,
		|	ВЫБОР 
		|		КОГДА НЕ ДД.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства)
		|			ТОГДА 0
		|		ИНАЧЕ
		|			1
		|	КОНЕЦ КАК ДоляСтоимостиУпр,
		|	НЕОПРЕДЕЛЕНО                                                            КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО                                                            КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО                                                            КАК КорСтатьяАктивовПассивов,
		|	НЕОПРЕДЕЛЕНО                                                            КАК КорАналитикаАктивовПассивов,
		|	ДД.Подразделение                                                        КАК КорПодразделение,
		|	Партии.НаправлениеДеятельности                                          КАК КорНаправлениеДеятельности,
		|	Партии.Ссылка                                                           КАК ПартияПроизводства,
		|	НЕОПРЕДЕЛЕНО                                                            КАК ЗаказНаПроизводство,
		|	0                                                                       КАК КодСтрокиПродукция,
		|	ДД.СтатьяКалькуляции                                                    КАК СтатьяКалькуляции,
		|	НЕОПРЕДЕЛЕНО                                                            КАК ИдентификаторСтроки
		|ИЗ
		|	ПрямыеРасходыКРаспределению КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК Партии
		|			ПО	Партии.Ссылка = ДД.АналитикаРасходов
		|			И	(ДД.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|				ИЛИ Партии.НаправлениеДеятельности = ДД.НаправлениеДеятельности)
		|			И Партии.Организация = ДД.Организация
		|ГДЕ ДД.АналитикаРасходов ССЫЛКА Справочник.ПартииПроизводства
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	""ТекстЗапросаДляРаспределенияПрямыхРасходовНаПроизводство""            КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)                   КАК ТипЗаписи,
		|	ИСТИНА                                                                  КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)    КАК РазделУчета,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                                  КАК ВидДвижения,
		|	&КонецПериода                                                           КАК Период,
		|	ДД.Регистратор                                                          КАК Регистратор,
		|	ДД.Организация                                                          КАК Организация,
		|	ДД.Подразделение                                                        КАК Подразделение,
		|	ДД.НаправлениеДеятельности                                              КАК НаправлениеДеятельности,
		|	ДД.СтатьяРасходов                                                       КАК СтатьяРасходов,
		|	ДД.АналитикаРасходов                                                    КАК АналитикаРасходов,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимостьПроизводства) КАК ХозяйственнаяОперация,
		|	Партии.ГруппаПродукции                                                  КАК ГруппаПродукции,
		|	ДД.ПравилоОтнесенияНаВыпуск                                             КАК ПравилоОтнесенияНаВыпуск,
		|	ВЫБОР 
		|		КОГДА НЕ ДД.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства)
		|			ТОГДА 0
		|		ИНАЧЕ
		|			ВЫРАЗИТЬ(ЕСТЬNULL(Базы.База, 0) КАК ЧИСЛО(28, 10))
		|	КОНЕЦ КАК ДоляСтоимости,
		|	ВЫБОР 
		|		КОГДА НЕ ДД.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства)
		|			ТОГДА 0
		|		ИНАЧЕ
		|			ВЫРАЗИТЬ(ЕСТЬNULL(Базы.БазаБезНДС, 0) КАК ЧИСЛО(28, 10))
		|	КОНЕЦ КАК ДоляСтоимостиБезНДС,
		|	ВЫБОР 
		|		КОГДА НЕ ДД.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства)
		|			И НЕ ДД.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства)
		|			ТОГДА 0
		|		ИНАЧЕ
		|			ВЫРАЗИТЬ(ЕСТЬNULL(Базы.БазаРегл, 0) КАК ЧИСЛО(28, 10))
		|	КОНЕЦ КАК ДоляСтоимостиРегл,
		|	ВЫБОР 
		|		КОГДА НЕ ДД.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства)
		|			ТОГДА 0
		|		ИНАЧЕ
		|			ВЫРАЗИТЬ(ЕСТЬNULL(Базы.БазаУпр, 0) КАК ЧИСЛО(28, 10))
		|	КОНЕЦ КАК ДоляСтоимостиУпр,
		|	НЕОПРЕДЕЛЕНО                                                            КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО                                                            КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО                                                            КАК КорСтатьяАктивовПассивов,
		|	НЕОПРЕДЕЛЕНО                                                            КАК КорАналитикаАктивовПассивов,
		|	Базы.Подразделение                                                      КАК КорПодразделение,
		|	Партии.НаправлениеДеятельности                                          КАК КорНаправлениеДеятельности,
		|	Базы.ПартияПроизводства                                                 КАК ПартияПроизводства,
		|	НЕОПРЕДЕЛЕНО                                                            КАК ЗаказНаПроизводство,
		|	0                                                                       КАК КодСтрокиПродукция,
		|	ДД.СтатьяКалькуляции                                                    КАК СтатьяКалькуляции,
		|	НЕОПРЕДЕЛЕНО                                                            КАК ИдентификаторСтроки
		|ИЗ
		|	ПрямыеРасходыКРаспределению КАК ДД 
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтБазыПрямыхРасходов КАК Базы
		|			ПО	ДД.БазаРаспределенияПоПартиям = Базы.БазаРаспределенияПоПартиям
		|				И ДД.АналитикаРасходов = Базы.ГруппаРаспределения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК Партии
		|			ПО	Партии.Ссылка = Базы.ПартияПроизводства
		|			И	(ДД.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|				ИЛИ Партии.НаправлениеДеятельности = ДД.НаправлениеДеятельности)
		|			И Партии.Организация = ДД.Организация 
		|ГДЕ НЕ ДД.АналитикаРасходов ССЫЛКА Справочник.ПартииПроизводства
		|";
		
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ПодставитьШаблоныВесаИОбъемаВТекстЗапроса(ТекстЗапроса, "СН");
	
КонецФункции

// ... описания данных

Функция ТекстОписаниеДанныхДляРаспределенияПрямыхРасходовНаПроизводство() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	""ТекстОписаниеДанныхДляРаспределенияПрямыхРасходовНаПроизводство""     КАК ЗапросИсточник,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)                   КАК ТипЗаписи,
	|	ЛОЖЬ                                                                    КАК РасчетЗавершен,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)    КАК РазделУчета,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                                  КАК ВидДвижения,
	|	ДД.Период                                                               КАК Период,
	|	ДД.Регистратор                                                          КАК Регистратор,
	|	ДД.Организация                                                          КАК Организация,
	|	ДД.Подразделение                                                        КАК Подразделение,
	|	ДД.НаправлениеДеятельности                                              КАК НаправлениеДеятельности,
	|	ДД.СтатьяРасходов                                                       КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                                    КАК АналитикаРасходов,
	|	ДД.ХозяйственнаяОперация                                                КАК ХозяйственнаяОперация,
	|	ДД.ГруппаПродукции                                                      КАК ГруппаПродукции,
	|	ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка)            КАК ПравилоОтнесенияНаВыпуск,
	|	0                                                                       КАК ДоляСтоимости,
	|	0                                                                       КАК ДоляСтоимостиБезНДС,
	|	0                                                                       КАК ДоляСтоимостиРегл,
	|	0                                                                       КАК ДоляСтоимостиУпр,
	|	ДД.КорСтатьяРасходов                                                    КАК КорСтатьяРасходов,
	|	ДД.КорАналитикаРасходов                                                 КАК КорАналитикаРасходов,
	|	АП.Статья                                                               КАК КорСтатьяАктивовПассивов,
	|	АП.Аналитика                                                            КАК КорАналитикаАктивовПассивов,
	|	ДД.КорПодразделение                                                     КАК КорПодразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)               КАК КорНаправлениеДеятельности,
	|	НЗП.ПартияПроизводства                                                  КАК ПартияПроизводства,
	|	НЗП.ЗаказНаПроизводство                                                 КАК ЗаказНаПроизводство,
	|	НЗП.КодСтрокиПродукция                                                  КАК КодСтрокиПродукция,
	|	ДД.КорСтатьяКалькуляции                                                 КАК СтатьяКалькуляции,
	|	ДД.ИдентификаторСтроки                                                  КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК НЗП
	|		ПО ИСТИНА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеАктивыПассивы КАК АП
	|		ПО ИСТИНА
	|";
	
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// ... формирования временные таблиц

Процедура ПодготовитьПрямыеРасходыКРаспределению(ПараметрыРасчета)
	
	ИнициализироватьТаблицуОВЗ(ПараметрыРасчета);
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	Запрос.УстановитьПараметр("ВариантыРаспределенияРасходов", 
		ОбщегоНазначенияУТКлиентСервер.Массив(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства));
	Запрос.УстановитьПараметр("Регистратор",
		?(ПараметрыРасчета.Свойство("Регистратор"), ПараметрыРасчета.Регистратор, Неопределено));
	
	Запрос.Текст = Документы.РаспределениеПрочихЗатрат.ТекстЗапросаПоступилоПрочихРасходов("ФактическийРасчет", Ложь);
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, 
		,,,НСтр("ru = 'Получение постатейных затрат прямых расходов для распределения.';
				|en = 'Getting itemized direct expenses for allocation.'"));

	Запрос.Текст = 
		"
		|ВЫБРАТЬ
		|	ДД.Ссылка КАК Регистратор,
		|	ДД.Дата КАК Дата,
		|	ДД.НазначениеНастройкиРаспределения,
		|	ДД.Организация,
		|	ДД.НаправлениеРаспределения,
		|	ДД.БазаРаспределенияПоПартиям,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ВЫБОР КОГДА ДД.УправленческийУчет ТОГДА 
		|		ДД.СтатьяРасходов.ВариантРаспределенияРасходовУпр 
		|	ИНАЧЕ
		|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)
		|	КОНЕЦ КАК ВариантРаспределенияРасходовУпр,
		|	ВЫБОР КОГДА ДД.РегламентированныйУчет ТОГДА 
		|		ДД.СтатьяРасходов.ВариантРаспределенияРасходовРегл 
		|	ИНАЧЕ
		|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)
		|	КОНЕЦ КАК ВариантРаспределенияРасходовРегл,
		|	ВЫБОР КОГДА ДД.НалоговыйУчет ТОГДА 
		|		ДД.СтатьяРасходов.ВариантРаспределенияРасходовНУ 
		|	ИНАЧЕ
		|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)
		|	КОНЕЦ КАК ВариантРаспределенияРасходовНУ,
		|	ДД.СтатьяКалькуляции,
		|	ВЫБОР 
		|		КОГДА ДД.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхИТрудозатрат)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымИТрудозатратам)
		|		КОГДА ДД.БазаРаспределенияПоПартиям В (ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаРасходовНаОплатуТруда),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоРаботУказанныхВидов),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.НормативыОплатыТруда))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоТрудозатратам)
		|		КОГДА ДД.БазаРаспределенияПоПартиям В (ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СуммаМатериальныхЗатрат),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.НормативРасходаМатериала),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоУказанныхМатериалов),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемУказанныхМатериалов),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесУказанныхМатериалов))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымЗатратам)
		|		КОГДА ДД.БазаРаспределенияПоПартиям В (ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоПродукции),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесПродукции),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемПродукции),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ПлановаяСтоимостьПродукции))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукции)
		|		КОГДА ДД.БазаРаспределенияПоПартиям В (ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоПродукцииСУчетомБудущихВыпусков),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемПродукцииСУчетомБудущихВыпусков),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесПродукцииСУчетомБудущихВыпусков),
		|												ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ПлановаяСтоимостьПродукцииСУчетомБудущихВыпусков))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукцииСУчетомБудущихВыпусков)
		|	КОНЕЦ КАК ПравилоОтнесенияНаВыпуск
		|ПОМЕСТИТЬ ПрямыеРасходыКРаспределению
		|ИЗ
		|	Документ.РаспределениеПрочихЗатрат КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасходыКРаспределению КАК Т
		|		ПО (Т.Организация = ДД.Организация)
		|			И (Т.Подразделение = ДД.Подразделение)
		|			И (Т.СтатьяРасходов = ДД.СтатьяРасходов)
		|			И (Т.АналитикаРасходов = ДД.АналитикаРасходов)
		|			И (Т.НаправлениеДеятельности = ДД.НаправлениеДеятельности)
		|ГДЕ
		|	ДД.НазначениеНастройкиРаспределения = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаСебестоимостьПроизводства)
		|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ДД.Организация В(&МассивОрганизаций)
		|	И ДД.Проведен
		|	И (ДД.Ссылка = &Регистратор
		|			ИЛИ &Регистратор = НЕОПРЕДЕЛЕНО)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДД.АналитикаРасходов,
		|	ДД.Организация,
		|	Регистратор,
		|	ДД.БазаРаспределенияПоПартиям
		|;
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.БазаРаспределенияПоПартиям КАК БазаРаспределенияПоПартиям,
		|	ДД.АналитикаРасходов КАК ГруппаРаспределения,
		|	ДД.Подразделение КАК Подразделение,
		|	ДД.Организация КАК Организация,
		|	Т.Ссылка КАК ПартияПроизводства
		|ПОМЕСТИТЬ ВтГруппыРаспределения
		|ИЗ ПрямыеРасходыКРаспределению КАК ДД
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК Т
		|ПО Т.Ссылка = ДД.АналитикаРасходов
		|	И Т.Организация = ДД.Организация
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов) = ТИП(Справочник.ПартииПроизводства)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.БазаРаспределенияПоПартиям,
		|	ДД.АналитикаРасходов,
		|	ДД.Подразделение КАК Подразделение,
		|	ДД.Организация КАК Организация,
		|	Т.Ссылка
		|ИЗ ПрямыеРасходыКРаспределению КАК ДД
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК Т
		|ПО Т.Номенклатура = ДД.АналитикаРасходов
		|	И Т.Организация = ДД.Организация
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов) = ТИП(Справочник.Номенклатура)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.БазаРаспределенияПоПартиям,
		|	ДД.АналитикаРасходов,
		|	ДД.Подразделение КАК Подразделение,
		|	ДД.Организация КАК Организация,
		|	Т.Ссылка
		|ИЗ ПрямыеРасходыКРаспределению КАК ДД
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК Т
		|ПО Т.ГруппаПродукции = ДД.АналитикаРасходов
		|	И Т.Организация = ДД.Организация
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов) = ТИП(Справочник.ГруппыАналитическогоУчетаНоменклатуры)
		//++ НЕ УТКА
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.БазаРаспределенияПоПартиям,
		|	ДД.АналитикаРасходов,
		|	ДД.Подразделение КАК Подразделение,
		|	ДД.Организация КАК Организация,
		|	Т.Ссылка
		|ИЗ ПрямыеРасходыКРаспределению КАК ДД
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК Т
		|ПО Т.Документ = ДД.АналитикаРасходов
		|	И Т.Организация = ДД.Организация
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов) = ТИП(Документ.ЗаказНаПроизводство2_2)
		//-- НЕ УТКА
		|
		|ИНДЕКСИРОВАТЬ ПО 
		|	ПартияПроизводства,
		|	Подразделение,
		|	Организация;";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,
		,,,НСтр("ru = 'Инициализация таблиц для распределения затрат.';
				|en = 'Initializing tables for cost allocation.'"));
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыЭтапа16_РаспределениеПрочихНаВыходныеИзделия

// Инициализация данных

Функция ТаблицаДляРаспределенияПрочихРасходовНЗП(ПараметрыРасчета)
	
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ТаблицаДляРаспределенияПартий(ПараметрыРасчета,
		ТекстОписаниеДанныхДляПрочихРасходовНЗП());
	
КонецФункции

// Выборка данных

Процедура ПолучитьДанныеДляПрочихРасходовНЗП(ПараметрыРасчета)
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаДляПрочихРасходовНЗП(ПараметрыРасчета));
	
КонецПроцедуры

// Тексты запросов

// ... общий

Функция ТекстЗапросаДляПрочихРасходовНЗП(ПараметрыРасчета = Неопределено) Экспорт

	ТекстФормированияВременныхТаблиц = ""
		// подготовка временных таблиц
		+ ТекстПартииДляОтнесенияРасходов()
		+ ТекстМатериальныеЗатратыНЗП()
		+ ТекстТрудозатратыНЗП()
		+ ТекстМатериальныеЗатратыИТрудозатратыНЗП()
		+ ТекстВыпущеннаяПродукция()
		+ ТекстПрочиеРасходыНЗПИнициализация()
		+ РасчетСебестоимостиЛокализация.ДополнитьЗапросСлужебнымиТаблицами()
		//++ НЕ УТКА
		+ ТекстОстаткиБазРаспределения()
		//-- НЕ УТКА
		+ ТекстКоэффициентыПриведения();

	ТекстыВыборкиДанных = Новый Массив;
	ТекстыВыборкиДанных.Добавить(ТекстОписаниеДанныхДляПрочихРасходовНЗП());
	ТекстыВыборкиДанных.Добавить(ТекстПриходыПрочихРасходовНЗП());
	ТекстыВыборкиДанных.Добавить(ТекстПриходыПрочихРасходовНЗПНаСебестоимостьПроизводства());
	ТекстыВыборкиДанных.Добавить(ТекстРасходыПрочихРасходовНЗППоМатериалам());
	ТекстыВыборкиДанных.Добавить(ТекстРасходыПрочихРасходовНЗППоТрудозатратам());
	ТекстыВыборкиДанных.Добавить(ТекстРасходыПрочихРасходовНЗППоМатериальнымИТрудозатратам());
	ТекстыВыборкиДанных.Добавить(ТекстРасходыПрочихРасходовНЗППоПродукции());
	РасчетСебестоимостиЛокализация.ДополнитьЗапросРасходовНЗПЛокализованнымиДанными(ТекстыВыборкиДанных);

	ТекстыВыборкиДанных = ОбъединитьТексты(ТекстыВыборкиДанных);

	Возврат ТекстФормированияВременныхТаблиц
		+ ТекстыВыборкиДанных;

КонецФункции

// ... описания данных

Функция ТекстОписаниеДанныхДляПрочихРасходовНЗП() Экспорт
	ТекстЗапроса = 
 	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	""ТекстОписаниеДанныхДляПрочихРасходовНЗП""								КАК ЗапросИсточник,
	|	0 																		КАК Приоритет,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)					КАК ТипЗаписи,
	|	ЛОЖЬ 																	КАК РасчетЗавершен,
	|	ДД.ВидДвижения 															КАК ВидДвижения,
	|	ДД.Период 																КАК Период,
	|	ДД.Регистратор 															КАК Регистратор,
	|	ДД.Организация 															КАК Организация,
	|	ДД.Подразделение 														КАК Подразделение,
	|	ДД.ПартияПроизводства													КАК ПартияПроизводства,
	|	ДД.АналитикаПартииВыпуска												КАК АналитикаПартииВыпуска,
	|	ДД.ЗаказНаПроизводство 													КАК ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция 													КАК КодСтрокиПродукция,
	|	ДД.НаправлениеДеятельности												КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка) 				КАК Спецификация,
	|	ДД.Этап 												 				КАК Этап,
	|	ДД.СтатьяКалькуляции 													КАК СтатьяКалькуляции,
	|	ДД.СтатьяРасходов 														КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов 													КАК АналитикаРасходов,
	|	ДД.ГруппаПродукции 														КАК ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск												КАК ПравилоОтнесенияНаВыпуск,
	|	ДД.АналитикаУчетаПродукции 												КАК АналитикаУчетаПродукции,
	|	ДД.КорАналитикаУчетаПартий												КАК КорАналитикаУчетаПартий,
	|	ДД.НаправлениеДеятельности												КАК КорНаправлениеДеятельности,
	|	0 																		КАК Знаменатель,
	|	ДД.КоличествоПродукции													КАК КоличествоПродукции,
	|	0																		КАК ДоляСтоимости,
	|	ДД.Стоимость 															КАК Стоимость,
	|	ДД.СтоимостьБезНДС 														КАК СтоимостьБезНДС,
	|	ДД.СтоимостьРегл 														КАК СтоимостьРегл,
	|	ДД.ПостояннаяРазница 													КАК ПостояннаяРазница,
	|	ДД.ВременнаяРазница 													КАК ВременнаяРазница,
	|	ДД.УдалитьПоказательОтнесенияНаВыпуск									КАК ПоказательОтнесенияНаВыпуск,
	|	ДД.УдалитьПоказательОтнесенияНаВыпускБезНДС								КАК ПоказательОтнесенияНаВыпускБезНДС,
	|	ДД.УдалитьПоказательОтнесенияНаВыпускРегл								КАК ПоказательОтнесенияНаВыпускРегл,
	|	ДД.УдалитьПоказательОтнесенияНаВыпускУпр								КАК ПоказательОтнесенияНаВыпускУпр,
	|	ДД.ПоказательОтнесенияНаПартию											КАК ПоказательОтнесенияНаПартию,
	|	ДД.ПоказательОтнесенияНаПартиюБезНДС									КАК ПоказательОтнесенияНаПартиюБезНДС,
	|	ДД.ПоказательОтнесенияНаПартиюРегл										КАК ПоказательОтнесенияНаПартиюРегл,
	|	ДД.ПоказательОтнесенияНаПартиюУпр										КАК ПоказательОтнесенияНаПартиюУпр,
	|	ЛОЖЬ 																	КАК Первичное,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) 				КАК ХозяйственнаяОперация,
	|	ДД.РазделУчета 															КАК РазделУчета,
	|	ДД.ВидЗапасов 															КАК ВидЗапасов,
	|	НЕОПРЕДЕЛЕНО 															КАК ВидДеятельностиНДС,
	|	ДД.ДокументДвижения 													КАК ДокументДвижения,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) 							КАК Назначение,
	|	ДД.ДокументИсточник 													КАК ДокументИсточник,
	|	ДД.ДокументВыпуска 														КАК ДокументВыпуска,
	|	ДД.Продукция 															КАК Продукция,
	|	ДД.ХарактеристикаПродукции 												КАК ХарактеристикаПродукции
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|";
	
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОписаниеДанныхДляПартийОтнесенияРасходов() Экспорт
	ТекстЗапроса = 
 	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	ДД.Организация                                 КАК Организация,
	|	ДД.Подразделение                               КАК Подразделение,
	|	ДД.ПартияПроизводства                          КАК ПартияПроизводства,
	|	ДД.АналитикаПартииВыпуска                      КАК АналитикаПартииВыпуска,
	|	ДД.ЗаказНаПроизводство                         КАК ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция                          КАК КодСтрокиПродукция,
	|	ДД.НаправлениеДеятельности                     КАК НаправлениеДеятельности,
	|	ДД.Этап                                        КАК Этап,
	|	ДД.СтатьяКалькуляции                           КАК СтатьяКалькуляции,
	|	ДД.СтатьяРасходов                              КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                           КАК АналитикаРасходов,
	|	ДД.ГруппаПродукции                             КАК ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск                    КАК ПравилоОтнесенияНаВыпуск,
	|	ДД.УдалитьПоказательОтнесенияНаВыпуск          КАК ПоказательОстаток,
	|	ДД.ДокументИсточник                            КАК ДокументИсточник,
	|	ДД.ДокументВыпуска                             КАК ДокументВыпуска
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|";
	
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

// ... формирования временные таблиц

Функция ТекстПартииДляОтнесенияРасходов()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДД.Организация                                 КАК Организация,
		|	ДД.Подразделение                               КАК Подразделение,
		|	ДД.ПартияПроизводства                          КАК ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство                         КАК ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция                          КАК КодСтрокиПродукция,
		|	ДД.НаправлениеДеятельности                     КАК НаправлениеДеятельности,
		|	ДД.Этап                                        КАК Этап,
		|	ДД.СтатьяКалькуляции                           КАК СтатьяКалькуляции,
		|	ДД.СтатьяРасходов                              КАК СтатьяРасходов,
		|	ДД.АналитикаРасходов                           КАК АналитикаРасходов,
		|	ДД.ГруппаПродукции                             КАК ГруппаПродукции,
		|	ДД.ПравилоОтнесенияНаВыпуск                    КАК ПравилоОтнесенияНаВыпуск,
		|	СУММА(ДД.ДоляСтоимостиОстаток)                 КАК ДоляСтоимостиОстаток
		|ПОМЕСТИТЬ втПартииДляОтнесенияРасходов
		|ИЗ
		|	(ВЫБРАТЬ
		|		Доли.Организация                                 КАК Организация,
		|		Доли.КорПодразделение                            КАК Подразделение,
		|		Доли.ПартияПроизводства                          КАК ПартияПроизводства,
		|		Доли.ЗаказНаПроизводство                         КАК ЗаказНаПроизводство,
		|		Доли.КодСтрокиПродукция                          КАК КодСтрокиПродукция,
		|		Доли.КорНаправлениеДеятельности                  КАК НаправлениеДеятельности,
		|		ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка) КАК Этап,
		|		Доли.СтатьяКалькуляции                           КАК СтатьяКалькуляции,
		|		Доли.СтатьяРасходов                              КАК СтатьяРасходов,
		|		Доли.АналитикаРасходов                           КАК АналитикаРасходов,
		|		Доли.ГруппаПродукции                             КАК ГруппаПродукции,
		|		Доли.ПравилоОтнесенияНаВыпуск                    КАК ПравилоОтнесенияНаВыпуск,
		|		0                                                КАК ДоляСтоимостиОстаток
		|	ИЗ
		|		ДолиПроизводственныхРасходов КАК Доли
		|	ГДЕ
		|		НЕ (Доли.ДоляСтоимости = 0
		|			И Доли.ДоляСтоимостиБезНДС = 0
		|			И Доли.ДоляСтоимостиРегл = 0
		|			И Доли.ДоляСтоимостиУпр = 0)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Доли.Организация                                 КАК Организация,
		|		Доли.КорПодразделение                            КАК Подразделение,
		|		Доли.ПартияПроизводства                          КАК ПартияПроизводства,
		|		Доли.ЗаказНаПроизводство                         КАК ЗаказНаПроизводство,
		|		Доли.КодСтрокиПродукция                          КАК КодСтрокиПродукция,
		|		Доли.КорНаправлениеДеятельности                  КАК НаправлениеДеятельности,
		|		ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка) КАК Этап,
		|		Доли.СтатьяКалькуляции                           КАК СтатьяКалькуляции,
		|		Доли.СтатьяРасходов                              КАК СтатьяРасходов,
		|		Доли.АналитикаРасходов                           КАК АналитикаРасходов,
		|		Доли.ГруппаПродукции                             КАК ГруппаПродукции,
		|		Доли.ПравилоОтнесенияНаВыпуск                    КАК ПравилоОтнесенияНаВыпуск,
		|		0                                                КАК ДоляСтоимостиОстаток
		|	ИЗ
		|		ПрямыеПроизводственныеРасходы КАК Доли
		|	ГДЕ
		|		НЕ (Доли.ДоляСтоимости = 0
		|			И Доли.ДоляСтоимостиБезНДС = 0
		|			И Доли.ДоляСтоимостиРегл = 0
		|			И Доли.ДоляСтоимостиУпр = 0)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		// Для типизации полей во временной таблице.
		|	ВЫБРАТЬ ПЕРВЫЕ 0
		|		ДД.Организация                                 КАК Организация,
		|		ДД.Подразделение                               КАК Подразделение,
		|		ДД.ПартияПроизводства                          КАК ПартияПроизводства,
		|		ДД.ЗаказНаПроизводство                         КАК ЗаказНаПроизводство,
		|		ДД.КодСтрокиПродукция                          КАК КодСтрокиПродукция,
		|		ДД.НаправлениеДеятельности                     КАК НаправлениеДеятельности,
		|		ДД.Этап                                        КАК Этап,
		|		ДД.СтатьяКалькуляции                           КАК СтатьяКалькуляции,
		|		ДД.СтатьяРасходов                              КАК СтатьяРасходов,
		|		ДД.АналитикаРасходов                           КАК АналитикаРасходов,
		|		ДД.ГруппаПродукции                             КАК ГруппаПродукции,
		|		ДД.ПравилоОтнесенияНаВыпуск                    КАК ПравилоОтнесенияНаВыпуск,
		|		ДД.ДоляСтоимости                               КАК ДоляСтоимостиОстаток
		|	ИЗ
		|		РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
		//++ НЕ УТКА
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Организация                                 КАК Организация,
		|		ДД.Подразделение                               КАК Подразделение,
		|		ДД.ПартияПроизводства                          КАК ПартияПроизводства,
		|		ДД.ЗаказНаПроизводство                         КАК ЗаказНаПроизводство,
		|		ДД.КодСтрокиПродукция                          КАК КодСтрокиПродукция,
		|		ДД.НаправлениеДеятельности                     КАК НаправлениеДеятельности,
		|		ДД.Этап                                        КАК Этап,
		|		ДД.СтатьяКалькуляции                           КАК СтатьяКалькуляции,
		|		ДД.СтатьяРасходов                              КАК СтатьяРасходов,
		|		ДД.АналитикаРасходов                           КАК АналитикаРасходов,
		|		ДД.ГруппаПродукции                             КАК ГруппаПродукции,
		|		ДД.ПравилоОтнесенияНаВыпуск                    КАК ПравилоОтнесенияНаВыпуск,
		|		ДД.ДоляСтоимостиОстаток                        КАК ДоляСтоимостиОстаток
		|	ИЗ
		|		РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
		|			&ГраницаКонецПредыдущегоПериода,
		|			Организация В (&МассивОрганизаций)) КАК ДД
		|	ГДЕ
		|		ЕСТЬNULL(ДД.СтоимостьОстаток,0) <> 0
		|		ИЛИ ЕСТЬNULL(ДД.СтоимостьБезНДСОстаток,0) <> 0
		|		ИЛИ ЕСТЬNULL(ДД.СтоимостьУпрОстаток,0) <> 0
		|		ИЛИ ЕСТЬNULL(ДД.СтоимостьРеглОстаток,0) <> 0
		|		ИЛИ ЕСТЬNULL(ДД.ПостояннаяРазницаОстаток,0) <> 0
		|		ИЛИ ЕСТЬNULL(ДД.ВременнаяРазницаОстаток,0) <> 0
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Организация                                 КАК Организация,
		|		ДД.Подразделение                               КАК Подразделение,
		|		ДД.ПартияПроизводства                          КАК ПартияПроизводства,
		|		ДД.ЗаказНаПроизводство                         КАК ЗаказНаПроизводство,
		|		ДД.КодСтрокиПродукция                          КАК КодСтрокиПродукция,
		|		ДД.НаправлениеДеятельности                     КАК НаправлениеДеятельности,
		|		ДД.Этап                                        КАК Этап,
		|		ДД.СтатьяКалькуляции                           КАК СтатьяКалькуляции,
		|		ДД.СтатьяРасходов                              КАК СтатьяРасходов,
		|		ДД.АналитикаРасходов                           КАК АналитикаРасходов,
		|		ДД.ГруппаПродукции                             КАК ГруппаПродукции,
		|		ДД.ПравилоОтнесенияНаВыпуск                    КАК ПравилоОтнесенияНаВыпуск,
		|		ДД.ДоляСтоимости                               КАК ДоляСтоимостиОстаток
		|	ИЗ
		|		ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачальныеОстаткиНЗППоПартиямПроизводства КАК НачальныеОстатки
		|			ПО НачальныеОстатки.Ссылка = ДД.Регистратор
		|	ГДЕ
		|		ДД.Стоимость <> 0
		|		ИЛИ ДД.СтоимостьБезНДС <> 0
		|		ИЛИ ДД.СтоимостьУпр <> 0
		|		ИЛИ ДД.СтоимостьРегл <> 0
		|		ИЛИ ДД.ПостояннаяРазница <> 0
		|		ИЛИ ДД.ВременнаяРазница <> 0
		//-- НЕ УТКА
		|	) КАК ДД
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция,
		|	ДД.НаправлениеДеятельности,
		|	ДД.Этап,
		|	ДД.СтатьяКалькуляции,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.ГруппаПродукции,
		|	ДД.ПравилоОтнесенияНаВыпуск
		|;
		|
		|////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.ПартияПроизводства                          КАК ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство                         КАК ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция                          КАК КодСтрокиПродукция,
		|	ДД.ПартияПроизводства                          КАК ДокументВыпуска,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаПартииВыпуска
		|ПОМЕСТИТЬ ИдентификаторыПартий
		|ИЗ
		|	втПартииДляОтнесенияРасходов КАК ДД
		|
		|ГДЕ
		|	ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
		//++ Устарело_Производство21
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.ПартияПроизводства                          КАК ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство                         КАК ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция                          КАК КодСтрокиПродукция,
		|	ДД.ЗаказНаПроизводство                         КАК ДокументВыпуска,
		|	Выпуск.АналитикаУчетаНоменклатуры              КАК АналитикаПартииВыпуска
		|ИЗ
		|	втПартииДляОтнесенияРасходов КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции.Товары КАК Выпуск
		|		ПО ДД.ЗаказНаПроизводство = Выпуск.Ссылка
		|		И ДД.КодСтрокиПродукция = Выпуск.КодСтроки
		//++ НЕ УТКА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДД.ПартияПроизводства                          КАК ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство                         КАК ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция                          КАК КодСтрокиПродукция,
		|	ДД.ЗаказНаПроизводство                         КАК ДокументВыпуска,
		|	МАКСИМУМ(МЛ.Ссылка)                            КАК АналитикаПартииВыпуска
		|ИЗ
		|	втПартииДляОтнесенияРасходов КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛистПроизводства КАК МЛ
		|		ПО ДД.ЗаказНаПроизводство = МЛ.Распоряжение
		|		И ДД.КодСтрокиПродукция = МЛ.КодСтроки
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция
		//-- НЕ УТКА
		//-- Устарело_Производство21
		|;
		|
		|////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.Организация                                 КАК Организация,
		|	ДД.Подразделение                               КАК Подразделение,
		|	ДД.ПартияПроизводства                          КАК ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство                         КАК ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция                          КАК КодСтрокиПродукция,
		|	ДД.НаправлениеДеятельности                     КАК НаправлениеДеятельности,
		|	ДД.Этап                                        КАК Этап,
		|	ДД.СтатьяКалькуляции                           КАК СтатьяКалькуляции,
		|	ДД.СтатьяРасходов 							   КАК СтатьяРасходов,
		|	ВЫБОР 
		|		КОГДА Статья.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат)
		|		ТОГДА ВтОВЗ.ВариантРаспределенияРасходовУпр
		|		ИНАЧЕ Статья.ВариантРаспределенияРасходовУпр
		|	КОНЕЦ КАК ВариантРаспределенияРасходовУпр,
		|	ВЫБОР 
		|		КОГДА Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат)
		|		ТОГДА ВтОВЗ.ВариантРаспределенияРасходовРегл
		|		ИНАЧЕ Статья.ВариантРаспределенияРасходовРегл
		|	КОНЕЦ КАК ВариантРаспределенияРасходовРегл,
		|	ВЫБОР 
		|		КОГДА Статья.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат)
		|		ТОГДА ВтОВЗ.ВариантРаспределенияРасходовНУ
		|		ИНАЧЕ Статья.ВариантРаспределенияРасходовНУ
		|	КОНЕЦ КАК ВариантРаспределенияРасходовНУ,
		|	ДД.АналитикаРасходов                           КАК АналитикаРасходов,
		|	ДД.ГруппаПродукции                             КАК ГруппаПродукции,
		|	ДД.ПравилоОтнесенияНаВыпуск                    КАК ПравилоОтнесенияНаВыпуск,
		|	ДД.ДоляСтоимостиОстаток                        КАК ДоляСтоимостиОстаток,
		|	Идентификаторы.ДокументВыпуска                 КАК ДокументВыпуска,
		|	Идентификаторы.АналитикаПартииВыпуска          КАК АналитикаПартииВыпуска
		|ПОМЕСТИТЬ ПартииДляОтнесенияРасходов
		|ИЗ
		|	втПартииДляОтнесенияРасходов КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ ИдентификаторыПартий КАК Идентификаторы
		|		ПО ДД.ПартияПроизводства = Идентификаторы.ПартияПроизводства
		|		И ДД.ЗаказНаПроизводство = Идентификаторы.ЗаказНаПроизводство
		|		И ДД.КодСтрокиПродукция = Идентификаторы.КодСтрокиПродукция
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статья
		|		ПО ДД.СтатьяРасходов = Статья.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтОВЗ КАК ВтОВЗ
		|		ПО ДД.АналитикаРасходов = ВтОВЗ.ОВЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.Подразделение                               КАК Подразделение,
		|	ДД.ПартияПроизводства                          КАК ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство                         КАК ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция                          КАК КодСтрокиПродукция,
		|	ДД.ПравилоОтнесенияНаВыпуск 				   КАК ПравилоОтнесенияНаВыпуск
		|ПОМЕСТИТЬ ПартииДляОтнесенияРасходовСводно
		|ИЗ
		|	втПартииДляОтнесенияРасходов КАК ДД
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Подразделение,
		|	ПартияПроизводства,
		|	ЗаказНаПроизводство,
		|	КодСтрокиПродукция,
		|	ПравилоОтнесенияНаВыпуск
		|;
		|
		|////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.ПартияПроизводства КАК ПартияПроизводства
		|ПОМЕСТИТЬ ПартииВыпущеннойПродукции
		|ИЗ
		|	ПартииДляОтнесенияРасходовСводно КАК ДД
		|ГДЕ
		|	ДД.ПравилоОтнесенияНаВыпуск В (
		|		ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукции),
		|		ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукцииСУчетомБудущихВыпусков))
		|ИНДЕКСИРОВАТЬ ПО
		|	ПартияПроизводства";
		
	Возврат ТекстЗапроса
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
		
КонецФункции

Функция ТекстМатериальныеЗатратыНЗП()
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДД.АналитикаУчетаНоменклатуры.МестоХранения              КАК Подразделение,
		|	ДД.Регистратор                                           КАК РегистраторРасхода,
		|	ДД.Период 												 КАК ДатаПроизводства,
		|	ДД.Партия                                                КАК ПартияПроизводства,
		|	НЕОПРЕДЕЛЕНО                                             КАК ЗаказНаПроизводство,
		|	0                                                        КАК КодСтрокиПродукция,
		|	ДД.КорАналитикаУчетаНоменклатуры                         КАК КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов                                         КАК КорВидЗапасов,
		|	ДД.КорАналитикаУчетаПартий                               КАК КорАналитикаУчетаПартий,
		|	ДД.КорРазделУчета                                        КАК КорРазделУчета,
		|	СУММА(ДД.Количество *
		|		(ЕСТЬNULL(Цены.Стоимость, 0)
		|		+ ЕСТЬNULL(Цены.СтоимостьДопРасходы, 0)
		|		+ ЕСТЬNULL(Цены.СтоимостьЗабалансовая, 0)))           КАК Стоимость,
		|	СУММА(ДД.Количество *
		|		(ЕСТЬNULL(Цены.СтоимостьБезНДС, 0)
		|		+ ЕСТЬNULL(Цены.СтоимостьДопРасходыБезНДС, 0)
		|		+ ЕСТЬNULL(Цены.СтоимостьЗабалансовая, 0)))           КАК СтоимостьБезНДС,
		|	СУММА(ДД.Количество *
		|		(ЕСТЬNULL(Цены.СтоимостьРегл, 0)
		|		+ ЕСТЬNULL(Цены.ДопРасходыРегл, 0)
		|		+ ЕСТЬNULL(Цены.СтоимостьЗабалансоваяРегл, 0)))       КАК СтоимостьРегл,
		|	СУММА(ДД.Количество *
		|		(ЕСТЬNULL(Цены.СтоимостьУпр, 0)
		|		+ ЕСТЬNULL(Цены.ДопРасходыУпр, 0)
		|		+ ЕСТЬNULL(Цены.СтоимостьЗабалансовая, 0)))           КАК СтоимостьУпр
		|ПОМЕСТИТЬ МатериальныеЗатратыПроизводства
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтоимостьПартийТоваров КАК Цены
		|		ПО Цены.Организация = ДД.Организация
		|			И Цены.Партия = ДД.Партия
		|			И Цены.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|			И Цены.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|			И Цены.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|			И Цены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|			И Цены.ВидЗапасов = ДД.ВидЗапасов
		|			И Цены.РазделУчета = ДД.РазделУчета
		|
		|ГДЕ
		|	ДД.АналитикаУчетаНоменклатуры.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
		|	И НЕ ДД.СлужебноеВидДвиженияПриход
		|	И ТИПЗНАЧЕНИЯ(ДД.Партия) = ТИП(Справочник.ПартииПроизводства)
		|	И ДД.Количество > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.АналитикаУчетаНоменклатуры.МестоХранения,
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.Партия,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорАналитикаУчетаПартий,
		|	ДД.КорРазделУчета";
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	РасчетСебестоимостиЛокализация.ДополнитьЗапросМатериальнымиЗатратамиНЗП(ТекстыЗапросов);
	
	ТекстЗапроса = ОбъединитьТексты(ТекстыЗапросов);
	ТекстЗапроса = ТекстЗапроса + "
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Подразделение,
		|	ПартияПроизводства,
		|	ЗаказНаПроизводство,
		|	КодСтрокиПродукция";
	
	Возврат ТекстЗапроса
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
		
КонецФункции

Функция ТекстТрудозатратыНЗП()
		
	ТекстыЗапросов = Новый Массив;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДД.Подразделение                                        КАК Подразделение,
		|	ДД.Регистратор                                          КАК РегистраторРасхода,
		|	ДД.Период                                               КАК ДатаПроизводства,
		|	ДД.ПартияПроизводства                                   КАК ПартияПроизводства,
		|	НЕОПРЕДЕЛЕНО                                            КАК ЗаказНаПроизводство,
		|	0                                                       КАК КодСтрокиПродукция,
		|	ДД.КорАналитикаУчетаПродукции                           КАК КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасовПродукции                               КАК КорВидЗапасов,
		|	ДД.КорАналитикаУчетаПартий                              КАК КорАналитикаУчетаПартий,
		|	ДД.КорРазделУчета                                       КАК КорРазделУчета,
		|	ВЫРАЗИТЬ(ВЫБОР
		|		КОГДА СУММА(ДД.Стоимость) = 0
		|			ТОГДА СУММА(ДД.НормативнаяСтоимость)
		|		ИНАЧЕ СУММА(ДД.Стоимость)
		|	КОНЕЦ КАК ЧИСЛО(23,10))                                 КАК Стоимость,
		|	ВЫРАЗИТЬ(ВЫБОР
		|		КОГДА СУММА(ДД.Стоимость) = 0
		|			ТОГДА СУММА(ДД.НормативнаяСтоимость)
		|		ИНАЧЕ СУММА(ДД.Стоимость)
		|	КОНЕЦ КАК ЧИСЛО(23,10))                                 КАК СтоимостьБезНДС,
		|	ВЫРАЗИТЬ(ВЫБОР
		|		КОГДА СУММА(ДД.СтоимостьРегл) = 0
		|			ТОГДА СУММА(ДД.НормативнаяСтоимость)
		|		ИНАЧЕ СУММА(ДД.СтоимостьРегл)
		|	КОНЕЦ КАК ЧИСЛО(23,10))                                 КАК СтоимостьРегл,
		|	ВЫРАЗИТЬ(ВЫБОР
		|		КОГДА НЕ &УправленческийУчетОрганизаций
		|			ТОГДА 0
		|		КОГДА СУММА(ДД.Стоимость) = 0
		|			ТОГДА СУММА(ДД.НормативнаяСтоимость)
		|		ИНАЧЕ СУММА(ДД.Стоимость)
		|	КОНЕЦ КАК ЧИСЛО(23,10))                                 КАК СтоимостьУпр
		|ПОМЕСТИТЬ ТрудозатратыПроизводства
		|ИЗ
		|	ВТКэшРасчетныеОборотыТрудозатратыНезавершенногоПроизводства КАК ДД
		|ГДЕ
		|	НЕ ДД.СлужебноеВидДвиженияПриход
		|	И НЕ ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Подразделение,
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ПартияПроизводства,
		|	ДД.КорАналитикаУчетаПродукции,
		|	ДД.КорВидЗапасовПродукции,
		|	ДД.КорАналитикаУчетаПартий,
		|	ДД.КорРазделУчета";
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	РасчетСебестоимостиЛокализация.ДополнитьЗапросТрудозатратамиНЗП(ТекстыЗапросов);

	ТекстЗапроса = ОбъединитьТексты(ТекстыЗапросов);
	ТекстЗапроса = ТекстЗапроса + "
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Подразделение,
		|	ПартияПроизводства,
		|	ЗаказНаПроизводство,
		|	КодСтрокиПродукция";
	
	Возврат ТекстЗапроса
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
		
КонецФункции

Функция ТекстМатериальныеЗатратыИТрудозатратыНЗП()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДД.Подразделение                         КАК Подразделение,
		|	ДД.РегистраторРасхода                    КАК РегистраторРасхода,
		|	ДД.ДатаПроизводства                      КАК ДатаПроизводства,
		|	ДД.ПартияПроизводства                    КАК ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство                   КАК ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция                    КАК КодСтрокиПродукция,
		|	ДД.КорАналитикаУчетаНоменклатуры         КАК КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов                         КАК КорВидЗапасов,
		|	ДД.КорАналитикаУчетаПартий               КАК КорАналитикаУчетаПартий,
		|	ДД.КорРазделУчета                        КАК КорРазделУчета,
		|	ВЫРАЗИТЬ(СУММА(ДД.Стоимость) КАК ЧИСЛО(23,10)) 			КАК Стоимость,
		|	ВЫРАЗИТЬ(СУММА(ДД.СтоимостьБезНДС) КАК ЧИСЛО(23,10))    КАК СтоимостьБезНДС,
		|	ВЫРАЗИТЬ(СУММА(ДД.СтоимостьРегл) КАК ЧИСЛО(23,10))      КАК СтоимостьРегл,
		|	ВЫРАЗИТЬ(СУММА(ДД.СтоимостьУпр) КАК ЧИСЛО(23,10))       КАК СтоимостьУпр
		|ПОМЕСТИТЬ МатериальныеИТрудозатратыПроизводства
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДД.Подразделение                         КАК Подразделение,
		|		ДД.РегистраторРасхода                    КАК РегистраторРасхода,
		|		ДД.ДатаПроизводства                      КАК ДатаПроизводства,
		|		ДД.ПартияПроизводства                    КАК ПартияПроизводства,
		|		ДД.ЗаказНаПроизводство                   КАК ЗаказНаПроизводство,
		|		ДД.КодСтрокиПродукция                    КАК КодСтрокиПродукция,
		|		ДД.КорАналитикаУчетаНоменклатуры         КАК КорАналитикаУчетаНоменклатуры,
		|		ДД.КорВидЗапасов                         КАК КорВидЗапасов,
		|		ДД.КорАналитикаУчетаПартий               КАК КорАналитикаУчетаПартий,
		|		ДД.КорРазделУчета                        КАК КорРазделУчета,
		|		ДД.Стоимость                             КАК Стоимость,
		|		ДД.СтоимостьБезНДС                       КАК СтоимостьБезНДС,
		|		ДД.СтоимостьРегл                         КАК СтоимостьРегл,
		|		ДД.СтоимостьУпр                          КАК СтоимостьУпр
		|	ИЗ МатериальныеЗатратыПроизводства КАК ДД
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Подразделение                         КАК Подразделение,
		|		ДД.РегистраторРасхода                    КАК РегистраторРасхода,
		|		ДД.ДатаПроизводства                      КАК ДатаПроизводства,
		|		ДД.ПартияПроизводства                    КАК ПартияПроизводства,
		|		ДД.ЗаказНаПроизводство                   КАК ЗаказНаПроизводство,
		|		ДД.КодСтрокиПродукция                    КАК КодСтрокиПродукция,
		|		ДД.КорАналитикаУчетаНоменклатуры         КАК КорАналитикаУчетаНоменклатуры,
		|		ДД.КорВидЗапасов                         КАК КорВидЗапасов,
		|		ДД.КорАналитикаУчетаПартий               КАК КорАналитикаУчетаПартий,
		|		ДД.КорРазделУчета                        КАК КорРазделУчета,
		|		ДД.Стоимость                             КАК Стоимость,
		|		ДД.СтоимостьБезНДС                       КАК СтоимостьБезНДС,
		|		ДД.СтоимостьРегл                         КАК СтоимостьРегл,
		|		ДД.СтоимостьУпр                          КАК СтоимостьУпр
		|	ИЗ ТрудозатратыПроизводства КАК ДД) КАК ДД
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Подразделение,
		|	ДД.РегистраторРасхода,
		|	ДД.ДатаПроизводства,
		|	ДД.ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорАналитикаУчетаПартий,
		|	ДД.КорРазделУчета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Подразделение,
		|	ПартияПроизводства,
		|	ЗаказНаПроизводство,
		|	КодСтрокиПродукция";
	
	Возврат ТекстЗапроса
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
		
КонецФункции

Функция ТекстВыпущеннаяПродукция()
		
	ТекстыЗапросов = Новый Массив;
	
	ТекстЗапроса =
		// Выпущенная продукция без заказов (товары).
		"ВЫБРАТЬ
		|	ДД.Ссылка                                               КАК РегистраторРасхода,
		|	Реквизиты.Дата                                          КАК ДатаПроизводства,
		|	СпрПартииПроизводства.Ссылка                            КАК ПартияПроизводства,
		|	Реквизиты.Подразделение                                 КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО                                            КАК ЗаказНаПроизводство,
		|	0                                                       КАК КодСтрокиПродукция,
		|	ВЫБОР
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
		|			И НЕ СпрСклады.ЦеховаяКладовая
		|			ТОГДА АналитикаПоПодразделению.КлючАналитики
		|		КОГДА НЕ &УчитыватьСебестоимостьТоваровПоНазначениям
		|			И НЕ СпрСклады.ЦеховаяКладовая
		|			ТОГДА АналитикаПоПодразделениюБезНазначения.КлючАналитики
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
		|			ТОГДА ДД.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ АналитикаДокументаБезНазначения.КлючАналитики
		|	КОНЕЦ                                                   КАК КорАналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов                                           КАК КорВидЗапасов,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.Организация В (&ОрганизацииСФИФОСкользящая)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|		ИНАЧЕ АналитикиУчетаПартий.КлючАналитики
		|	КОНЕЦ                                                   КАК КорАналитикаУчетаПартий,
		|	ВЫБОР
		|		КОГДА ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветХранение)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|	КОНЕЦ                                                   КАК КорРазделУчета,
		|	ВЫРАЗИТЬ(СУММА(ВЫБОР
		|			КОГДА ДД.ДоляСтоимости = 0
		|				ТОГДА ДД.Количество - ЕСТЬNULL(ПартииМатериаловВНЗП.Количество, 0)
		|			ИНАЧЕ ДД.ДоляСтоимости
		|					- ЕСТЬNULL(ПартииМатериаловВНЗП.Количество, 0)
		|						* ДД.ДоляСтоимости
		|						/ ДД.Количество
		|		КОНЕЦ) КАК ЧИСЛО(23,10))                            КАК Стоимость,
		|	ВЫРАЗИТЬ(СУММА(
		|		ВЫБОР
		|			КОГДА ДД.ДоляСтоимости = 0
		|				ТОГДА ДД.Количество
		|			ИНАЧЕ ДД.ДоляСтоимости
		|		КОНЕЦ) КАК ЧИСЛО(23,10))                            КАК ПолнаяСтоимость,
		|	0                                                       КАК ПлановоеКоличествоПродукции
		|ПОМЕСТИТЬ ВыпущеннаяПродукция
		|ИЗ
		|	Документ.ПроизводствоБезЗаказа.ВидыЗапасовВыходныеИзделия КАК ДД
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК Реквизиты
		|		ПО ДД.Ссылка = Реквизиты.Ссылка
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
		|		ПО СпрПартииПроизводства.Код = ДД.НомерГруппыЗатрат
		|		И СпрПартииПроизводства.Документ = ДД.Ссылка
		|		И НЕ СпрПартииПроизводства.ПометкаУдаления
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартий КАК АналитикиУчетаПартий
		|		ПО АналитикиУчетаПартий.ГруппаФинансовогоУчета	= ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
		|		И АналитикиУчетаПартий.Поставщик				= ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|		И АналитикиУчетаПартий.Контрагент				= НЕОПРЕДЕЛЕНО
		|		И АналитикиУчетаПартий.СтавкаНДС				= ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
		|		И АналитикиУчетаПартий.НалогообложениеНДС 		= ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|		И АналитикиУчетаПартий.ВидЦенности				= ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)
		|		И АналитикиУчетаПартий.КодСтроки				= ДД.КодСтроки
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаДокументаБезНазначения
		|		ПО АналитикаДокументаБезНазначения.Номенклатура = ДД.АналитикаУчетаНоменклатуры.Номенклатура
		|		И АналитикаДокументаБезНазначения.Характеристика = ДД.АналитикаУчетаНоменклатуры.Характеристика
		|		И АналитикаДокументаБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|		И АналитикаДокументаБезНазначения.СтатьяКалькуляции = ДД.АналитикаУчетаНоменклатуры.СтатьяКалькуляции
		|		И АналитикаДокументаБезНазначения.МестоХранения = ДД.АналитикаУчетаНоменклатуры.МестоХранения
		|		И АналитикаДокументаБезНазначения.Серия = ДД.АналитикаУчетаНоменклатуры.Серия
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
		|			ПО СпрСклады.Ссылка = ДД.АналитикаУчетаНоменклатуры.МестоХранения
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПоПодразделению
		|			ПО ДД.АналитикаУчетаНоменклатуры.Номенклатура = АналитикаПоПодразделению.Номенклатура
		|			И ДД.АналитикаУчетаНоменклатуры.Характеристика = АналитикаПоПодразделению.Характеристика
		|			И ДД.АналитикаУчетаНоменклатуры.Серия = АналитикаПоПодразделению.Серия
		|			И Реквизиты.Подразделение = АналитикаПоПодразделению.МестоХранения
		|			И ДД.АналитикаУчетаНоменклатуры.Назначение = АналитикаПоПодразделению.Назначение
		|			И ДД.АналитикаУчетаНоменклатуры.СтатьяКалькуляции = АналитикаПоПодразделению.СтатьяКалькуляции
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПоПодразделениюБезНазначения
		|			ПО АналитикаПоПодразделению.Номенклатура = АналитикаПоПодразделениюБезНазначения.Номенклатура
		|			И АналитикаПоПодразделению.Характеристика = АналитикаПоПодразделениюБезНазначения.Характеристика
		|			И АналитикаПоПодразделению.Серия = АналитикаПоПодразделениюБезНазначения.Серия
		|			И АналитикаПоПодразделению.МестоХранения = АналитикаПоПодразделениюБезНазначения.МестоХранения
		|			И ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = АналитикаПоПодразделениюБезНазначения.Назначение
		|			И АналитикаПоПодразделению.СтатьяКалькуляции = АналитикаПоПодразделениюБезНазначения.СтатьяКалькуляции
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПартииМатериаловВНЗП КАК ПартииМатериаловВНЗП
		|			ПО ПартииМатериаловВНЗП.ПартияПроизводства = СпрПартииПроизводства.Ссылка
		|			И ПартииМатериаловВНЗП.ПартияМатериала = ДД.Ссылка
		|			И ПартииМатериаловВНЗП.АналитикаУчетаПартий = АналитикиУчетаПартий.КлючАналитики
		|
		|ГДЕ
		|	Реквизиты.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Реквизиты.Проведен
		|	И Реквизиты.Организация В(&МассивОрганизаций)
		|
		|СГРУППИРОВАТЬ ПО
		|	СпрПартииПроизводства.Ссылка,
		|	ДД.Ссылка,
		|	Реквизиты.Дата,
		|	Реквизиты.Подразделение,
		|	ВЫБОР
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
		|			И НЕ СпрСклады.ЦеховаяКладовая
		|			ТОГДА АналитикаПоПодразделению.КлючАналитики
		|		КОГДА НЕ &УчитыватьСебестоимостьТоваровПоНазначениям
		|			И НЕ СпрСклады.ЦеховаяКладовая
		|			ТОГДА АналитикаПоПодразделениюБезНазначения.КлючАналитики
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
		|			ТОГДА ДД.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ АналитикаДокументаБезНазначения.КлючАналитики
		|	КОНЕЦ,
		|	ДД.ВидЗапасов,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.Организация В (&ОрганизацииСФИФОСкользящая)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|		ИНАЧЕ АналитикиУчетаПартий.КлючАналитики
		|	КОНЕЦ,
		|	ДД.ВидЗапасов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Выпущенная продукция без заказов (работы).
		|ВЫБРАТЬ
		|	ДД.Ссылка                                               КАК РегистраторРасхода,
		|	Реквизиты.Дата                                          КАК ДатаПроизводства,
		|	СпрПартииПроизводства.Ссылка                            КАК ПартияПроизводства,
		|	Реквизиты.Подразделение                                 КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО                                            КАК ЗаказНаПроизводство,
		|	0                                                       КАК КодСтрокиПродукция,
		|	ВЫБОР
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
		|			ТОГДА ДД.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ АналитикаДокументаБезНазначения.КлючАналитики
		|	КОНЕЦ                                                   КАК КорАналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)           КАК КорВидЗапасов,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.Организация В (&ОрганизацииСФИФОСкользящая)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|		ИНАЧЕ АналитикиУчетаПартий.КлючАналитики
		|	КОНЕЦ                                                   КАК КорАналитикаУчетаПартий,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК КорРазделУчета,
		|	ВЫРАЗИТЬ(СУММА(ВЫБОР
		|			КОГДА ДД.ДоляСтоимости = 0
		|				ТОГДА ДД.Количество - ЕСТЬNULL(ПартииМатериаловВНЗП.Количество, 0)
		|			ИНАЧЕ ДД.ДоляСтоимости
		|				- ЕСТЬNULL(ПартииМатериаловВНЗП.Количество, 0)
		|					* ДД.ДоляСтоимости
		|					/ ДД.Количество
		|		КОНЕЦ) КАК ЧИСЛО(23,10))                            КАК Стоимость,
		|	ВЫРАЗИТЬ(СУММА(
		|		ВЫБОР
		|			КОГДА ДД.ДоляСтоимости = 0
		|				ТОГДА ДД.Количество
		|			ИНАЧЕ ДД.ДоляСтоимости
		|		КОНЕЦ) КАК ЧИСЛО(23,10))                            КАК ПолнаяСтоимость,
		|	0                                                       КАК ПлановоеКоличествоПродукции
		|ИЗ
		|	Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ДД
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК Реквизиты
		|		ПО ДД.Ссылка = Реквизиты.Ссылка
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
		|		ПО СпрПартииПроизводства.Код = ДД.НомерГруппыЗатрат
		|		И СпрПартииПроизводства.Документ = ДД.Ссылка
		|		И НЕ СпрПартииПроизводства.ПометкаУдаления
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартий КАК АналитикиУчетаПартий
		|		ПО АналитикиУчетаПартий.ГруппаФинансовогоУчета	= ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
		|		И АналитикиУчетаПартий.Поставщик				= ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|		И АналитикиУчетаПартий.Контрагент				= НЕОПРЕДЕЛЕНО
		|		И АналитикиУчетаПартий.СтавкаНДС				= ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
		|		И АналитикиУчетаПартий.НалогообложениеНДС 		= ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|		И АналитикиУчетаПартий.ВидЦенности				= ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
		|		И АналитикиУчетаПартий.КодСтроки				= ДД.КодСтроки
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаДокументаБезНазначения
		|		ПО АналитикаДокументаБезНазначения.Номенклатура = ДД.АналитикаУчетаНоменклатуры.Номенклатура
		|		И АналитикаДокументаБезНазначения.Характеристика = ДД.АналитикаУчетаНоменклатуры.Характеристика
		|		И АналитикаДокументаБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|		И АналитикаДокументаБезНазначения.СтатьяКалькуляции = ДД.АналитикаУчетаНоменклатуры.СтатьяКалькуляции
		|		И АналитикаДокументаБезНазначения.МестоХранения = ДД.АналитикаУчетаНоменклатуры.МестоХранения
		|		И АналитикаДокументаБезНазначения.Серия = ДД.АналитикаУчетаНоменклатуры.Серия
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПартииМатериаловВНЗП КАК ПартииМатериаловВНЗП
		|		ПО ПартииМатериаловВНЗП.ПартияПроизводства = СпрПартииПроизводства.Ссылка
		|		И ПартииМатериаловВНЗП.ПартияМатериала = ДД.Ссылка
		|		И ПартииМатериаловВНЗП.АналитикаУчетаПартий = АналитикиУчетаПартий.КлючАналитики
		|
		|ГДЕ
		|	Реквизиты.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Реквизиты.Проведен
		|	И Реквизиты.Организация В(&МассивОрганизаций)
		|	И ДД.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|
		|СГРУППИРОВАТЬ ПО
		|	СпрПартииПроизводства.Ссылка,
		|	ДД.Ссылка,
		|	Реквизиты.Дата,
		|	Реквизиты.Подразделение,
		|	ВЫБОР
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
		|			ТОГДА ДД.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ АналитикаДокументаБезНазначения.КлючАналитики
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.Организация В (&ОрганизацииСФИФОСкользящая)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|		ИНАЧЕ АналитикиУчетаПартий.КлючАналитики
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Выпущенная продукция по отдельным отчетам переработчиков.
		|ВЫБРАТЬ
		|	ДД.Ссылка                                               КАК РегистраторРасхода,
		|	Реквизиты.Дата                                          КАК ДатаПроизводства,
		|	СпрПартииПроизводства.Ссылка                            КАК ПартияПроизводства,
		|	Реквизиты.Подразделение                                 КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО                                            КАК ЗаказНаПроизводство,
		|	0                                                       КАК КодСтрокиПродукция,
		|	ВЫБОР
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
		|			ТОГДА ДД.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ АналитикаДокументаБезНазначения.КлючАналитики
		|	КОНЕЦ                                                   КАК КорАналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)           КАК КорВидЗапасов,
		|	ВЫБОР
		|		КОГДА Реквизиты.Организация В (&ОрганизацииСФИФОСкользящая)
		|			ТОГДА АналитикиУчетаПартий.КлючАналитики
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|	КОНЕЦ                                                   КАК КорАналитикаУчетаПартий,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК КорРазделУчета,
		|	ВЫРАЗИТЬ(СУММА(
		|		ВЫБОР
		|			КОГДА ДД.ДоляСтоимости = 0
		|				ТОГДА ДД.Количество
		|			ИНАЧЕ ДД.ДоляСтоимости
		|		КОНЕЦ) КАК ЧИСЛО(23,10)) КАК Стоимость,
		|	ВЫРАЗИТЬ(СУММА(
		|		ВЫБОР
		|			КОГДА ДД.ДоляСтоимости = 0
		|				ТОГДА ДД.Количество
		|			ИНАЧЕ ДД.ДоляСтоимости
		|		КОНЕЦ) КАК ЧИСЛО(23,10)) КАК ПолнаяСтоимость,
		|	0
		|ИЗ
		|	Документ.ОтчетПереработчика.Продукция КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика КАК Реквизиты
		|		ПО ДД.Ссылка = Реквизиты.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
		|		ПО СпрПартииПроизводства.Документ = ДД.Ссылка
		|			И СпрПартииПроизводства.Код = ДД.НомерГруппыЗатрат
		|			И НЕ СпрПартииПроизводства.ПометкаУдаления
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартий КАК АналитикиУчетаПартий
		|		ПО АналитикиУчетаПартий.ГруппаФинансовогоУчета	= ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
		|			И АналитикиУчетаПартий.Поставщик			= Реквизиты.Партнер
		|			И АналитикиУчетаПартий.Контрагент			= Реквизиты.Контрагент
		|			И АналитикиУчетаПартий.СтавкаНДС			= Реквизиты.СтавкаНДС
		|			И АналитикиУчетаПартий.НалогообложениеНДС	= ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|			И АналитикиУчетаПартий.ВидЦенности			= ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)
		|			И АналитикиУчетаПартий.КодСтроки			= ДД.КодСтрокиПродукция
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаДокументаБезНазначения
		|		ПО АналитикаДокументаБезНазначения.Номенклатура 		= ДД.АналитикаУчетаНоменклатуры.Номенклатура
		|			И АналитикаДокументаБезНазначения.Характеристика 	= ДД.АналитикаУчетаНоменклатуры.Характеристика
		|			И АналитикаДокументаБезНазначения.Назначение 		= ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			И АналитикаДокументаБезНазначения.СтатьяКалькуляции = ДД.АналитикаУчетаНоменклатуры.СтатьяКалькуляции
		|			И АналитикаДокументаБезНазначения.МестоХранения 	= ДД.АналитикаУчетаНоменклатуры.МестоХранения
		|			И АналитикаДокументаБезНазначения.Серия 			= ДД.АналитикаУчетаНоменклатуры.Серия
		|
		|ГДЕ
		|	Реквизиты.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Реквизиты.Проведен
		|	И Реквизиты.Организация В(&МассивОрганизаций)
		|	И Реквизиты.ГруппировкаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства)
		|
		|СГРУППИРОВАТЬ ПО
		|	Реквизиты.Дата,
		|	ДД.Ссылка,
		|	СпрПартииПроизводства.Ссылка,
		|	ВЫБОР
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
		|			ТОГДА ДД.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ АналитикаДокументаБезНазначения.КлючАналитики
		|	КОНЕЦ,
		|	Реквизиты.Подразделение,
		|	ВЫБОР
		|		КОГДА Реквизиты.Организация В (&ОрганизацииСФИФОСкользящая)
		|			ТОГДА АналитикиУчетаПартий.КлючАналитики
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|	КОНЕЦ";
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	//++ НЕ УТКА
	ТекстЗапроса = 
		// Выпущенная продукция по заказам (выпущенные товары).
		"ВЫБРАТЬ
		|	Реквизиты.Ссылка					КАК РегистраторРасхода,
		|	ДД.ДатаОперации						КАК ДатаПроизводства,
		|	Реквизиты.ПартияПроизводства		КАК ПартияПроизводства,
		|	ДД.Подразделение				КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО						КАК ЗаказНаПроизводство,
		|	0									КАК КодСтрокиПродукция,
		|	ВЫБОР
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
		|			ТОГДА ДД.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ АналитикаДокументаБезНазначения.КлючАналитики
		|	КОНЕЦ								КАК КорАналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов						КАК КорВидЗапасов,
		|	ЕСТЬNULL(АналитикиУчетаПартийТоваров.КлючАналитики,
		|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка))	КАК КорАналитикаУчетаПартий,
		|	ВЫБОР
		|		КОГДА ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветХранение)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|	КОНЕЦ								КАК КорРазделУчета,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА ДД.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода 
		|				ТОГДА ВЫБОР
		|					КОГДА ДД.ДоляСтоимости = 0
		|						ТОГДА ДД.Количество - ЕСТЬNULL(ПартииМатериаловВНЗП.Количество, 0)
		|					ИНАЧЕ ДД.ДоляСтоимости - ЕСТЬNULL(ПартииМатериаловВНЗП.Количество, 0) * ДД.ДоляСтоимости / ДД.Количество
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ)								КАК Стоимость,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА ДД.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|				ТОГДА ВЫБОР
		|					КОГДА ДД.ДоляСтоимости = 0
		|						ТОГДА ДД.Количество
		|					ИНАЧЕ ДД.ДоляСтоимости
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ)								КАК ПолнаяСтоимость,
		|	СУММА(
		|		ВЫБОР 
		|			КОГДА ДД.ДатаОперации <= &КонецПериода
		|				ТОГДА 0
		|			КОГДА ДД.ДоляСтоимости = 0
		|				ТОГДА ДД.Количество
		|			ИНАЧЕ ДД.ДоляСтоимости
		|	КОНЕЦ)								КАК ПлановоеКоличествоПродукции
		|ИЗ
		|	Документ.ЭтапПроизводства2_2.ВидыЗапасовИзделия КАК ДД
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК Реквизиты
		|		ПО ДД.Ссылка = Реквизиты.Ссылка
		|		И Реквизиты.Проведен
		|		И НЕ Реквизиты.ПроизводствоНаСтороне
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПартииВыпущеннойПродукции КАК ПартииПроизводства
		|		ПО ПартииПроизводства.ПартияПроизводства = Реквизиты.ПартияПроизводства
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаДокументаБезНазначения
		|	ПО АналитикаДокументаБезНазначения.Номенклатура = ДД.АналитикаУчетаНоменклатуры.Номенклатура
		|	И АналитикаДокументаБезНазначения.Характеристика = ДД.АналитикаУчетаНоменклатуры.Характеристика
		|	И АналитикаДокументаБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|	И АналитикаДокументаБезНазначения.СтатьяКалькуляции = ДД.АналитикаУчетаНоменклатуры.СтатьяКалькуляции
		|	И АналитикаДокументаБезНазначения.МестоХранения = ДД.АналитикаУчетаНоменклатуры.МестоХранения
		|	И АналитикаДокументаБезНазначения.Серия = ДД.АналитикаУчетаНоменклатуры.Серия
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартий КАК АналитикиУчетаПартийТоваров
		|	ПО АналитикиУчетаПартийТоваров.ГруппаФинансовогоУчета	= ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
		|	И АналитикиУчетаПартийТоваров.Поставщик					= ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|	И АналитикиУчетаПартийТоваров.Контрагент				= НЕОПРЕДЕЛЕНО
		|	И АналитикиУчетаПартийТоваров.СтавкаНДС					= ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
		|	И АналитикиУчетаПартийТоваров.НалогообложениеНДС 		= ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И АналитикиУчетаПартийТоваров.ВидЦенности				= ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)
		|	И АналитикиУчетаПартийТоваров.КодСтроки					= ДД.КодСтроки
		|	И Реквизиты.Организация В (&ОрганизацииСФИФОСкользящая)
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПартииМатериаловВНЗП КАК ПартииМатериаловВНЗП
		|	ПО ПартииМатериаловВНЗП.ПартияПроизводства = Реквизиты.ПартияПроизводства
		|	И ПартииМатериаловВНЗП.ПартияМатериала = ДД.Ссылка
		|	И ПартииМатериаловВНЗП.АналитикаУчетаПартий = АналитикиУчетаПартийТоваров.КлючАналитики
		|
		|ГДЕ
		|	ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
		|
		|СГРУППИРОВАТЬ ПО
		|	Реквизиты.Ссылка,
		|	ДД.ДатаОперации,
		|	Реквизиты.ПартияПроизводства,
		|	ДД.Подразделение,
		|	ВЫБОР
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
		|			ТОГДА ДД.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ АналитикаДокументаБезНазначения.КлючАналитики
		|	КОНЕЦ,
		|	ДД.ВидЗапасов,
		|	ВЫБОР
		|		КОГДА ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветХранение)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|	КОНЕЦ,
		|	ЕСТЬNULL(АналитикиУчетаПартийТоваров.КлючАналитики,
		|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Выпущенная продукция по заказам (не выпущенные товары, работы).
		|ВЫБРАТЬ
		|	Реквизиты.Ссылка								КАК РегистраторРасхода,
		|	ДД.ДатаПроизводства								КАК ДатаПроизводства,
		|	Реквизиты.ПартияПроизводства					КАК ПартияПроизводства,
		|	ДД.Подразделение							КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО									КАК ЗаказНаПроизводство,
		|	0												КАК КодСтрокиПродукция,
		|	ВЫБОР
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
		|			ТОГДА ДД.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ АналитикаДокументаБезНазначения.КлючАналитики
		|	КОНЕЦ											КАК КорАналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)	КАК КорВидЗапасов,
		|	ВЫБОР
		|		КОГДА ДД.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|			ТОГДА ЕСТЬNULL(АналитикиУчетаПартийРабот.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка))
		|		ИНАЧЕ ЕСТЬNULL(АналитикиУчетаПартийТоваров.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка))
		|	КОНЕЦ											КАК КорАналитикаУчетаПартий,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)	КАК КорРазделУчета,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА ДД.Произведено
		|				И ДД.ДатаПроизводства МЕЖДУ &НачалоПериода И &КонецПериода 
		|				ТОГДА ВЫБОР
		|					КОГДА ДД.ДоляСтоимости = 0
		|						ТОГДА ДД.Количество - ЕСТЬNULL(ПартииМатериаловВНЗП.Количество, 0)
		|					ИНАЧЕ ДД.ДоляСтоимости - ЕСТЬNULL(ПартииМатериаловВНЗП.Количество, 0) * ДД.ДоляСтоимости / ДД.Количество
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ)											КАК Стоимость,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА ДД.Произведено
		|				И ДД.ДатаПроизводства МЕЖДУ &НачалоПериода И &КонецПериода
		|				ТОГДА ВЫБОР
		|					КОГДА ДД.ДоляСтоимости = 0
		|						ТОГДА ДД.Количество
		|					ИНАЧЕ ДД.ДоляСтоимости
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ)											КАК ПолнаяСтоимость,
		|	СУММА(
		|		ВЫБОР 
		|			КОГДА ДД.Произведено
		|				И ДД.ДатаПроизводства <= &КонецПериода
		|				ТОГДА 0
		|			КОГДА ДД.ДоляСтоимости = 0
		|				ТОГДА ДД.Количество
		|			ИНАЧЕ ДД.ДоляСтоимости
		|	КОНЕЦ)											КАК ПлановоеКоличествоПродукции
		|ИЗ
		|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ДД
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК Реквизиты
		|		ПО ДД.Ссылка = Реквизиты.Ссылка
		|		И Реквизиты.Проведен
		|		И НЕ Реквизиты.ПроизводствоНаСтороне
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПартииВыпущеннойПродукции КАК ПартииПроизводства
		|		ПО ПартииПроизводства.ПартияПроизводства = Реквизиты.ПартияПроизводства
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаДокументаБезНазначения
		|	ПО АналитикаДокументаБезНазначения.Номенклатура = ДД.АналитикаУчетаНоменклатуры.Номенклатура
		|	И АналитикаДокументаБезНазначения.Характеристика = ДД.АналитикаУчетаНоменклатуры.Характеристика
		|	И АналитикаДокументаБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|	И АналитикаДокументаБезНазначения.СтатьяКалькуляции = ДД.АналитикаУчетаНоменклатуры.СтатьяКалькуляции
		|	И АналитикаДокументаБезНазначения.МестоХранения = ДД.АналитикаУчетаНоменклатуры.МестоХранения
		|	И АналитикаДокументаБезНазначения.Серия = ДД.АналитикаУчетаНоменклатуры.Серия
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартий КАК АналитикиУчетаПартийТоваров
		|	ПО АналитикиУчетаПартийТоваров.ГруппаФинансовогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
		|	И АналитикиУчетаПартийТоваров.Поставщик				= ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|	И АналитикиУчетаПартийТоваров.Контрагент			= НЕОПРЕДЕЛЕНО
		|	И АналитикиУчетаПартийТоваров.СтавкаНДС				= ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
		|	И АналитикиУчетаПартийТоваров.НалогообложениеНДС 	= ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И АналитикиУчетаПартийТоваров.ВидЦенности			= ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)
		|	И АналитикиУчетаПартийТоваров.КодСтроки				= ДД.КодСтроки
		|	И Реквизиты.Организация В (&ОрганизацииСФИФОСкользящая)
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартий КАК АналитикиУчетаПартийРабот
		|	ПО АналитикиУчетаПартийРабот.ГруппаФинансовогоУчета	= ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
		|	И АналитикиУчетаПартийРабот.Поставщик				= ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|	И АналитикиУчетаПартийРабот.Контрагент				= НЕОПРЕДЕЛЕНО
		|	И АналитикиУчетаПартийРабот.СтавкаНДС				= ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
		|	И АналитикиУчетаПартийРабот.НалогообложениеНДС		= ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И АналитикиУчетаПартийРабот.ВидЦенности				= ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
		|	И АналитикиУчетаПартийРабот.КодСтроки				= ДД.КодСтроки
		|	И Реквизиты.Организация В (&ОрганизацииСФИФОСкользящая)
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПартииМатериаловВНЗП КАК ПартииМатериаловВНЗП
		|	ПО ПартииМатериаловВНЗП.ПартияПроизводства = Реквизиты.ПартияПроизводства
		|	И ПартииМатериаловВНЗП.ПартияМатериала = ДД.Ссылка
		|	И (ПартииМатериаловВНЗП.АналитикаУчетаПартий = АналитикиУчетаПартийТоваров.КлючАналитики
		|		ИЛИ ПартииМатериаловВНЗП.АналитикаУчетаПартий = АналитикиУчетаПартийРабот.КлючАналитики)
		|
		|ГДЕ
		|	Реквизиты.Проведен
		|	И НЕ ДД.Отменено
		|	И (ДД.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|		ИЛИ НЕ ДД.Произведено)
		|
		|СГРУППИРОВАТЬ ПО
		|	Реквизиты.Ссылка,
		|	ДД.ДатаПроизводства,
		|	Реквизиты.ПартияПроизводства,
		|	ДД.Подразделение,
		|	ВЫБОР
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
		|			ТОГДА ДД.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ АналитикаДокументаБезНазначения.КлючАналитики
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДД.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|			ТОГДА ЕСТЬNULL(АналитикиУчетаПартийРабот.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка))
		|		ИНАЧЕ ЕСТЬNULL(АналитикиУчетаПартийТоваров.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка))
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Выпущенная продукция по переработке выпускающих этапов
		// Доли стоимости выбираются из этапов производства.
		|ВЫБРАТЬ
		|	РеквизитыОтчета.Ссылка                                  КАК РегистраторРасхода,
		|	РеквизитыОтчета.Дата                                    КАК ДатаПроизводства,
		|	РеквизитыЭтапа.ПартияПроизводства                       КАК ПартияПроизводства,
		|	РеквизитыОтчета.Подразделение                           КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО                                            КАК ЗаказНаПроизводство,
		|	0                                                       КАК КодСтрокиПродукция,
		|	ВЫБОР
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
		|			ТОГДА ДД.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ АналитикаДокументаБезНазначения.КлючАналитики
		|	КОНЕЦ                                                   КАК КорАналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)           КАК КорВидЗапасов,
		|	ВЫБОР
		|		КОГДА РеквизитыОтчета.Организация В (&ОрганизацииСФИФОСкользящая)
		|			ТОГДА АналитикиУчетаПартий.КлючАналитики
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|	КОНЕЦ                                                   КАК КорАналитикаУчетаПартий,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК КорРазделУчета,
		|	ВЫРАЗИТЬ(СУММА(
		|		ДД.Количество *
		|		ВЫБОР
		|			КОГДА ИзделияЭтапа.ДоляСтоимости = 0
		|				ТОГДА ИзделияЭтапа.Количество
		|			ИНАЧЕ ИзделияЭтапа.ДоляСтоимости
		|		КОНЕЦ / ИзделияЭтапа.Количество) КАК ЧИСЛО(23,10))  КАК Стоимость,
		|	ВЫРАЗИТЬ(СУММА(
		|		ДД.Количество *
		|		ВЫБОР
		|			КОГДА ИзделияЭтапа.ДоляСтоимости = 0
		|				ТОГДА ИзделияЭтапа.Количество
		|			ИНАЧЕ ИзделияЭтапа.ДоляСтоимости
		|		КОНЕЦ / ИзделияЭтапа.Количество) КАК ЧИСЛО(23,10))  КАК ПолнаяСтоимость,
		|	0
		|ИЗ
		|	Документ.ОтчетПереработчика.Продукция КАК ДД
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ИзделияЭтапа
		|		ПО ДД.ЭтапПроизводства = ИзделияЭтапа.Ссылка
		|		И ДД.КодСтроки = ИзделияЭтапа.КодСтроки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика КАК РеквизитыОтчета
		|		ПО ДД.Ссылка = РеквизитыОтчета.Ссылка
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК РеквизитыЭтапа
		|		ПО ДД.ЭтапПроизводства = РеквизитыЭтапа.Ссылка
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартий КАК АналитикиУчетаПартий
		|		ПО АналитикиУчетаПартий.ГруппаФинансовогоУчета	= ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
		|		И АналитикиУчетаПартий.Поставщик				= РеквизитыОтчета.Партнер
		|		И АналитикиУчетаПартий.Контрагент				= РеквизитыОтчета.Контрагент
		|		И АналитикиУчетаПартий.СтавкаНДС				= РеквизитыОтчета.СтавкаНДС
		|		И АналитикиУчетаПартий.НалогообложениеНДС		= ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|		И АналитикиУчетаПартий.ВидЦенности				= ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)
		|		И АналитикиУчетаПартий.КодСтроки				= ДД.КодСтрокиПродукция
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаДокументаБезНазначения
		|	ПО
		|		АналитикаДокументаБезНазначения.Номенклатура = ДД.АналитикаУчетаНоменклатуры.Номенклатура
		|		И АналитикаДокументаБезНазначения.Характеристика = ДД.АналитикаУчетаНоменклатуры.Характеристика
		|		И АналитикаДокументаБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|		И АналитикаДокументаБезНазначения.СтатьяКалькуляции = ДД.АналитикаУчетаНоменклатуры.СтатьяКалькуляции
		|		И АналитикаДокументаБезНазначения.МестоХранения = ДД.АналитикаУчетаНоменклатуры.МестоХранения
		|		И АналитикаДокументаБезНазначения.Серия = ДД.АналитикаУчетаНоменклатуры.Серия
		|
		|ГДЕ
		|	РеквизитыОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РеквизитыОтчета.Проведен
		|	И РеквизитыОтчета.Организация В(&МассивОрганизаций)
		|
		|СГРУППИРОВАТЬ ПО
		|	РеквизитыЭтапа.ПартияПроизводства,
		|	РеквизитыОтчета.Ссылка,
		|	РеквизитыОтчета.Дата,
		|	РеквизитыЭтапа.Ссылка,
		|	РеквизитыОтчета.Подразделение,
		|	ВЫБОР
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
		|			ТОГДА ДД.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ АналитикаДокументаБезНазначения.КлючАналитики
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА РеквизитыОтчета.Организация В (&ОрганизацииСФИФОСкользящая)
		|			ТОГДА АналитикиУчетаПартий.КлючАналитики
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|	КОНЕЦ";
		
	ТекстыЗапросов.Добавить(ТекстЗапроса);	
	//-- НЕ УТКА
	РасчетСебестоимостиЛокализация.ДополнитьЗапросВыпущеннойПродукцией(ТекстыЗапросов);
	
	ТекстЗапроса = ОбъединитьТексты(ТекстыЗапросов);
	ТекстЗапроса = ТекстЗапроса + "
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПартияПроизводства,
		|	ЗаказНаПроизводство,
		|	КодСтрокиПродукция,
		|	Подразделение";
	
	Возврат ТекстЗапроса
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
		
КонецФункции

Функция ТекстПрочиеРасходыНЗПИнициализация()
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстЗапроса =
		// используется для подмены аналитики давальческой работы
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		// поля соединения
		|	ДД.Регистратор                        КАК Регистратор,
		|	ДД.КорАналитикаУчетаНоменклатуры      КАК АналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов                      КАК ВидЗапасов,
		|	ДД.АналитикаУчетаПартий               КАК АналитикаУчетаПартий,
		// поля замены
		|	ДД.РазделУчета                        КАК КорРазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры         КАК КорАналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов                         КАК КорВидЗапасов
		|ПОМЕСТИТЬ
		|	РаботыДляДавальца
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|ГДЕ
		|	ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
		|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|	И ДД.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДД.ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция,
		|	ДД.ПравилоОтнесенияНаВыпуск,
		|	СУММА(ДД.ПоказательОтнесенияНаВыпуск),
		|	СУММА(ДД.ПоказательОтнесенияНаВыпускБезНДС),
		|	СУММА(ДД.ПоказательОтнесенияНаВыпускРегл),
		|	СУММА(ДД.ПоказательОтнесенияНаВыпускУпр)
		|ПОМЕСТИТЬ ЗатратыПродукции
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДД.ПартияПроизводства КАК ПартияПроизводства,
		|		ДД.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|		ДД.КодСтрокиПродукция КАК КодСтрокиПродукция,
		|		ДД.ПравилоОтнесенияНаВыпуск КАК ПравилоОтнесенияНаВыпуск,
		|		СУММА(Затраты.Стоимость) КАК ПоказательОтнесенияНаВыпуск,
		|		СУММА(Затраты.СтоимостьБезНДС) КАК ПоказательОтнесенияНаВыпускБезНДС,
		|		СУММА(Затраты.СтоимостьРегл) КАК ПоказательОтнесенияНаВыпускРегл,
		|		СУММА(Затраты.СтоимостьУпр) КАК ПоказательОтнесенияНаВыпускУпр		
		|	ИЗ
		|		ПартииДляОтнесенияРасходовСводно КАК ДД
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ МатериальныеЗатратыПроизводства КАК Затраты
		|			ПО (Затраты.Подразделение = ДД.Подразделение)
		|				И (Затраты.ПартияПроизводства = ДД.ПартияПроизводства)
		|				И (Затраты.ЗаказНаПроизводство = ДД.ЗаказНаПроизводство)
		|				И (Затраты.КодСтрокиПродукция = ДД.КодСтрокиПродукция)
		|	ГДЕ
		|		ДД.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымЗатратам)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДД.ПартияПроизводства,
		|		ДД.ЗаказНаПроизводство,
		|		ДД.КодСтрокиПродукция,
		|		ДД.ПравилоОтнесенияНаВыпуск
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДД.ПартияПроизводства,
		|		ДД.ЗаказНаПроизводство,
		|		ДД.КодСтрокиПродукция,
		|		ДД.ПравилоОтнесенияНаВыпуск,
		|		СУММА(Затраты.Стоимость),
		|		СУММА(Затраты.СтоимостьБезНДС),
		|		СУММА(Затраты.СтоимостьРегл),
		|		СУММА(Затраты.СтоимостьУпр)		
		|	ИЗ
		|		ПартииДляОтнесенияРасходовСводно КАК ДД
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТрудозатратыПроизводства КАК Затраты
		|			ПО (Затраты.Подразделение = ДД.Подразделение)
		|				И (Затраты.ПартияПроизводства = ДД.ПартияПроизводства)
		|				И (Затраты.ЗаказНаПроизводство = ДД.ЗаказНаПроизводство)
		|				И (Затраты.КодСтрокиПродукция = ДД.КодСтрокиПродукция)
		|	ГДЕ
		|		ДД.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоТрудозатратам)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДД.ПартияПроизводства,
		|		ДД.ЗаказНаПроизводство,
		|		ДД.КодСтрокиПродукция,
		|		ДД.ПравилоОтнесенияНаВыпуск
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДД.ПартияПроизводства,
		|		ДД.ЗаказНаПроизводство,
		|		ДД.КодСтрокиПродукция,
		|		ДД.ПравилоОтнесенияНаВыпуск,
		|		СУММА(Затраты.Стоимость),
		|		СУММА(Затраты.СтоимостьБезНДС),
		|		СУММА(Затраты.СтоимостьРегл),
		|		СУММА(Затраты.СтоимостьУпр)
		|	ИЗ
		|		ПартииДляОтнесенияРасходовСводно КАК ДД
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ МатериальныеИТрудозатратыПроизводства КАК Затраты
		|			ПО (Затраты.Подразделение = ДД.Подразделение)
		|				И (Затраты.ПартияПроизводства = ДД.ПартияПроизводства)
		|				И (Затраты.ЗаказНаПроизводство = ДД.ЗаказНаПроизводство)
		|				И (Затраты.КодСтрокиПродукция = ДД.КодСтрокиПродукция)
		|	ГДЕ
		|		ДД.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымИТрудозатратам)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДД.ПартияПроизводства,
		|		ДД.ЗаказНаПроизводство,
		|		ДД.КодСтрокиПродукция,
		|		ДД.ПравилоОтнесенияНаВыпуск
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДД.ПартияПроизводства,
		|		ДД.ЗаказНаПроизводство,
		|		ДД.КодСтрокиПродукция,
		|		ДД.ПравилоОтнесенияНаВыпуск,
		|		СУММА(Затраты.Стоимость),
		|		СУММА(Затраты.Стоимость),
		|		СУММА(Затраты.Стоимость),
		|		СУММА(Затраты.Стоимость)
		|	ИЗ
		|		ПартииДляОтнесенияРасходовСводно КАК ДД
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыпущеннаяПродукция КАК Затраты
		|			ПО (Затраты.ПартияПроизводства = ДД.ПартияПроизводства)
		|				И (Затраты.ЗаказНаПроизводство = ДД.ЗаказНаПроизводство)
		|				И (Затраты.КодСтрокиПродукция = ДД.КодСтрокиПродукция)
		|				И ВЫБОР
		|					КОГДА ДД.КодСтрокиПродукция > 0
		|						ТОГДА Затраты.Подразделение = ДД.Подразделение
		|					ИНАЧЕ
		|						ИСТИНА
		|				КОНЕЦ
		|	ГДЕ
		|		ДД.ПравилоОтнесенияНаВыпуск В (ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукцииСУчетомБудущихВыпусков),
		|										ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукции),
		|										ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДД.ПартияПроизводства,
		|		ДД.ЗаказНаПроизводство,
		|		ДД.КодСтрокиПродукция,
		|		ДД.ПравилоОтнесенияНаВыпуск
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДолиПроизводственныхРасходов.ПартияПроизводства,
		|		ДолиПроизводственныхРасходов.ЗаказНаПроизводство,
		|		ДолиПроизводственныхРасходов.КодСтрокиПродукция,
		|		ДолиПроизводственныхРасходов.ПравилоОтнесенияНаВыпуск,
		|		0,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		ДолиПроизводственныхРасходов КАК ДолиПроизводственныхРасходов
		|	ГДЕ
		|		ДолиПроизводственныхРасходов.ПравилоОтнесенияНаВыпуск В (ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымЗатратам), 
		|																ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоТрудозатратам), 
		|																ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымИТрудозатратам))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПрямыеПроизводственныеРасходы.ПартияПроизводства,
		|		ПрямыеПроизводственныеРасходы.ЗаказНаПроизводство,
		|		ПрямыеПроизводственныеРасходы.КодСтрокиПродукция,
		|		ПрямыеПроизводственныеРасходы.ПравилоОтнесенияНаВыпуск,
		|		0,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		ПрямыеПроизводственныеРасходы КАК ПрямыеПроизводственныеРасходы
		|	ГДЕ
		|		ПрямыеПроизводственныеРасходы.ПравилоОтнесенияНаВыпуск В (ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымЗатратам), 
		|																ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоТрудозатратам), 
		|																ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымИТрудозатратам))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПрочиеРасходыНезавершенногоПроизводстваОстатки.ПартияПроизводства,
		|		ПрочиеРасходыНезавершенногоПроизводстваОстатки.ЗаказНаПроизводство,
		|		ПрочиеРасходыНезавершенногоПроизводстваОстатки.КодСтрокиПродукция,
		|		ПрочиеРасходыНезавершенногоПроизводстваОстатки.ПравилоОтнесенияНаВыпуск,
		|		0,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(&НачалоПериода, ) КАК ПрочиеРасходыНезавершенногоПроизводстваОстатки
		|	ГДЕ
		|		(ПрочиеРасходыНезавершенногоПроизводстваОстатки.СтоимостьОстаток <> 0
		|			ИЛИ ПрочиеРасходыНезавершенногоПроизводстваОстатки.СтоимостьБезНДСОстаток <> 0
		|			ИЛИ ПрочиеРасходыНезавершенногоПроизводстваОстатки.СтоимостьРеглОстаток <> 0)) КАК ДД
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция,
		|	ДД.ПравилоОтнесенияНаВыпуск,
		|	ДД.ПартияПроизводства";
		
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	//++ НЕ УТКА
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.ПартияПроизводства
		|ПОМЕСТИТЬ ПолучателиПостатейныхРасходов22Материальные
		|ИЗ
		|	ЗатратыПродукции КАК ДД
		|ГДЕ
		|	ДД.ПравилоОтнесенияНаВыпуск В (ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымЗатратам),
		|								ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымИТрудозатратам))
		|	И НЕ ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДД.ПартияПроизводства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция,
		|	ДД.ПартияПроизводства
		|ПОМЕСТИТЬ ПолучателиПостатейныхРасходовПоТрудозатратам
		|ИЗ
		|	ЗатратыПродукции КАК ДД
		|ГДЕ
		|	ДД.ПравилоОтнесенияНаВыпуск В (ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоТрудозатратам),
		|								ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымИТрудозатратам))";
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	//-- НЕ УТКА
	
	ТекстЗапроса = ОбъединитьТексты(ТекстыЗапросов, 
		ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
		
	Возврат ТекстЗапроса
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
		
КонецФункции

//++ НЕ УТКА

Функция ТекстОстаткиБазРаспределения()
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Аналитика.МестоХранения КАК Подразделение,
		|	ДД.Партия КАК ПартияПроизводства,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказНаПроизводство,
		|	0 КАК КодСтрокиПродукция,
		|	ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымЗатратам) КАК ПравилоОтнесенияНаВыпуск,
		|	ВЫРАЗИТЬ(СУММА(ДД.Количество * (ЕСТЬNULL(Цены.Стоимость, 0) + ЕСТЬNULL(Цены.СтоимостьДопРасходы, 0) + ЕСТЬNULL(Цены.СтоимостьЗабалансовая, 0))) КАК ЧИСЛО(23, 10)) КАК Остаток,
		|	ВЫРАЗИТЬ(СУММА(ДД.Количество * (ЕСТЬNULL(Цены.СтоимостьБезНДС, 0) + ЕСТЬNULL(Цены.СтоимостьДопРасходыБезНДС, 0) + ЕСТЬNULL(Цены.СтоимостьЗабалансовая, 0))) КАК ЧИСЛО(23, 10)) КАК ОстатокБезНДС,
		|	ВЫРАЗИТЬ(СУММА(ДД.Количество * (ЕСТЬNULL(Цены.СтоимостьРегл, 0) + ЕСТЬNULL(Цены.ДопРасходыРегл, 0) + ЕСТЬNULL(Цены.СтоимостьЗабалансоваяРегл, 0))) КАК ЧИСЛО(23, 10)) КАК ОстатокРегл,
		|	ВЫРАЗИТЬ(СУММА(ДД.Количество * (ЕСТЬNULL(Цены.СтоимостьУпр, 0) + ЕСТЬNULL(Цены.ДопРасходыУпр, 0) + ЕСТЬNULL(Цены.СтоимостьЗабалансовая, 0))) КАК ЧИСЛО(23, 10)) КАК ОстатокУпр
		|ПОМЕСТИТЬ ОстаткиБазРаспределения
		|ИЗ
		|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
		|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.КлючАналитики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПолучателиПостатейныхРасходов22Материальные КАК Партии
		|		ПО ДД.Партия = Партии.ПартияПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтоимостьПартийТоваров КАК Цены
		|		ПО (Цены.Организация = ДД.Организация)
		|			И (Цены.Партия = ДД.Партия)
		|			И (Цены.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий)
		|			И (Цены.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета)
		|			И (Цены.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС)
		|			И (Цены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры)
		|			И (Цены.ВидЗапасов = ДД.ВидЗапасов)
		|			И (Цены.РазделУчета = ДД.РазделУчета)
		|ГДЕ
		|	ДД.Количество > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Аналитика.МестоХранения,
		|	ДД.Партия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Остатки.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)),
		|	ДД.ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция,
		|	ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоТрудозатратам),
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(Остатки.Стоимость, 0) = 0
		|				ТОГДА ЕСТЬNULL(Остатки.НормативнаяСтоимость, 0)
		|			ИНАЧЕ Остатки.Стоимость
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(Остатки.Стоимость, 0) = 0
		|				ТОГДА ЕСТЬNULL(Остатки.НормативнаяСтоимость, 0)
		|			ИНАЧЕ Остатки.Стоимость
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(Остатки.СтоимостьРегл, 0) = 0
		|				ТОГДА ЕСТЬNULL(Остатки.НормативнаяСтоимость, 0)
		|			ИНАЧЕ Остатки.СтоимостьРегл
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(Остатки.Стоимость, 0) = 0
		|				ТОГДА ЕСТЬNULL(Остатки.НормативнаяСтоимость, 0)
		|			ИНАЧЕ Остатки.Стоимость
		|		КОНЕЦ)
		|ИЗ
		|	ПолучателиПостатейныхРасходовПоТрудозатратам КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОстаткиТрудозатратыНезавершенногоПроизводства КАК Остатки
		|		ПО ДД.ПартияПроизводства = Остатки.ПартияПроизводства
		|			И ДД.ЗаказНаПроизводство = Остатки.ЗаказНаПроизводство
		|			И ДД.КодСтрокиПродукция = Остатки.КодСтрокиПродукция
		|ГДЕ
		|	НЕ ДД.ЗаказНаПроизводство = НЕОПРЕДЕЛЕНО
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(Остатки.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)),
		|	ДД.ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Остатки.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)),
		|	ДД.ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция,
		|	ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоТрудозатратам),
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(Остатки.Стоимость, 0) = 0
		|				ТОГДА ЕСТЬNULL(Остатки.НормативнаяСтоимость, 0)
		|			ИНАЧЕ Остатки.Стоимость
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(Остатки.Стоимость, 0) = 0
		|				ТОГДА ЕСТЬNULL(Остатки.НормативнаяСтоимость, 0)
		|			ИНАЧЕ Остатки.Стоимость
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(Остатки.СтоимостьРегл, 0) = 0
		|				ТОГДА ЕСТЬNULL(Остатки.НормативнаяСтоимость, 0)
		|			ИНАЧЕ Остатки.СтоимостьРегл
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(Остатки.Стоимость, 0) = 0
		|				ТОГДА ЕСТЬNULL(Остатки.НормативнаяСтоимость, 0)
		|			ИНАЧЕ Остатки.Стоимость
		|		КОНЕЦ)
		|ИЗ
		|	ПолучателиПостатейныхРасходовПоТрудозатратам КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОстаткиТрудозатратыНезавершенногоПроизводства КАК Остатки
		|		ПО ДД.ПартияПроизводства = Остатки.ПартияПроизводства
		|ГДЕ
		|	ДД.ЗаказНаПроизводство = НЕОПРЕДЕЛЕНО
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(Остатки.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)),
		|	ДД.ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
		|	ДД.ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция,
		|	ДД.ПравилоОтнесенияНаВыпуск,
		|	СУММА(Остатки.ПлановоеКоличествоПродукции),
		|	СУММА(Остатки.ПлановоеКоличествоПродукции),
		|	СУММА(Остатки.ПлановоеКоличествоПродукции),
		|	СУММА(Остатки.ПлановоеКоличествоПродукции)
		|ИЗ
		|	ЗатратыПродукции КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВыпущеннаяПродукция КАК Остатки
		|		ПО ДД.ПартияПроизводства = Остатки.ПартияПроизводства
		|			И ДД.ЗаказНаПроизводство = Остатки.ЗаказНаПроизводство
		|			И ДД.КодСтрокиПродукция = Остатки.КодСтрокиПродукция
		|ГДЕ
		|	ДД.ПравилоОтнесенияНаВыпуск В (ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукцииСУчетомБудущихВыпусков),
		|									ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция,
		|	ДД.ПравилоОтнесенияНаВыпуск";
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	РасчетСебестоимостиЛокализация.ДополнитьЗапросОстаткамиБазРаспределения(ТекстыЗапросов);
	
	ТекстЗапроса = ОбъединитьТексты(ТекстыЗапросов) + "
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Подразделение,
		|	ПартияПроизводства,
		|	ЗаказНаПроизводство,
		|	КодСтрокиПродукция,
		|	ПравилоОтнесенияНаВыпуск";
	
	Возврат ТекстЗапроса
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
	
КонецФункции
//-- НЕ УТКА
Функция ТекстКоэффициентыПриведения()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДД.ПартияПроизводства,
		|	ДД.ЗаказНаПроизводство,
		|	ДД.ПравилоОтнесенияНаВыпуск,
		|	ВЫБОР
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпуск) > 1000000000
		|			ТОГДА 1000000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпуск) > 100000000
		|			ТОГДА 100000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпуск) > 10000000
		|			ТОГДА 10000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпуск) > 1000000
		|			ТОГДА 1000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпуск) > 100000
		|			ТОГДА 100
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпуск) > 10000
		|			ТОГДА 10
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Коэффициент,
		|	ВЫБОР
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускБезНДС) > 1000000000
		|			ТОГДА 1000000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускБезНДС) > 100000000
		|			ТОГДА 100000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускБезНДС) > 10000000
		|			ТОГДА 10000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускБезНДС) > 1000000
		|			ТОГДА 1000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускБезНДС) > 100000
		|			ТОГДА 100
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускБезНДС) > 10000
		|			ТОГДА 10
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентБезНДС,
		|	ВЫБОР
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускРегл) > 1000000000
		|			ТОГДА 1000000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускРегл) > 100000000
		|			ТОГДА 100000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускРегл) > 10000000
		|			ТОГДА 10000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускРегл) > 1000000
		|			ТОГДА 1000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускРегл) > 100000
		|			ТОГДА 100
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускРегл) > 10000
		|			ТОГДА 10
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентРегл,
		|	ВЫБОР
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускУпр) > 1000000000
		|			ТОГДА 1000000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускУпр) > 100000000
		|			ТОГДА 100000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускУпр) > 10000000
		|			ТОГДА 10000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускУпр) > 1000000
		|			ТОГДА 1000
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускУпр) > 100000
		|			ТОГДА 100
		|		КОГДА СУММА(ДД.ПоказательОтнесенияНаВыпускУпр) > 10000
		|			ТОГДА 10
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентУпр
		|ПОМЕСТИТЬ КоэффициентыПриведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗатратыПродукции.ПартияПроизводства КАК ПартияПроизводства,
		|		ЗатратыПродукции.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|		ЗатратыПродукции.ПравилоОтнесенияНаВыпуск КАК ПравилоОтнесенияНаВыпуск,
		|		ЗатратыПродукции.ПоказательОтнесенияНаВыпуск КАК ПоказательОтнесенияНаВыпуск,
		|		ЗатратыПродукции.ПоказательОтнесенияНаВыпускБезНДС КАК ПоказательОтнесенияНаВыпускБезНДС,
		|		ЗатратыПродукции.ПоказательОтнесенияНаВыпускРегл КАК ПоказательОтнесенияНаВыпускРегл,
		|		ЗатратыПродукции.ПоказательОтнесенияНаВыпускУпр КАК ПоказательОтнесенияНаВыпускУпр
		|	ИЗ
		|		ЗатратыПродукции КАК ЗатратыПродукции
		//++ НЕ УТКА
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ОстаткиБазРаспределения.ПартияПроизводства,
		|		ОстаткиБазРаспределения.ЗаказНаПроизводство,
		|		ОстаткиБазРаспределения.ПравилоОтнесенияНаВыпуск,
		|		ОстаткиБазРаспределения.Остаток,
		|		ОстаткиБазРаспределения.ОстатокБезНДС,
		|		ОстаткиБазРаспределения.ОстатокРегл,
		|		ОстаткиБазРаспределения.ОстатокУпр
		|	ИЗ
		|		ОстаткиБазРаспределения КАК ОстаткиБазРаспределения
		//-- НЕ УТКА
		|) КАК ДД
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.ЗаказНаПроизводство,
		|	ДД.ПартияПроизводства,
		|	ДД.ПравилоОтнесенияНаВыпуск";
		
	Возврат ТекстЗапроса
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
		
КонецФункции

Функция ТекстОписаниеДанныхДляКоэффициентовПриведения() Экспорт
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка) КАК ПартияПроизводства,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказНаПроизводство,
		|	ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка) КАК ПравилоОтнесенияНаВыпуск,
		|	1 КАК Коэффициент,
		|	1 КАК КоэффициентБезНДС,
		|	1 КАК КоэффициентРегл,
		|	1 КАК КоэффициентУпр
		|ПОМЕСТИТЬ Данные
		|";
		
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОписаниеДанныхДляОстатковБазРаспределения() Экспорт
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
		|	ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка) КАК ПартияПроизводства,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказНаПроизводство,
		|	0 КАК КодСтрокиПродукция,
		|	ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка) КАК ПравилоОтнесенияНаВыпуск,
		|	0 КАК Остаток,
		|	0 КАК ОстатокБезНДС,
		|	0 КАК ОстатокРегл,
		|	0 КАК ОстатокУпр
		|ПОМЕСТИТЬ Данные
		|";
		
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

// ... выборки данных

Функция ТекстПриходыПрочихРасходовНЗП()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстПриходыПрочихРасходовНЗП""                   КАК ЗапросИсточник,
		|	10                                                  КАК Приоритет,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) КАК ТипЗаписи,
		|	ИСТИНА                                              КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)              КАК ВидДвижения,
		|	ДД.Период                                           КАК Период,
		|	ДД.Регистратор                                      КАК Регистратор,
		|	ДД.Организация                                      КАК Организация,
		|	ДД.КорПодразделение                                 КАК Подразделение,
		|	ДД.ПартияПроизводства                               КАК ПартияПроизводства,
		|	ПартииСводно.АналитикаПартииВыпуска                 КАК АналитикаПартииВыпуска,
		|	ДД.ЗаказНаПроизводство                              КАК ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция                               КАК КодСтрокиПродукция,
		|	ДД.КорНаправлениеДеятельности						КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО                                        КАК Спецификация,
		|	ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка) КАК Этап,
		|	ДД.СтатьяКалькуляции                                КАК СтатьяКалькуляции,
		|	ДД.СтатьяРасходов                                   КАК СтатьяРасходов,
		|	ДД.АналитикаРасходов                                КАК АналитикаРасходов,
		|	ДД.ГруппаПродукции                                  КАК ГруппаПродукции,
		|	ДД.ПравилоОтнесенияНаВыпуск                         КАК ПравилоОтнесенияНаВыпуск,
		|	НЕОПРЕДЕЛЕНО                                        КАК АналитикаУчетаПродукции,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК КорАналитикаУчетаПартий,
		|	ДД.НаправлениеДеятельности							КАК КорНаправлениеДеятельности,
		|	0                                                   КАК Знаменатель,
		|	0                                                   КАК КоличествоПродукции,
		|	0                                                   КАК ДоляСтоимости,
		|	0                                                   КАК Стоимость,
		|	0                                                   КАК СтоимостьБезНДС,
		|	0                                                   КАК СтоимостьРегл,
		|	0                                                   КАК ПостояннаяРазница,
		|	0                                                   КАК ВременнаяРазница,
		|	0													КАК ПоказательОтнесенияНаВыпуск,
		|	0													КАК ПоказательОтнесенияНаВыпускБезНДС,
		|	0													КАК ПоказательОтнесенияНаВыпускРегл,
		|	0													КАК ПоказательОтнесенияНаВыпускУпр,
		|	ДД.ДоляСтоимости									КАК ПоказательОтнесенияНаПартию,
		|	ДД.ДоляСтоимостиБезНДС								КАК ПоказательОтнесенияНаПартиюБезНДС,
		|	ДД.ДоляСтоимостиРегл								КАК ПоказательОтнесенияНаПартиюРегл,
		|	ДД.ДоляСтоимостиУпр									КАК ПоказательОтнесенияНаПартиюУпр,
		|	ИСТИНА                                              КАК Первичное,
		|	НЕОПРЕДЕЛЕНО                                        КАК ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО                                        КАК РазделУчета,
		|	НЕОПРЕДЕЛЕНО                                        КАК ВидЗапасов,
		|	НЕОПРЕДЕЛЕНО                                        КАК ВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО                                        КАК ДокументДвижения,
		|	НЕОПРЕДЕЛЕНО                                        КАК Назначение,
		|	НЕОПРЕДЕЛЕНО                                        КАК ДокументИсточник,
		|	ПартииСводно.ДокументВыпуска                        КАК ДокументВыпуска,
		|	НЕОПРЕДЕЛЕНО                                        КАК Продукция,
		|	НЕОПРЕДЕЛЕНО                                        КАК ХарактеристикаПродукции
		|ИЗ
		|	ДолиПроизводственныхРасходов КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПартииДляОтнесенияРасходов КАК ПартииСводно
		|		ПО ПартииСводно.Организация = ДД.Организация
		|		И ПартииСводно.Подразделение = ДД.КорПодразделение
		|		И ПартииСводно.ПартияПроизводства = ДД.ПартияПроизводства
		|		И ПартииСводно.ЗаказНаПроизводство = ДД.ЗаказНаПроизводство
		|		И ПартииСводно.КодСтрокиПродукция = ДД.КодСтрокиПродукция
		|		И ПартииСводно.СтатьяКалькуляции = ДД.СтатьяКалькуляции
		|		И ПартииСводно.СтатьяРасходов = ДД.СтатьяРасходов
		|		И ПартииСводно.АналитикаРасходов = ДД.АналитикаРасходов
		|		И ПартииСводно.ГруппаПродукции = ДД.ГруппаПродукции
		|		И ПартииСводно.ПравилоОтнесенияНаВыпуск = ДД.ПравилоОтнесенияНаВыпуск
		|		И ПартииСводно.НаправлениеДеятельности = ДД.КорНаправлениеДеятельности
		|ГДЕ
		|	ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства)
		|";
КонецФункции

Функция ТекстПриходыПрочихРасходовНЗПНаСебестоимостьПроизводства()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстПриходыПрочихРасходовНЗПНаСебестоимостьПроизводства"" КАК ЗапросИсточник,
		|	10                                                  КАК Приоритет,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) КАК ТипЗаписи,
		|	ИСТИНА                                              КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)              КАК ВидДвижения,
		|	ДД.Период                                           КАК Период,
		|	ДД.Регистратор                                      КАК Регистратор,
		|	ДД.Организация                                      КАК Организация,
		|	ДД.КорПодразделение                                 КАК Подразделение,
		|	ДД.ПартияПроизводства                               КАК ПартияПроизводства,
		|	ПартииСводно.АналитикаПартииВыпуска                 КАК АналитикаПартииВыпуска,
		|	ДД.ЗаказНаПроизводство                              КАК ЗаказНаПроизводство,
		|	ДД.КодСтрокиПродукция                               КАК КодСтрокиПродукция,
		|	ДД.КорНаправлениеДеятельности						КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО                                        КАК Спецификация,
		|	ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка) КАК Этап,
		|	ДД.СтатьяКалькуляции                                КАК СтатьяКалькуляции,
		|	ДД.СтатьяРасходов                                   КАК СтатьяРасходов,
		|	ДД.АналитикаРасходов                                КАК АналитикаРасходов,
		|	ДД.ГруппаПродукции                                  КАК ГруппаПродукции,
		|	ДД.ПравилоОтнесенияНаВыпуск                         КАК ПравилоОтнесенияНаВыпуск,
		|	НЕОПРЕДЕЛЕНО                                        КАК АналитикаУчетаПродукции,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК КорАналитикаУчетаПартий,
		|	ДД.НаправлениеДеятельности							КАК КорНаправлениеДеятельности,
		|	0                                                   КАК Знаменатель,
		|	0                                                   КАК КоличествоПродукции,
		|	0                                                   КАК ДоляСтоимости,
		|	0                                                   КАК Стоимость,
		|	0                                                   КАК СтоимостьБезНДС,
		|	0                                                   КАК СтоимостьРегл,
		|	0                                                   КАК ПостояннаяРазница,
		|	0                                                   КАК ВременнаяРазница,
		|	0													КАК ПоказательОтнесенияНаВыпуск,
		|	0													КАК ПоказательОтнесенияНаВыпускБезНДС,
		|	0													КАК ПоказательОтнесенияНаВыпускРегл,
		|	0													КАК ПоказательОтнесенияНаВыпускУпр,
		|	ДД.ДоляСтоимости									КАК ПоказательОтнесенияНаПартию,
		|	ДД.ДоляСтоимостиБезНДС								КАК ПоказательОтнесенияНаПартиюБезНДС,
		|	ДД.ДоляСтоимостиРегл								КАК ПоказательОтнесенияНаПартиюРегл,
		|	ДД.ДоляСтоимостиУпр									КАК ПоказательОтнесенияНаПартиюУпр,
		|	ИСТИНА                                              КАК Первичное,
		|	НЕОПРЕДЕЛЕНО                                        КАК ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО                                        КАК РазделУчета,
		|	НЕОПРЕДЕЛЕНО                                        КАК ВидЗапасов,
		|	НЕОПРЕДЕЛЕНО                                        КАК ВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО                                        КАК ДокументДвижения,
		|	НЕОПРЕДЕЛЕНО                                        КАК Назначение,
		|	НЕОПРЕДЕЛЕНО                                        КАК ДокументИсточник,
		|	ПартииСводно.ДокументВыпуска                        КАК ДокументВыпуска,
		|	НЕОПРЕДЕЛЕНО                                        КАК Продукция,
		|	НЕОПРЕДЕЛЕНО                                        КАК ХарактеристикаПродукции
		|ИЗ
		|	ПрямыеПроизводственныеРасходы КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПартииДляОтнесенияРасходов КАК ПартииСводно
		|		ПО ПартииСводно.Организация = ДД.Организация
		|		И ПартииСводно.Подразделение = ДД.КорПодразделение
		|		И ПартииСводно.ПартияПроизводства = ДД.ПартияПроизводства
		|		И ПартииСводно.ЗаказНаПроизводство = ДД.ЗаказНаПроизводство
		|		И ПартииСводно.КодСтрокиПродукция = ДД.КодСтрокиПродукция
		|		И ПартииСводно.СтатьяКалькуляции = ДД.СтатьяКалькуляции
		|		И ПартииСводно.СтатьяРасходов = ДД.СтатьяРасходов
		|		И ПартииСводно.АналитикаРасходов = ДД.АналитикаРасходов
		|		И ПартииСводно.ГруппаПродукции = ДД.ГруппаПродукции
		|		И ПартииСводно.ПравилоОтнесенияНаВыпуск = ДД.ПравилоОтнесенияНаВыпуск
		|";
КонецФункции

Функция ТекстРасходыПрочихРасходовНЗППоМатериалам() // использует ПартииДляОтнесенияРасходов, МатериальныеЗатратыПроизводства, ОстаткиПриходыРасходы, РаботыДляДавальца
	Возврат "
	|ВЫБРАТЬ
	|	""ТекстРасходыПрочихРасходовНЗППоМатериалам""       КАК ЗапросИсточник,
	|	10                                                  КАК Приоритет,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) КАК ТипЗаписи,
	|	ИСТИНА                                              КАК РасчетЗавершен,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)              КАК ВидДвижения,
	|	Материальные.ДатаПроизводства                       КАК Период,
	|	Материальные.РегистраторРасхода                     КАК Регистратор,
	|	ДД.Организация                                      КАК Организация,
	|	ДД.Подразделение                                    КАК Подразделение,
	|	ДД.ПартияПроизводства                               КАК ПартияПроизводства,
	|	ДД.АналитикаПартииВыпуска                           КАК АналитикаПартииВыпуска,
	|	ДД.ЗаказНаПроизводство                              КАК ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция                               КАК КодСтрокиПродукция,
	|	ДД.НаправлениеДеятельности                          КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                                        КАК Спецификация,
	|	ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка) КАК Этап,
	|	ДД.СтатьяКалькуляции                                КАК СтатьяКалькуляции,
	|	ДД.СтатьяРасходов                                   КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                КАК АналитикаРасходов,
	|	ДД.ГруппаПродукции                                  КАК ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск                         КАК ПравилоОтнесенияНаВыпуск,
	|	ЕСТЬNULL(РаботыДляДавальца.КорАналитикаУчетаНоменклатуры, Материальные.КорАналитикаУчетаНоменклатуры) КАК АналитикаУчетаПродукции,
	|	Материальные.КорАналитикаУчетаПартий                КАК КорАналитикаУчетаПартий,
	|	ДД.НаправлениеДеятельности                          КАК КорНаправлениеДеятельности,
	|	0                                                   КАК Знаменатель,
	|	0                                                   КАК КоличествоПродукции,
	|	0                                                   КАК ДоляСтоимости,
	|	0                                                   КАК Стоимость,
	|	0                                                   КАК СтоимостьБезНДС,
	|	0                                                   КАК СтоимостьРегл,
	|	0                                                   КАК ПостояннаяРазница,
	|	0                                                   КАК ВременнаяРазница,
	|	ВЫБОР 
	|		КОГДА ДД.ВариантРаспределенияРасходовУпр В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ТОГДА ВЫРАЗИТЬ(Материальные.Стоимость / ЕСТЬNULL(Коэффициенты.Коэффициент, 1) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК ПоказательОтнесенияНаВыпуск,
	|	ВЫБОР 
	|		КОГДА ДД.ВариантРаспределенияРасходовУпр В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ТОГДА ВЫРАЗИТЬ(Материальные.СтоимостьБезНДС / ЕСТЬNULL(Коэффициенты.КоэффициентБезНДС, 1) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК ПоказательОтнесенияНаВыпускБезНДС,
	|	ВЫБОР 
	|		КОГДА ДД.ВариантРаспределенияРасходовРегл В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ИЛИ ДД.ВариантРаспределенияРасходовНУ В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ТОГДА ВЫРАЗИТЬ(Материальные.СтоимостьРегл / ЕСТЬNULL(Коэффициенты.КоэффициентРегл, 1) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК ПоказательОтнесенияНаВыпускРегл,
	|	ВЫБОР 
	|		КОГДА ДД.ВариантРаспределенияРасходовУпр В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ТОГДА ВЫРАЗИТЬ(Материальные.СтоимостьУпр / ЕСТЬNULL(Коэффициенты.КоэффициентУпр, 1) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК ПоказательОтнесенияНаВыпускУпр,
	|	0                                                   КАК ПоказательОтнесенияНаПартию,
	|	0                                                   КАК ПоказательОтнесенияНаПартиюБезНДС,
	|	0                                                   КАК ПоказательОтнесенияНаПартиюРегл,
	|	0                                                   КАК ПоказательОтнесенияНаПартиюУпр,
	|	ИСТИНА                                              КАК Первичное,
	|	НЕОПРЕДЕЛЕНО                                        КАК ХозяйственнаяОперация,
	|	ЕСТЬNULL(РаботыДляДавальца.КорРазделУчета, Материальные.КорРазделУчета) КАК РазделУчета,
	|	ЕСТЬNULL(РаботыДляДавальца.КорВидЗапасов, Материальные.КорВидЗапасов)  КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ
	|			ЕСТЬNULL(
	|				ВЫРАЗИТЬ(ДД.АналитикаПартииВыпуска КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Назначение.ВидДеятельностиНДС, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ 												КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО                                        КАК ДокументДвижения,
	|	НЕОПРЕДЕЛЕНО                                        КАК Назначение,
	|	НЕОПРЕДЕЛЕНО                                        КАК ДокументИсточник,
	|	ДД.ДокументВыпуска                                  КАК ДокументВыпуска,
	|	НЕОПРЕДЕЛЕНО                                        КАК Продукция,
	|	НЕОПРЕДЕЛЕНО                                        КАК ХарактеристикаПродукции
	|ИЗ
	|	ПартииДляОтнесенияРасходов КАК ДД
	// расход на каждую аналитику выпуска
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ МатериальныеЗатратыПроизводства КАК Материальные
	|		ПО Материальные.Подразделение = ДД.Подразделение
	|		И Материальные.ПартияПроизводства = ДД.ПартияПроизводства
	|		И Материальные.ЗаказНаПроизводство = ДД.ЗаказНаПроизводство
	|		И Материальные.КодСтрокиПродукция = ДД.КодСтрокиПродукция
	|	ЛЕВОЕ СОЕДИНЕНИЕ РаботыДляДавальца КАК РаботыДляДавальца
	|		ПО Материальные.РегистраторРасхода = РаботыДляДавальца.Регистратор
	|		И Материальные.КорАналитикаУчетаНоменклатуры = РаботыДляДавальца.АналитикаУчетаНоменклатуры
	|		И Материальные.КорВидЗапасов = РаботыДляДавальца.ВидЗапасов
	|		И Материальные.КорАналитикаУчетаПартий = РаботыДляДавальца.АналитикаУчетаПартий
	|	ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыПриведения КАК Коэффициенты
	|		ПО Коэффициенты.ПартияПроизводства = ДД.ПартияПроизводства
	|		И Коэффициенты.ЗаказНаПроизводство = ДД.ЗаказНаПроизводство
	|		И Коэффициенты.ПравилоОтнесенияНаВыпуск = ДД.ПравилоОтнесенияНаВыпуск
	|ГДЕ
	|	ДД.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымЗатратам)
	|";
КонецФункции

Функция ТекстРасходыПрочихРасходовНЗППоТрудозатратам() // использует ПартииДляОтнесенияРасходов, ТрудозатратыПроизводства, ОстаткиПриходыРасходы, РаботыДляДавальца
	Возврат "
	|ВЫБРАТЬ
	|	""ТекстРасходыПрочихРасходовНЗППоТрудозатратам""    КАК ЗапросИсточник,
	|	10                                                  КАК Приоритет,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) КАК ТипЗаписи,
	|	ИСТИНА                                              КАК РасчетЗавершен,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)              КАК ВидДвижения,
	|	Трудозатраты.ДатаПроизводства                       КАК Период,
	|	Трудозатраты.РегистраторРасхода                     КАК Регистратор,
	|	ДД.Организация                                      КАК Организация,
	|	ДД.Подразделение                                    КАК Подразделение,
	|	ДД.ПартияПроизводства                               КАК ПартияПроизводства,
	|	ДД.АналитикаПартииВыпуска                           КАК АналитикаПартииВыпуска,
	|	ДД.ЗаказНаПроизводство                              КАК ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция                               КАК КодСтрокиПродукция,
	|	ДД.НаправлениеДеятельности                          КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                                        КАК Спецификация,
	|	ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка) КАК Этап,
	|	ДД.СтатьяКалькуляции                                КАК СтатьяКалькуляции,
	|	ДД.СтатьяРасходов                                   КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                КАК АналитикаРасходов,
	|	ДД.ГруппаПродукции                                  КАК ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск                         КАК ПравилоОтнесенияНаВыпуск,
	|	ЕСТЬNULL(РаботыДляДавальца.КорАналитикаУчетаНоменклатуры, Трудозатраты.КорАналитикаУчетаНоменклатуры) КАК АналитикаУчетаПродукции,
	|	Трудозатраты.КорАналитикаУчетаПартий                КАК КорАналитикаУчетаПартий,
	|	ДД.НаправлениеДеятельности                          КАК КорНаправлениеДеятельности,
	|	0                                                   КАК Знаменатель,
	|	0                                                   КАК КоличествоПродукции,
	|	0                                                   КАК ДоляСтоимости,
	|	0                                                   КАК Стоимость,
	|	0                                                   КАК СтоимостьБезНДС,
	|	0                                                   КАК СтоимостьРегл,
	|	0                                                   КАК ПостояннаяРазница,
	|	0                                                   КАК ВременнаяРазница,
	|	ВЫБОР 
	|		КОГДА ДД.ВариантРаспределенияРасходовУпр В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ТОГДА ВЫРАЗИТЬ(Трудозатраты.Стоимость / ЕСТЬNULL(Коэффициенты.Коэффициент, 1) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК ПоказательОтнесенияНаВыпуск,
	|	ВЫБОР 
	|		КОГДА ДД.ВариантРаспределенияРасходовУпр В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ТОГДА ВЫРАЗИТЬ(Трудозатраты.СтоимостьБезНДС / ЕСТЬNULL(Коэффициенты.КоэффициентБезНДС, 1) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК ПоказательОтнесенияНаВыпускБезНДС,
	|	ВЫБОР 
	|		КОГДА ДД.ВариантРаспределенияРасходовРегл В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ИЛИ ДД.ВариантРаспределенияРасходовНУ В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ТОГДА ВЫРАЗИТЬ(Трудозатраты.СтоимостьРегл / ЕСТЬNULL(Коэффициенты.КоэффициентРегл, 1) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК ПоказательОтнесенияНаВыпускРегл,
	|	ВЫБОР 
	|		КОГДА ДД.ВариантРаспределенияРасходовУпр В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ТОГДА ВЫРАЗИТЬ(Трудозатраты.СтоимостьУпр / ЕСТЬNULL(Коэффициенты.КоэффициентУпр, 1) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК ПоказательОтнесенияНаВыпускУпр,
	|	0                                                   КАК ПоказательОтнесенияНаПартию,
	|	0                                                   КАК ПоказательОтнесенияНаПартиюБезНДС,
	|	0                                                   КАК ПоказательОтнесенияНаПартиюРегл,
	|	0                                                   КАК ПоказательОтнесенияНаПартиюУпр,
	|	ИСТИНА                                              КАК Первичное,
	|	НЕОПРЕДЕЛЕНО                                        КАК ХозяйственнаяОперация,
	|	ЕСТЬNULL(РаботыДляДавальца.КорРазделУчета, Трудозатраты.КорРазделУчета) КАК РазделУчета,
	|	ЕСТЬNULL(РаботыДляДавальца.КорВидЗапасов, Трудозатраты.КорВидЗапасов)   КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ
	|			ЕСТЬNULL(
	|				ВЫРАЗИТЬ(ДД.АналитикаПартииВыпуска КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Назначение.ВидДеятельностиНДС, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ 												КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО                                        КАК ДокументДвижения,
	|	НЕОПРЕДЕЛЕНО                                        КАК Назначение,
	|	НЕОПРЕДЕЛЕНО                                        КАК ДокументИсточник,
	|	ДД.ДокументВыпуска                                  КАК ДокументВыпуска,
	|	НЕОПРЕДЕЛЕНО                                        КАК Продукция,
	|	НЕОПРЕДЕЛЕНО                                        КАК ХарактеристикаПродукции
	|ИЗ
	|	ПартииДляОтнесенияРасходов КАК ДД
	// расход на каждую аналитику выпуска
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТрудозатратыПроизводства КАК Трудозатраты
	|		ПО Трудозатраты.Подразделение = ДД.Подразделение
	|		И Трудозатраты.ПартияПроизводства = ДД.ПартияПроизводства
	|		И Трудозатраты.ЗаказНаПроизводство = ДД.ЗаказНаПроизводство
	|		И Трудозатраты.КодСтрокиПродукция = ДД.КодСтрокиПродукция
	|	ЛЕВОЕ СОЕДИНЕНИЕ РаботыДляДавальца КАК РаботыДляДавальца
	|		ПО Трудозатраты.РегистраторРасхода = РаботыДляДавальца.Регистратор
	|		И Трудозатраты.КорАналитикаУчетаНоменклатуры = РаботыДляДавальца.АналитикаУчетаНоменклатуры
	|		И Трудозатраты.КорВидЗапасов = РаботыДляДавальца.ВидЗапасов
	|		И Трудозатраты.КорАналитикаУчетаПартий = РаботыДляДавальца.АналитикаУчетаПартий
	|	ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыПриведения КАК Коэффициенты
	|		ПО Коэффициенты.ПартияПроизводства = ДД.ПартияПроизводства
	|		И Коэффициенты.ЗаказНаПроизводство = ДД.ЗаказНаПроизводство
	|		И Коэффициенты.ПравилоОтнесенияНаВыпуск = ДД.ПравилоОтнесенияНаВыпуск
	|ГДЕ
	|	ДД.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоТрудозатратам)
	|";
КонецФункции

Функция ТекстРасходыПрочихРасходовНЗППоМатериальнымИТрудозатратам() // использует ПартииДляОтнесенияРасходов, МатериальныеИТрудозатратыПроизводства, ОстаткиПриходыРасходы, РаботыДляДавальца
	Возврат "
	|ВЫБРАТЬ
	|	""ТекстРасходыПрочихРасходовНЗППоМатериальнымИТрудозатратам"" КАК ЗапросИсточник,
	|	10                                                  КАК Приоритет,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) КАК ТипЗаписи,
	|	ИСТИНА                                              КАК РасчетЗавершен,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)              КАК ВидДвижения,
	|	Затраты.ДатаПроизводства                            КАК Период,
	|	Затраты.РегистраторРасхода                          КАК Регистратор,
	|	ДД.Организация                                      КАК Организация,
	|	ДД.Подразделение                                    КАК Подразделение,
	|	ДД.ПартияПроизводства                               КАК ПартияПроизводства,
	|	ДД.АналитикаПартииВыпуска                           КАК АналитикаПартииВыпуска,
	|	ДД.ЗаказНаПроизводство                              КАК ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция                               КАК КодСтрокиПродукция,
	|	ДД.НаправлениеДеятельности                          КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                                        КАК Спецификация,
	|	ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка) КАК Этап,
	|	ДД.СтатьяКалькуляции                                КАК СтатьяКалькуляции,
	|	ДД.СтатьяРасходов                                   КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                КАК АналитикаРасходов,
	|	ДД.ГруппаПродукции                                  КАК ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск                         КАК ПравилоОтнесенияНаВыпуск,
	|	ЕСТЬNULL(РаботыДляДавальца.КорАналитикаУчетаНоменклатуры, Затраты.КорАналитикаУчетаНоменклатуры) КАК АналитикаУчетаПродукции,
	|	Затраты.КорАналитикаУчетаПартий                     КАК КорАналитикаУчетаПартий,
	|	ДД.НаправлениеДеятельности                          КАК КорНаправлениеДеятельности,
	|	0                                                   КАК Знаменатель,
	|	0                                                   КАК КоличествоПродукции,
	|	0                                                   КАК ДоляСтоимости,
	|	0                                                   КАК Стоимость,
	|	0                                                   КАК СтоимостьБезНДС,
	|	0                                                   КАК СтоимостьРегл,
	|	0                                                   КАК ПостояннаяРазница,
	|	0                                                   КАК ВременнаяРазница,
	|	ВЫБОР 
	|		КОГДА ДД.ВариантРаспределенияРасходовУпр В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ТОГДА ВЫРАЗИТЬ(Затраты.Стоимость / ЕСТЬNULL(Коэффициенты.Коэффициент, 1) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК ПоказательОтнесенияНаВыпуск,
	|	ВЫБОР 
	|		КОГДА ДД.ВариантРаспределенияРасходовУпр В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ТОГДА ВЫРАЗИТЬ(Затраты.СтоимостьБезНДС / ЕСТЬNULL(Коэффициенты.КоэффициентБезНДС, 1) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК ПоказательОтнесенияНаВыпускБезНДС,
	|	ВЫБОР 
	|		КОГДА ДД.ВариантРаспределенияРасходовРегл В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ИЛИ ДД.ВариантРаспределенияРасходовНУ В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ТОГДА ВЫРАЗИТЬ(Затраты.СтоимостьРегл / ЕСТЬNULL(Коэффициенты.КоэффициентРегл, 1) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК ПоказательОтнесенияНаВыпускРегл,
	|	ВЫБОР 
	|		КОГДА ДД.ВариантРаспределенияРасходовУпр В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ТОГДА ВЫРАЗИТЬ(Затраты.СтоимостьУпр / ЕСТЬNULL(Коэффициенты.КоэффициентУпр, 1) КАК ЧИСЛО (23, 10))
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК ПоказательОтнесенияНаВыпускУпр,
	|	0                                                   КАК ПоказательОтнесенияНаПартию,
	|	0                                                   КАК ПоказательОтнесенияНаПартиюБезНДС,
	|	0                                                   КАК ПоказательОтнесенияНаПартиюРегл,
	|	0                                                   КАК ПоказательОтнесенияНаПартиюУпр,
	|	ИСТИНА                                              КАК Первичное,
	|	НЕОПРЕДЕЛЕНО                                        КАК ХозяйственнаяОперация,
	|	ЕСТЬNULL(РаботыДляДавальца.КорРазделУчета, Затраты.КорРазделУчета) КАК РазделУчета,
	|	ЕСТЬNULL(РаботыДляДавальца.КорВидЗапасов, Затраты.КорВидЗапасов)   КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ
	|			ЕСТЬNULL(
	|				ВЫРАЗИТЬ(ДД.АналитикаПартииВыпуска КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Назначение.ВидДеятельностиНДС, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ 												КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО                                        КАК ДокументДвижения,
	|	НЕОПРЕДЕЛЕНО                                        КАК Назначение,
	|	НЕОПРЕДЕЛЕНО                                        КАК ДокументИсточник,
	|	ДД.ДокументВыпуска                                  КАК ДокументВыпуска,
	|	НЕОПРЕДЕЛЕНО                                        КАК Продукция,
	|	НЕОПРЕДЕЛЕНО                                        КАК ХарактеристикаПродукции
	|ИЗ
	|	ПартииДляОтнесенияРасходов КАК ДД
	// расход на каждую аналитику выпуска
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ МатериальныеИТрудозатратыПроизводства КАК Затраты
	|		ПО Затраты.Подразделение = ДД.Подразделение
	|		И Затраты.ПартияПроизводства = ДД.ПартияПроизводства
	|		И Затраты.ЗаказНаПроизводство = ДД.ЗаказНаПроизводство
	|		И Затраты.КодСтрокиПродукция = ДД.КодСтрокиПродукция
	|	ЛЕВОЕ СОЕДИНЕНИЕ РаботыДляДавальца КАК РаботыДляДавальца
	|		ПО Затраты.РегистраторРасхода = РаботыДляДавальца.Регистратор
	|		И Затраты.КорАналитикаУчетаНоменклатуры = РаботыДляДавальца.АналитикаУчетаНоменклатуры
	|		И Затраты.КорВидЗапасов = РаботыДляДавальца.ВидЗапасов
	|		И Затраты.КорАналитикаУчетаПартий = РаботыДляДавальца.АналитикаУчетаПартий
	|	ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыПриведения КАК Коэффициенты
	|		ПО Коэффициенты.ПартияПроизводства = ДД.ПартияПроизводства
	|		И Коэффициенты.ЗаказНаПроизводство = ДД.ЗаказНаПроизводство
	|		И Коэффициенты.ПравилоОтнесенияНаВыпуск = ДД.ПравилоОтнесенияНаВыпуск
	|ГДЕ
	|	ДД.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымИТрудозатратам)
	|";
КонецФункции

Функция ТекстРасходыПрочихРасходовНЗППоПродукции() // использует ПартииДляОтнесенияРасходов, ВыпущеннаяПродукция, РаботыДляДавальца
	Возврат "
			|ВЫБРАТЬ
			|	""ТекстРасходыПрочихРасходовНЗППоПродукции""        КАК ЗапросИсточник,
			|	10                                                  КАК Приоритет,
			|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) КАК ТипЗаписи,
			|	ИСТИНА                                              КАК РасчетЗавершен,
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)              КАК ВидДвижения,
			|	Продукция.ДатаПроизводства                          КАК Период,
			|	Продукция.РегистраторРасхода                        КАК Регистратор,
			|	ДД.Организация                                      КАК Организация,
			|	ДД.Подразделение                                    КАК Подразделение,
			|	ДД.ПартияПроизводства                               КАК ПартияПроизводства,
			|	ДД.АналитикаПартииВыпуска                           КАК АналитикаПартииВыпуска,
			|	ДД.ЗаказНаПроизводство                              КАК ЗаказНаПроизводство,
			|	ДД.КодСтрокиПродукция                               КАК КодСтрокиПродукция,
			|	ДД.НаправлениеДеятельности                          КАК НаправлениеДеятельности,
			|	НЕОПРЕДЕЛЕНО                                        КАК Спецификация,
			|	ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка) КАК Этап,
			|	ДД.СтатьяКалькуляции                                КАК СтатьяКалькуляции,
			|	ДД.СтатьяРасходов                                   КАК СтатьяРасходов,
			|	ДД.АналитикаРасходов                                КАК АналитикаРасходов,
			|	ДД.ГруппаПродукции                                  КАК ГруппаПродукции,
			|	ДД.ПравилоОтнесенияНаВыпуск                         КАК ПравилоОтнесенияНаВыпуск,
			|	ЕСТЬNULL(РаботыДляДавальца.КорАналитикаУчетаНоменклатуры, Продукция.КорАналитикаУчетаНоменклатуры) КАК АналитикаУчетаПродукции,
			|	Продукция.КорАналитикаУчетаПартий                   КАК КорАналитикаУчетаПартий,
			|	ДД.НаправлениеДеятельности							КАК КорНаправлениеДеятельности,
			|	0                                                   КАК Знаменатель,
			|	0                                                   КАК КоличествоПродукции,
			|	0                                                   КАК ДоляСтоимости,
			|	0                                                   КАК Стоимость,
			|	0                                                   КАК СтоимостьБезНДС,
			|	0                                                   КАК СтоимостьРегл,
			|	0                                                   КАК ПостояннаяРазница,
			|	0                                                   КАК ВременнаяРазница,
			|	ВЫБОР 
			|		КОГДА ДД.ВариантРаспределенияРасходовУпр В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
			|			ТОГДА ВЫРАЗИТЬ(Продукция.Стоимость / ЕСТЬNULL(Коэффициенты.Коэффициент, 1) КАК ЧИСЛО (23, 10))
			|		ИНАЧЕ 0
			|	КОНЕЦ												КАК ПоказательОтнесенияНаВыпуск,
			|	ВЫБОР 
			|		КОГДА ДД.ВариантРаспределенияРасходовУпр В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
			|			ТОГДА ВЫРАЗИТЬ(Продукция.Стоимость / ЕСТЬNULL(Коэффициенты.Коэффициент, 1) КАК ЧИСЛО (23, 10))
			|		ИНАЧЕ 0
			|	КОНЕЦ												КАК ПоказательОтнесенияНаВыпускБезНДС,
			|	ВЫБОР 
			|		КОГДА ДД.ВариантРаспределенияРасходовРегл В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
			|			ИЛИ ДД.ВариантРаспределенияРасходовНУ В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
			|			ТОГДА ВЫРАЗИТЬ(Продукция.Стоимость / ЕСТЬNULL(Коэффициенты.Коэффициент, 1) КАК ЧИСЛО (23, 10))
			|		ИНАЧЕ 0
			|	КОНЕЦ												КАК ПоказательОтнесенияНаВыпускРегл,
			|	ВЫБОР 
			|		КОГДА &УправленческийУчетОрганизаций
			|			И ДД.ВариантРаспределенияРасходовУпр В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
			|			ТОГДА ВЫРАЗИТЬ(Продукция.Стоимость / ЕСТЬNULL(Коэффициенты.Коэффициент, 1) КАК ЧИСЛО (23, 10))
			|		ИНАЧЕ 0
			|	КОНЕЦ												КАК ПоказательОтнесенияНаВыпускУпр,
			|	0                                                   КАК ПоказательОтнесенияНаПартию,
			|	0                                                   КАК ПоказательОтнесенияНаПартиюБезНДС,
			|	0                                                   КАК ПоказательОтнесенияНаПартиюРегл,
			|	0                                                   КАК ПоказательОтнесенияНаПартиюУпр,
			|	ИСТИНА                                              КАК Первичное,
			|	НЕОПРЕДЕЛЕНО                                        КАК ХозяйственнаяОперация,
			|	ЕСТЬNULL(РаботыДляДавальца.КорРазделУчета, Продукция.КорРазделУчета) КАК РазделУчета,
			|	ЕСТЬNULL(РаботыДляДавальца.КорВидЗапасов, Продукция.КорВидЗапасов)   КАК ВидЗапасов,
			|	ВЫБОР
			|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ
			|			ЕСТЬNULL(
			|				ВЫРАЗИТЬ(ДД.АналитикаПартииВыпуска КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Назначение.ВидДеятельностиНДС, НЕОПРЕДЕЛЕНО)
			|	КОНЕЦ 												КАК ВидДеятельностиНДС,
			|	НЕОПРЕДЕЛЕНО                                        КАК ДокументДвижения,
			|	НЕОПРЕДЕЛЕНО                                        КАК Назначение,
			|	НЕОПРЕДЕЛЕНО                                        КАК ДокументИсточник,
			|	ДД.ДокументВыпуска                                  КАК ДокументВыпуска,
			|	НЕОПРЕДЕЛЕНО                                        КАК Продукция,
			|	НЕОПРЕДЕЛЕНО                                        КАК ХарактеристикаПродукции
			|ИЗ
			|	ПартииДляОтнесенияРасходов КАК ДД
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыпущеннаяПродукция КАК Продукция
			|		ПО Продукция.ПартияПроизводства = ДД.ПартияПроизводства
			|		И Продукция.ЗаказНаПроизводство = ДД.ЗаказНаПроизводство
			|		И Продукция.КодСтрокиПродукция = ДД.КодСтрокиПродукция
			|		И ВЫБОР
			|			КОГДА Продукция.КодСтрокиПродукция > 0
			|				ТОГДА Продукция.Подразделение = ДД.Подразделение
			|			ИНАЧЕ
			|				ИСТИНА
			|		КОНЕЦ
			|	ЛЕВОЕ СОЕДИНЕНИЕ РаботыДляДавальца КАК РаботыДляДавальца
			|		ПО Продукция.РегистраторРасхода = РаботыДляДавальца.Регистратор
			|		И Продукция.КорАналитикаУчетаНоменклатуры = РаботыДляДавальца.АналитикаУчетаНоменклатуры
			|		И Продукция.КорВидЗапасов = РаботыДляДавальца.ВидЗапасов
			|		И Продукция.КорАналитикаУчетаПартий = РаботыДляДавальца.АналитикаУчетаПартий
			|	ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыПриведения КАК Коэффициенты
			|		ПО Коэффициенты.ПартияПроизводства = ДД.ПартияПроизводства
			|		И Коэффициенты.ЗаказНаПроизводство = ДД.ЗаказНаПроизводство
			|		И Коэффициенты.ПравилоОтнесенияНаВыпуск = ДД.ПравилоОтнесенияНаВыпуск
			|ГДЕ
			|	ДД.ПравилоОтнесенияНаВыпуск В (ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукции),
			|									ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукцииСУчетомБудущихВыпусков))
			|	И Продукция.ДатаПроизводства МЕЖДУ &НачалоПериода И &КонецПериода
			|";
КонецФункции

#КонецОбласти

//-- НЕ УТ

#Область ПроцедурыЭтапа18_РаспределениеНаПродажи

Функция ТаблицаДляРаспределенияРасходовНаПродажу(ПараметрыРасчета)
	
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ТаблицаДляРаспределенияПартий(ПараметрыРасчета,
		ТекстОписаниеДанныхДляРаспределенияРасходовНаПродажи());
	
КонецФункции

// Выборка данных

Процедура ПолучитьДанныеДляРаспределенияРасходовНаПродажу(ПараметрыРасчета)
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаРаспределениеРасходовНаПродажи(ПараметрыРасчета));
	
КонецПроцедуры

Функция ТекстЗапросаРаспределениеРасходовНаПродажи(ПараметрыРасчета) Экспорт
	
	Возврат ТекстЗапросаБазаРаспределенияРасходовНаПродажи()
		+ ТекстЗапросаПодготовкаДанныхРаспределенияРасходовНаПродажи()
		+ ТекстОписаниеДанныхДляРаспределенияРасходовНаПродажи()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстЗапросаВыборкаРаспределениеРасходовНаПродажи()
	
КонецФункции

Функция ТекстЗапросаБазаРаспределенияРасходовНаПродажи()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочиеРасходы.Организация КАК Организация,
	|	ПрочиеРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ПрочиеРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВтОтборПродажПоПартнеру
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ПрочиеРасходы
	|ГДЕ
	|	ПрочиеРасходы.Организация В (&МассивОрганизаций)
	|	И ПрочиеРасходы.Период >= &НачалоПериода
	|	И ПрочиеРасходы.Период <= &КонецПериода
	|	И ПрочиеРасходы.Активность
	|	И ПрочиеРасходы.АналитикаРасходов ССЫЛКА Справочник.Партнеры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочиеРасходы.Организация КАК Организация,
	|	ПрочиеРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ПрочиеРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВтОтборПродажПоЗаказу
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ПрочиеРасходы
	|ГДЕ
	|	ПрочиеРасходы.Организация В (&МассивОрганизаций)
	|	И ПрочиеРасходы.Период >= &НачалоПериода
	|	И ПрочиеРасходы.Период <= &КонецПериода
	|	И ПрочиеРасходы.Активность
	|	И (ПрочиеРасходы.АналитикаРасходов ССЫЛКА Документ.ЗаказКлиента
	|	ИЛИ ПрочиеРасходы.АналитикаРасходов ССЫЛКА Документ.АктВыполненныхРабот
	|	ИЛИ ПрочиеРасходы.АналитикаРасходов ССЫЛКА Документ.РеализацияТоваровУслуг)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Отбор.Организация КАК Организация,
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВтОтборПродажПоРеализациямПрошлыхПериодов
	|ИЗ
	|	ВтОтборПродажПоЗаказу КАК Отбор
	|ГДЕ
	|	Отбор.АналитикаРасходов ССЫЛКА Документ.АктВыполненныхРабот
	|	И ВЫРАЗИТЬ(Отбор.АналитикаРасходов КАК Документ.АктВыполненныхРабот).Дата < &НачалоПериода
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Отбор.Организация КАК Организация,
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	ВтОтборПродажПоЗаказу КАК Отбор
	|ГДЕ
	|	Отбор.АналитикаРасходов ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И ВЫРАЗИТЬ(Отбор.АналитикаРасходов КАК Документ.РеализацияТоваровУслуг).Дата < &НачалоПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочиеРасходы.Организация КАК Организация,
	|	ПрочиеРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ПрочиеРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВтОтборПродажПоСделке
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ПрочиеРасходы
	|ГДЕ
	|	ПрочиеРасходы.Организация В (&МассивОрганизаций)
	|	И ПрочиеРасходы.Период >= &НачалоПериода
	|	И ПрочиеРасходы.Период <= &КонецПериода
	|	И ПрочиеРасходы.Активность
	|	И ПрочиеРасходы.АналитикаРасходов ССЫЛКА Справочник.СделкиСКлиентами
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	Отбор.Организация КАК Организация,
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВтНезаполненныеАналитикиРасходов
	|ИЗ ВтОтборПродажПоПартнеру КАК Отбор
	|ГДЕ
	|	Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ 
	|	Отбор.Организация,
	|	Отбор.АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ ВтОтборПродажПоСделке КАК Отбор
	|ГДЕ
	|	Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ 
	|	Отбор.Организация,
	|	Отбор.АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ ВтОтборПродажПоЗаказу КАК Отбор
	|ГДЕ
	|	Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|		ИЛИ Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.АктВыполненныхРабот.ПустаяСсылка)
	|		ИЛИ Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|		ИЛИ Отбор.АналитикаРасходов = НЕОПРЕДЕЛЕНО
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Отбор.Организация КАК Организация,
	|	ВыручкаИСебестоимостьПродаж.Период КАК Период,
	|	ВыручкаИСебестоимостьПродаж.Регистратор КАК Регистратор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента КАК ЗаказКлиента,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВыручкаИСебестоимостьПродаж.Подразделение КАК Подразделение,
	|	ВыручкаИСебестоимостьПродаж.ТипЗапасов КАК ТипЗапасов,
	|	ВыручкаИСебестоимостьПродаж.ВидЗапасов КАК ВидЗапасов,
	|	ВыручкаИСебестоимостьПродаж.РазделУчета КАК РазделУчета,
	|	ВыручкаИСебестоимостьПродаж.Партия КАК Партия,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ВыручкаИСебестоимостьПродаж.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ВыручкаИСебестоимостьПродаж.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ВыручкаИСебестоимостьПродаж.Менеджер КАК Менеджер,
	|	ВыручкаИСебестоимостьПродаж.Склад КАК Склад,
	|	ВыручкаИСебестоимостьПродаж.Соглашение КАК Соглашение,
	|	ВыручкаИСебестоимостьПродаж.Договор КАК Договор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.Сторно,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручки КАК ВыручкаУпр,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручкиБезНДС КАК ВыручкаРегл,
	|	ВыручкаИСебестоимостьПродаж.Стоимость КАК СебестоимостьУпр,
	|	ВыручкаИСебестоимостьПродаж.СтоимостьБезНДС КАК СебестоимостьРегл,
	|	ВыручкаИСебестоимостьПродаж.Количество КАК Количество,
	|	&Вес * ВыручкаИСебестоимостьПродаж.Количество КАК Вес,
	|	&Объем * ВыручкаИСебестоимостьПродаж.Количество КАК Объем,
	|	ВыручкаИСебестоимостьПродаж.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ВыручкаИСебестоимостьПродаж.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВыручкаИСебестоимостьПродаж.ВалютаДокумента КАК ВалютаДокумента,
	|	ВыручкаИСебестоимостьПродаж.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры
	|ПОМЕСТИТЬ ВтБазаРаспределенияПродажИсхДанные
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборПродажПоПартнеру КАК Отбор
	|			ПО КлючиАналитикиУчетаПоПартнерам.Партнер = Отбор.АналитикаРасходов
	|			И КлючиАналитикиУчетаПоПартнерам.Организация = Отбор.Организация
	|ГДЕ
	|	ВыручкаИСебестоимостьПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КлючиАналитикиУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|	И НЕ Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И (ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента = Отбор.НаправлениеДеятельности
	|		ИЛИ Отбор.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Отбор.Организация КАК Организация,
	|	ВыручкаИСебестоимостьПродаж.Период КАК Период,
	|	ВыручкаИСебестоимостьПродаж.Регистратор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам,
	|	ВыручкаИСебестоимостьПродаж.Подразделение,
	|	ВыручкаИСебестоимостьПродаж.ТипЗапасов,
	|	ВыручкаИСебестоимостьПродаж.ВидЗапасов,
	|	ВыручкаИСебестоимостьПродаж.РазделУчета,
	|	ВыручкаИСебестоимостьПродаж.Партия,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПартий,
	|	ВыручкаИСебестоимостьПродаж.АналитикаФинансовогоУчета,
	|	ВыручкаИСебестоимостьПродаж.ВидДеятельностиНДС,
	|	ВыручкаИСебестоимостьПродаж.Менеджер,
	|	ВыручкаИСебестоимостьПродаж.Склад,
	|	ВыручкаИСебестоимостьПродаж.Соглашение,
	|	ВыручкаИСебестоимостьПродаж.Договор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНаборов,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.Сторно,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручки КАК ВыручкаУпр,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручкиБезНДС КАК ВыручкаРегл,
	|	ВыручкаИСебестоимостьПродаж.Стоимость КАК СебестоимостьУпр,
	|	ВыручкаИСебестоимостьПродаж.СтоимостьБезНДС КАК СебестоимостьРегл,
	|	ВыручкаИСебестоимостьПродаж.Количество КАК Количество,
	|	&Вес * ВыручкаИСебестоимостьПродаж.Количество КАК Вес,
	|	&Объем * ВыручкаИСебестоимостьПродаж.Количество КАК Объем,
	|	ВыручкаИСебестоимостьПродаж.НалогообложениеНДС,
	|	ВыручкаИСебестоимостьПродаж.ВалютаВзаиморасчетов,
	|	ВыручкаИСебестоимостьПродаж.ВалютаДокумента,
	|	ВыручкаИСебестоимостьПродаж.ИсточникГФУНоменклатуры
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборПродажПоЗаказу КАК Отбор
	|			ПО ВыручкаИСебестоимостьПродаж.ЗаказКлиента = Отбор.АналитикаРасходов
	|			И КлючиАналитикиУчетаПоПартнерам.Организация = Отбор.Организация
	|ГДЕ
	|	ВыручкаИСебестоимостьПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КлючиАналитикиУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|	И НЕ (Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|		ИЛИ Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.АктВыполненныхРабот.ПустаяСсылка)
	|		ИЛИ Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|		ИЛИ Отбор.АналитикаРасходов = НЕОПРЕДЕЛЕНО
	|	)
	|	И (ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента = Отбор.НаправлениеДеятельности
	|		ИЛИ Отбор.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Отбор.Организация КАК Организация,
	|	&КонецПериода КАК Период,
	|	ВыручкаИСебестоимостьПродаж.Регистратор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам,
	|	ВыручкаИСебестоимостьПродаж.Подразделение,
	|	ВыручкаИСебестоимостьПродаж.ТипЗапасов,
	|	ВыручкаИСебестоимостьПродаж.ВидЗапасов,
	|	ВыручкаИСебестоимостьПродаж.РазделУчета,
	|	ВыручкаИСебестоимостьПродаж.Партия,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПартий,
	|	ВыручкаИСебестоимостьПродаж.АналитикаФинансовогоУчета,
	|	ВыручкаИСебестоимостьПродаж.ВидДеятельностиНДС,
	|	ВыручкаИСебестоимостьПродаж.Менеджер,
	|	ВыручкаИСебестоимостьПродаж.Склад,
	|	ВыручкаИСебестоимостьПродаж.Соглашение,
	|	ВыручкаИСебестоимостьПродаж.Договор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНаборов,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.Сторно,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручки КАК ВыручкаУпр,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручкиБезНДС КАК ВыручкаРегл,
	|	ВыручкаИСебестоимостьПродаж.Стоимость КАК СебестоимостьУпр,
	|	ВыручкаИСебестоимостьПродаж.СтоимостьБезНДС КАК СебестоимостьРегл,
	|	ВыручкаИСебестоимостьПродаж.Количество КАК Количество,
	|	&Вес * ВыручкаИСебестоимостьПродаж.Количество КАК Вес,
	|	&Объем * ВыручкаИСебестоимостьПродаж.Количество КАК Объем,
	|	ВыручкаИСебестоимостьПродаж.НалогообложениеНДС,
	|	ВыручкаИСебестоимостьПродаж.ВалютаВзаиморасчетов,
	|	ВыручкаИСебестоимостьПродаж.ВалютаДокумента,
	|	ВыручкаИСебестоимостьПродаж.ИсточникГФУНоменклатуры
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|		ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборПродажПоРеализациямПрошлыхПериодов КАК Отбор
	|		ПО ВыручкаИСебестоимостьПродаж.ЗаказКлиента = Отбор.АналитикаРасходов
	|			И КлючиАналитикиУчетаПоПартнерам.Организация = Отбор.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|		ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|ГДЕ
	|	ВыручкаИСебестоимостьПродаж.Период < &НачалоПериода
	|	И ВыручкаИСебестоимостьПродаж.Активность
	|	И КлючиАналитикиУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|	И (ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента = Отбор.НаправлениеДеятельности
	|		ИЛИ Отбор.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Отбор.Организация КАК Организация,
	|	ВыручкаИСебестоимостьПродаж.Период КАК Период,
	|	ВыручкаИСебестоимостьПродаж.Регистратор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам,
	|	ВыручкаИСебестоимостьПродаж.Подразделение,
	|	ВыручкаИСебестоимостьПродаж.ТипЗапасов,
	|	ВыручкаИСебестоимостьПродаж.ВидЗапасов,
	|	ВыручкаИСебестоимостьПродаж.РазделУчета,
	|	ВыручкаИСебестоимостьПродаж.Партия,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПартий,
	|	ВыручкаИСебестоимостьПродаж.АналитикаФинансовогоУчета,
	|	ВыручкаИСебестоимостьПродаж.ВидДеятельностиНДС,
	|	ВыручкаИСебестоимостьПродаж.Менеджер,
	|	ВыручкаИСебестоимостьПродаж.Склад,
	|	ВыручкаИСебестоимостьПродаж.Соглашение,
	|	ВыручкаИСебестоимостьПродаж.Договор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНаборов,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.Сторно,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручки КАК ВыручкаУпр,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручкиБезНДС КАК ВыручкаРегл,
	|	ВыручкаИСебестоимостьПродаж.Стоимость КАК СебестоимостьУпр,
	|	ВыручкаИСебестоимостьПродаж.СтоимостьБезНДС КАК СебестоимостьРегл,
	|	ВыручкаИСебестоимостьПродаж.Количество КАК Количество,
	|	&Вес * ВыручкаИСебестоимостьПродаж.Количество КАК Вес,
	|	&Объем * ВыручкаИСебестоимостьПродаж.Количество КАК Объем,
	|	ВыручкаИСебестоимостьПродаж.НалогообложениеНДС,
	|	ВыручкаИСебестоимостьПродаж.ВалютаВзаиморасчетов,
	|	ВыручкаИСебестоимостьПродаж.ВалютаДокумента,
	|	ВыручкаИСебестоимостьПродаж.ИсточникГФУНоменклатуры
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборПродажПоСделке КАК Отбор
	|			ПО ЕСТЬNULL(ВыручкаИСебестоимостьПродаж.ЗаказКлиента.Сделка, ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)) = Отбор.АналитикаРасходов
	|			И КлючиАналитикиУчетаПоПартнерам.Организация = Отбор.Организация
	|ГДЕ
	|	ВыручкаИСебестоимостьПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КлючиАналитикиУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|	И НЕ Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)
	|	И (ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента = Отбор.НаправлениеДеятельности
	|		ИЛИ Отбор.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Отбор.Организация КАК Организация,
	|	ВыручкаИСебестоимостьПродаж.Период КАК Период,
	|	ВыручкаИСебестоимостьПродаж.Регистратор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам,
	|	ВыручкаИСебестоимостьПродаж.Подразделение,
	|	ВыручкаИСебестоимостьПродаж.ТипЗапасов,
	|	ВыручкаИСебестоимостьПродаж.ВидЗапасов,
	|	ВыручкаИСебестоимостьПродаж.РазделУчета,
	|	ВыручкаИСебестоимостьПродаж.Партия,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПартий,
	|	ВыручкаИСебестоимостьПродаж.АналитикаФинансовогоУчета,
	|	ВыручкаИСебестоимостьПродаж.ВидДеятельностиНДС,
	|	ВыручкаИСебестоимостьПродаж.Менеджер,
	|	ВыручкаИСебестоимостьПродаж.Склад,
	|	ВыручкаИСебестоимостьПродаж.Соглашение,
	|	ВыручкаИСебестоимостьПродаж.Договор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНаборов,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.Сторно,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручки КАК ВыручкаУпр,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручкиБезНДС КАК ВыручкаРегл,
	|	ВыручкаИСебестоимостьПродаж.Стоимость КАК СебестоимостьУпр,
	|	ВыручкаИСебестоимостьПродаж.СтоимостьБезНДС КАК СебестоимостьРегл,
	|	ВыручкаИСебестоимостьПродаж.Количество КАК Количество,
	|	&Вес * ВыручкаИСебестоимостьПродаж.Количество КАК Вес,
	|	&Объем * ВыручкаИСебестоимостьПродаж.Количество КАК Объем,
	|	ВыручкаИСебестоимостьПродаж.НалогообложениеНДС,
	|	ВыручкаИСебестоимостьПродаж.ВалютаВзаиморасчетов,
	|	ВыручкаИСебестоимостьПродаж.ВалютаДокумента,
	|	ВыручкаИСебестоимостьПродаж.ИсточникГФУНоменклатуры
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНезаполненныеАналитикиРасходов КАК Отбор
	|			ПО КлючиАналитикиУчетаПоПартнерам.Организация = Отбор.Организация
	|ГДЕ
	|	ВыручкаИСебестоимостьПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КлючиАналитикиУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|	И ВыручкаИСебестоимостьПродаж.ЗаказКлиента <> НЕОПРЕДЕЛЕНО
	|	И КлючиАналитикиУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И (ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента = Отбор.НаправлениеДеятельности
	|		ИЛИ Отбор.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	)
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;
	|ВЫБРАТЬ
	|	Данные.НаправлениеДеятельности,
	|	Данные.АналитикаРасходов,
	|	Данные.Организация,
	|	Данные.Период,
	|	Данные.Регистратор,
	|	Данные.АналитикаУчетаНоменклатуры,
	|	Данные.ЗаказКлиента,
	|	Данные.АналитикаУчетаПоПартнерам,
	|	Данные.Подразделение,
	|	Данные.ТипЗапасов,
	|	Данные.ВидЗапасов,
	|	Данные.РазделУчета,
	|	Данные.Партия,
	|	Данные.АналитикаУчетаПартий,
	|	Данные.АналитикаФинансовогоУчета,
	|	Данные.ВидДеятельностиНДС,
	|	Данные.Менеджер,
	|	Данные.Склад,
	|	Данные.Соглашение,
	|	Данные.Договор,
	|	Данные.АналитикаУчетаНаборов,
	|	Данные.НаправлениеДеятельностиКонтрагента,
	|	Данные.НаправлениеДеятельностиНоменклатуры,
	|	Данные.НалогообложениеНДС,
	|	Данные.ВалютаВзаиморасчетов,
	|	Данные.ВалютаДокумента,
	|	Данные.ИсточникГФУНоменклатуры,
	|	Данные.Сторно,
	|	СУММА(Данные.Количество) КАК Количество,
	|	СУММА(Данные.Вес) КАК Вес,
	|	СУММА(Данные.Объем) КАК Объем,
	|	СУММА(Данные.ВыручкаУпр) КАК ВыручкаУпр,
	|	СУММА(Данные.ВыручкаРегл) КАК ВыручкаРегл,
	|	СУММА(Данные.СебестоимостьУпр) КАК СебестоимостьУпр,
	|	СУММА(Данные.СебестоимостьРегл) КАК СебестоимостьРегл
	|ПОМЕСТИТЬ ВтБазаРаспределенияПродажДанные
	|ИЗ
	|	ВтБазаРаспределенияПродажИсхДанные КАК Данные
	|СГРУППИРОВАТЬ ПО
	|	Данные.НаправлениеДеятельности,
	|	Данные.АналитикаРасходов,
	|	Данные.Организация,
	|	Данные.Период,
	|	Данные.Регистратор,
	|	Данные.АналитикаУчетаНоменклатуры,
	|	Данные.ЗаказКлиента,
	|	Данные.АналитикаУчетаПоПартнерам,
	|	Данные.Подразделение,
	|	Данные.ТипЗапасов,
	|	Данные.ВидЗапасов,
	|	Данные.РазделУчета,
	|	Данные.Партия,
	|	Данные.АналитикаУчетаПартий,
	|	Данные.АналитикаФинансовогоУчета,
	|	Данные.ВидДеятельностиНДС,
	|	Данные.Менеджер,
	|	Данные.Склад,
	|	Данные.Соглашение,
	|	Данные.Договор,
	|	Данные.АналитикаУчетаНаборов,
	|	Данные.НаправлениеДеятельностиКонтрагента,
	|	Данные.НаправлениеДеятельностиНоменклатуры,
	|	Данные.НалогообложениеНДС,
	|	Данные.ВалютаВзаиморасчетов,
	|	Данные.ВалютаДокумента,
	|	Данные.ИсточникГФУНоменклатуры,
	|	Данные.Сторно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтБазаРаспределенияПродажИсхДанные.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаРасходов КАК АналитикаРасходов,
	|	ВтБазаРаспределенияПродажИсхДанные.Организация КАК Организация,
	|	СУММА(ВтБазаРаспределенияПродажИсхДанные.ВыручкаУпр) КАК ВыручкаУпр,
	|	СУММА(ВтБазаРаспределенияПродажИсхДанные.ВыручкаРегл) КАК ВыручкаРегл,
	|	СУММА(ВтБазаРаспределенияПродажИсхДанные.СебестоимостьУпр) КАК СебестоимостьУпр,
	|	СУММА(ВтБазаРаспределенияПродажИсхДанные.СебестоимостьРегл) КАК СебестоимостьРегл,
	|	СУММА(ВтБазаРаспределенияПродажИсхДанные.Количество) КАК Количество,
	|	СУММА(ВтБазаРаспределенияПродажИсхДанные.Вес) КАК Вес,
	|	СУММА(ВтБазаРаспределенияПродажИсхДанные.Объем) КАК Объем
	|ПОМЕСТИТЬ ВтБазаРаспределенияПродажСуммы
	|ИЗ
	|	ВтБазаРаспределенияПродажИсхДанные КАК ВтБазаРаспределенияПродажИсхДанные
	|СГРУППИРОВАТЬ ПО
	|	ВтБазаРаспределенияПродажИсхДанные.НаправлениеДеятельности,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаРасходов,
	|	ВтБазаРаспределенияПродажИсхДанные.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтБазаРаспределенияПродажИсхДанные.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаРасходов КАК АналитикаРасходов,
	|	ВтБазаРаспределенияПродажИсхДанные.Период КАК Период,
	|	ВтБазаРаспределенияПродажИсхДанные.Организация КАК Организация,
	|	ВтБазаРаспределенияПродажИсхДанные.Регистратор КАК Регистратор,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаУчетаНоменклатуры,
	|	ВтБазаРаспределенияПродажИсхДанные.ЗаказКлиента,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаУчетаПоПартнерам,
	|	ВтБазаРаспределенияПродажИсхДанные.Подразделение,
	|	ВтБазаРаспределенияПродажИсхДанные.ТипЗапасов,
	|	ВтБазаРаспределенияПродажИсхДанные.ВидЗапасов,
	|	ВтБазаРаспределенияПродажИсхДанные.РазделУчета,
	|	ВтБазаРаспределенияПродажИсхДанные.Партия,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаУчетаПартий,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаФинансовогоУчета,
	|	ВтБазаРаспределенияПродажИсхДанные.ВидДеятельностиНДС,
	|	ВтБазаРаспределенияПродажИсхДанные.Менеджер,
	|	ВтБазаРаспределенияПродажИсхДанные.Склад,
	|	ВтБазаРаспределенияПродажИсхДанные.Соглашение,
	|	ВтБазаРаспределенияПродажИсхДанные.Договор,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаУчетаНаборов,
	|	ВтБазаРаспределенияПродажИсхДанные.НаправлениеДеятельностиКонтрагента,
	|	ВтБазаРаспределенияПродажИсхДанные.НаправлениеДеятельностиНоменклатуры,
	|	ВтБазаРаспределенияПродажИсхДанные.Сторно,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтБазаРаспределенияПродажСуммы.ВыручкаУпр, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтБазаРаспределенияПродажИсхДанные.ВыручкаУпр / ВтБазаРаспределенияПродажСуммы.ВыручкаУпр
	|	КОНЕЦ КАК ДоляВыручкаУпр,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтБазаРаспределенияПродажСуммы.ВыручкаРегл, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтБазаРаспределенияПродажИсхДанные.ВыручкаРегл / ВтБазаРаспределенияПродажСуммы.ВыручкаРегл
	|	КОНЕЦ КАК ДоляВыручкаРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтБазаРаспределенияПродажСуммы.СебестоимостьУпр, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтБазаРаспределенияПродажИсхДанные.СебестоимостьУпр / ВтБазаРаспределенияПродажСуммы.СебестоимостьУпр
	|	КОНЕЦ КАК ДоляСебеСтоимостьУпр,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтБазаРаспределенияПродажСуммы.СебестоимостьРегл, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтБазаРаспределенияПродажИсхДанные.СебестоимостьРегл / ВтБазаРаспределенияПродажСуммы.СебестоимостьРегл
	|	КОНЕЦ КАК ДоляСебеСтоимостьРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтБазаРаспределенияПродажСуммы.Количество, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтБазаРаспределенияПродажИсхДанные.Количество / ВтБазаРаспределенияПродажСуммы.Количество
	|	КОНЕЦ КАК ДоляКоличество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтБазаРаспределенияПродажСуммы.Вес, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтБазаРаспределенияПродажИсхДанные.Вес / ВтБазаРаспределенияПродажСуммы.Вес
	|	КОНЕЦ КАК ДоляВес,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтБазаРаспределенияПродажСуммы.Объем, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтБазаРаспределенияПродажИсхДанные.Объем / ВтБазаРаспределенияПродажСуммы.Объем
	|	КОНЕЦ КАК ДоляОбъем,
	|	ВтБазаРаспределенияПродажИсхДанные.НалогообложениеНДС,
	|	ВтБазаРаспределенияПродажИсхДанные.ВалютаВзаиморасчетов,
	|	ВтБазаРаспределенияПродажИсхДанные.ВалютаДокумента,
	|	ВтБазаРаспределенияПродажИсхДанные.ИсточникГФУНоменклатуры
	|ПОМЕСТИТЬ ВтБазаРаспределенияНаПродажи
	|ИЗ
	|	ВтБазаРаспределенияПродажДанные КАК ВтБазаРаспределенияПродажИсхДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтБазаРаспределенияПродажСуммы КАК ВтБазаРаспределенияПродажСуммы
	|		ПО ВтБазаРаспределенияПродажИсхДанные.АналитикаРасходов = ВтБазаРаспределенияПродажСуммы.АналитикаРасходов
	|			И ВтБазаРаспределенияПродажИсхДанные.Организация = ВтБазаРаспределенияПродажСуммы.Организация
	|			И ВтБазаРаспределенияПродажИсхДанные.НаправлениеДеятельности = ВтБазаРаспределенияПродажСуммы.НаправлениеДеятельности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация,
	|	НаправлениеДеятельности;
	|";
	
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ПодставитьШаблоныВесаИОбъемаВТекстЗапроса(ТекстЗапроса);
	
КонецФункции

Функция ТекстЗапросаРегистраторыПрошлыхПериодов()
	
	ТекстЗапроса = "
	|	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтРаспределениеРасходовНаПродажи.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторыПрошлыхПериодов
	|ИЗ ВтРаспределениеРасходовНаПродажи КАК ВтРаспределениеРасходовНаПродажи
	|ГДЕ ВтРаспределениеРасходовНаПродажи.Период < &НачалоПериода;
	|";	
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПодготовкаДанныхРаспределенияРасходовНаПродажи() 
	
	ТекстЗапроса = "ВЫБРАТЬ 
	|	Статьи.Ссылка КАК СтатьяРасходов,
	|	Статьи.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
	|	Статьи.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
	|	Статьи.ВариантРаспределенияРасходовНУ КАК ВариантРаспределенияРасходовНУ,
	|	Статьи.ПравилоРаспределенияНаСебестоимостьПродажУпр КАК ПравилоРаспределенияНаСебестоимостьПродажУпр,
	|	Статьи.ПравилоРаспределенияНаСебестоимостьПродажРегл КАК ПравилоРаспределенияНаСебестоимостьПродажРегл
	|	
	|ПОМЕСТИТЬ СтатьиКРаспределениюНаПродажу
	|
	|ИЗ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|
	|ГДЕ
	|	Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|	ИЛИ
	|		Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|		
	|ИНДЕКСИРОВАТЬ ПО СтатьяРасходов;
	|
	|ВЫБРАТЬ
	|	Расходы.Организация,
	|	Расходы.Подразделение,
	|	Расходы.НаправлениеДеятельности,
	|	Расходы.СтатьяРасходов,
	|	Расходы.АналитикаРасходов,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА
	|			Статьи.ПравилоРаспределенияНаСебестоимостьПродажУпр = ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноСтоимости)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоВыручкеУпр,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА
	|			Статьи.ПравилоРаспределенияНаСебестоимостьПродажУпр = ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноСебестоимости)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоСебестоимостиУпр,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА
	|			Статьи.ПравилоРаспределенияНаСебестоимостьПродажУпр = ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноКоличеству)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоКоличествуУпр,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА
	|			Статьи.ПравилоРаспределенияНаСебестоимостьПродажУпр = ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноВесу)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоВесуУпр,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА
	|			Статьи.ПравилоРаспределенияНаСебестоимостьПродажУпр = ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноОбъему)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоОбъемуУпр,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА
	|			Статьи.ПравилоРаспределенияНаСебестоимостьПродажРегл = ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноСтоимости)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоВыручкеРегл,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА
	|			Статьи.ПравилоРаспределенияНаСебестоимостьПродажРегл = ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноСебестоимости)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоСебестоимостиРегл,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА
	|			Статьи.ПравилоРаспределенияНаСебестоимостьПродажРегл = ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноКоличеству)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоКоличествуРегл,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА
	|			Статьи.ПравилоРаспределенияНаСебестоимостьПродажРегл = ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноВесу)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоВесуРегл,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА
	|			Статьи.ПравилоРаспределенияНаСебестоимостьПродажРегл = ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноОбъему)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоОбъемуРегл,
	|	СУММА(ВЫБОР
	|		КОГДА
	|			Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|			ТОГДА Расходы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|		КОГДА
	|			Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|			ТОГДА Расходы.СуммаБезНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА
	|			Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|			ТОГДА Расходы.СуммаУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаУпр,
	|	СУММА(ВЫБОР
	|		КОГДА
	|			Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|			ТОГДА Расходы.СуммаРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаРегл,
	|	СУММА(ВЫБОР
	|		КОГДА
	|			Статьи.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|			ТОГДА Расходы.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК ПостояннаяРазница,
	|	СУММА(ВЫБОР
	|		КОГДА
	|			Статьи.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|			ТОГДА Расходы.ВременнаяРазница
	|		ИНАЧЕ Расходы.СуммаРегл
	|	КОНЕЦ) КАК ВременнаяРазница
	|
	|ПОМЕСТИТЬ РасходыКРаспределениюНаПродажу
	|
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходы КАК Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатьиКРаспределениюНаПродажу КАК Статьи
	|		ПО Расходы.СтатьяРасходов = Статьи.СтатьяРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	Расходы.Организация,
	|	Расходы.Подразделение,
	|	Расходы.НаправлениеДеятельности,
	|	Расходы.СтатьяРасходов,
	|	Расходы.АналитикаРасходов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВыборкаРаспределениеРасходовНаПродажи() 
	
	ТекстЗапроса = "
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расходы.Организация,
	|	Расходы.Подразделение КАК ПодразделениеРасходов,
	|	Расходы.НаправлениеДеятельности,
	|	Расходы.СтатьяРасходов,
	|	Расходы.АналитикаРасходов,
	|	База.Период,
	|	База.Регистратор,
	|	База.АналитикаУчетаНоменклатуры,
	|	База.ЗаказКлиента,
	|	База.АналитикаУчетаПоПартнерам,
	|	База.Подразделение КАК ПодразделениеВыручки,
	|	База.ТипЗапасов,
	|	База.ВидЗапасов,
	|	База.РазделУчета,
	|	База.Партия,
	|	База.АналитикаУчетаПартий,
	|	База.АналитикаФинансовогоУчета,
	|	База.ВидДеятельностиНДС,
	|	База.Менеджер,
	|	База.Склад,
	|	База.Соглашение,
	|	База.Договор,
	|	База.АналитикаУчетаНаборов,
	|	База.НаправлениеДеятельностиКонтрагента,
	|	База.НаправлениеДеятельностиНоменклатуры,
	|	База.НалогообложениеНДС,
	|	База.ВалютаВзаиморасчетов,
	|	База.ВалютаДокумента,
	|	База.ИсточникГФУНоменклатуры,
	|	База.Сторно,
	|	Расходы.Сумма * (Расходы.КоэффПоВыручкеУпр * База.ДоляВыручкаУпр + Расходы.КоэффПоСебестоимостиУпр *
	|		База.ДоляСебестоимостьУпр + Расходы.КоэффПоКоличествуУпр * База.ДоляКоличество + Расходы.КоэффПоВесуУпр * База.ДоляВес +
	|		Расходы.КоэффПоОбъемуУпр * База.ДоляОбъем) КАК Сумма,
	|	Расходы.СуммаБезНДС * (Расходы.КоэффПоВыручкеУпр * База.ДоляВыручкаУпр + Расходы.КоэффПоСебестоимостиУпр *
	|		База.ДоляСебестоимостьУпр + Расходы.КоэффПоКоличествуУпр * База.ДоляКоличество + Расходы.КоэффПоВесуУпр * База.ДоляВес +
	|		Расходы.КоэффПоОбъемуУпр * База.ДоляОбъем) КАК СуммаБезНДС,
	|	Расходы.СуммаУпр * (Расходы.КоэффПоВыручкеУпр * База.ДоляВыручкаУпр + Расходы.КоэффПоСебестоимостиУпр *
	|		База.ДоляСебестоимостьУпр + Расходы.КоэффПоКоличествуУпр * База.ДоляКоличество + Расходы.КоэффПоВесуУпр * База.ДоляВес +
	|		Расходы.КоэффПоОбъемуУпр * База.ДоляОбъем) КАК СуммаУпр,
	|	Расходы.СуммаРегл * (Расходы.КоэффПоВыручкеРегл * База.ДоляВыручкаРегл + Расходы.КоэффПоСебестоимостиРегл *
	|		База.ДоляСебестоимостьРегл + Расходы.КоэффПоКоличествуРегл * База.ДоляКоличество + Расходы.КоэффПоВесуРегл * База.ДоляВес +
	|		Расходы.КоэффПоОбъемуРегл * База.ДоляОбъем) КАК СуммаРегл,
	|	Расходы.ПостояннаяРазница * (Расходы.КоэффПоВыручкеРегл * База.ДоляВыручкаРегл + Расходы.КоэффПоСебестоимостиРегл *
	|		База.ДоляСебестоимостьРегл + Расходы.КоэффПоКоличествуРегл * База.ДоляКоличество + Расходы.КоэффПоВесуРегл * База.ДоляВес +
	|		Расходы.КоэффПоОбъемуРегл * База.ДоляОбъем) КАК ПостояннаяРазница,
	|	Расходы.ВременнаяРазница * (Расходы.КоэффПоВыручкеРегл * База.ДоляВыручкаРегл + Расходы.КоэффПоСебестоимостиРегл *
	|		База.ДоляСебестоимостьРегл + Расходы.КоэффПоКоличествуРегл * База.ДоляКоличество + Расходы.КоэффПоВесуРегл * База.ДоляВес +
	|		Расходы.КоэффПоОбъемуРегл * База.ДоляОбъем) КАК ВременнаяРазница
	|ИЗ
	|	РасходыКРаспределениюНаПродажу КАК Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтБазаРаспределенияНаПродажи КАК База
	|		ПО	Расходы.АналитикаРасходов = База.АналитикаРасходов
	|			И Расходы.Организация = База.Организация
	|			И Расходы.НаправлениеДеятельности = База.НаправлениеДеятельности;
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОписаниеДанныхДляРаспределенияРасходовНаПродажи() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	Расходы.Организация,
	|	Расходы.Подразделение КАК ПодразделениеРасходов,
	|	Расходы.НаправлениеДеятельности,
	|	Расходы.СтатьяРасходов,
	|	Расходы.АналитикаРасходов,
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ЗаказКлиента,
	|	ДД.АналитикаУчетаПоПартнерам,
	|	ДД.Подразделение КАК ПодразделениеВыручки,
	|	ДД.ТипЗапасов,
	|	ДД.ВидЗапасов,
	|	ДД.РазделУчета,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.Менеджер,
	|	ДД.Склад,
	|	ДД.Соглашение,
	|	ДД.Договор,
	|	ДД.АналитикаУчетаНаборов,
	|	ДД.НаправлениеДеятельностиКонтрагента,
	|	ДД.НаправлениеДеятельностиНоменклатуры,
	|	ДД.НалогообложениеНДС,
	|	ДД.ВалютаВзаиморасчетов,
	|	ДД.ВалютаДокумента,
	|	ДД.ИсточникГФУНоменклатуры,
	|	ДД.Сторно,
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК Расходы
	|	ПО ИСТИНА
	|";
	
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапов_Общие

#Область ПроцедурыПоддержкиРаботыЧерезОВЗ

Процедура ИнициализироватьТаблицуОВЗ(ПараметрыРасчета) Экспорт

	Если РасчетСебестоимостиПрикладныеАлгоритмы.ВременнаяТаблицаСуществует(ПараметрыРасчета.МенеджерВременныхТаблиц, "ВтОВЗ") Тогда
		Возврат; // ВТ по ОВЗ уже была инициализирована ранее
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ИнициализироватьТаблицуОВЗ");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	Запрос.Текст = ТекстВТпоОВЗ();
	Если Не РасчетСебестоимостиПрикладныеАлгоритмы.ВременнаяТаблицаСуществует(Запрос.МенеджерВременныхТаблиц, "ЗначенияПоказателейОВЗ") Тогда
		Запрос.Текст = Запрос.Текст + РасчетСебестоимостиПостатейныеЗатраты.ТекстЗначенияПоказателейРаспределенияНаОВЗ();
	КонецЕсли;
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ВтОВЗ");
	
КонецПроцедуры

Функция ТекстВТпоОВЗ() Экспорт

	ТекстЗапроса = РасчетСебестоимостиПостатейныеЗатраты.ТекстОписаниеДанныхДляОВЗ();
	
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПриемникЗапросаОписанияДанных(ТекстЗапроса, "ВтОВЗ");
	Возврат ТекстЗапроса + ";
	|";

КонецФункции

Функция ТекстЗначенияПоказателейРаспределенияНаОВЗ() Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	НЕОПРЕДЕЛЕНО	КАК Показатель,
	|	НЕОПРЕДЕЛЕНО	КАК ОВЗ,
	|	НЕОПРЕДЕЛЕНО	КАК БазаРаспределения,
	|	НЕОПРЕДЕЛЕНО	КАК ЗначениеПоказателя
	|ПОМЕСТИТЬ ЗначенияПоказателейОВЗ;
	|";
	
	//++ НЕ УТ
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат") Тогда
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Правила.Ссылка КАК Показатель
		|ПОМЕСТИТЬ ПостоянныеПоказателиОВЗ
		|ИЗ
		|	Справочник.ПравилаРаспределенияРасходов КАК Правила
		|ГДЕ Правила.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении)
		|		И Правила.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаОВЗ)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель
		|;
		|
		|ВЫБРАТЬ
		|	Т.Показатель,
		|	Т.ОВЗ,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении) КАК БазаРаспределения,
		|	Т.ЗначениеПоказателя
		|ПОМЕСТИТЬ ЗначенияПоказателейОВЗ
		|ИЗ
		|	РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходовНаОВЗ.СрезПоследних(
		|			&НачалоПериода,
		|			Показатель В
		|				(ВЫБРАТЬ
		|					ДД.Показатель
		|				ИЗ
		|					ПостоянныеПоказателиОВЗ КАК ДД)) КАК Т
		|ГДЕ
		|	Т.ЗначениеПоказателя > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.Показатель,
		|	Т.ОВЗ,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно) КАК БазаРаспределения,
		|	Т.ЗначениеПоказателя
		|ИЗ
		|	Справочник.ПравилаРаспределенияРасходов КАК Правила
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходовНаОВЗ КАК Т
		|		ПО Правила.Ссылка = Т.Показатель
		|		И Т.Период = &НачалоПериода
		|ГДЕ
		|	Т.ЗначениеПоказателя > 0
		|	И Правила.БазаРаспределения В (ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно), ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.АвтозаполнениеВводитсяЕжемесячно))
		|	И Правила.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаОВЗ)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель,
		|	ОВЗ
		|////////////////////////////////////////////////////////////////////////////////
		|;
		|
		|УНИЧТОЖИТЬ ПостоянныеПоказателиОВЗ;
		|";
	КонецЕсли;
	//-- НЕ УТ

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстОписаниеДанныхДляОВЗ() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	0																	КАК НомерУзла,
	|	НЕОПРЕДЕЛЕНО														КАК ОВЗ,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)						КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)				КАК Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)	КАК ВариантРаспределенияРасходовУпр,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)	КАК ВариантРаспределенияРасходовРегл,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)	КАК ВариантРаспределенияРасходовНУ,
	|	ЗНАЧЕНИЕ(Справочник.ПравилаРаспределенияРасходов.ПустаяСсылка)		КАК ПравилоРаспределенияРасходовУпр,
	|	ЗНАЧЕНИЕ(Справочник.ПравилаРаспределенияРасходов.ПустаяСсылка)		КАК ПравилоРаспределенияРасходовРегл,
	|	ЗНАЧЕНИЕ(Справочник.ПравилаРаспределенияРасходов.ПустаяСсылка)		КАК ПравилоРаспределенияРасходовНУ,
	|	ЛОЖЬ																КАК НеИспользуется,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)		КАК ПустаяСтатьяРасходов,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)			КАК ПустоеНаправлениеДеятельности,
	|	ИСТИНА																КАК ЭтоОВЗ
	|ПОМЕСТИТЬ Данные
	|";
	
	//++ НЕ УТ
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат") Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	АВТОНОМЕРЗАПИСИ() КАК НомерУзла,
		|	Т.Ссылка КАК ОВЗ,
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
		|	Т.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
		|	Т.ВариантРаспределенияРасходовНУ КАК ВариантРаспределенияРасходовНУ,
		|	Т.ПравилоРаспределенияРасходовУпр КАК ПравилоРаспределенияРасходовУпр,
		|	Т.ПравилоРаспределенияРасходовРегл КАК ПравилоРаспределенияРасходовРегл,
		|	Т.ПравилоРаспределенияРасходовНУ КАК ПравилоРаспределенияРасходовНУ,
		|	Т.НеИспользуется КАК НеИспользуется,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК ПустаяСтатьяРасходов,
		|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК ПустоеНаправлениеДеятельности,
		|	ИСТИНА КАК ЭтоОВЗ
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	Справочник.ОбъектыВозникновенияЗатрат КАК Т
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОВЗ,
		|	Подразделение,
		|	Организация
		|";
	КонецЕсли;
	//-- НЕ УТ
	
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстОписаниеДанныхДляТранзитаРасходовМеждуОВЗ() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	НЕОПРЕДЕЛЕНО													КАК ДокументДвижения,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)					КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)			КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)		КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)	КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО													КАК АналитикаРасходов,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)					КАК КорОрганизация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)			КАК КорПодразделение,
	|	НЕОПРЕДЕЛЕНО													КАК КорАналитикаРасходов,
	|	0																КАК Вес, 
	|	0																КАК ВесРегл,
	|	0																КАК ПриведенныйВес, 
	|	0																КАК ПриведенныйВесРегл
	|ПОМЕСТИТЬ Данные
	|";
	
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстОписаниеДанныхДляИсходныхДанныхТранзитаРасходовМеждуОВЗ() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)					КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)			КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)		КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)	КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО													КАК АналитикаРасходов,
	|	0																КАК Вес,
	|	0																КАК ВесРегл,
	|	0																КАК ПриведенныйВес, 
	|	0																КАК ПриведенныйВесРегл
	|ПОМЕСТИТЬ Данные
	|";
	
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПараметрыНастроекОтбора

Функция ПолучитьОписаниеГруппОбъектовПоНастройкамОтбора(ТекстПолученияОбъектов, ПараметрыРасчета, ИмяВременнойТаблицыГруппыОбъектов, НедоступныеПоляОтбора = Неопределено) Экспорт
	
	МассивТиповОбъектов = Новый Массив;
	МассивТиповОбъектов.Добавить(Тип("ДокументСсылка.РаспределениеПрочихЗатрат")); // для закрытия периода.
	МассивТиповОбъектов.Добавить(Тип("Число")); // для случаев когда вызывается процедура извне.
	
	ГруппыОбъектов = Новый ТаблицаЗначений;
	ГруппыОбъектов.Колонки.Добавить("НомерГруппы", Новый ОписаниеТипов("Число"));
	ГруппыОбъектов.Колонки.Добавить("Объект", Новый ОписаниеТипов(МассивТиповОбъектов));
	
	ОписаниеГрупп = Новый ТаблицаЗначений;
	ОписаниеГрупп.Колонки.Добавить("НомерГруппы", Новый ОписаниеТипов("Число"));
	ОписаниеГрупп.Колонки.Добавить("Используется", Новый ОписаниеТипов("Булево"));
	ОписаниеГрупп.Колонки.Добавить("ТекстУсловия", Новый ОписаниеТипов("Строка"));
	ОписаниеГрупп.Колонки.Добавить("ПараметрыЗапроса", Новый ОписаниеТипов("Структура"));
	ОписаниеГрупп.Колонки.Добавить("КоличествоПараметров", Новый ОписаниеТипов("Число"));
	
	Если ПараметрыРасчета = Неопределено Тогда
		Возврат ОписаниеГрупп;
	КонецЕсли;
	
	ИндексируемыеПоля = "ТекстУсловия, КоличествоПараметров";
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстПолученияОбъектов;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ГруппыСформированыУспешно = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыОтбора = ОпределитьПараметрыОтбора(Выборка, НедоступныеПоляОтбора);
		
		Если ПараметрыОтбора = Неопределено Тогда
			ГруппыСформированыУспешно = Ложь;
			РеквизитОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Ссылка, "Организация");
			РасчетСебестоимостиПрикладныеАлгоритмы.ЗарегистрироватьПроблемуВыполненияРасчета(ПараметрыРасчета, РеквизитОрганизация,
			НСтр("ru = 'Некорректные условия отбора';
				|en = 'Incorrect filter criteria'"), 
			НСтр("ru = 'В условиях отбора не поддерживается использование дополнительных реквизитов';
				|en = 'Additional attributes are not supported in the filter criteria'"),
			Выборка.Ссылка);
			Продолжить;
		КонецЕсли;
		
		НомерГруппы = ОпределитьГруппу(ПараметрыОтбора, ОписаниеГрупп);
		
		НовыйОбъект = ГруппыОбъектов.Добавить();
		НовыйОбъект.НомерГруппы = НомерГруппы;
		НовыйОбъект.Объект = Выборка.Ссылка;
		
		Если НомерГруппы < ОписаниеГрупп.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыОтбора.ПараметрыЗапроса.Количество()>0 Тогда
			Для Каждого ПараметрЗапроса Из ПараметрыОтбора.ПараметрыЗапроса Цикл
				Если ОписаниеГрупп.Колонки.Найти(ПараметрЗапроса.Ключ) = Неопределено Тогда
					ОписаниеГрупп.Колонки.Добавить(ПараметрЗапроса.Ключ);
					ИндексируемыеПоля = СтрШаблон("%1, %2", ИндексируемыеПоля, ПараметрЗапроса.Ключ);
					ОписаниеГрупп.Индексы.Добавить(ИндексируемыеПоля);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ОписаниеГруппы = ОписаниеГрупп.Добавить();
		ОписаниеГруппы.НомерГруппы = НомерГруппы;
		ОписаниеГруппы.Используется = Истина;
		ОписаниеГруппы.ТекстУсловия = ПараметрыОтбора.ТекстУсловия;
		ОписаниеГруппы.ПараметрыЗапроса = ПараметрыОтбора.ПараметрыЗапроса;
		ОписаниеГруппы.КоличествоПараметров = ПараметрыОтбора.ПараметрыЗапроса.Количество();
		ЗаполнитьЗначенияСвойств(ОписаниеГруппы, ПараметрыОтбора.ПараметрыЗапроса);

		Для Каждого Параметр Из ПараметрыОтбора.ПараметрыЗапроса Цикл
			
			Если Параметр.Ключ = "ПоказательБазыРаспределения" Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяПараметра = СформироватьИмяПараметра(Параметр.Ключ, НомерГруппы, ИмяВременнойТаблицыГруппыОбъектов);
			ПараметрыРасчета.ДополнительныеПараметрыЗапросаЭтапа.Вставить(ИмяПараметра, Параметр.Значение);
			
		КонецЦикла;
		
	КонецЦикла;

	Если Не ГруппыСформированыУспешно Тогда
		ВызватьИсключение НСтр("ru = 'В заданных отборах документов распределения обнаружены неподдерживаемые условия.
									|Зарегистрированы ошибки расчета.';
									|en = 'Unsupported criteria is found in the specified filters of allocation documents.
									|Calculation errors are registered.'");
	КонецЕсли;
	
	ОписаниеГрупп.Индексы.Очистить();
	ПараметрыРасчета.ДополнительныеПараметрыЗапросаЭтапа.Вставить(ИмяВременнойТаблицыГруппыОбъектов, ГруппыОбъектов);
	
	Возврат ОписаниеГрупп;
	
КонецФункции

Функция ОпределитьПараметрыОтбора(Выборка, НедоступныеПоляДляОтбора = Неопределено)

	ИмяСхемы = ПравилаРаспределенияПовтИсп.ИмяСхемыБазыРаспределения(Выборка.ТипБазыРаспределения);
	
	ПараметрыОтбора = Новый Структура("ТекстУсловия, ПараметрыЗапроса", "", Новый Структура);
	ПараметрыОтбора.ПараметрыЗапроса.Вставить("ПоказательБазыРаспределения", ИмяСхемы);
	Если ИмяСхемы = "Товары" Тогда
		ПараметрыОтбора.ПараметрыЗапроса.Вставить("ТипАналитикиРасходов", Выборка.ТипАналитикиРасходов);
	КонецЕсли;
	
	НастройкиКомпоновкиДанных = Выборка.НастройкиСхемы.Получить(); // НастройкиКомпоновкиДанных
	Если НастройкиКомпоновкиДанных = Неопределено Тогда
		// Отборы не заданы.
		Возврат ПараметрыОтбора;
	КонецЕсли;
	
	Если Не НедоступныеПоляДляОтбора = Неопределено Тогда
		
		Для Каждого НедоступноеПоле Из НедоступныеПоляДляОтбора Цикл
			ОчиститьНедоступныеПоляИзОтбора(НастройкиКомпоновкиДанных.Отбор.Элементы, НедоступноеПоле);
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, НастройкиКомпоновкиДанных);
	НастройкиКомпоновкиДанныхXML = ЗаписьXML.Закрыть();
	
	МакетКомпоновки = ПравилаРаспределенияПовтИсп.МакетКомпоновкиДанных(ИмяСхемы,
		Выборка.ТипБазыРаспределения, НастройкиКомпоновкиДанныхXML);
	
	Если Не МакетКомпоновки.НаборыДанных.Количество() Тогда
		Возврат ПараметрыОтбора;
	КонецЕсли;
	
	ТекстЗапроса = МакетКомпоновки.НаборыДанных[0].Запрос;
	
	ДлинаПрефикса = СтрДлина("ГДЕ");
	НачалоУсловия = СтрНайти(ТекстЗапроса, "ГДЕ") + ДлинаПрефикса;
	Если НачалоУсловия = ДлинаПрефикса Тогда
		ПараметрыОтбора.ТекстУсловия = "";
	Иначе
		ПараметрыОтбора.ТекстУсловия = ТекстУсловияБезФорматирования(
			СокрЛП(Сред(ТекстЗапроса, НачалоУсловия)));
	КонецЕсли;
	
	Если СтрНайти(ПараметрыОтбора.ТекстУсловия, "ДополнительныеРеквизиты.") <> 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Псевдонимы = Неопределено;
	Если ИмяСхемы = "НаправлениеРаспределения" Тогда
		
		Псевдонимы = Новый Соответствие();
		Псевдонимы.Вставить("Подразделение", "Ссылка");
		
	КонецЕсли;
	
	ЗаменитьПустыеЗначенияНаПсевдонимы(ПараметрыОтбора.ТекстУсловия,
		ТекстЗапроса,
		Псевдонимы);
	
	//++ НЕ УТ
	Если ИмяСхемы = "НаправлениеРаспределения" Тогда
		// Добавление предопределенных параметров.
		ПараметрыОтбора.ПараметрыЗапроса.Вставить("ТекущееПодразделение", Неопределено);
		ПараметрыОтбора.ПараметрыЗапроса.Вставить("ПодразделениеАналитикиРасходов", Неопределено);
		ПараметрыОтбора.ПараметрыЗапроса.Вставить("ВышестоящееПодразделение", Неопределено);
	КонецЕсли;
	
	ТекстыИсключенияПолуфабрикатов = Новый Массив;
	//-- НЕ УТ
	Для Каждого Параметр Из МакетКомпоновки.ЗначенияПараметров Цикл
		
		//++ НЕ УТ
		Если Параметр.Имя = "ТекущееПодразделение" И ИмяСхемы = "НаправлениеРаспределения" Тогда
			Если СтрНайти(ПараметрыОтбора.ТекстУсловия, СтрШаблон("&%1", Параметр.Имя)) > 0 Тогда
				ПараметрыОтбора.ПараметрыЗапроса.Вставить(Параметр.Имя, Выборка.Подразделение);
			КонецЕсли;
		ИначеЕсли Параметр.Имя = "ПодразделениеАналитикиРасходов" И ИмяСхемы = "НаправлениеРаспределения" Тогда
			Если СтрНайти(ПараметрыОтбора.ТекстУсловия, СтрШаблон("&%1", Параметр.Имя)) > 0 Тогда
				ПараметрыОтбора.ПараметрыЗапроса.Вставить(Параметр.Имя, Выборка.АналитикаРасходов);
			КонецЕсли;
		ИначеЕсли Параметр.Имя = "ВышестоящееПодразделение" И ИмяСхемы = "НаправлениеРаспределения" Тогда
			Если СтрНайти(ПараметрыОтбора.ТекстУсловия, СтрШаблон("&%1", Параметр.Имя)) > 0 Тогда
				ПараметрыОтбора.ПараметрыЗапроса.Вставить(Параметр.Имя, Выборка.ПодразделениеРодитель);
			КонецЕсли;
		Иначе
		//-- НЕ УТ
				ПараметрыОтбора.ПараметрыЗапроса.Вставить(Параметр.Имя, Параметр.Значение);
		//++ НЕ УТ
		КонецЕсли;
		Если Параметр.Имя = "ИсключатьПолуфабрикатыСобственные" И Параметр.Значение
			И ИмяСхемы = "МатериальныеЗатраты" Тогда
			ТекстыИсключенияПолуфабрикатов.Добавить("НЕ ИсточникБазы.ЭтоПолуфабрикатСобственный");
		ИначеЕсли Параметр.Имя = "ИсключатьПолуфабрикатыПереработчика" И Параметр.Значение
			И ИмяСхемы = "МатериальныеЗатраты" Тогда
			ТекстыИсключенияПолуфабрикатов.Добавить("НЕ ИсточникБазы.ЭтоПолуфабрикатПереработчика");
		КонецЕсли;
		//-- НЕ УТ
		
	КонецЦикла;
	
	//++ НЕ УТ
	ТекстИсключенияПолуфабрикатов = СтрСоединить(ТекстыИсключенияПолуфабрикатов, " И ");
	Если Не ПустаяСтрока(ТекстИсключенияПолуфабрикатов) Тогда
		ПараметрыОтбора.ТекстУсловия = СтрШаблон("%1 И (%2)",
			ТекстИсключенияПолуфабрикатов,
			?(ПустаяСтрока(ПараметрыОтбора.ТекстУсловия), "ИСТИНА", ПараметрыОтбора.ТекстУсловия));
	КонецЕсли;
	//-- НЕ УТ
	
	Возврат ПараметрыОтбора;
	
КонецФункции

Процедура ОчиститьНедоступныеПоляИзОтбора(КоллекцияЭлементовОтбора, ИмяПоля)
	
	Индекс = КоллекцияЭлементовОтбора.Количество() - 1;
	Пока Индекс >= 0 Цикл
		
		ЭлементОтбора = КоллекцияЭлементовОтбора[Индекс];
		Индекс = Индекс - 1;
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			ОчиститьНедоступныеПоляИзОтбора(ЭлементОтбора.Элементы, ИмяПоля);
			
			Если ЭлементОтбора.Элементы.Количество() = 0 Тогда
				КоллекцияЭлементовОтбора.Удалить(ЭлементОтбора);
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		Если СтрНачинаетсяС(ЭлементОтбора.ЛевоеЗначение, ИмяПоля) Тогда
			КоллекцияЭлементовОтбора.Удалить(ЭлементОтбора);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОпределитьГруппу(НовыеПараметры, ОписаниеГрупп)
	
	// -4 количество начальных колонок в таблице.
	Если ОписаниеГрупп.Колонки.Количество() - 4 < НовыеПараметры.ПараметрыЗапроса.Количество() Тогда
		Возврат ОписаниеГрупп.Количество();
	КонецЕсли;
	
	КлючПоиска = Новый Структура("ТекстУсловия, КоличествоПараметров",
		НовыеПараметры.ТекстУсловия, НовыеПараметры.ПараметрыЗапроса.Количество());
	ЕстьСпискиЗначений = Ложь;
	ВсеПараметрыУстановлены = Истина;
	Для Каждого ПараметрЗапроса Из НовыеПараметры.ПараметрыЗапроса Цикл
		
		Если ТипЗнч(ПараметрЗапроса.Ключ) = Тип("СписокЗначений") Тогда
			
			ЕстьСпискиЗначений = Истина;
			Продолжить;
			
		КонецЕсли;
		
		Если ОписаниеГрупп.Колонки.Найти(ПараметрЗапроса.Ключ) = Неопределено Тогда
			
			ВсеПараметрыУстановлены = Ложь;
			Прервать;
			
		КонецЕсли;
		
		КлючПоиска.Вставить(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
		
	КонецЦикла;	
	
	Если Не ВсеПараметрыУстановлены Тогда
		Возврат ОписаниеГрупп.Количество();
	КонецЕсли;
	
	ГруппыУсловия = ОписаниеГрупп.НайтиСтроки(КлючПоиска);
	Если ГруппыУсловия.Количество() = 0 Тогда
		Возврат ОписаниеГрупп.Количество();
	КонецЕсли;
	
	Если Не ЕстьСпискиЗначений И ГруппыУсловия.Количество() = 1 Тогда
		Возврат ГруппыУсловия[0].НомерГруппы;
	КонецЕсли;
	
	НомерГруппы = ОписаниеГрупп.Количество();
	Для Каждого ОписаниеГруппы Из ГруппыУсловия Цикл
		
		ГруппаСоответствует = Истина;
		ИндексПараметра = 0;
		Пока ГруппаСоответствует И ИндексПараметра < НовыеПараметры.ПараметрыЗапроса.Количество() Цикл
			
			НовыйПараметр = НовыеПараметры.ПараметрыЗапроса[ИндексПараметра];
			Если Не ТипЗнч(НовыйПараметр.Значение) = Тип("СписокЗначений") Тогда
				// Поиск по полям ссылочного типа выполнен ранее.
				ИндексПараметра = ИндексПараметра + 1;
				Продолжить;
			КонецЕсли;
			
			ПараметрГруппы = ОписаниеГруппы[НовыйПараметр.Ключ];
			Если Не ТипЗнч(ПараметрГруппы) = ТипЗнч(НовыйПараметр.Значение) Тогда
				ГруппаСоответствует = Ложь;
			Иначе
				
				НовыйПараметр.Значение.СортироватьПоЗначению();
				ГруппаСоответствует = (ПараметрГруппы.Количество() = НовыйПараметр.Значение.Количество());
				
				ИндексЭлемента = 0;
				Пока ИндексЭлемента < ПараметрГруппы.Количество()
					И ГруппаСоответствует Цикл
					
					ГруппаСоответствует = (ПараметрГруппы[ИндексЭлемента].Значение = НовыйПараметр.Значение[ИндексЭлемента].Значение);
					ИндексЭлемента = ИндексЭлемента + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ГруппаСоответствует Тогда
			
			НомерГруппы = ОписаниеГруппы.НомерГруппы;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НомерГруппы;
	
КонецФункции

Функция ТекстУсловияБезФорматирования(Текст)
	
	СимволыКЗамене = Новый Массив;
	СимволыКЗамене.Добавить(Символы.ВК);
	СимволыКЗамене.Добавить(Символы.ВТаб);
	СимволыКЗамене.Добавить(Символы.НПП);
	СимволыКЗамене.Добавить(Символы.ПС);
	СимволыКЗамене.Добавить(Символы.ПФ);
	СимволыКЗамене.Добавить(Символы.Таб);
	
	Для Каждого СимволКЗамене Из СимволыКЗамене Цикл
		Текст = СтрЗаменить(Текст, СимволКЗамене, " ");
	КонецЦикла;
	
	Пока СтрНайти(Текст, "  ") > 0 Цикл
		Текст = СтрЗаменить(Текст, "  ", " ");
	КонецЦикла;
	
	Возврат Текст;
	
КонецФункции

Процедура ЗаменитьПустыеЗначенияНаПсевдонимы(ТекстУсловия, Знач ТекстЗапроса, Псевдонимы = Неопределено)
	
	Определитель = "ЗНАЧЕНИЕ(";
	
	Пока СтрНайти(ТекстУсловия, Определитель) > 0 Цикл
		
		НачалоПустогоЗначения = СтрНайти(ТекстУсловия, Определитель);
		ПустоеЗначение = Сред(ТекстУсловия, 
			НачалоПустогоЗначения,
			СтрНайти(ТекстУсловия, ")",, НачалоПустогоЗначения) - НачалоПустогоЗначения + 1);
			
		ПозицияЗапятой = СтрНайти(ТекстЗапроса, ",", , СтрНайти(ТекстЗапроса, ПустоеЗначение));
		ПозицияНачалаПсевдонима = СтрНайти(ТекстЗапроса, " ", НаправлениеПоиска.СКонца, ПозицияЗапятой) + 1;
		
		Если ПозицияЗапятой - ПозицияНачалаПсевдонима <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Псевдоним = Сред(ТекстЗапроса, 
			ПозицияНачалаПсевдонима,
			ПозицияЗапятой - ПозицияНачалаПсевдонима);

		Если Не Псевдонимы = Неопределено
			И Не Псевдонимы.Получить(Псевдоним) = Неопределено Тогда
			Псевдоним = Псевдонимы.Получить(Псевдоним);
		КонецЕсли;
		
		ТекстУсловия = СтрЗаменить(ТекстУсловия, ПустоеЗначение, 
			СтрШаблон("%1.%2", "ИсточникБазы", Псевдоним));
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьИмяПараметра(ИсходноеИмя, НомерГруппы, Этап)
	
	Возврат СтрШаблон("%1_%2_%3", ИсходноеИмя, Формат(НомерГруппы, "ЧН=; ЧГ=0"), Этап);
	
КонецФункции

// Дополняет тексты запросов новыми текстами по описанию групп.
// Параметры:
//	ТекстыЗапросов - Массив - тексты запросов базы распределения в разрезе документов распределения расходов.
//	ОписаниеГрупп - Структура -
//	ИсточникШаблона - Строка - откуда получать шаблон текста запроса.
Процедура ДополнитьТекстамиПоОписаниюГрупп(ТекстыЗапросов, ОписаниеГрупп, ИсточникШаблона) Экспорт
	
	Для Каждого ОписаниеГруппы Из ОписаниеГрупп Цикл
		
		ШаблонЗапроса = "";
		Если ИсточникШаблона = "ГруппыОбъектовДополнительныхРасходов" Тогда
			
			ОписаниеГруппы.ТекстУсловия = СтрЗаменить(ОписаниеГруппы.ТекстУсловия, "ИсточникБазы.Склад", "АналитикаОтбора.МестоХранения");
			ОписаниеГруппы.ТекстУсловия = СтрЗаменить(ОписаниеГруппы.ТекстУсловия, "ИсточникБазы.", "АналитикаОтбора.");
			ОписаниеГруппы.ТекстУсловия = СтрЗаменить(ОписаниеГруппы.ТекстУсловия, "АналитикаОтбора.Партия", "ИсточникБазы.Партия");
			ШаблонЗапроса = ШаблонТекстаПервичныеПриемникиДополнительныхРасходов(ОписаниеГруппы.ПараметрыЗапроса.ТипАналитикиРасходов);
		//++ НЕ УТ	
		ИначеЕсли ИсточникШаблона = "ГруппыОбъектовРаспределенияПоПартиям" Тогда
			ШаблонЗапроса = ШаблонТекстаБазыРаспределенияПоПартиям(
				ОписаниеГруппы.ПоказательБазыРаспределения);
		ИначеЕсли ИсточникШаблона = "ГруппыОбъектовРаспределенияПоПодразделениям" Тогда
			ШаблонЗапроса = ШаблонТекстаБазыРаспределенияПоПодразделениям(
				ОписаниеГруппы.ПоказательБазыРаспределения);
		ИначеЕсли ИсточникШаблона = "ГруппыОбъектовПоНаправлениюРаспределения" Тогда
			ШаблонЗапроса = ШаблонТекстаОтбораПоПодразделениям();
		//-- НЕ УТ	
			
		Иначе
			
			Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИсточникШаблона);
			ШаблонЗапроса = Менеджер.ШаблонТекстаБазыРаспределения(
				ОписаниеГруппы.ПоказательБазыРаспределения);
			
		КонецЕсли;

		Если ЗначениеЗаполнено(ШаблонЗапроса) Тогда
			ТекстыЗапросов.Добавить(
				СформироватьТекстЗапросаПоОтбору(
					ШаблонЗапроса, 
					ОписаниеГруппы,
					СтрЗаменить(ИсточникШаблона, ".", "")));
		Иначе
			ОписаниеГруппы.Используется = Ложь;
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстПомещенияГруппыОбъектовВоВременнуюТаблицу(ИмяВременнойТаблицы) Экспорт

	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Т.НомерГруппы,
		|	Т.Объект
		|ПОМЕСТИТЬ ИмяВременнойТаблицы
		|ИЗ
		|	&ИмяВременнойТаблицы КАК Т";
	
	Возврат СтрЗаменить(ТекстЗапроса, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	
КонецФункции

Функция СформироватьТекстЗапросаПоОтбору(ШаблонЗапроса, ОписаниеГруппы, ПостфиксПараметра)

	ТекстаЗапроса = СтрЗаменить(ШаблонЗапроса, "&НомерГруппы", Формат(ОписаниеГруппы.НомерГруппы, "ЧН=0; ЧГ=0"));
	ТекстаЗапроса = СтрЗаменить(ТекстаЗапроса, "ТаблицаДанных",
		СтрШаблон("ТаблицаДанных%1", Формат(ОписаниеГруппы.НомерГруппы, "ЧН=0; ЧГ=0")));
	Если Не ЗначениеЗаполнено(СокрЛП(ОписаниеГруппы.ТекстУсловия)) Тогда
		Возврат СтрЗаменить(ТекстаЗапроса, "&УсловиеСоединения", "ИСТИНА");
	КонецЕсли;
	
	УсловиеДляГруппы = ОписаниеГруппы.ТекстУсловия;

	МассивПараметров = Новый Массив;
	Для Каждого Колонка Из ОписаниеГруппы.Владелец().Колонки Цикл
		
		Если Колонка.Имя = "НомерГруппы"
			Или Колонка.Имя = "ТекстУсловия"
			Или Колонка.Имя = "КоличествоПараметров"
			Или Колонка.Имя = "ИсточникиДополнительныхРеквизитов" Тогда
			Продолжить;
		КонецЕсли;
		
		МассивПараметров.Добавить(Колонка.Имя);
		
	КонецЦикла;
	
	ПозицииПараметров = Новый СписокЗначений;

	Индекс = МассивПараметров.ВГраница();
	Пока Индекс >= 0 Цикл
		
		ИмяПараметра = СтрШаблон("&%1", МассивПараметров[Индекс]);
		НовоеИмяПараметра = СформироватьИмяПараметра(ИмяПараметра, ОписаниеГруппы.НомерГруппы, ПостфиксПараметра);
		
		НачальнаяПозиция = СтрНайти(УсловиеДляГруппы, ИмяПараметра);

		Пока НачальнаяПозиция > 0 Цикл
			
			Если Не ПозицииПараметров.НайтиПоЗначению(НачальнаяПозиция) = Неопределено Тогда
				
				Если НачальнаяПозиция + СтрДлина(ИмяПараметра) > СтрДлина(УсловиеДляГруппы) Тогда
					НачальнаяПозиция = 0;
				Иначе
					НачальнаяПозиция = СтрНайти(УсловиеДляГруппы, ИмяПараметра, , НачальнаяПозиция + СтрДлина(ИмяПараметра));
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			НоваяПозиция = ПозицииПараметров.Добавить(НачальнаяПозиция);
			
			УсловиеДляГруппы = Лев(УсловиеДляГруппы, НачальнаяПозиция - 1) + НовоеИмяПараметра
				+ Сред(УсловиеДляГруппы, НачальнаяПозиция + СтрДлина(ИмяПараметра));

			ПозицииПараметров.СортироватьПоЗначению();
			ИндексПозиции = ПозицииПараметров.Индекс(НоваяПозиция) + 1;
			Пока ИндексПозиции < ПозицииПараметров.Количество() Цикл
				ПозицииПараметров[ИндексПозиции].Значение = ПозицииПараметров[ИндексПозиции].Значение
					+ СтрДлина(НовоеИмяПараметра) - СтрДлина(ИмяПараметра);
				ИндексПозиции = ИндексПозиции + 1;
			КонецЦикла;
			
			НачальнаяПозиция = СтрНайти(УсловиеДляГруппы, ИмяПараметра, , НачальнаяПозиция + СтрДлина(НовоеИмяПараметра) - 1);
			
		КонецЦикла;
		
		Индекс = Индекс - 1;
		
	КонецЦикла;
	
	Возврат СтрЗаменить(ТекстаЗапроса, "&УсловиеСоединения", УсловиеДляГруппы);
	
КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапов_Контекстные

// Используется для всех вызовов заполнения расчетной партии.
//
Процедура ЗаполнитьРасчетнуюПартию(ПараметрыРасчета, Контекст, РасчетнаяПартия, Расход, Приход, ПартияЗаполнена) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область Тестирование

// Дополняет список этапов расчета.
// 
// Параметры:
// 	СписокЭтапов - СписокЗначений - 
//
Процедура ДополнитьЭтапыСРаспределениемПартий(СписокЭтапов) Экспорт
	
	// Этап РаспределениеДопРасходовМеждуПартиямиИТоварами пока реализован на нестандартной механике.
	Возврат;
	
КонецПроцедуры

// Дополняет список этапов расчета.
// 
// Параметры:
// 	СписокЭтапов - СписокЗначений - 
//
Процедура ДополнитьЭтапыСТрансляциейПартий(СписокЭтапов) Экспорт
	
	СписокЭтапов.Добавить("РаспределениеОтклоненийВСтоимости"); // пока возможна отладка только 1го шага из 4х
	СписокЭтапов.Добавить("РаспределениеДопРасходовМеждуПартиямиИТоварами"); // пока возможна отладка только 1го шага из 4х
	//++ НЕ УТ
	СписокЭтапов.Добавить("РаспределитьДолиПроизводственныхРасходов");
	СписокЭтапов.Добавить("РаспределитьПрямыеПроизводственныеРасходы");
	СписокЭтапов.Добавить("РаспределениеПостатейныхРасходовНаВыходныеИзделия");
	СписокЭтапов.Добавить("РаспределениеПостатейныхРасходовНаПродажу");
	//-- НЕ УТ
	
КонецПроцедуры

Процедура ТекстЗапросаДляРасчетаЭтапа(ИмяЭтапа, ПараметрыРасчета, ТекстЗапроса) Экспорт
	
	Если ИмяЭтапа = "РаспределениеОтклоненийВСтоимости" Тогда
		ТекстЗапроса = ТекстРаспределенияОтклоненийВСтоимостиСебестоимостьТоваров(ПараметрыРасчета);
	ИначеЕсли ИмяЭтапа = "РаспределениеДопРасходовМеждуПартиямиИТоварами" Тогда
		ТекстЗапроса = ТекстЗапросаДляРаспределенияДополнительныхРасходов(ПараметрыРасчета);
	//++ НЕ УТ
	ИначеЕсли ИмяЭтапа = "РаспределитьДолиПроизводственныхРасходов" Тогда
		ТекстЗапроса = ТекстЗапросаДляРаспределенияДолейПроизводственныхРасходов(ПараметрыРасчета);
	ИначеЕсли ИмяЭтапа = "РаспределитьПрямыеПроизводственныеРасходы" Тогда
		ТекстЗапроса = ТекстЗапросаДляРаспределенияПрямыхРасходовНаПроизводство(ПараметрыРасчета);
		
	ИначеЕсли ИмяЭтапа = "РаспределитьПрямыеПроизводственныеРасходы" Тогда
		ТекстЗапроса = ТекстЗапросаДляРаспределенияПрямыхРасходовНаПроизводство(ПараметрыРасчета);
		
	ИначеЕсли ИмяЭтапа = "РаспределениеПостатейныхРасходовНаВыходныеИзделия" Тогда
		ТекстЗапроса = ТекстЗапросаДляПрочихРасходовНЗП(ПараметрыРасчета);
	ИначеЕсли ИмяЭтапа = "РаспределитьПрямыеПроизводственныеРасходы" Тогда
		ТекстЗапроса = ТекстЗапросаДляРаспределенияПрямыхРасходовНаПроизводство(ПараметрыРасчета);
	//-- НЕ УТ
	ИначеЕсли ИмяЭтапа = "РаспределениеПостатейныхРасходовНаПродажу" Тогда
		ТекстЗапроса = ТекстЗапросаРаспределениеРасходовНаПродажи(ПараметрыРасчета);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ОбъединитьТексты(ТекстыЗапросов, Разделитель = "")
	
	Если ПустаяСтрока(Разделитель) Тогда
		Разделитель = ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении();
	КонецЕсли;
	
	Возврат СтрСоединить(ТекстыЗапросов, Разделитель);
	
КонецФункции


#КонецОбласти
