
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбновитьПредопределенные() Экспорт

	ТабДок = ПолучитьМакет("МакетЗаполнения");
	
	Для Стр = 2 По ТабДок.ВысотаТаблицы Цикл
		
		КраткоеИмяНалога = СокрЛП(ТабДок.Область(Стр,1).Текст);
		
		ТекущийОбъект = Справочники.ГлавыНалоговогоКодексаНалоговогоМониторинга[КраткоеИмяНалога].ПолучитьОбъект();
		ТекущийОбъект.ИсточникРегламентированногоОтчета = СокрЛП(ТабДок.Область(Стр,2).Текст);		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТекущийОбъект);
	
	КонецЦикла;

КонецПроцедуры

#КонецЕсли
