// АПК:142-выкл 
// АПК:134-выкл 

#Область СлужебныеПроцедурыИФункции

Процедура ОписаниеПоказателей_6НДФЛ_2021Кв4(ПоказателиОтчета) Экспорт
	
	
	// Раздел 1
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010001001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00001М102101", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00001М102201", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00001М203101", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00001М203201", Истина, Истина);
	
	// Раздел 2
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020010001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020010501", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020011003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020011103", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020011203", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020011303", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020011503", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020012003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020012103", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020013003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020014003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020014103", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020014203", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020015003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020015503", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020017003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020018003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020019003", Истина, Истина);
	
	// Приложение 1
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000005", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000006", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000007", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000008", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000009", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000010", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000011", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000012", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100005", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100006", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100007", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100008", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100009", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100010", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М200001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М200002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М300001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М300002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М300003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М300004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М500001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М500002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М500003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М600004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М600005", Истина, Ложь);

КонецПроцедуры

Процедура ЗначенияПоказателей_6НДФЛ_2021Кв4(ПараметрыОтчета, Контейнер) Экспорт
	
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	Организация = ПараметрыОтчета.Организация;
	НачалоПериода = НачалоГода(ДатаКонцаПериодаОтчета);
	ОкончаниеПериода = КонецМесяца(ДатаКонцаПериодаОтчета);
	НомерКорректировки = ПараметрыОтчета.НомерКорректировки;
	Если ПараметрыОтчета.Свойство("РегистрацииВНО") Тогда
		РегистрацияВНалоговомОргане = ПараметрыОтчета.РегистрацииВНО;
	Иначе
		ТитульныйЛист = Контейнер.Титульный;
		ПараметрыОтбораРегистрацийВНО = Новый Структура;
		ПараметрыОтбораРегистрацийВНО.Вставить("КодНО", ТитульныйЛист.НалоговыйОрган);
		ПараметрыОтбораРегистрацийВНО.Вставить("ОКТМО", ТитульныйЛист.ОКТМО);
		Если СтрДлина(ТитульныйЛист.ИНН) = 10 Тогда
			ПараметрыОтбораРегистрацийВНО.Вставить("КПП", ТитульныйЛист.КПП);
			ПараметрыОтбораРегистрацийВНО.Вставить("ИскатьПоПервымСимволамОКТМО", Истина);
		КонецЕсли;
		РегистрацияВНалоговомОргане = РегламентированнаяОтчетность.РегистрацииОрганизацииВНалоговомОргане(Организация, ПараметрыОтбораРегистрацийВНО);
	КонецЕсли;
	ЗаполнятьПриложение1 = КонецМесяца(ОкончаниеПериода) = КонецГода(ОкончаниеПериода);
	Если ПараметрыОтчета.Свойство("ЗаполнятьПриложение1") Тогда
		ЗаполнятьПриложение1 = ПараметрыОтчета.ЗаполнятьПриложение1;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РегистрацияВНалоговомОргане) Тогда
		Возврат
	КонецЕсли;
	                         
	// Очистка отчета
	ПоказателиОтчета = Новый Структура;
	ОписаниеПоказателей_6НДФЛ_2021Кв4(ПоказателиОтчета);
	
	ДанныеРаздела1 = Контейнер.Раздел1.Строки;
	ПоляКБК = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеРаздела1[0].Данные); 
	ПоляСуммКПеречислению = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеРаздела1[0].ДанныеМногострочныхЧастей.П00001М1.Строки[0].Данные);
	ПоляСуммВозврата = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеРаздела1[0].ДанныеМногострочныхЧастей.П00001М2.Строки[0].Данные);
	ДанныеРаздела1.Очистить();
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляКБК);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляСуммКПеречислению);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляСуммВозврата);
	
	ДанныеРаздела2 = Контейнер.Раздел2.Строки;
	ПоляРаздела2 = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеРаздела2[0].Данные); 
	ДанныеРаздела2.Очистить();
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляРаздела2);
	
	Если ЗаполнятьПриложение1 Тогда
		
		ДанныеПриложение1 = Контейнер.Приложение1.Строки;
		ДанныеСправки = ДанныеПриложение1[0].ДанныеМногострочныхЧастей.П000П1М1.Строки;
		ПоляНалогоплательщика = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеПриложение1[0].Данные);
		ПоляИтогов = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].Данные);
		ПоляВычетов = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].ДанныеМногострочныхЧастей.П000П1М2.Строки[0].Данные);
		ПоляУведомленийОВычетах = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].ДанныеМногострочныхЧастей.П000П1М3.Строки[0].Данные);
		ПоляНеудержано = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].ДанныеМногострочныхЧастей.П000П1М4.Строки[0].Данные);
		ПоляДоходов = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].ДанныеМногострочныхЧастей.П000П1М5.Строки[0].Данные);
		ПоляВычетовКДоходам = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].ДанныеМногострочныхЧастей.П000П1М5.Строки[0].ДанныеМногострочныхЧастей.П000П1М6.Строки[0].Данные);
		ДанныеПриложение1.Очистить();
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляНалогоплательщика);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляИтогов);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляВычетов);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляУведомленийОВычетах);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляДоходов);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляВычетовКДоходам);
		Для каждого КлючИЗначение Из ПоляНеудержано Цикл
			ПоляНеудержано[КлючИЗначение.Ключ] = 0
		КонецЦикла;
		
	КонецЕсли;
	
	// Сбор данных
	ОписаниеТаблиц = Новый Структура("КоличествоПолучателейДохода, Раздел1Налоги, Раздел1Возвраты, Раздел2Доходы, Раздел2Вычеты, Раздел2Налоги, КоличествоПолучателейДохода");
	Если ЗаполнятьПриложение1 Тогда
		ОписаниеТаблиц.Вставить("Приложение1Налогоплательщики");	
		Если НомерКорректировки <> 99 Тогда
			ОписаниеТаблиц.Вставить("Приложение1Итоги");	
			ОписаниеТаблиц.Вставить("Приложение1Доходы");	
			ОписаниеТаблиц.Вставить("Приложение1Вычеты");	
			ОписаниеТаблиц.Вставить("Приложение1УведомленияОВычетах");	
		КонецЕсли;
	КонецЕсли;
	РасчетПоказателей_6НДФЛ_2021Кв4(НачалоПериода, ОкончаниеПериода, ?(ПараметрыОтчета.ДатаПодписи > ОкончаниеПериода,ПараметрыОтчета.ДатаПодписи, ОкончаниеПериода), Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц, Ложь, НомерКорректировки);	
	
	// Вывод данных в отчет
	
	ВсеКБК = Новый Массив;
	ВсеКБК.Добавить("18210102010011000110");
	ВсеКБК.Добавить("18210102060011000110");
	ВсеКБК.Добавить("18210102070011000110");
	ВсеКБК.Добавить("18210102080011000110");
	ПоискПоКБК = Новый Структура("КБК");
	
	// Раздел 1
	Налоги = ОписаниеТаблиц.Раздел1Налоги;
	Возвраты = ОписаниеТаблиц.Раздел1Возвраты;
	Для каждого КБК Из ВсеКБК Цикл
		
		ПоискПоКБК.КБК = КБК;
		СтрокиНалогов = Налоги.НайтиСтроки(ПоискПоКБК);
		СтрокиВозвратов = Возвраты.НайтиСтроки(ПоискПоКБК);
		
		Если СтрокиНалогов.Количество() > 0 Или СтрокиВозвратов.Количество() > 0 Тогда
			СтраницаРаздела1 = ДанныеРаздела1.Добавить();
			СтраницаРаздела1.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляКБК);
			СтраницаРаздела1.Данные.П000010001001 = КБК;
			СтраницаРаздела1.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П00001М1,П00001М2");
			Если СтрокиНалогов.Количество() = 0 Тогда
				НоваяСтрокаСуммКПеречислению = СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М1.Строки.Добавить();
				НоваяСтрокаСуммКПеречислению.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммКПеречислению);
			КонецЕсли;
			Если СтрокиВозвратов.Количество() = 0 Тогда
				НоваяСтрокаСуммВозврата = СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М2.Строки.Добавить();
				НоваяСтрокаСуммВозврата.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммВозврата);
			КонецЕсли;
		КонецЕсли;
		Для каждого СтрокаНалогов Из СтрокиНалогов Цикл
			НоваяСтрокаСуммКПеречислению = СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М1.Строки.Добавить();
			НоваяСтрокаСуммКПеречислению.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммКПеречислению);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСуммКПеречислению.Данные, СтрокаНалогов);
		КонецЦикла;
		Для каждого СтрокаВозвратов Из СтрокиВозвратов Цикл
			НоваяСтрокаСуммВозврата = СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М2.Строки.Добавить();
			НоваяСтрокаСуммВозврата.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммВозврата);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСуммВозврата.Данные, СтрокаВозвратов);
		КонецЦикла;
		
	КонецЦикла;
	Если ДанныеРаздела1.Количество() = 0 Тогда
		СтраницаРаздела1 = ДанныеРаздела1.Добавить();
		СтраницаРаздела1.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляКБК);
		СтраницаРаздела1.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П00001М1,П00001М2");
		СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М1.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммКПеречислению);
		СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М2.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммВозврата);
	КонецЕсли;
	
	// Раздел 2
	Доходы = ОписаниеТаблиц.Раздел2Доходы;
	Вычеты = ОписаниеТаблиц.Раздел2Вычеты;
	Налоги = ОписаниеТаблиц.Раздел2Налоги;
	Количество = ОписаниеТаблиц.КоличествоПолучателейДохода;
	ПоискПоКБКиСтавке = Новый Структура("КБК,Ставка");
	Для каждого Ставка Из Перечисления.НДФЛСтавки Цикл
		ПоискПоКБКиСтавке.Ставка = Ставка;
		Для каждого КБК Из ВсеКБК Цикл
			
			ПоискПоКБКиСтавке.КБК = КБК;
			СтрокиДоходов = Доходы.НайтиСтроки(ПоискПоКБКиСтавке);
			СтрокиВычетов = Вычеты.НайтиСтроки(ПоискПоКБКиСтавке);
			СтрокиНалогов = Налоги.НайтиСтроки(ПоискПоКБКиСтавке);
			СтрокиКоличества = Количество.НайтиСтроки(ПоискПоКБКиСтавке);
			
			Если СтрокиДоходов.Количество() > 0 Или СтрокиНалогов.Количество() > 0 Или СтрокиВычетов.Количество() > 0 Тогда
				СтраницаРаздела = ДанныеРаздела2.Добавить();
				СтраницаРаздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляРаздела2);
				СтраницаРаздела.Данные.П000020010501 = КБК;
				Если Ставка = Перечисления.НДФЛСтавки.Ставка03 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 3
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка05 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 5
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка06 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 6
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка07 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 7
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка09 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 9
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка10 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 10
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка12 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 12
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка13 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 13
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка15 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 15
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка30 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 30
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка35 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 35
				Иначе
					
				КонецЕсли;
				СтраницаРаздела.ДанныеМногострочныхЧастей = Новый Структура();
			КонецЕсли;
			Для каждого СтрокаДанных Из СтрокиДоходов Цикл
				ЗаполнитьЗначенияСвойств(СтраницаРаздела.Данные, СтрокаДанных);
				Прервать;
			КонецЦикла;
			Для каждого СтрокаДанных Из СтрокиНалогов Цикл
				ЗаполнитьЗначенияСвойств(СтраницаРаздела.Данные, СтрокаДанных);
				Прервать;
			КонецЦикла;
			Для каждого СтрокаДанных Из СтрокиВычетов Цикл
				ЗаполнитьЗначенияСвойств(СтраницаРаздела.Данные, СтрокаДанных);
				Прервать;
			КонецЦикла;
			Для каждого СтрокаДанных Из СтрокиКоличества Цикл
				ЗаполнитьЗначенияСвойств(СтраницаРаздела.Данные, СтрокаДанных);
				Прервать;
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	Если ДанныеРаздела2.Количество() = 0 Тогда
		СтраницаРаздела = ДанныеРаздела2.Добавить();
		СтраницаРаздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляРаздела2);
		СтраницаРаздела.ДанныеМногострочныхЧастей = Новый Структура();
	КонецЕсли;
	
	// Приложение 1
	Если ЗаполнятьПриложение1 Тогда
		Если ОписаниеТаблиц.Приложение1Налогоплательщики.Количество() > 0 Тогда
			
			СоответствиеСтавок = Новый Соответствие;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка03] = 3;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка05] = 5;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка06] = 6;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка07] = 7;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка09] = 9;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка10] = 10;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка12] = 12;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка13] = 13;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка15] = 15;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка30] = 30;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка35] = 35;
			
			Если НомерКорректировки <> 99 Тогда
				Приложение1Итоги = ОписаниеТаблиц.Приложение1Итоги;
				Если Приложение1Итоги.Количество() > 100 Тогда
					Приложение1Итоги.Индексы.Добавить("ФизическоеЛицо");
				КонецЕсли;
				Приложение1Доходы = ОписаниеТаблиц.Приложение1Доходы;
				Если Приложение1Доходы.Количество() > 100 Тогда
					Приложение1Доходы.Индексы.Добавить("ФизическоеЛицо,Ставка,КБК");
				КонецЕсли;
				Приложение1Вычеты = ОписаниеТаблиц.Приложение1Вычеты;
				Если Приложение1Вычеты.Количество() > 100 Тогда
					Приложение1Вычеты.Индексы.Добавить("ФизическоеЛицо,Ставка,КБК");
				КонецЕсли;
				Приложение1УведомленияОВычетах = ОписаниеТаблиц.Приложение1УведомленияОВычетах;
				Если Приложение1УведомленияОВычетах.Количество() > 100 Тогда
					Приложение1УведомленияОВычетах.Индексы.Добавить("ФизическоеЛицо");
				КонецЕсли;
				ПоискПоФизлицу = Новый Структура("ФизическоеЛицо");
				ПоискПоФизлицуИСтавке = Новый Структура("ФизическоеЛицо,Ставка,КБК");
			КонецЕсли;
			
			НомерПервойСправки = 1;
			Если Не ОписаниеТаблиц.Свойство("Приложение1МаксимальныйНомерИзПереданныхСправок", НомерПервойСправки) Тогда
				НомерПервойСправки = 1;
			КонецЕсли;
			Для каждого СтрокаДанных Из ОписаниеТаблиц.Приложение1Налогоплательщики Цикл
				
				СтраницаПриложение1 = ДанныеПриложение1.Добавить();
				СтраницаПриложение1.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляНалогоплательщика);
				СтраницаПриложение1.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М1");
				Если НомерКорректировки = 0 Тогда
					СтраницаПриложение1.Данные.П000П10000001 = НомерПервойСправки;
					НомерПервойСправки = НомерПервойСправки + 1;
					СтраницаПриложение1.Данные.П000П10000002 = "00";
				ИначеЕсли НомерКорректировки < 99 Тогда
					Если ЗначениеЗаполнено(СтрокаДанных.НомерСправки) Тогда
						СтраницаПриложение1.Данные.П000П10000001 = СтрокаДанных.НомерСправки;
						СтраницаПриложение1.Данные.П000П10000002 = ?(СтрокаДанных.НомерКорректировки = 99, "99", Формат(СтрокаДанных.НомерКорректировки + 1, "ЧЦ=2; ЧДЦ=0; ЧВН="));
					Иначе
						СтраницаПриложение1.Данные.П000П10000001 = НомерПервойСправки;
						НомерПервойСправки = НомерПервойСправки + 1;
						СтраницаПриложение1.Данные.П000П10000002 = "00";
					КонецЕсли;
				ИначеЕсли НомерКорректировки = 99 Тогда
					СтраницаПриложение1.Данные.П000П10000001 = СтрокаДанных.НомерСправки;
					СтраницаПриложение1.Данные.П000П10000002 = "99";
				КонецЕсли;
				СтраницаПриложение1.Данные.П000П10000003 = СтрокаДанных.ИНН;
				СтраницаПриложение1.Данные.П000П10000004 = СокрЛП(СтрокаДанных.Фамилия);
				СтраницаПриложение1.Данные.П000П10000005 = СокрЛП(СтрокаДанных.Имя);
				СтраницаПриложение1.Данные.П000П10000006 = СокрЛП(СтрокаДанных.Отчество);
				СтраницаПриложение1.Данные.П000П10000007 = СтрокаДанных.КодФНС;
				СтраницаПриложение1.Данные.П000П10000008 = СтрокаДанных.ДатаРождения;
				СтраницаПриложение1.Данные.П000П10000009 = СтрокаДанных.КодСтраныДляОтчетности;
				СтраницаПриложение1.Данные.П000П10000010 = СтрокаДанных.КодМВД;
				СтраницаПриложение1.Данные.П000П10000011 = СокрЛП(СтрокаДанных.СерияДокумента);
				СтраницаПриложение1.Данные.П000П10000012 = СокрЛП(СтрокаДанных.НомерДокумента);
				
				ВыводитьДоходы = СтраницаПриложение1.Данные.П000П10000002 <> "99";
				Если ВыводитьДоходы Тогда
					ПоискПоФизлицу.ФизическоеЛицо = СтрокаДанных.ФизическоеЛицо;
					ПоискПоФизлицуИСтавке.ФизическоеЛицо = СтрокаДанных.ФизическоеЛицо;
					СтрокиФизлица = Приложение1Итоги.НайтиСтроки(ПоискПоФизлицу);
					ВыводитьДоходы = СтрокиФизлица.Количество() > 0;
				КонецЕсли;
				Если ВыводитьДоходы Тогда
					Для каждого СтрокаИтоговПоСтавке Из СтрокиФизлица Цикл
						
						ПоискПоФизлицуИСтавке.Ставка = СтрокаИтоговПоСтавке.Ставка;
						ПоискПоФизлицуИСтавке.КБК = СтрокаИтоговПоСтавке.КБК;
						СтраницаПоСтавке = СтраницаПриложение1.ДанныеМногострочныхЧастей.П000П1М1.Строки.Добавить();
						СтраницаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляИтогов);
						ЗаполнитьЗначенияСвойств(СтраницаПоСтавке.Данные, СтрокаИтоговПоСтавке);
						СтраницаПоСтавке.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М2,П000П1М3,П000П1М4,П000П1М5");
						СтрокиДанных = Приложение1Вычеты.НайтиСтроки(ПоискПоФизлицуИСтавке);
						ВыводитьИмущественныйВычет = Ложь;
						ВыводитьСоциальныйВычет = Ложь;
						Если СтрокиДанных.Количество() > 0 Тогда
							Для каждого СтрокаДанных Из СтрокиДанных Цикл
								СтрокаПоСтавке = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М2.Строки.Добавить();
								СтрокаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетов);
								ЗаполнитьЗначенияСвойств(СтрокаПоСтавке.Данные, СтрокаДанных);
								Если Не ВыводитьИмущественныйВычет Тогда
									ВыводитьИмущественныйВычет = СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.Имущественные
								КонецЕсли;
								Если Не ВыводитьСоциальныйВычет Тогда
									ВыводитьСоциальныйВычет = СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.СоциальныеПоУведомлениюНО
								КонецЕсли;
							КонецЦикла;
						Иначе
							СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М2.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетов);
						КонецЕсли;
						
						СтрокиДанных = Приложение1УведомленияОВычетах.НайтиСтроки(ПоискПоФизлицу);
						Если СтрокиДанных.Количество() > 0 Тогда
							Для каждого СтрокаДанных Из СтрокиДанных Цикл
								Если ВыводитьИмущественныйВычет И СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.Имущественные Тогда
									СтрокаПоСтавке = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить();
									СтрокаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
									ЗаполнитьЗначенияСвойств(СтрокаПоСтавке.Данные, СтрокаДанных);
									СтрокаПоСтавке.Данные.П000П1М300001 = "1"
								КонецЕсли;
								Если ВыводитьСоциальныйВычет И СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.Социальные Тогда
									СтрокаПоСтавке = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить();
									СтрокаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
									ЗаполнитьЗначенияСвойств(СтрокаПоСтавке.Данные, СтрокаДанных);
									СтрокаПоСтавке.Данные.П000П1М300001 = "2"
								КонецЕсли;
								Если СтрокаИтоговПоСтавке.П000П1М100006 > 0 И СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.ПустаяСсылка() Тогда
									СтрокаПоСтавке = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить();
									СтрокаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
									ЗаполнитьЗначенияСвойств(СтрокаПоСтавке.Данные, СтрокаДанных);
									СтрокаПоСтавке.Данные.П000П1М300001 = "3"
								КонецЕсли;
							КонецЦикла;
							Если СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Количество() = 0 Тогда
								СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
							КонецЕсли;
						Иначе
							СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
						КонецЕсли;
						
						СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М4.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляНеудержано);
						СтрокиДанных = Приложение1Доходы.Скопировать(Приложение1Доходы.НайтиСтроки(ПоискПоФизлицуИСтавке));
						Если СтрокиДанных.Количество() > 0 Тогда
							СтрокиДанных.Сортировать("Период,П000П1М500002");
							ТекущийКод = Неопределено;
							ТекущийПериод = Неопределено;
							ПредыдущаяСтрока = Неопределено; 
							СуммаДохода = 0;
							Для каждого СтрокаДанных Из СтрокиДанных Цикл
								Если ТекущийПериод <> СтрокаДанных.Период Или ТекущийКод <> СтрокаДанных.П000П1М500002 Тогда
									Если ПредыдущаяСтрока <> Неопределено Тогда
										ПредыдущаяСтрока.Данные.П000П1М500003 = СуммаДохода;
										Если ПредыдущаяСтрока.ДанныеМногострочныхЧастей.П000П1М6.Строки.Количество() = 0 Тогда
											СтрокаВычета = ПредыдущаяСтрока.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить();
											СтрокаВычета.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
											СтрокаВычета.Данные.П000П1М600004 = "";
										КонецЕсли;
									КонецЕсли;
									ТекущийКод = СтрокаДанных.П000П1М500002; 
									ТекущийПериод = СтрокаДанных.Период;
									СуммаДохода = 0;
									СтрокаПоСтавке = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М5.Строки.Добавить();
									ПредыдущаяСтрока = СтрокаПоСтавке;  
									СтрокаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляДоходов);
									ЗаполнитьЗначенияСвойств(СтрокаПоСтавке.Данные, СтрокаДанных);
									СтрокаПоСтавке.Данные.П000П1М500001 = Формат(СтрокаДанных.Период, "ДФ=MM");
									СтрокаПоСтавке.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М6");
								КонецЕсли;
								СуммаДохода = СуммаДохода + СтрокаДанных.П000П1М500003;
								Если ЗначениеЗаполнено(СтрокаДанных.П000П1М600004) Тогда
									СтрокаВычета = СтрокаПоСтавке.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить();
									СтрокаВычета.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
									ЗаполнитьЗначенияСвойств(СтрокаВычета.Данные, СтрокаДанных);
								КонецЕсли;
							КонецЦикла;
							СтрокаПоСтавке.Данные.П000П1М500003 = СуммаДохода;
							Если СтрокаПоСтавке.ДанныеМногострочныхЧастей.П000П1М6.Строки.Количество() = 0 Тогда
								СтрокаВычета = СтрокаПоСтавке.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить();
								СтрокаВычета.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
								СтрокаВычета.Данные.П000П1М600004 = "";
							КонецЕсли;
						Иначе
							СтрокаДоходов = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М5.Строки.Добавить();
							СтрокаДоходов.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляДоходов);
							СтрокаДоходов.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М6");
							СтрокаДоходов.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
						КонецЕсли;
						
					КонецЦикла; 
				Иначе
					СтраницаПоСтавке = СтраницаПриложение1.ДанныеМногострочныхЧастей.П000П1М1.Строки.Добавить();
					СтраницаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляИтогов);
					СтраницаПоСтавке.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М2,П000П1М3,П000П1М4,П000П1М5");
					СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М2.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетов);
					СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
					СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М4.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляНеудержано);
					СтрокаДоходов = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М5.Строки.Добавить();
					СтрокаДоходов.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляДоходов);
					СтрокаДоходов.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М6");
					СтрокаДоходов.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе 
			СтраницаПриложение1 = ДанныеПриложение1.Добавить();
			СтраницаПриложение1.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляНалогоплательщика);
			СтраницаПриложение1.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М1");
			СтраницаПоСтавке = СтраницаПриложение1.ДанныеМногострочныхЧастей.П000П1М1.Строки.Добавить();
			СтраницаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляИтогов);
			СтраницаПоСтавке.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М2,П000П1М3,П000П1М4,П000П1М5");
			СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М2.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетов);
			СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
			СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М4.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляНеудержано);
			СтрокаДоходов = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М5.Строки.Добавить();
			СтрокаДоходов.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляДоходов);
			СтрокаДоходов.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М6");
			СтрокаДоходов.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОписаниеПоказателей_6НДФЛ_2021Кв1(ПоказателиОтчета) Экспорт
	
	
	// Раздел 1
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010001001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00001М102101", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00001М102201", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00001М203101", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П00001М203201", Истина, Истина);
	
	// Раздел 2
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020010001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020010501", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020011003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020011103", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020011203", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020011303", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020012003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020013003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020014003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020014103", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020015003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020016003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020017003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020018003", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020019003", Истина, Истина);
	
	// Приложение 1
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000005", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000006", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000007", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000008", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000009", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000010", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000011", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П10000012", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100005", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100006", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100007", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М100008", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М200001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М200002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М300001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М300002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М300003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М300004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М500001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М500002", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М500003", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М600004", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000П1М600005", Истина, Ложь);

КонецПроцедуры

Процедура ЗначенияПоказателей_6НДФЛ_2021Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	Организация = ПараметрыОтчета.Организация;
	НачалоПериода = НачалоГода(ДатаКонцаПериодаОтчета);
	ОкончаниеПериода = КонецМесяца(ДатаКонцаПериодаОтчета);
	НомерКорректировки = ПараметрыОтчета.НомерКорректировки;
	Если ПараметрыОтчета.Свойство("РегистрацииВНО") Тогда
		РегистрацияВНалоговомОргане = ПараметрыОтчета.РегистрацииВНО;
	Иначе
		ТитульныйЛист = Контейнер.Титульный;
		ПараметрыОтбораРегистрацийВНО = Новый Структура;
		ПараметрыОтбораРегистрацийВНО.Вставить("КодНО", ТитульныйЛист.НалоговыйОрган);
		ПараметрыОтбораРегистрацийВНО.Вставить("ОКТМО", ТитульныйЛист.ОКТМО);
		Если СтрДлина(ТитульныйЛист.ИНН) = 10 Тогда
			ПараметрыОтбораРегистрацийВНО.Вставить("КПП", ТитульныйЛист.КПП);
			ПараметрыОтбораРегистрацийВНО.Вставить("ИскатьПоПервымСимволамОКТМО", Истина);
		КонецЕсли;
		РегистрацияВНалоговомОргане = РегламентированнаяОтчетность.РегистрацииОрганизацииВНалоговомОргане(Организация, ПараметрыОтбораРегистрацийВНО);
	КонецЕсли;
	ЗаполнятьПриложение1 = КонецМесяца(ОкончаниеПериода) = КонецГода(ОкончаниеПериода);
	Если ПараметрыОтчета.Свойство("ЗаполнятьПриложение1") Тогда
		ЗаполнятьПриложение1 = ПараметрыОтчета.ЗаполнятьПриложение1;
	КонецЕсли;
	
	НомерПервойСправки = 1;
	
	Если Не ЗначениеЗаполнено(РегистрацияВНалоговомОргане) Тогда
		Возврат
	КонецЕсли;
	                         
	// Очистка отчета
	ПоказателиОтчета = Новый Структура;
	ОписаниеПоказателей_6НДФЛ_2021Кв1(ПоказателиОтчета);
	
	ДанныеРаздела1 = Контейнер.Раздел1.Строки;
	ПоляКБК = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеРаздела1[0].Данные); 
	ПоляСуммКПеречислению = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеРаздела1[0].ДанныеМногострочныхЧастей.П00001М1.Строки[0].Данные);
	ПоляСуммВозврата = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеРаздела1[0].ДанныеМногострочныхЧастей.П00001М2.Строки[0].Данные);
	ДанныеРаздела1.Очистить();
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляКБК);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляСуммКПеречислению);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляСуммВозврата);
	
	ДанныеРаздела2 = Контейнер.Раздел2.Строки;
	ПоляРаздела2 = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеРаздела2[0].Данные); 
	ДанныеРаздела2.Очистить();
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляРаздела2);
	
	Если ЗаполнятьПриложение1 Тогда
		
		ДанныеПриложение1 = Контейнер.Приложение1.Строки;
		ДанныеСправки = ДанныеПриложение1[0].ДанныеМногострочныхЧастей.П000П1М1.Строки;
		ПоляНалогоплательщика = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеПриложение1[0].Данные);
		ПоляИтогов = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].Данные);
		ПоляВычетов = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].ДанныеМногострочныхЧастей.П000П1М2.Строки[0].Данные);
		ПоляУведомленийОВычетах = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].ДанныеМногострочныхЧастей.П000П1М3.Строки[0].Данные);
		ПоляНеудержано = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].ДанныеМногострочныхЧастей.П000П1М4.Строки[0].Данные);
		ПоляДоходов = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].ДанныеМногострочныхЧастей.П000П1М5.Строки[0].Данные);
		ПоляВычетовКДоходам = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].ДанныеМногострочныхЧастей.П000П1М5.Строки[0].ДанныеМногострочныхЧастей.П000П1М6.Строки[0].Данные);
		ДанныеПриложение1.Очистить();
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляНалогоплательщика);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляИтогов);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляВычетов);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляУведомленийОВычетах);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляДоходов);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляВычетовКДоходам);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляНеудержано);
		
	КонецЕсли;
	
	// Сбор данных
	ОписаниеТаблиц = Новый Структура("КоличествоПолучателейДохода, Раздел1Налоги, Раздел1Возвраты, Раздел2Доходы, Раздел2Вычеты, Раздел2Налоги, КоличествоПолучателейДохода");
	Если ЗаполнятьПриложение1 Тогда
		ОписаниеТаблиц.Вставить("Приложение1Налогоплательщики");	
		Если НомерКорректировки <> 99 Тогда
			ОписаниеТаблиц.Вставить("Приложение1Итоги");	
			ОписаниеТаблиц.Вставить("Приложение1Доходы");	
			ОписаниеТаблиц.Вставить("Приложение1Вычеты");	
			ОписаниеТаблиц.Вставить("Приложение1УведомленияОВычетах");	
		КонецЕсли;
	КонецЕсли;
	РасчетПоказателей_6НДФЛ_2021Кв1(НачалоПериода, ОкончаниеПериода, ?(ПараметрыОтчета.ДатаПодписи > ОкончаниеПериода,ПараметрыОтчета.ДатаПодписи, ОкончаниеПериода), Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц, Ложь, НомерКорректировки);	
	
	// Вывод данных в отчет
	
	ВсеКБК = Новый Массив;
	ВсеКБК.Добавить("18210102010011000110");
	ВсеКБК.Добавить("18210102060011000110");
	ВсеКБК.Добавить("18210102070011000110");
	ВсеКБК.Добавить("18210102080011000110");
	ПоискПоКБК = Новый Структура("КБК");
	
	// Раздел 1
	Налоги = ОписаниеТаблиц.Раздел1Налоги;
	Возвраты = ОписаниеТаблиц.Раздел1Возвраты;
	Для каждого КБК Из ВсеКБК Цикл
		
		ПоискПоКБК.КБК = КБК;
		СтрокиНалогов = Налоги.НайтиСтроки(ПоискПоКБК);
		СтрокиВозвратов = Возвраты.НайтиСтроки(ПоискПоКБК);
		
		Если СтрокиНалогов.Количество() > 0 Или СтрокиВозвратов.Количество() > 0 Тогда
			СтраницаРаздела1 = ДанныеРаздела1.Добавить();
			СтраницаРаздела1.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляКБК);
			СтраницаРаздела1.Данные.П000010001001 = КБК;
			СтраницаРаздела1.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П00001М1,П00001М2");
			Если СтрокиНалогов.Количество() = 0 Тогда
				НоваяСтрокаСуммКПеречислению = СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М1.Строки.Добавить();
				НоваяСтрокаСуммКПеречислению.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммКПеречислению);
			КонецЕсли;
			Если СтрокиВозвратов.Количество() = 0 Тогда
				НоваяСтрокаСуммВозврата = СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М2.Строки.Добавить();
				НоваяСтрокаСуммВозврата.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммВозврата);
			КонецЕсли;
		КонецЕсли;
		Для каждого СтрокаНалогов Из СтрокиНалогов Цикл
			НоваяСтрокаСуммКПеречислению = СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М1.Строки.Добавить();
			НоваяСтрокаСуммКПеречислению.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммКПеречислению);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСуммКПеречислению.Данные, СтрокаНалогов);
		КонецЦикла;
		Для каждого СтрокаВозвратов Из СтрокиВозвратов Цикл
			НоваяСтрокаСуммВозврата = СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М2.Строки.Добавить();
			НоваяСтрокаСуммВозврата.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммВозврата);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСуммВозврата.Данные, СтрокаВозвратов);
		КонецЦикла;
		
	КонецЦикла;
	Если ДанныеРаздела1.Количество() = 0 Тогда
		СтраницаРаздела1 = ДанныеРаздела1.Добавить();
		СтраницаРаздела1.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляКБК);
		СтраницаРаздела1.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П00001М1,П00001М2");
		СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М1.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммКПеречислению);
		СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М2.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммВозврата);
	КонецЕсли;
	
	// Раздел 2
	Доходы = ОписаниеТаблиц.Раздел2Доходы;
	Вычеты = ОписаниеТаблиц.Раздел2Вычеты;
	Налоги = ОписаниеТаблиц.Раздел2Налоги;
	Количество = ОписаниеТаблиц.КоличествоПолучателейДохода;
	ПоискПоКБКиСтавке = Новый Структура("КБК,Ставка");
	Для каждого Ставка Из Перечисления.НДФЛСтавки Цикл
		ПоискПоКБКиСтавке.Ставка = Ставка;
		Для каждого КБК Из ВсеКБК Цикл
			
			ПоискПоКБКиСтавке.КБК = КБК;
			СтрокиДоходов = Доходы.НайтиСтроки(ПоискПоКБКиСтавке);
			СтрокиВычетов = Вычеты.НайтиСтроки(ПоискПоКБКиСтавке);
			СтрокиНалогов = Налоги.НайтиСтроки(ПоискПоКБКиСтавке);
			СтрокиКоличества = Количество.НайтиСтроки(ПоискПоКБКиСтавке);
			
			Если СтрокиДоходов.Количество() > 0 Или СтрокиНалогов.Количество() > 0 Или СтрокиВычетов.Количество() > 0 Тогда
				СтраницаРаздела = ДанныеРаздела2.Добавить();
				СтраницаРаздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляРаздела2);
				СтраницаРаздела.Данные.П000020010501 = КБК;
				Если Ставка = Перечисления.НДФЛСтавки.Ставка03 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 3
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка05 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 5
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка06 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 6
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка07 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 7
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка09 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 9
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка10 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 10
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка12 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 12
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка13 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 13
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка15 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 15
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка30 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 30
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка35 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 35
				Иначе
					
				КонецЕсли;
				СтраницаРаздела.ДанныеМногострочныхЧастей = Новый Структура();
			КонецЕсли;
			Для каждого СтрокаДанных Из СтрокиДоходов Цикл
				ЗаполнитьЗначенияСвойств(СтраницаРаздела.Данные, СтрокаДанных);
				Прервать;
			КонецЦикла;
			Для каждого СтрокаДанных Из СтрокиНалогов Цикл
				ЗаполнитьЗначенияСвойств(СтраницаРаздела.Данные, СтрокаДанных);
				Прервать;
			КонецЦикла;
			Для каждого СтрокаДанных Из СтрокиВычетов Цикл
				ЗаполнитьЗначенияСвойств(СтраницаРаздела.Данные, СтрокаДанных);
				Прервать;
			КонецЦикла;
			Для каждого СтрокаДанных Из СтрокиКоличества Цикл
				ЗаполнитьЗначенияСвойств(СтраницаРаздела.Данные, СтрокаДанных);
				Прервать;
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	Если ДанныеРаздела2.Количество() = 0 Тогда
		СтраницаРаздела = ДанныеРаздела2.Добавить();
		СтраницаРаздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляРаздела2);
		СтраницаРаздела.ДанныеМногострочныхЧастей = Новый Структура();
	КонецЕсли;
	
	// Приложение 1
	Если ЗаполнятьПриложение1 Тогда
		Если ОписаниеТаблиц.Приложение1Налогоплательщики.Количество() > 0 Тогда
			
			СоответствиеСтавокДоходов = УчетНДФЛ.СоответствиеДоходовСтавкам();
			СоответствиеКодовСтран = Новый Соответствие;
			СоответствиеИменСтран = Новый Соответствие;
			СоответствиеДокументовУдостоверяющихЛичность = Новый Соответствие;
			СоответствиеКодовДоходов = Новый Соответствие;
			СоответствиеКодовФНССтатусамНДФЛ = Новый Соответствие;
			УчетНДФЛ.ПрочитатьКлассификаторыВСоответствия(СоответствиеКодовСтран, 
				СоответствиеИменСтран, 
				СоответствиеДокументовУдостоверяющихЛичность,
				СоответствиеКодовДоходов, 
				СоответствиеКодовФНССтатусамНДФЛ);
			
			СоответствиеСтавок = Новый Соответствие;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка03] = 3;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка05] = 5;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка06] = 6;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка07] = 7;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка09] = 9;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка10] = 10;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка12] = 12;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка13] = 13;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка15] = 15;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка30] = 30;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка35] = 35;
			
			Если НомерКорректировки <> 99 Тогда
				Приложение1Итоги = ОписаниеТаблиц.Приложение1Итоги;
				Если Приложение1Итоги.Количество() > 100 Тогда
					Приложение1Итоги.Индексы.Добавить("ФизическоеЛицо");
				КонецЕсли;
				Приложение1Доходы = ОписаниеТаблиц.Приложение1Доходы;
				Если Приложение1Доходы.Количество() > 100 Тогда
					Приложение1Доходы.Индексы.Добавить("ФизическоеЛицо,Ставка");
				КонецЕсли;
				Приложение1Вычеты = ОписаниеТаблиц.Приложение1Вычеты;
				Если Приложение1Вычеты.Количество() > 100 Тогда
					Приложение1Вычеты.Индексы.Добавить("ФизическоеЛицо,Ставка");
				КонецЕсли;
				Приложение1УведомленияОВычетах = ОписаниеТаблиц.Приложение1УведомленияОВычетах;
				Если Приложение1УведомленияОВычетах.Количество() > 100 Тогда
					Приложение1УведомленияОВычетах.Индексы.Добавить("ФизическоеЛицо");
				КонецЕсли;
				ПоискПоФизлицу = Новый Структура("ФизическоеЛицо");
				ПоискПоФизлицуИСтавке = Новый Структура("ФизическоеЛицо,Ставка");
			КонецЕсли;
			
			Для каждого СтрокаДанных Из ОписаниеТаблиц.Приложение1Налогоплательщики Цикл
				
				СтраницаПриложение1 = ДанныеПриложение1.Добавить();
				СтраницаПриложение1.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляНалогоплательщика);
				СтраницаПриложение1.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М1");
				СтраницаПриложение1.Данные.П000П10000001 = НомерПервойСправки;
				НомерПервойСправки = НомерПервойСправки + 1;
				СтраницаПриложение1.Данные.П000П10000002 = "00";
				СтраницаПриложение1.Данные.П000П10000003 = СтрокаДанных.ИНН;
				СтраницаПриложение1.Данные.П000П10000004 = СокрЛП(СтрокаДанных.Фамилия);
				СтраницаПриложение1.Данные.П000П10000005 = СокрЛП(СтрокаДанных.Имя);
				СтраницаПриложение1.Данные.П000П10000006 = СокрЛП(СтрокаДанных.Отчество);
				Описание = СоответствиеКодовФНССтатусамНДФЛ.Получить(СтрокаДанных.СтатусНалогоплательщика);
				СтраницаПриложение1.Данные.П000П10000007 = ?(Описание = Неопределено, "", Описание.КодФНС_2015);
				СтраницаПриложение1.Данные.П000П10000008 = СтрокаДанных.ДатаРождения;
				СтраницаПриложение1.Данные.П000П10000009 = ФизическиеЛицаЗарплатаКадры.КодСтраныДляОтчетности(СоответствиеКодовСтран, СтрокаДанных.Гражданство, СтрокаДанных.СтранаВыдачиДокумента);
				Описание = СоответствиеДокументовУдостоверяющихЛичность.Получить(СтрокаДанных.ВидДокумента);
				СтраницаПриложение1.Данные.П000П10000010 = ?(Описание = Неопределено, "", Описание.КодМВД_2015);
				СтраницаПриложение1.Данные.П000П10000011 = СокрЛП(СтрокаДанных.СерияДокумента);
				СтраницаПриложение1.Данные.П000П10000012 = СокрЛП(СтрокаДанных.НомерДокумента);
				
				ВыводитьДоходы = НомерКорректировки <> 99;
				Если ВыводитьДоходы Тогда
					ПоискПоФизлицу.ФизическоеЛицо = СтрокаДанных.ФизическоеЛицо;
					ПоискПоФизлицуИСтавке.ФизическоеЛицо = СтрокаДанных.ФизическоеЛицо;
					СтрокиФизлица = Приложение1Итоги.НайтиСтроки(ПоискПоФизлицу);
					ВыводитьДоходы = СтрокиФизлица.Количество() > 0;
				КонецЕсли;
				Если ВыводитьДоходы Тогда
					Для каждого СтрокаИтоговПоСтавке Из СтрокиФизлица Цикл
						
						ПоискПоФизлицуИСтавке.Ставка = СтрокаИтоговПоСтавке.Ставка;
						СтраницаПоСтавке = СтраницаПриложение1.ДанныеМногострочныхЧастей.П000П1М1.Строки.Добавить();
						СтраницаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляИтогов);
						ЗаполнитьЗначенияСвойств(СтраницаПоСтавке.Данные, СтрокаИтоговПоСтавке);
						СтраницаПоСтавке.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М2,П000П1М3,П000П1М4,П000П1М5");
						СтрокиДанных = Приложение1Вычеты.НайтиСтроки(ПоискПоФизлицуИСтавке);
						ВыводитьИмущественныйВычет = Ложь;
						ВыводитьСоциальныйВычет = Ложь;
						Если СтрокиДанных.Количество() > 0 Тогда
							Для каждого СтрокаДанных Из СтрокиДанных Цикл
								Если СтрокаДанных.П000П1М200002 <> 0 Тогда
									СтрокаПоСтавке = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М2.Строки.Добавить();
									СтрокаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетов);
									ЗаполнитьЗначенияСвойств(СтрокаПоСтавке.Данные, СтрокаДанных);
									Если Не ВыводитьИмущественныйВычет Тогда
										ВыводитьИмущественныйВычет = СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.Имущественные 
									КонецЕсли;
									Если Не ВыводитьСоциальныйВычет Тогда
										ВыводитьСоциальныйВычет = СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.СоциальныеПоУведомлениюНО
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						Если СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М2.Строки.Количество() = 0 Тогда
							СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М2.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетов);
						КонецЕсли;	
						
						СтрокиДанных = Приложение1УведомленияОВычетах.НайтиСтроки(ПоискПоФизлицу);
						Если СтрокиДанных.Количество() > 0 Тогда
							Для каждого СтрокаДанных Из СтрокиДанных Цикл
								Если ВыводитьИмущественныйВычет И СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.Имущественные Тогда
									СтрокаПоСтавке = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить();
									СтрокаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
									ЗаполнитьЗначенияСвойств(СтрокаПоСтавке.Данные, СтрокаДанных);
									СтрокаПоСтавке.Данные.П000П1М300001 = "1"
								КонецЕсли;
								Если ВыводитьСоциальныйВычет И СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.Социальные Тогда
									СтрокаПоСтавке = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить();
									СтрокаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
									ЗаполнитьЗначенияСвойств(СтрокаПоСтавке.Данные, СтрокаДанных);
									СтрокаПоСтавке.Данные.П000П1М300001 = "2"
								КонецЕсли;
								Если СтрокаИтоговПоСтавке.П000П1М100006 > 0 И СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.ПустаяСсылка() Тогда
									СтрокаПоСтавке = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить();
									СтрокаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
									ЗаполнитьЗначенияСвойств(СтрокаПоСтавке.Данные, СтрокаДанных);
									СтрокаПоСтавке.Данные.П000П1М300001 = "3"
								КонецЕсли;
							КонецЦикла;
							Если СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Количество() = 0 Тогда
								СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
							КонецЕсли;
						Иначе
							СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
						КонецЕсли;
						
						СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М4.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляНеудержано);
						СтрокиДанных = Приложение1Доходы.Скопировать(Приложение1Доходы.НайтиСтроки(ПоискПоФизлицуИСтавке));
						Если СтрокиДанных.Количество() > 0 Тогда
							СтрокиДанных.Сортировать("Период,П000П1М500002");
							ТекущийКод = Неопределено;
							ТекущийПериод = Неопределено;
							ПредыдущаяСтрока = Неопределено; 
							СуммаДохода = 0;
							Для каждого СтрокаДанных Из СтрокиДанных Цикл
								Если ТекущийПериод <> СтрокаДанных.Период Или ТекущийКод <> СтрокаДанных.П000П1М500002 Тогда
									Если ПредыдущаяСтрока <> Неопределено Тогда
										ПредыдущаяСтрока.Данные.П000П1М500003 = СуммаДохода;
										Если ПредыдущаяСтрока.ДанныеМногострочныхЧастей.П000П1М6.Строки.Количество() = 0 Тогда
											СтрокаВычета = ПредыдущаяСтрока.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить();
											СтрокаВычета.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
											СтрокаВычета.Данные.П000П1М600004 = "";
										КонецЕсли;
									КонецЕсли;
									ТекущийКод = СтрокаДанных.П000П1М500002; 
									ТекущийПериод = СтрокаДанных.Период;
									СуммаДохода = 0;
									СтрокаПоСтавке = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М5.Строки.Добавить();
									ПредыдущаяСтрока = СтрокаПоСтавке;  
									СтрокаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляДоходов);
									ЗаполнитьЗначенияСвойств(СтрокаПоСтавке.Данные, СтрокаДанных);
									СтрокаПоСтавке.Данные.П000П1М500001 = Формат(СтрокаДанных.Период, "ДФ=MM");
									СтрокаПоСтавке.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М6");
								КонецЕсли;
								СуммаДохода = СуммаДохода + СтрокаДанных.П000П1М500003;
								Если ЗначениеЗаполнено(СтрокаДанных.П000П1М600004) Тогда
									СтрокаВычета = СтрокаПоСтавке.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить();
									СтрокаВычета.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
									ЗаполнитьЗначенияСвойств(СтрокаВычета.Данные, СтрокаДанных);
								КонецЕсли;
							КонецЦикла;
							СтрокаПоСтавке.Данные.П000П1М500003 = СуммаДохода;
							Если СтрокаПоСтавке.ДанныеМногострочныхЧастей.П000П1М6.Строки.Количество() = 0 Тогда
								СтрокаВычета = СтрокаПоСтавке.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить();
								СтрокаВычета.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
								СтрокаВычета.Данные.П000П1М600004 = "";
							КонецЕсли;
						Иначе
							СтрокаДоходов = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М5.Строки.Добавить();
							СтрокаДоходов.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляДоходов);
							СтрокаДоходов.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М6");
							СтрокаДоходов.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
						КонецЕсли;
						
					КонецЦикла; 
				Иначе
					СтраницаПоСтавке = СтраницаПриложение1.ДанныеМногострочныхЧастей.П000П1М1.Строки.Добавить();
					СтраницаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляИтогов);
					СтраницаПоСтавке.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М2,П000П1М3,П000П1М4,П000П1М5");
					СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М2.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетов);
					СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
					СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М4.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляНеудержано);
					СтрокаДоходов = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М5.Строки.Добавить();
					СтрокаДоходов.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляДоходов);
					СтрокаДоходов.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М6");
					СтрокаДоходов.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе 
			СтраницаПриложение1 = ДанныеПриложение1.Добавить();
			СтраницаПриложение1.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляНалогоплательщика);
			СтраницаПриложение1.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М1");
			СтраницаПоСтавке = СтраницаПриложение1.ДанныеМногострочныхЧастей.П000П1М1.Строки.Добавить();
			СтраницаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляИтогов);
			СтраницаПоСтавке.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М2,П000П1М3,П000П1М4,П000П1М5");
			СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М2.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетов);
			СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
			СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М4.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляНеудержано);
			СтрокаДоходов = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М5.Строки.Добавить();
			СтрокаДоходов.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляДоходов);
			СтрокаДоходов.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М6");
			СтрокаДоходов.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОписаниеПоказателей_6НДФЛ_2016Кв1(ПоказателиОтчета) Экспорт
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010001001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010002001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010002501", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010003001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010004001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010004501", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010005001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010006001", Истина, Ложь);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010007001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010008001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000010009001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020010001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020011001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020012001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020013001", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020014001", Истина, Истина);
	
КонецПроцедуры

Процедура ЗначенияПоказателей_6НДФЛ_2016Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	Организация = ПараметрыОтчета.Организация;
	НачалоПериода = НачалоГода(ДатаКонцаПериодаОтчета);
	ОкончаниеПериода = КонецМесяца(ДатаКонцаПериодаОтчета);
	РегистрацияВНалоговомОргане = ПараметрыОтчета.РегистрацииВНО;
	НомерКорректировки = 0;
	Если ПараметрыОтчета.Свойство("НомерКорректировки") Тогда
		НомерКорректировки = ПараметрыОтчета.НомерКорректировки;
	КонецЕсли;
	
	// очищаем разделы
	ПоказателиОтчета = Новый Структура;
	ОписаниеПоказателей_6НДФЛ_2016Кв1(ПоказателиОтчета);
	
	ДанныеРаздела1 = Контейнер.Раздел1;
	Значение = Неопределено;
	Для каждого КлючИЗначение Из ДанныеРаздела1 Цикл
		Если ПоказателиОтчета.Свойство(КлючИЗначение.Ключ, Значение) Тогда
			ДанныеРаздела1[КлючИЗначение.Ключ] = 0
		КонецЕсли;
	КонецЦикла;
	Контейнер.Раздел1_ДанныеДопСтрок.Очистить();
	Контейнер.Раздел2_ДанныеДопСтрок.Очистить();
	 
	ОписаниеТаблиц = Новый Структура("КоличествоПолучателейДохода, Раздел1Доходы, Раздел1Вычеты, Раздел1Налоги, Раздел2");
	Если ОкончаниеПериода < '20170101' Тогда
		РасчетПоказателей_6НДФЛ_2016Кв1(НачалоПериода, ОкончаниеПериода, ?(ПараметрыОтчета.ДатаПодписи > ОкончаниеПериода,ПараметрыОтчета.ДатаПодписи, ОкончаниеПериода), Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц);	
	Иначе
		РасчетПоказателей_6НДФЛ_2017Кв1(НачалоПериода, ОкончаниеПериода, ?(ПараметрыОтчета.ДатаПодписи > ОкончаниеПериода,ПараметрыОтчета.ДатаПодписи, ОкончаниеПериода), Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц, Ложь, НомерКорректировки);	
	КонецЕсли;
	
	// -------------------------------------------------------------------------------
	// Вывод данных в отчет
	
	// Раздел 1
	
	Результат = ОписаниеТаблиц.КоличествоПолучателейДохода;
	Если Результат.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ДанныеРаздела1,Результат[0]);
	КонецЕсли;
	РезультатРаздел1Налоги = ОписаниеТаблиц.Раздел1Налоги;
	
	ВременнаяТаблица = Контейнер.Раздел1_ДанныеДопСтрок.СкопироватьКолонки();
	Для каждого СтрокаДанных Из ОписаниеТаблиц.Раздел1Доходы Цикл
		ЗаполнитьЗначенияСвойств(ВременнаяТаблица.Добавить(), СтрокаДанных);
	КонецЦикла;
	Для каждого СтрокаДанных Из ОписаниеТаблиц.Раздел1Вычеты Цикл
		ЗаполнитьЗначенияСвойств(ВременнаяТаблица.Добавить(), СтрокаДанных);
	КонецЦикла;
	Для каждого СтрокаДанных Из РезультатРаздел1Налоги Цикл
		ЗаполнитьЗначенияСвойств(ВременнаяТаблица.Добавить(), СтрокаДанных);
	КонецЦикла;
	
	РезультатРаздел1Налоги.Свернуть(,"П000010007001,П000010008001,П000010009001");
	Если РезультатРаздел1Налоги.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ДанныеРаздела1, РезультатРаздел1Налоги[0]);
	КонецЕсли;
	
	ВременнаяТаблица.Свернуть("П000010001001","П000010002001,П000010002501,П000010003001,П000010004001,П000010004501,П000010005001");
	ВременнаяТаблица.Сортировать("П000010001001");
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ВременнаяТаблица, Контейнер.Раздел1_ДанныеДопСтрок);
	
	// Раздел 2
	
	Для каждого СтрокаДанных Из ОписаниеТаблиц.Раздел2 Цикл
		ЗаполнитьЗначенияСвойств(Контейнер.Раздел2_ДанныеДопСтрок.Добавить(), СтрокаДанных);
	КонецЦикла;
	
КонецПроцедуры

Процедура РасчетПоказателей6НДФЛ(ИмяРасчета, НачалоПериода, ОкончаниеПериода, ДатаПодписи, Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц, ПодробныеДанные = Ложь, НомерКорректировки = 0) Экспорт

	Если ИмяРасчета = "РасчетПоказателей_6НДФЛ_2016Кв1" Тогда
		РасчетПоказателей_6НДФЛ_2016Кв1(НачалоПериода, ОкончаниеПериода, ДатаПодписи, Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц, ПодробныеДанные);
	ИначеЕсли ИмяРасчета = "РасчетПоказателей_6НДФЛ_2017Кв1" Тогда
		РасчетПоказателей_6НДФЛ_2017Кв1(НачалоПериода, ОкончаниеПериода, ДатаПодписи, Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц, ПодробныеДанные, НомерКорректировки);
	ИначеЕсли ИмяРасчета = "РасчетПоказателей_6НДФЛ_2021Кв1" Тогда
		РасчетПоказателей_6НДФЛ_2021Кв1(НачалоПериода, ОкончаниеПериода, ДатаПодписи, Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц, ПодробныеДанные, НомерКорректировки);
	ИначеЕсли ИмяРасчета = "РасчетПоказателей_6НДФЛ_2021Кв4" Тогда
		РасчетПоказателей_6НДФЛ_2021Кв4(НачалоПериода, ОкончаниеПериода, ДатаПодписи, Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц, ПодробныеДанные, НомерКорректировки);
	Иначе
		
	КонецЕсли;

КонецПроцедуры

Процедура РасчетПоказателей_6НДФЛ_2021Кв4(НачалоПериода, ОкончаниеПериода, ДатаПодписи, Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц, ПодробныеДанные, НомерКорректировки)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
	Запрос.УстановитьПараметр("НачалоПредыдущегоГода", ДобавитьМесяц(НачалоПериода, -12));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(НачалоПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("ДатаПодписи", КонецДня(ДатаПодписи));
	Запрос.УстановитьПараметр("КБКсПревышения", "18210102080011000110");
	Запрос.УстановитьПараметр("ОсновнойКБК", "18210102010011000110");
	Запрос.УстановитьПараметр("КБКПоОблигациям", "18210102070011000110");
	Запрос.УстановитьПараметр("НачалоОтчетногоКвартала", НачалоКвартала(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериодаОсмотраДоходовВычетов", ?(КонецГода(ОкончаниеПериода) = ОкончаниеПериода Или ЗначениеЗаполнено(НомерКорректировки), Макс(ДатаПодписи, ОкончаниеПериода), ОкончаниеПериода));
	Запрос.УстановитьПараметр("ВКС", Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалисты());
	
	ДатаАктуальности = Макс(ОкончаниеПериода, ДатаПодписи);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда) КАК КатегорияДохода,
	|	&ОсновнойКБК КАК КБК
	|ПОМЕСТИТЬ ВТСоответствиеКатегорийКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходВНатуральнойФормеОтТрудовойДеятельности),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеНатуральныеДоходы),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходы),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке03),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке05),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке06),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке07),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке10),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке15),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходыПредыдущихРедакций),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыОтДолевогоУчастия),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоВыигрышам),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЦБ),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыРЕПО),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЗаймЦБ),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыИИС),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоОблигациям),
	|	&КБКПоОблигациям";
	Запрос.Выполнить();
	
	Если ОписаниеТаблиц.Свойство("Раздел1Налоги") Или ОписаниеТаблиц.Свойство("Раздел1Возвраты") Или ОписаниеТаблиц.Свойство("Раздел2Налоги") Или ОписаниеТаблиц.Свойство("Приложение1Налогоплательщики") Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода КАК КатегорияДохода,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор КАК Регистратор,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК ДатаПолученияДохода,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВариантУдержания КАК ВариантУдержания,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения КАК ВидДвижения,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СрокПеречисления КАК СрокПеречисления,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма КАК Сумма,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения КАК СуммаСПревышения,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК Период,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период КАК ДатаУдержания,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период КАК ДатаВозврата,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование КАК ДокументОснование,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КрайнийСрокУплаты КАК КрайнийСрокУплаты,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РасчетМежрасчетногоПериода КАК РасчетМежрасчетногоПериода,
		|	СоответствиеКатегорийКБК.КБК КАК КБК,
		|	ВЫБОР
		|		КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
		|			ТОГДА ВЫБОР
		|					КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов = 0
		|						ТОГДА 0
		|					КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов > 0
		|							И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения > 0
		|						ТОГДА ВЫБОР
		|								КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения >= РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов
		|									ТОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов
		|								ИНАЧЕ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения
		|							КОНЕЦ
		|					КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов < 0
		|							И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения < 0
		|						ТОГДА ВЫБОР
		|								КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения <= РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов
		|									ТОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов
		|								ИНАЧЕ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НалогНаПрибыльДляДивидендов
		|ПОМЕСТИТЬ ВТНалоги
		|ИЗ
		|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеКатегорийКБК КАК СоответствиеКатегорийКБК
		|		ПО РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода = СоответствиеКатегорийКБК.КатегорияДохода
		|ГДЕ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане В(&РегистрацияВНалоговомОргане)
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И (РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма <> 0
		|			ИЛИ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения <> 0)";
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел1Налоги") Тогда
		
		Если НачалоКвартала(ОкончаниеПериода) = '20210101' Тогда
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СтрокиНалогов.КБК КАК КБК,
			|	СтрокиНалогов.Регистратор КАК Регистратор,
			|	СтрокиНалогов.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СтрокиНалогов.КрайнийСрокУплаты КАК СрокПеречисленияНалога,
			|	СтрокиНалогов.КрайнийСрокУплаты КАК П00001М102101,
			|	СтрокиНалогов.Сумма КАК П00001М102201
			|ПОМЕСТИТЬ ВТСтрокиНалогов
			|ИЗ
			|	ВТНалоги КАК СтрокиНалогов
			|ГДЕ
			|	СтрокиНалогов.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И СтрокиНалогов.ДатаУдержания МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&КБКсПревышения,
			|	СтрокиНалогов.Регистратор,
			|	СтрокиНалогов.ФизическоеЛицо,
			|	СтрокиНалогов.КрайнийСрокУплаты,
			|	СтрокиНалогов.КрайнийСрокУплаты,
			|	СтрокиНалогов.СуммаСПревышения
			|ИЗ
			|	ВТНалоги КАК СтрокиНалогов
			|ГДЕ
			|	СтрокиНалогов.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И СтрокиНалогов.ДатаУдержания МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СтрокиНалогов.КБК,
			|	СтрокиНалогов.Регистратор,
			|	СтрокиНалогов.ФизическоеЛицо,
			|	СтрокиНалогов.КрайнийСрокУплаты,
			|	СтрокиНалогов.КрайнийСрокУплаты,
			|	СтрокиНалогов.Сумма
			|ИЗ
			|	ВТНалоги КАК СтрокиНалогов
			|ГДЕ
			|	СтрокиНалогов.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И СтрокиНалогов.КрайнийСрокУплаты >= ДАТАВРЕМЯ(2021, 1, 1, 0, 0, 0)
			|	И СтрокиНалогов.ДатаУдержания < ДАТАВРЕМЯ(2021, 1, 1, 0, 0, 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НалогиПоДатам.КБК КАК КБК,
			|	НалогиПоДатам.Регистратор КАК Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НалогиПоДатам.СрокПеречисленияНалога КАК СрокПеречисленияНалога,
			|	НалогиПоДатам.П00001М102101 КАК П00001М102101,
			|	СУММА(НалогиПоДатам.П00001М102201) КАК П00001М102201
			|ИЗ
			|	ВТСтрокиНалогов КАК НалогиПоДатам
			|
			|СГРУППИРОВАТЬ ПО
			|	НалогиПоДатам.КБК,
			|	НалогиПоДатам.Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо,
			|	НалогиПоДатам.СрокПеречисленияНалога,
			|	НалогиПоДатам.П00001М102101
			|
			|ИМЕЮЩИЕ
			|	СУММА(НалогиПоДатам.П00001М102201) > 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	СрокПеречисленияНалога";
			
		Иначе
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	НалогиПоДатам.КБК КАК КБК,
			|	НалогиПоДатам.Регистратор КАК Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НалогиПоДатам.КрайнийСрокУплаты КАК СрокПеречисленияНалога,
			|	НалогиПоДатам.КрайнийСрокУплаты КАК П00001М102101,
			|	СУММА(НалогиПоДатам.Сумма) КАК П00001М102201
			|ИЗ
			|	ВТНалоги КАК НалогиПоДатам
			|ГДЕ
			|	НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И НалогиПоДатам.ДатаУдержания МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
			|
			|СГРУППИРОВАТЬ ПО
			|	НалогиПоДатам.КБК,
			|	НалогиПоДатам.Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо,
			|	НалогиПоДатам.КрайнийСрокУплаты,
			|	НалогиПоДатам.КрайнийСрокУплаты
			|
			|ИМЕЮЩИЕ
			|	СУММА(НалогиПоДатам.Сумма) > 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&КБКсПревышения,
			|	НалогиПоДатам.Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо,
			|	НалогиПоДатам.КрайнийСрокУплаты,
			|	НалогиПоДатам.КрайнийСрокУплаты,
			|	СУММА(НалогиПоДатам.СуммаСПревышения)
			|ИЗ
			|	ВТНалоги КАК НалогиПоДатам
			|ГДЕ
			|	НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И НалогиПоДатам.ДатаУдержания МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
			|
			|СГРУППИРОВАТЬ ПО
			|	НалогиПоДатам.Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо,
			|	НалогиПоДатам.КрайнийСрокУплаты,
			|	НалогиПоДатам.КрайнийСрокУплаты
			|
			|ИМЕЮЩИЕ
			|	СУММА(НалогиПоДатам.СуммаСПревышения) > 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	СрокПеречисленияНалога";
			
		КонецЕсли;
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
			МассивПолей.Добавить("Регистратор");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "НалогиПоДатам");
		ОписаниеТаблиц.Раздел1Налоги = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел1Возвраты") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	НалогиПоДатам.КБК КАК КБК,
		|	НалогиПоДатам.Регистратор КАК Регистратор,
		|	НалогиПоДатам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НалогиПоДатам.ДатаВозврата КАК ДатаВозврата,
		|	НалогиПоДатам.ДатаВозврата КАК П00001М203101,
		|	-СУММА(НалогиПоДатам.Сумма) КАК П00001М203201
		|ИЗ
		|	ВТНалоги КАК НалогиПоДатам
		|ГДЕ
		|	НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|	И НалогиПоДатам.ДатаВозврата МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	НалогиПоДатам.КБК,
		|	НалогиПоДатам.Регистратор,
		|	НалогиПоДатам.ФизическоеЛицо,
		|	НалогиПоДатам.ДатаВозврата,
		|	НалогиПоДатам.ДатаВозврата
		|
		|ИМЕЮЩИЕ
		|	СУММА(НалогиПоДатам.Сумма) < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&КБКсПревышения,
		|	НалогиПоДатам.Регистратор,
		|	НалогиПоДатам.ФизическоеЛицо,
		|	НалогиПоДатам.ДатаВозврата,
		|	НалогиПоДатам.ДатаВозврата,
		|	-СУММА(НалогиПоДатам.СуммаСПревышения)
		|ИЗ
		|	ВТНалоги КАК НалогиПоДатам
		|ГДЕ
		|	НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|	И НалогиПоДатам.ДатаВозврата МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	НалогиПоДатам.Регистратор,
		|	НалогиПоДатам.ФизическоеЛицо,
		|	НалогиПоДатам.ДатаВозврата,
		|	НалогиПоДатам.ДатаВозврата
		|
		|ИМЕЮЩИЕ
		|	СУММА(НалогиПоДатам.СуммаСПревышения) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВозврата";
		
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
			МассивПолей.Добавить("Регистратор");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "НалогиПоДатам");
		ОписаниеТаблиц.Раздел1Возвраты = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел2Доходы") Или ОписаниеТаблиц.Свойство("Раздел2Налоги") Или ОписаниеТаблиц.Свойство("КоличествоПолучателейДохода") Или ОписаниеТаблиц.Свойство("Раздел2Вычеты") Или ОписаниеТаблиц.Свойство("Приложение1Налогоплательщики") Тогда
		
		ПараметрыРасчетаНДФЛПоПрогрессивнойШкале = УчетНДФЛ.ПараметрыРасчетаНДФЛПоПрогрессивнойШкале();
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизическиеЛицаОтчета
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
		|ГДЕ
		|	СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|	И (СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ИЛИ СведенияОДоходахНДФЛ.Регистратор <> СведенияОДоходахНДФЛ.ДокументОснование)
		|	И СведенияОДоходахНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане В(&РегистрацияВНалоговомОргане)
		|	И НЕ СведенияОДоходахНДФЛ.КодДохода.НеОблагаетсяУНалоговогоАгента
		|	И СведенияОДоходахНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо
		|
		|ИМЕЮЩИЕ
		|	(СУММА(СведенияОДоходахНДФЛ.СуммаДохода) <> 0
		|		ИЛИ СУММА(СведенияОДоходахНДФЛ.СуммаВычета) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК Период,
		|	СведенияОДоходахНДФЛ.КатегорияДохода КАК КатегорияДохода,
		|	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
		|	СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента
		|ПОМЕСТИТЬ ВТСтрокиДоходов
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
		|ГДЕ
		|	СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|	И (СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ИЛИ СведенияОДоходахНДФЛ.Регистратор <> СведенияОДоходахНДФЛ.ДокументОснование)
		|	И СведенияОДоходахНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И НЕ СведенияОДоходахНДФЛ.КодДохода.НеОблагаетсяУНалоговогоАгента
		|	И СведенияОДоходахНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И СведенияОДоходахНДФЛ.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				ФизическиеЛицаОтчета.ФизическоеЛицо КАК ФизическоеЛицо
		|			ИЗ
		|				ВТФизическиеЛицаОтчета КАК ФизическиеЛицаОтчета)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
		|	СведенияОДоходахНДФЛ.КатегорияДохода,
		|	СведенияОДоходахНДФЛ.КодДохода,
		|	СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента
		|
		|ИМЕЮЩИЕ
		|	(СУММА(СведенияОДоходахНДФЛ.СуммаДохода) <> 0
		|		ИЛИ СУММА(СведенияОДоходахНДФЛ.СуммаВычета) <> 0)";
		Запрос.Выполнить();
		
		ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТСтрокиДоходов", "ФизическоеЛицо");
		ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
		ПараметрыПостроения.ВсеЗаписи = Истина;
	    ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "РегистрСведений.ДатаРегистрацииИзменений", "<=", "ДАТАВРЕМЯ(" + Формат(ДатаАктуальности,"ДФ=гггг") + ", " + Месяц(ДатаАктуальности) + ", " + День(ДатаАктуальности) + ", 23, 59, 59)", Ложь);
		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
			"СтатусыЗастрахованныхФизическихЛиц",
			Запрос.МенеджерВременныхТаблиц,
			Ложь,
			ОписаниеФильтра,
			ПараметрыПостроения);
		
		УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента(Запрос.МенеджерВременныхТаблиц, "ВТСтрокиДоходов", "УчитыватьИзмененияСтатусаДляОтчетности", ОкончаниеПериода);
		
		Запрос.УстановитьПараметр("ОсновнаяНалоговаяБаза", Перечисления.КатегорииДоходовНДФЛ.ОсновнаяНалоговаяБаза());
		Запрос.УстановитьПараметр("Предел", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел);
		Запрос.УстановитьПараметр("СтавкаСПревышения", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Ставка);
		Запрос.УстановитьПараметр("СтавкаЧисломСПревышения", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.СтавкаЧислом * 100);
		Запрос.УстановитьПараметр("ГодПериода", Год(ОкончаниеПериода));
			
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаЧислом * 100 КАК СтавкаНалога,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ КАК Ставка,
		|	ЕСТЬNULL(СтатусыЗастрахованныхФизическихЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (&ВКС)
		|		ИЛИ СтавкаНДФЛПоСтавкеРезидента.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.ВысококвалифицированныйИностранныйСпециалист) КАК ЭтоВКС,
		|	ВЫБОР
		|		КОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ <> ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
		|		КОГДА СведенияОДоходахНДФЛ.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
		|		КОГДА СведенияОДоходахНДФЛ.КатегорияДохода В (&ОсновнаяНалоговаяБаза)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
		|		ИНАЧЕ СведенияОДоходахНДФЛ.КатегорияДохода
		|	КОНЕЦ КАК НалоговаяБаза,
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК Период,
		|	СведенияОДоходахНДФЛ.КатегорияДохода КАК КатегорияДохода,
		|	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
		|	СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
		|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода) КАК СуммаДохода,
		|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
		|	СведенияОДоходахНДФЛ.Начисление КАК Начисление,
		|	ВЫБОР
		|		КОГДА СведенияОДоходахНДФЛ.СуммаВычета = 0
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
		|		ИНАЧЕ СведенияОДоходахНДФЛ.КодВычета
		|	КОНЕЦ КАК КодВычета,
		|	СУММА(СведенияОДоходахНДФЛ.СуммаВычета) КАК СуммаВычета,
		|	СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ КАК ИсточникДоходаЗаПределамиРФ,
		|	СоответствиеКатегорийКБК.КБК КАК КБК,
		|	СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане В (&РегистрацияВНалоговомОргане) КАК ДанныеДляОтчета,
		|	СведенияОДоходахНДФЛ.СтрокаРаздела2Расчета6НДФЛ КАК СтрокаРаздела2
		|ПОМЕСТИТЬ ВТДоходыПоСтавкам
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеКатегорийКБК КАК СоответствиеКатегорийКБК
		|		ПО СведенияОДоходахНДФЛ.КатегорияДохода = СоответствиеКатегорийКБК.КатегорияДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыЗастрахованныхФизическихЛицСрезПоследних КАК СтатусыЗастрахованныхФизическихЛиц
		|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СтатусыЗастрахованныхФизическихЛиц.ФизическоеЛицо
		|			И СведенияОДоходахНДФЛ.ДатаПолученияДохода = СтатусыЗастрахованныхФизическихЛиц.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
		|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
		|			И СведенияОДоходахНДФЛ.ДатаПолученияДохода = СтавкаНДФЛПоСтавкеРезидента.Период
		|			И СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
		|			И СведенияОДоходахНДФЛ.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
		|ГДЕ
		|	СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|	И СведенияОДоходахНДФЛ.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				ФизическиеЛицаОтчета.ФизическоеЛицо КАК ФизическоеЛицо
		|			ИЗ
		|				ВТФизическиеЛицаОтчета КАК ФизическиеЛицаОтчета)
		|	И (СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ИЛИ СведенияОДоходахНДФЛ.Регистратор <> СведенияОДоходахНДФЛ.ДокументОснование)
		|	И СведенияОДоходахНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И НЕ СведенияОДоходахНДФЛ.КодДохода.НеОблагаетсяУНалоговогоАгента
		|	И СведенияОДоходахНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И (СведенияОДоходахНДФЛ.СуммаДохода <> 0
		|			ИЛИ СведенияОДоходахНДФЛ.СуммаВычета <> 0)
		|	И (НЕ СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ
		|			ИЛИ СтавкаНДФЛПоСтавкеРезидента.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаЧислом,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ,
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
		|	СведенияОДоходахНДФЛ.КатегорияДохода,
		|	СведенияОДоходахНДФЛ.КодДохода,
		|	СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента,
		|	СведенияОДоходахНДФЛ.Регистратор,
		|	СведенияОДоходахНДФЛ.Начисление,
		|	СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ,
		|	СоответствиеКатегорийКБК.КБК,
		|	СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане В (&РегистрацияВНалоговомОргане),
		|	ВЫБОР
		|		КОГДА СведенияОДоходахНДФЛ.СуммаВычета = 0
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
		|		ИНАЧЕ СведенияОДоходахНДФЛ.КодВычета
		|	КОНЕЦ,
		|	СведенияОДоходахНДФЛ.СтрокаРаздела2Расчета6НДФЛ,
		|	ЕСТЬNULL(СтатусыЗастрахованныхФизическихЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (&ВКС)
		|		ИЛИ СтавкаНДФЛПоСтавкеРезидента.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.ВысококвалифицированныйИностранныйСпециалист)
		|
		|ИМЕЮЩИЕ
		|	(СУММА(СведенияОДоходахНДФЛ.СуммаДохода) <> 0
		|		ИЛИ СУММА(СведенияОДоходахНДФЛ.СуммаВычета) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Регистратор КАК Регистратор,
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.КодВычета КАК КодВычета,
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Сумма КАК Сумма,
		|	НАЧАЛОПЕРИОДА(ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.РегистрацияВНалоговомОргане В (&РегистрацияВНалоговомОргане) КАК ДанныеДляОтчета
		|ПОМЕСТИТЬ ВТСтандартныеИмущественныеВычеты
		|ИЗ
		|	РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ КАК ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ
		|ГДЕ
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериодаОсмотраДоходовВычетов
		|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Сумма <> 0
		|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				ФизическиеЛицаОтчета.ФизическоеЛицо КАК ФизическоеЛицо
		|			ИЗ
		|				ВТФизическиеЛицаОтчета КАК ФизическиеЛицаОтчета)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИмущественныеВычетыНДФЛ.Регистратор,
		|	ИмущественныеВычетыНДФЛ.ФизическоеЛицо,
		|	ИмущественныеВычетыНДФЛ.КодВычета,
		|	ИмущественныеВычетыНДФЛ.Сумма,
		|	НАЧАЛОПЕРИОДА(ИмущественныеВычетыНДФЛ.Период, МЕСЯЦ),
		|	ИмущественныеВычетыНДФЛ.РегистрацияВНалоговомОргане В (&РегистрацияВНалоговомОргане)
		|ИЗ
		|	РегистрНакопления.ИмущественныеВычетыНДФЛ КАК ИмущественныеВычетыНДФЛ
		|ГДЕ
		|	ИмущественныеВычетыНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериода
		|	И ИмущественныеВычетыНДФЛ.МесяцРегистрации <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|	И ИмущественныеВычетыНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И ИмущественныеВычетыНДФЛ.Сумма <> 0
		|	И ИмущественныеВычетыНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ИмущественныеВычетыНДФЛ.Год = &ГодПериода
		|	И ИмущественныеВычетыНДФЛ.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				ФизическиеЛицаОтчета.ФизическоеЛицо КАК ФизическоеЛицо
		|			ИЗ
		|				ВТФизическиеЛицаОтчета КАК ФизическиеЛицаОтчета)";
		УстановитьПривилегированныйРежим(Истина);
		Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
		|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда) КАК НалоговаяБаза,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТМесяцыПослеПревышения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	База.ФизическоеЛицо КАК ФизическоеЛицо,
		|	База.НалоговаяБаза КАК НалоговаяБаза
		|ПОМЕСТИТЬ ВТСотрудникиСПревышением
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
		|		ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
		|		ДоходыПоСтавкам.СуммаДохода - ДоходыПоСтавкам.СуммаВычета КАК ОблагаемаяБаза
		|	ИЗ
		|		ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
		|	ГДЕ
		|		ДоходыПоСтавкам.НалоговаяБаза <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СтандартныеИмущественныеВычеты.ФизическоеЛицо,
		|		ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда),
		|		-СтандартныеИмущественныеВычеты.Сумма
		|	ИЗ
		|		ВТСтандартныеИмущественныеВычеты КАК СтандартныеИмущественныеВычеты) КАК База
		|
		|СГРУППИРОВАТЬ ПО
		|	База.ФизическоеЛицо,
		|	База.НалоговаяБаза
		|
		|ИМЕЮЩИЕ
		|	СУММА(База.ОблагаемаяБаза) > &Предел";
		
		Если Запрос.Выполнить().Выгрузить()[0].Количество > 0 Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.Период КАК Период,
			|	НАЧАЛОПЕРИОДА(СведенияОДоходахНДФЛ.Период, МЕСЯЦ) КАК НачалоМесяца,
			|	СведенияОДоходахНДФЛ.НалоговаяБаза КАК НалоговаяБаза,
			|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода - СведенияОДоходахНДФЛ.СуммаВычета) КАК ОблагаемыйДоход,
			|	0 КАК ОблагаемыйДоходСНачалаГода,
			|	ЛОЖЬ КАК ЭтоДеньПревышенияПредела,
			|	ЛОЖЬ КАК ПределПревышен
			|ИЗ
			|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
			|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
			|			И СведенияОДоходахНДФЛ.НалоговаяБаза = СотрудникиСПревышением.НалоговаяБаза
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.Период,
			|	СведенияОДоходахНДФЛ.НалоговаяБаза
			|
			|ИМЕЮЩИЕ
			|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода - СведенияОДоходахНДФЛ.СуммаВычета) <> 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	НалоговаяБаза,
			|	Период";
			ТаблицаРасчетаНарастающимИтогом = Запрос.Выполнить().Выгрузить();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СУММА(СтандартныеИмущественныеВычеты.Сумма) КАК Сумма,
			|	НАЧАЛОПЕРИОДА(СтандартныеИмущественныеВычеты.МесяцНалоговогоПериода, МЕСЯЦ) КАК НачалоМесяца
			|ИЗ
			|	ВТСтандартныеИмущественныеВычеты КАК СтандартныеИмущественныеВычеты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
			|		ПО СтандартныеИмущественныеВычеты.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
			|			И (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда) = СотрудникиСПревышением.НалоговаяБаза)
			|
			|СГРУППИРОВАТЬ ПО
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо,
			|	НАЧАЛОПЕРИОДА(СтандартныеИмущественныеВычеты.МесяцНалоговогоПериода, МЕСЯЦ)";
			ТаблицаВычетов = Запрос.Выполнить().Выгрузить();
			ИскатьВычеты = ТаблицаВычетов.Количество() > 0;
			Если ИскатьВычеты И ТаблицаВычетов.Количество() > 100 Тогда
				ТаблицаВычетов.Индексы.Добавить("ФизическоеЛицо,НачалоМесяца");
			КонецЕсли;
			ПоискВычетов = Новый Структура("ФизическоеЛицо,НачалоМесяца");
			
			// Расчет облагаемого дохода нарастающим итогом с учетом всех вычетов для каждой даты получения дохода.
			ОблагаемыйДоходСНачалаГода = 0;
			ТекущееФизлицо = Неопределено;
			ТекущаяНалоговаяБаза = Неопределено;
			ТекущееНачалоМесяца = Неопределено;
			Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
				Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Тогда
					ОблагаемыйДоходСНачалаГода = 0;
					ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
					ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
					ТекущееНачалоМесяца = Неопределено;
				КонецЕсли;
				// Стандартные, имущественные вычеты учтем один раз за каждый месяц - в первую дату получения дохода месяца.
				ПредоставленныеВычеты = 0;
				Если ИскатьВычеты И СтрокаТаблицы.НалоговаяБаза = Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда И ТекущееНачалоМесяца <> СтрокаТаблицы.НачалоМесяца Тогда
					ЗаполнитьЗначенияСвойств(ПоискВычетов, СтрокаТаблицы);
					СтрокиВычетов = ТаблицаВычетов.НайтиСтроки(ПоискВычетов);
					Если СтрокиВычетов.Количество() > 0 Тогда
						ПредоставленныеВычеты = СтрокиВычетов[0].Сумма;
					КонецЕсли;
					ТекущееНачалоМесяца = СтрокаТаблицы.НачалоМесяца;
				КонецЕсли;
				СтрокаТаблицы.ЭтоДеньПревышенияПредела = ОблагаемыйДоходСНачалаГода < ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел И ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты > ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел;
				ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты;
				СтрокаТаблицы.ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода;
				СтрокаТаблицы.ПределПревышен = ОблагаемыйДоходСНачалаГода > ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел;
			КонецЦикла;
			
			Запрос.УстановитьПараметр("РасчетНарастающимИтогом", ТаблицаРасчетаНарастающимИтогом); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасчетНарастающимИтогом.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасчетНарастающимИтогом.Период КАК Период,
			|	РасчетНарастающимИтогом.НалоговаяБаза КАК НалоговаяБаза,
			|	РасчетНарастающимИтогом.ОблагаемыйДоход КАК ОблагаемыйДоход,
			|	РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
			|	РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела КАК ЭтоДеньПревышенияПредела,
			|	РасчетНарастающимИтогом.ПределПревышен КАК ПределПревышен
			|ПОМЕСТИТЬ ВТРасчетНарастающимИтогом
			|ИЗ
			|	&РасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоходыПоСтавкам.СтавкаНалога КАК СтавкаНалога,
			|	ДоходыПоСтавкам.Ставка КАК Ставка,
			|	ДоходыПоСтавкам.ЭтоВКС КАК ЭтоВКС,
			|	ДоходыПоСтавкам.Регистратор КАК Регистратор,
			|	ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыПоСтавкам.Начисление КАК Начисление,
			|	ДоходыПоСтавкам.Период КАК Период,
			|	ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыПоСтавкам.КатегорияДохода КАК КатегорияДохода,
			|	ДоходыПоСтавкам.КБК КАК КБК,
			|	ДоходыПоСтавкам.ДанныеДляОтчета КАК ДанныеДляОтчета,
			|	ДоходыПоСтавкам.КодДохода КАК КодДохода,
			|	ДоходыПоСтавкам.СуммаДохода КАК СуммаДохода,
			|	ДоходыПоСтавкам.КодВычета КАК КодВычета,
			|	ДоходыПоСтавкам.СуммаВычета КАК СуммаВычета,
			|	ДоходыПоСтавкам.СтрокаРаздела2 КАК СтрокаРаздела2,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода, 0) КАК ОблагаемыйДоходСНачалаГода,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела, ЛОЖЬ) КАК ЭтоДеньПревышенияПредела,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ПределПревышен, ЛОЖЬ) КАК ПределПревышен,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоход, 0) КАК ОблагаемыйДоходЗаДень
			|ПОМЕСТИТЬ ВТРасширенныеДанныеОДоходах
			|ИЗ
			|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|		ПО ДоходыПоСтавкам.ФизическоеЛицо = РасчетНарастающимИтогом.ФизическоеЛицо
			|			И ДоходыПоСтавкам.Период = РасчетНарастающимИтогом.Период
			|			И ДоходыПоСтавкам.НалоговаяБаза = РасчетНарастающимИтогом.НалоговаяБаза
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасширенныеДанныеОДоходах.СтавкаНалога КАК СтавкаНалога,
			|	РасширенныеДанныеОДоходах.Ставка КАК Ставка,
			|	РасширенныеДанныеОДоходах.ЭтоВКС КАК ЭтоВКС,
			|	РасширенныеДанныеОДоходах.Регистратор КАК Регистратор,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Начисление КАК Начисление,
			|	РасширенныеДанныеОДоходах.Период КАК Период,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.СтрокаРаздела2 КАК СтрокаРаздела2,
			|	РасширенныеДанныеОДоходах.КБК КАК КБК,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода) КАК СуммаДохода,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаВычета) КАК СуммаВычета,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода - РасширенныеДанныеОДоходах.СуммаВычета) КАК ОблагаемаяСумма,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень КАК ОблагаемыйДоходЗаДень,
			|	РасширенныеДанныеОДоходах.ДанныеДляОтчета КАК ДанныеДляОтчета
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
			|
			|СГРУППИРОВАТЬ ПО
			|	РасширенныеДанныеОДоходах.СтавкаНалога,
			|	РасширенныеДанныеОДоходах.Ставка,
			|	РасширенныеДанныеОДоходах.Регистратор,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Начисление,
			|	РасширенныеДанныеОДоходах.Период,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.КатегорияДохода,
			|	РасширенныеДанныеОДоходах.КБК,
			|	РасширенныеДанныеОДоходах.КодДохода,
			|	РасширенныеДанныеОДоходах.КодВычета,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень,
			|	РасширенныеДанныеОДоходах.ДанныеДляОтчета,
			|	РасширенныеДанныеОДоходах.СтрокаРаздела2,
			|	РасширенныеДанныеОДоходах.ЭтоВКС
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	НалоговаяБаза,
			|	КодДохода";
			
			ТаблицаРасчетаНарастающимИтогом = Запрос.Выполнить().Выгрузить();
			ДоходыСУточненнымиСтавками = ТаблицаРасчетаНарастающимИтогом.СкопироватьКолонки();
			
			ТекущееФизлицо = Неопределено;
			ТекущаяНалоговаяБаза = Неопределено;
			СтрокиРаспределения = Новый Массив;
			ОблагаемыйДоходДоПредела = 0;
			Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
				Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Тогда
					Если ОблагаемыйДоходДоПредела <> 0 Тогда
						ВыделитьСуммыПревышенияПредела(ОблагаемыйДоходДоПредела, СтрокиРаспределения, ДоходыСУточненнымиСтавками)				
					КонецЕсли;
					СтрокиРаспределения = Новый Массив;
					ОблагаемыйДоходДоПредела = 0;
					ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
					ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
				КонецЕсли;
				Если ОблагаемыйДоходДоПредела = 0 Тогда
					ОблагаемыйДоходДоПредела = СтрокаТаблицы.ОблагаемыйДоходЗаДень - СтрокаТаблицы.ОблагаемыйДоходСНачалаГода + ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел
				КонецЕсли;
				СтрокиРаспределения.Добавить(СтрокаТаблицы);
			КонецЦикла;
			Если ОблагаемыйДоходДоПредела <> 0 Тогда
				ВыделитьСуммыПревышенияПредела(ОблагаемыйДоходДоПредела, СтрокиРаспределения, ДоходыСУточненнымиСтавками)				
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРасчетаНарастающимИтогом, ДоходыСУточненнымиСтавками); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			
			Запрос.УстановитьПараметр("ДоходыСУточненнымиСтавками", ДоходыСУточненнымиСтавками); ДоходыСУточненнымиСтавками = Неопределено;
			Запрос.Текст =
			"УНИЧТОЖИТЬ ВТДоходыПоСтавкам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.СтавкаНалога КАК СтавкаНалога,
			|	ДоходыСУточненнымиСтавками.Ставка КАК Ставка,
			|	ДоходыСУточненнымиСтавками.ЭтоВКС КАК ЭтоВКС,
			|	ДоходыСУточненнымиСтавками.Регистратор КАК Регистратор,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Начисление КАК Начисление,
			|	ДоходыСУточненнымиСтавками.Период КАК Период,
			|	ДоходыСУточненнымиСтавками.ДанныеДляОтчета КАК ДанныеДляОтчета,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.КатегорияДохода КАК КатегорияДохода,
			|	ДоходыСУточненнымиСтавками.СтрокаРаздела2 КАК СтрокаРаздела2,
			|	ВЫБОР
			|		КОГДА ДоходыСУточненнымиСтавками.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
			|			ТОГДА &КБКсПревышения
			|		ИНАЧЕ ДоходыСУточненнымиСтавками.КБК
			|	КОНЕЦ КАК КБК,
			|	ДоходыСУточненнымиСтавками.КодДохода КАК КодДохода,
			|	ДоходыСУточненнымиСтавками.СуммаДохода КАК СуммаДохода,
			|	ДоходыСУточненнымиСтавками.КодВычета КАК КодВычета,
			|	ДоходыСУточненнымиСтавками.СуммаВычета КАК СуммаВычета
			|ПОМЕСТИТЬ ВТДоходыСУточненнымиСтавками
			|ИЗ
			|	&ДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
			|			ТОГДА &СтавкаЧисломСПревышения
			|		ИНАЧЕ РасширенныеДанныеОДоходах.СтавкаНалога
			|	КОНЕЦ КАК СтавкаНалога,
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
			|			ТОГДА &СтавкаСПревышения
			|		ИНАЧЕ РасширенныеДанныеОДоходах.Ставка
			|	КОНЕЦ КАК Ставка,
			|	РасширенныеДанныеОДоходах.ЭтоВКС КАК ЭтоВКС,
			|	РасширенныеДанныеОДоходах.Регистратор КАК Регистратор,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Начисление КАК Начисление,
			|	РасширенныеДанныеОДоходах.Период КАК Период,
			|	РасширенныеДанныеОДоходах.ДанныеДляОтчета КАК ДанныеДляОтчета,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.СтрокаРаздела2 КАК СтрокаРаздела2,
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
			|			ТОГДА &КБКсПревышения
			|		ИНАЧЕ РасширенныеДанныеОДоходах.КБК
			|	КОНЕЦ КАК КБК,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	РасширенныеДанныеОДоходах.СуммаДохода КАК СуммаДохода,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	РасширенныеДанныеОДоходах.СуммаВычета КАК СуммаВычета
			|ПОМЕСТИТЬ ВТДоходыПоСтавкам
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	НЕ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.СтавкаНалога,
			|	ДоходыСУточненнымиСтавками.Ставка,
			|	ДоходыСУточненнымиСтавками.ЭтоВКС,
			|	ДоходыСУточненнымиСтавками.Регистратор,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Начисление,
			|	ДоходыСУточненнымиСтавками.Период,
			|	ДоходыСУточненнымиСтавками.ДанныеДляОтчета,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.КатегорияДохода,
			|	ДоходыСУточненнымиСтавками.СтрокаРаздела2,
			|	ДоходыСУточненнымиСтавками.КБК,
			|	ДоходыСУточненнымиСтавками.КодДохода,
			|	ДоходыСУточненнымиСтавками.СуммаДохода,
			|	ДоходыСУточненнымиСтавками.КодВычета,
			|	ДоходыСУточненнымиСтавками.СуммаВычета
			|ИЗ
			|	ВТДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками";
			Запрос.Выполнить();
			
			Если ИскатьВычеты Тогда
				Запрос.Текст =
				"УНИЧТОЖИТЬ ВТМесяцыПослеПревышения
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
				|	НАЧАЛОПЕРИОДА(ДоходыПоСтавкам.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода
				|ПОМЕСТИТЬ ВТМесяцыУникальныхКБК
				|ИЗ
				|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
				|ГДЕ
				|	ДоходыПоСтавкам.НалоговаяБаза <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
				|
				|СГРУППИРОВАТЬ ПО
				|	ДоходыПоСтавкам.НалоговаяБаза,
				|	ДоходыПоСтавкам.ФизическоеЛицо,
				|	НАЧАЛОПЕРИОДА(ДоходыПоСтавкам.Период, МЕСЯЦ)
				|
				|ИМЕЮЩИЕ
				|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДоходыПоСтавкам.КБК) = 1
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	МесяцыУникальныхКБК.ФизическоеЛицо КАК ФизическоеЛицо,
				|	МесяцыУникальныхКБК.НалоговаяБаза КАК НалоговаяБаза,
				|	МесяцыУникальныхКБК.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
				|ПОМЕСТИТЬ ВТМесяцыПослеПревышения
				|ИЗ
				|	ВТМесяцыУникальныхКБК КАК МесяцыУникальныхКБК
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
				|		ПО МесяцыУникальныхКБК.ФизическоеЛицо = ДоходыПоСтавкам.ФизическоеЛицо
				|			И МесяцыУникальныхКБК.НалоговаяБаза = ДоходыПоСтавкам.НалоговаяБаза
				|			И (МесяцыУникальныхКБК.МесяцНалоговогоПериода = НАЧАЛОПЕРИОДА(ДоходыПоСтавкам.Период, МЕСЯЦ))
				|ГДЕ
				|	ДоходыПоСтавкам.КБК = &КБКсПревышения";
				Запрос.Выполнить();
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОписаниеТаблиц.Свойство("Раздел2Доходы") Или ОписаниеТаблиц.Свойство("Раздел2Налоги") Или ОписаниеТаблиц.Свойство("КоличествоПолучателейДохода") Или ОписаниеТаблиц.Свойство("Приложение1Налогоплательщики") Тогда
			
			Запрос.УстановитьПараметр("СтрокиРаздела2ПоКодамДохода", УчетНДФЛПовтИсп.СтрокиРаздела2Расчета6НДФЛПоКодамДохода());
			
			ПоДатамТрудовыхДоговоров = Новый Массив;
			ПоДатамТрудовыхДоговоров.Добавить(УчетНДФЛПовтИсп.Доход2710());
			ПоДатамТрудовыхДоговоров.Добавить(Справочники.ВидыДоходовНДФЛ.Код2720);
			ПоДатамТрудовыхДоговоров.Добавить(Справочники.ВидыДоходовНДФЛ.Код2760);
			ПоДатамТрудовыхДоговоров.Добавить(Справочники.ВидыДоходовНДФЛ.Код4800);
			Запрос.УстановитьПараметр("ПоДатамДоговоров", ПоДатамТрудовыхДоговоров);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СтрокиРаздела2ПоКодамДохода.КодДохода КАК КодДохода,
			|	СтрокиРаздела2ПоКодамДохода.СтрокаРаздела2Расчета6НДФЛ КАК СтрокаРаздела2
			|ПОМЕСТИТЬ ВТСтрокиРаздела2ПоКодамДохода
			|ИЗ
			|	&СтрокиРаздела2ПоКодамДохода КАК СтрокиРаздела2ПоКодамДохода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СведенияОДоходахНДФЛ.Период КАК Период,
			|	СведенияОДоходахНДФЛ.СтавкаНалога КАК СтавкаНалога,
			|	СведенияОДоходахНДФЛ.Ставка КАК Ставка,
			|	СведенияОДоходахНДФЛ.ЭтоВКС КАК ЭтоВКС,
			|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.Начисление КАК Начисление,
			|	СведенияОДоходахНДФЛ.КатегорияДохода КАК КатегорияДохода,
			|	СведенияОДоходахНДФЛ.КБК КАК КБК,
			|	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
			|	СведенияОДоходахНДФЛ.СуммаДохода КАК СуммаДохода,
			|	ВЫБОР
			|		КОГДА СведенияОДоходахНДФЛ.СтрокаРаздела2 <> ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ПустаяСсылка)
			|			ТОГДА СведенияОДоходахНДФЛ.СтрокаРаздела2
			|		ИНАЧЕ СтрокиРаздела2ПоКодамДохода.СтрокаРаздела2
			|	КОНЕЦ КАК СтрокаРаздела2
			|ПОМЕСТИТЬ ВТДоходыСоСтрокамиРаздела2
			|ИЗ
			|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтрокиРаздела2ПоКодамДохода КАК СтрокиРаздела2ПоКодамДохода
			|		ПО СведенияОДоходахНДФЛ.КодДохода = СтрокиРаздела2ПоКодамДохода.КодДохода
			|ГДЕ
			|	СведенияОДоходахНДФЛ.ДанныеДляОтчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ФизЛица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	&НачалоПериода КАК НачалоПериода,
			|	&ОкончаниеПериода КАК ОкончаниеПериода,
			|	&ГоловнаяОрганизация КАК ГоловнаяОрганизация
			|ИЗ
			|	ВТДоходыСоСтрокамиРаздела2 КАК ФизЛица
			|ГДЕ
			|	ФизЛица.СтрокаРаздела2 ЕСТЬ NULL";
			Результат = Запрос.Выполнить();
			Если Не Результат.Пустой() Тогда
				
				ФизЛицаОрганизаций = Результат.Выгрузить();
				Запрос.УстановитьПараметр("ТаблицаДоговоров", КадровыйУчет.ДоговорыФизическихЛиц(ФизЛицаОрганизаций)); ФизЛицаОрганизаций = Неопределено; 
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ТаблицаДоговоров.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ТаблицаДоговоров.ВидДоговора КАК ВидДоговора,
				|	ТаблицаДоговоров.Окончание КАК Окончание,
				|	ТаблицаДоговоров.Начало КАК Начало
				|ПОМЕСТИТЬ ВТДоговоры
				|ИЗ
				|	&ТаблицаДоговоров КАК ТаблицаДоговоров
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
				|	СведенияОДоходахНДФЛ.Период КАК Период,
				|	НЕ МИНИМУМ(ФизЛица.ВидДоговора) КАК ЕстьТрудовойДоговор
				|ПОМЕСТИТЬ ВТДниДоговоров
				|ИЗ
				|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоговоры КАК ФизЛица
				|		ПО (ФизЛица.Начало <= СведенияОДоходахНДФЛ.Период)
				|			И (ФизЛица.Окончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ИЛИ ФизЛица.Окончание >= СведенияОДоходахНДФЛ.Период)
				|			И СведенияОДоходахНДФЛ.ФизическоеЛицо = ФизЛица.ФизическоеЛицо
				|ГДЕ
				|	ФизЛица.ФизическоеЛицо ЕСТЬ НЕ NULL 
				|	И СведенияОДоходахНДФЛ.ДанныеДляОтчета
				|
				|СГРУППИРОВАТЬ ПО
				|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
				|	СведенияОДоходахНДФЛ.Период
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СведенияОДоходахНДФЛ.СтавкаНалога КАК СтавкаНалога,
				|	СведенияОДоходахНДФЛ.Ставка КАК Ставка,
				|	СведенияОДоходахНДФЛ.ЭтоВКС КАК ЭтоВКС,
				|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
				|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
				|	СведенияОДоходахНДФЛ.Начисление КАК Начисление,
				|	СведенияОДоходахНДФЛ.КатегорияДохода КАК КатегорияДохода,
				|	СведенияОДоходахНДФЛ.КБК КАК КБК,
				|	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
				|	СведенияОДоходахНДФЛ.СуммаДохода КАК СуммаДохода,
				|	ВЫБОР
				|		КОГДА СведенияОДоходахНДФЛ.СтрокаРаздела2 ЕСТЬ НЕ NULL 
				|			ТОГДА СведенияОДоходахНДФЛ.СтрокаРаздела2
				|		КОГДА СведенияОДоходахНДФЛ.КодДохода В (&ПоДатамДоговоров)
				|			ТОГДА ВЫБОР
				|					КОГДА ЕСТЬNULL(ДниДоговоров.ЕстьТрудовойДоговор, ЛОЖЬ)
				|						ТОГДА ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ТрудовойДоговор)
				|					КОГДА НЕ ДниДоговоров.ЕстьТрудовойДоговор
				|						ТОГДА ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ДоговорГПХ)
				|					ИНАЧЕ НЕОПРЕДЕЛЕНО
				|				КОНЕЦ
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК СтрокаРаздела2
				|ПОМЕСТИТЬ ВТПодробныеДоходы
				|ИЗ
				|	ВТДоходыСоСтрокамиРаздела2 КАК СведенияОДоходахНДФЛ
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДниДоговоров КАК ДниДоговоров
				|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = ДниДоговоров.ФизическоеЛицо
				|			И СведенияОДоходахНДФЛ.Период = ДниДоговоров.Период
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТДоходыСоСтрокамиРаздела2
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПодробныеДоходы.СтавкаНалога КАК СтавкаНалога,
				|	ПодробныеДоходы.Ставка КАК Ставка,
				|	ПодробныеДоходы.ЭтоВКС КАК ЭтоВКС,
				|	ПодробныеДоходы.Регистратор КАК Регистратор,
				|	ПодробныеДоходы.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ПодробныеДоходы.Начисление КАК Начисление,
				|	ПодробныеДоходы.КатегорияДохода КАК КатегорияДохода,
				|	ПодробныеДоходы.КБК КАК КБК,
				|	ПодробныеДоходы.КодДохода КАК КодДохода,
				|	ПодробныеДоходы.СуммаДохода КАК СуммаДохода,
				|	ПодробныеДоходы.СтрокаРаздела2 КАК СтрокаРаздела2
				|ПОМЕСТИТЬ ВТДоходыСоСтрокамиРаздела2
				|ИЗ
				|	ВТПодробныеДоходы КАК ПодробныеДоходы";
				Запрос.Выполнить();
				
			КонецЕсли;
		КонецЕсли;
			
		Если ОписаниеТаблиц.Свойство("Раздел2Вычеты") Или ОписаниеТаблиц.Свойство("Приложение1Налогоплательщики") Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходахНДФЛ.КБК КАК КБК,
			|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.КодВычета КАК КодВычета,
			|	СведенияОДоходахНДФЛ.СтавкаНалога КАК СтавкаНалога,
			|	СведенияОДоходахНДФЛ.Ставка КАК Ставка,
			|	СведенияОДоходахНДФЛ.СуммаВычета КАК СуммаВычета
			|ПОМЕСТИТЬ ВТВычетыПоСтавкам
			|ИЗ
			|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
			|ГДЕ
			|	СведенияОДоходахНДФЛ.СуммаВычета <> 0
			|	И СведенияОДоходахНДФЛ.ДанныеДляОтчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА СотрудникиСПревышением.ФизическоеЛицо ЕСТЬ NULL
			|			ТОГДА &ОсновнойКБК
			|		ИНАЧЕ &КБКсПревышения
			|	КОНЕЦ,
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Регистратор,
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ФизическоеЛицо,
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.КодВычета,
			|	ВЫБОР
			|		КОГДА СотрудникиСПревышением.ФизическоеЛицо ЕСТЬ NULL
			|			ТОГДА 13
			|		ИНАЧЕ 15
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА СотрудникиСПревышением.ФизическоеЛицо ЕСТЬ NULL
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
			|	КОНЕЦ,
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Сумма
			|ИЗ
			|	ВТСтандартныеИмущественныеВычеты КАК ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМесяцыПослеПревышения КАК СотрудникиСПревышением
			|		ПО ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
			|			И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.МесяцНалоговогоПериода = СотрудникиСПревышением.МесяцНалоговогоПериода
			|			И (СотрудникиСПревышением.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда))
			|ГДЕ
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ДанныеДляОтчета";
			Запрос.Выполнить();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел2Доходы") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.КодДохода КАК КодДохода,
		|	СведенияОДоходах.Начисление КАК Начисление,
		|	СведенияОДоходах.Регистратор КАК Регистратор,
		|	СведенияОДоходах.СтавкаНалога КАК СтавкаНалога,
		|	СведенияОДоходах.Ставка КАК Ставка,
		|	СведенияОДоходах.КБК КАК КБК,
		|	СУММА(СведенияОДоходах.СуммаДохода) КАК П000020011003,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.СтрокаРаздела2 = ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.Дивиденды)
		|				ТОГДА СведенияОДоходах.СуммаДохода
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П000020011103,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.СтрокаРаздела2 = ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ТрудовойДоговор)
		|				ТОГДА СведенияОДоходах.СуммаДохода
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П000020011203,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.СтрокаРаздела2 = ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ДоговорГПХ)
		|				ТОГДА СведенияОДоходах.СуммаДохода
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П000020011303,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ СведенияОДоходах.ЭтоВКС
		|				ТОГДА 0
		|			КОГДА СведенияОДоходах.СтрокаРаздела2 = ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ДоговорГПХ)
		|				ТОГДА СведенияОДоходах.СуммаДохода
		|			КОГДА СведенияОДоходах.СтрокаРаздела2 = ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ТрудовойДоговор)
		|				ТОГДА СведенияОДоходах.СуммаДохода
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П000020011503
		|ИЗ
		|	ВТДоходыСоСтрокамиРаздела2 КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Ставка,
		|	СведенияОДоходах.КБК,
		|	СведенияОДоходах.КодДохода,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.Регистратор,
		|	СведенияОДоходах.СтавкаНалога";
		
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
			МассивПолей.Добавить("КодДохода");
			МассивПолей.Добавить("Начисление");
			МассивПолей.Добавить("Регистратор");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
		ОписаниеТаблиц.Раздел2Доходы = Запрос.Выполнить().Выгрузить()
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("КоличествоПолучателейДохода") Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ДанныеОКоличествах.ВсегоПолучателей) КАК П000020012003,
		|	СУММА(ДанныеОКоличествах.ВсегоВКС) КАК П000020012103,
		|	ДанныеОКоличествах.Ставка КАК Ставка,
		|	ДанныеОКоличествах.КБК КАК КБК
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СведенияОДоходахНДФЛ.ФизическоеЛицо), 0) КАК ВсегоПолучателей,
		|		0 КАК ВсегоВКС,
		|		СведенияОДоходахНДФЛ.Ставка КАК Ставка,
		|		СведенияОДоходахНДФЛ.КБК КАК КБК
		|	ИЗ
		|		ВТДоходыСоСтрокамиРаздела2 КАК СведенияОДоходахНДФЛ
		|	ГДЕ
		|		СведенияОДоходахНДФЛ.СуммаДохода <> 0
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СведенияОДоходахНДФЛ.Ставка,
		|		СведенияОДоходахНДФЛ.КБК
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		0,
		|		ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СведенияОДоходахНДФЛ.ФизическоеЛицо), 0),
		|		СведенияОДоходахНДФЛ.Ставка,
		|		СведенияОДоходахНДФЛ.КБК
		|	ИЗ
		|		ВТДоходыСоСтрокамиРаздела2 КАК СведенияОДоходахНДФЛ
		|	ГДЕ
		|		СведенияОДоходахНДФЛ.СуммаДохода <> 0
		|		И СведенияОДоходахНДФЛ.ЭтоВКС
		|		И (СведенияОДоходахНДФЛ.СтрокаРаздела2 = ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ДоговорГПХ)
		|				ИЛИ СведенияОДоходахНДФЛ.СтрокаРаздела2 = ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ТрудовойДоговор))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СведенияОДоходахНДФЛ.Ставка,
		|		СведенияОДоходахНДФЛ.КБК) КАК ДанныеОКоличествах
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеОКоличествах.Ставка,
		|	ДанныеОКоличествах.КБК";
		
		ОписаниеТаблиц.КоличествоПолучателейДохода = Запрос.Выполнить().Выгрузить()
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел2Вычеты") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СведенияОДоходах.Ставка КАК Ставка,
		|	СведенияОДоходах.КБК КАК КБК,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.КодВычета КАК КодВычета,
		|	СведенияОДоходах.Регистратор КАК Регистратор,
		|	СведенияОДоходах.СтавкаНалога КАК СтавкаНалога,
		|	СУММА(СведенияОДоходах.СуммаВычета) КАК П000020013003
		|ИЗ
		|	ВТВычетыПоСтавкам КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.Ставка,
		|	СведенияОДоходах.КБК,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.КодВычета,
		|	СведенияОДоходах.Регистратор,
		|	СведенияОДоходах.СтавкаНалога";
		
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
			МассивПолей.Добавить("КодВычета");
			МассивПолей.Добавить("Регистратор");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
		ОписаниеТаблиц.Раздел2Вычеты = Запрос.Выполнить().Выгрузить()
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел2Налоги") Или ОписаниеТаблиц.Свойство("Приложение1Налогоплательщики") Тогда
		
		УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента(Запрос.МенеджерВременныхТаблиц, "ВТНалоги", "УчитыватьИзмененияСтатусаДляОтчетности", ОкончаниеПериода, "ВТСтавкаНДФЛПоНалогам");
		
		Если Не ЗарплатаКадры.ВТСуществует(Запрос.МенеджерВременныхТаблиц, "ВТСтатусыЗастрахованныхФизическихЛицСрезПоследних") Тогда
			ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТНалоги", "ФизическоеЛицо");
			ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
			ПараметрыПостроения.ВсеЗаписи = Истина;
		    ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "РегистрСведений.ДатаРегистрацииИзменений", "<=", "ДАТАВРЕМЯ(" + Формат(ДатаАктуальности,"ДФ=гггг") + ", " + Месяц(ДатаАктуальности) + ", " + День(ДатаАктуальности) + ", 23, 59, 59)", Ложь);
			ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
				"СтатусыЗастрахованныхФизическихЛиц",
				Запрос.МенеджерВременныхТаблиц,
				Ложь,
				ОписаниеФильтра,
				ПараметрыПостроения);
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.КатегорияДохода КАК КатегорияДохода,
		|	СведенияОДоходах.Период КАК Период,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НЕ СведенияОДоходах.ЭтоВКС
		|				ТОГДА ЛОЖЬ
		|			КОГДА СведенияОДоходах.СтрокаРаздела2 = ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ДоговорГПХ)
		|				ТОГДА ИСТИНА
		|			КОГДА СведенияОДоходах.СтрокаРаздела2 = ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ТрудовойДоговор)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ЭтоВКС
		|ПОМЕСТИТЬ ВТСведенияВКС
		|ИЗ
		|	ВТДоходыСоСтрокамиРаздела2 КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.КатегорияДохода,
		|	СведенияОДоходах.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДФЛ.КБК КАК КБК,
		|	НДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаЧислом * 100 КАК СтавкаНалога,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ КАК Ставка,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
		|			ТОГДА НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Начислено,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.КатегорияДохода В (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12))
		|					ИЛИ НДФЛ.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходыПредыдущихРедакций)
		|						И НДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09))
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачисленоПоДивидендам,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЗачтеноАвансов,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаУдержания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Удержано,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА НДФЛ.Сумма
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК УдержаноЗаНалоговыйПериод,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
		|			ТОГДА ВЫБОР
		|					КОГДА НДФЛ.НалогНаПрибыльДляДивидендов = 0
		|						ТОГДА НДФЛ.Сумма
		|					КОГДА ВЫБОР
		|							КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|								ТОГДА ВЫБОР
		|										КОГДА НДФЛ.СуммаСПревышения > 0
		|											ТОГДА ВЫБОР
		|													КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения > 0
		|														ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|													ИНАЧЕ 0
		|												КОНЕЦ
		|										КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения < 0
		|											ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|										ИНАЧЕ 0
		|									КОНЕЦ
		|							ИНАЧЕ НДФЛ.НалогНаПрибыльДляДивидендов
		|						КОНЕЦ * НДФЛ.Сумма > 0
		|						ТОГДА ВЫБОР
		|								КОГДА НДФЛ.Сумма > 0
		|									ТОГДА ВЫБОР
		|											КОГДА НДФЛ.Сумма - ВЫБОР
		|													КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|														ТОГДА ВЫБОР
		|																КОГДА НДФЛ.СуммаСПревышения > 0
		|																	ТОГДА ВЫБОР
		|																			КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения > 0
		|																				ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																			ИНАЧЕ 0
		|																		КОНЕЦ
		|																КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения < 0
		|																	ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																ИНАЧЕ 0
		|															КОНЕЦ
		|													ИНАЧЕ НДФЛ.НалогНаПрибыльДляДивидендов
		|												КОНЕЦ > 0
		|												ТОГДА НДФЛ.Сумма - ВЫБОР
		|														КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|															ТОГДА ВЫБОР
		|																	КОГДА НДФЛ.СуммаСПревышения > 0
		|																		ТОГДА ВЫБОР
		|																				КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения > 0
		|																					ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																				ИНАЧЕ 0
		|																			КОНЕЦ
		|																	КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения < 0
		|																		ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																	ИНАЧЕ 0
		|																КОНЕЦ
		|														ИНАЧЕ НДФЛ.НалогНаПрибыльДляДивидендов
		|													КОНЕЦ
		|											ИНАЧЕ 0
		|										КОНЕЦ
		|								КОГДА НДФЛ.Сумма - ВЫБОР
		|										КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|											ТОГДА ВЫБОР
		|													КОГДА НДФЛ.СуммаСПревышения > 0
		|														ТОГДА ВЫБОР
		|																КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения > 0
		|																	ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																ИНАЧЕ 0
		|															КОНЕЦ
		|													КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения < 0
		|														ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|													ИНАЧЕ 0
		|												КОНЕЦ
		|										ИНАЧЕ НДФЛ.НалогНаПрибыльДляДивидендов
		|									КОНЕЦ < 0
		|									ТОГДА НДФЛ.Сумма - ВЫБОР
		|											КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|												ТОГДА ВЫБОР
		|														КОГДА НДФЛ.СуммаСПревышения > 0
		|															ТОГДА ВЫБОР
		|																	КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения > 0
		|																		ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																	ИНАЧЕ 0
		|																КОНЕЦ
		|														КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения < 0
		|															ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|														ИНАЧЕ 0
		|													КОНЕЦ
		|											ИНАЧЕ НДФЛ.НалогНаПрибыльДляДивидендов
		|										КОНЕЦ
		|								ИНАЧЕ 0
		|							КОНЕЦ
		|					ИНАЧЕ НДФЛ.Сумма
		|				КОНЕЦ
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА -НДФЛ.Сумма
		|		КОГДА (НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|				ИЛИ НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей))
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА -НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Сальдо,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|				И (НДФЛ.ДатаУдержания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА -НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Возвращено,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
		|				И НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.Сумма > 0
		|			ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - ВЫБОР
		|					КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|						ТОГДА ВЫБОР
		|								КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.НалогНаПрибыльДляДивидендов < НДФЛ.СуммаСПревышения * НДФЛ.СуммаСПревышения
		|									ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов
		|								ИНАЧЕ НДФЛ.СуммаСПревышения
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НалогНаПрибыльДляДивидендов,
		|	НДФЛ.КатегорияДохода КАК КатегорияДохода,
		|	НДФЛ.ДатаПолученияДохода КАК ДатаПолученияДохода
		|ПОМЕСТИТЬ ВТНалогиПоСтавкам
		|ИЗ
		|	ВТНалоги КАК НДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыЗастрахованныхФизическихЛицСрезПоследних КАК СтатусыЗастрахованныхФизическихЛиц
		|		ПО НДФЛ.ФизическоеЛицо = СтатусыЗастрахованныхФизическихЛиц.ФизическоеЛицо
		|			И НДФЛ.Период = СтатусыЗастрахованныхФизическихЛиц.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоНалогам КАК СтавкаНДФЛПоСтавкеРезидента
		|		ПО НДФЛ.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
		|			И НДФЛ.Период = СтавкаНДФЛПоСтавкеРезидента.Период
		|			И НДФЛ.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
		|			И НДФЛ.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
		|ГДЕ
		|	НДФЛ.Сумма <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&КБКсПревышения,
		|	НДФЛ.ФизическоеЛицо,
		|	15,
		|	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15),
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
		|			ТОГДА НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.КатегорияДохода В (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12))
		|					ИЛИ НДФЛ.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходыПредыдущихРедакций)
		|						И НДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09))
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаУдержания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
		|			ТОГДА ВЫБОР
		|					КОГДА НДФЛ.НалогНаПрибыльДляДивидендов = 0
		|						ТОГДА НДФЛ.СуммаСПревышения
		|					КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|						ТОГДА ВЫБОР
		|								КОГДА НДФЛ.СуммаСПревышения > 0
		|									ТОГДА ВЫБОР
		|											КОГДА НДФЛ.СуммаСПревышения - НДФЛ.НалогНаПрибыльДляДивидендов > 0
		|												ТОГДА НДФЛ.СуммаСПревышения - НДФЛ.НалогНаПрибыльДляДивидендов
		|											ИНАЧЕ 0
		|										КОНЕЦ
		|								КОГДА НДФЛ.СуммаСПревышения - НДФЛ.НалогНаПрибыльДляДивидендов < 0
		|									ТОГДА НДФЛ.СуммаСПревышения - НДФЛ.НалогНаПрибыльДляДивидендов
		|								ИНАЧЕ 0
		|							КОНЕЦ
		|					ИНАЧЕ НДФЛ.СуммаСПревышения
		|				КОНЕЦ
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА -НДФЛ.СуммаСПревышения
		|		КОГДА (НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|				ИЛИ НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей))
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА -НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|				И (НДФЛ.ДатаУдержания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА -НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
		|				И НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|			ТОГДА ВЫБОР
		|					КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.НалогНаПрибыльДляДивидендов < НДФЛ.СуммаСПревышения * НДФЛ.СуммаСПревышения
		|						ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов
		|					ИНАЧЕ НДФЛ.СуммаСПревышения
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	НДФЛ.КатегорияДохода,
		|	НДФЛ.ДатаПолученияДохода
		|ИЗ
		|	ВТНалоги КАК НДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыЗастрахованныхФизическихЛицСрезПоследних КАК СтатусыЗастрахованныхФизическихЛиц
		|		ПО НДФЛ.ФизическоеЛицо = СтатусыЗастрахованныхФизическихЛиц.ФизическоеЛицо
		|			И НДФЛ.Период = СтатусыЗастрахованныхФизическихЛиц.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоНалогам КАК СтавкаНДФЛПоСтавкеРезидента
		|		ПО НДФЛ.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
		|			И НДФЛ.Период = СтавкаНДФЛПоСтавкеРезидента.Период
		|			И НДФЛ.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
		|			И НДФЛ.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
		|ГДЕ
		|	НДФЛ.СуммаСПревышения <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Налоги.СтавкаНалога КАК СтавкаНалога,
		|	СУММА(Налоги.Сальдо) КАК НеУдержано,
		|	Налоги.КБК КАК КБК
		|ПОМЕСТИТЬ ВТНеУдержано
		|ИЗ
		|	ВТНалогиПоСтавкам КАК Налоги
		|
		|СГРУППИРОВАТЬ ПО
		|	Налоги.ФизическоеЛицо,
		|	Налоги.СтавкаНалога,
		|	Налоги.КБК
		|
		|ИМЕЮЩИЕ
		|	СУММА(Налоги.Сальдо) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Налоги.СтавкаНалога КАК СтавкаНалога,
		|	Налоги.КБК КАК КБК,
		|	-СУММА(Налоги.Сальдо) КАК ИзлишнеУдержано
		|ПОМЕСТИТЬ ВТИзлишнеУдержаноПоКБК
		|ИЗ
		|	ВТНалогиПоСтавкам КАК Налоги
		|
		|СГРУППИРОВАТЬ ПО
		|	Налоги.ФизическоеЛицо,
		|	Налоги.СтавкаНалога,
		|	Налоги.КБК
		|
		|ИМЕЮЩИЕ
		|	СУММА(Налоги.Сальдо) < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Налоги.СтавкаНалога КАК СтавкаНалога,
		|	СУММА(Налоги.Начислено) КАК Начислено,
		|	СУММА(Налоги.НачисленоПоДивидендам) КАК НачисленоПоДивидендам,
		|	СУММА(Налоги.НалогНаПрибыльДляДивидендов) КАК НалогНаПрибыльДляДивидендов,
		|	СУММА(Налоги.ЗачтеноАвансов) КАК ЗачтеноАвансов,
		|	СУММА(Налоги.Удержано) КАК Удержано,
		|	СУММА(Налоги.УдержаноЗаНалоговыйПериод) КАК УдержаноЗаНалоговыйПериод,
		|	СУММА(Налоги.Возвращено) КАК Возвращено,
		|	ЕСТЬNULL(МАКСИМУМ(ПоФизлицам.НеУдержано), 0) КАК НеУдержано,
		|	ЕСТЬNULL(МАКСИМУМ(ИзлишнеУдержаноПоКБК.ИзлишнеУдержано), 0) КАК ИзлишнеУдержано,
		|	Налоги.Ставка КАК Ставка,
		|	Налоги.КБК КАК КБК,
		|	ЕСТЬNULL(СведенияВКС.ЭтоВКС, ЛОЖЬ) КАК ЭтоВКС
		|ПОМЕСТИТЬ ВТДанныеПоФизлицам
		|ИЗ
		|	ВТНалогиПоСтавкам КАК Налоги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияВКС КАК СведенияВКС
		|		ПО Налоги.ФизическоеЛицо = СведенияВКС.ФизическоеЛицо
		|			И Налоги.КатегорияДохода = СведенияВКС.КатегорияДохода
		|			И Налоги.ДатаПолученияДохода = СведенияВКС.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНеУдержано КАК ПоФизлицам
		|		ПО Налоги.ФизическоеЛицо = ПоФизлицам.ФизическоеЛицо
		|			И Налоги.СтавкаНалога = ПоФизлицам.СтавкаНалога
		|			И Налоги.КБК = ПоФизлицам.КБК
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИзлишнеУдержаноПоКБК КАК ИзлишнеУдержаноПоКБК
		|		ПО Налоги.ФизическоеЛицо = ИзлишнеУдержаноПоКБК.ФизическоеЛицо
		|			И Налоги.КБК = ИзлишнеУдержаноПоКБК.КБК
		|			И Налоги.СтавкаНалога = ИзлишнеУдержаноПоКБК.СтавкаНалога
		|ГДЕ
		|	(Налоги.Начислено <> 0
		|			ИЛИ Налоги.ЗачтеноАвансов <> 0
		|			ИЛИ Налоги.Удержано <> 0
		|			ИЛИ Налоги.УдержаноЗаНалоговыйПериод <> 0
		|			ИЛИ Налоги.Возвращено <> 0
		|			ИЛИ ИзлишнеУдержаноПоКБК.ИзлишнеУдержано <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	Налоги.ФизическоеЛицо,
		|	Налоги.СтавкаНалога,
		|	Налоги.Ставка,
		|	Налоги.КБК,
		|	ЕСТЬNULL(СведенияВКС.ЭтоВКС, ЛОЖЬ)";
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел2Налоги") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(Налоги.Начислено) КАК П000020014003,
		|	СУММА(Налоги.НачисленоПоДивидендам) КАК П000020014103,
		|	СУММА(ВЫБОР
		|			КОГДА Налоги.ЭтоВКС
		|				ТОГДА Налоги.Начислено
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК П000020014203,
		|	СУММА(Налоги.ЗачтеноАвансов) КАК П000020015003,
		|	СУММА(Налоги.НалогНаПрибыльДляДивидендов) КАК П000020015503,
		|	СУММА(Налоги.Удержано) КАК П000020016003,
		|	СУММА(Налоги.НеУдержано) КАК П000020017003,
		|	СУММА(Налоги.Возвращено) КАК П000020019003,
		|	СУММА(Налоги.ИзлишнеУдержано) КАК П000020018003,
		|	Налоги.СтавкаНалога КАК СтавкаНалога,
		|	Налоги.Ставка КАК Ставка,
		|	Налоги.КБК КАК КБК
		|ИЗ
		|	ВТДанныеПоФизлицам КАК Налоги
		|ГДЕ
		|	(Налоги.Начислено <> 0
		|			ИЛИ Налоги.ЗачтеноАвансов <> 0
		|			ИЛИ Налоги.Удержано <> 0
		|			ИЛИ Налоги.Возвращено <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	Налоги.СтавкаНалога,
		|	Налоги.Ставка,
		|	Налоги.КБК,
		|	Налоги.ФизическоеЛицо";
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "Налоги");
		ОписаниеТаблиц.Раздел2Налоги = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Приложение1Налогоплательщики") Тогда
		
		НеобходимыеКадровыеДанные = Новый Массив();
		НеобходимыеКадровыеДанные.Добавить("ФизическоеЛицо");
		НеобходимыеКадровыеДанные.Добавить("ИНН");
		НеобходимыеКадровыеДанные.Добавить("Наименование");
		НеобходимыеКадровыеДанные.Добавить("Фамилия");
		НеобходимыеКадровыеДанные.Добавить("Имя");
		НеобходимыеКадровыеДанные.Добавить("Отчество");
		НеобходимыеКадровыеДанные.Добавить("СтатусНалогоплательщика");
		НеобходимыеКадровыеДанные.Добавить("ВидЗастрахованногоЛица");
		НеобходимыеКадровыеДанные.Добавить("ДатаРождения");	
		НеобходимыеКадровыеДанные.Добавить("ДокументВид");
		НеобходимыеКадровыеДанные.Добавить("ДокументСерия");
		НеобходимыеКадровыеДанные.Добавить("ДокументНомер");
		НеобходимыеКадровыеДанные.Добавить("ДокументСтранаВыдачи");
		НеобходимыеКадровыеДанные.Добавить("Страна");
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТДоходыСоСтрокамиРаздела2 КАК СведенияОДоходах";
		ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц,"ВТСтатусыЗастрахованныхФизическихЛицСрезПоследних", Истина);
		КадровыйУчет.СоздатьНаДатуВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, Истина, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо"), НеобходимыеКадровыеДанные, ДатаАктуальности);
		
		// Для корректирующей и отменяющей формы прочитаем переданные в предыдущих отчетах данные.
		Если НомерКорректировки > 0 Тогда
			ФормироватьПустыеДанные = ТипЗнч(РегистрацияВНалоговомОргане) = Тип("Массив") И РегистрацияВНалоговомОргане.Количество() = 0;
			Если ФормироватьПустыеДанные Тогда
				СоздатьПустыеВТПереданныхДанныхОтчета2021(Запрос.МенеджерВременныхТаблиц)
			Иначе 
				РеквизитыРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(?(ТипЗнч(РегистрацияВНалоговомОргане) = Тип("Массив"), РегистрацияВНалоговомОргане[0], РегистрацияВНалоговомОргане), "КодПоОКТМО,КПП");
				ПолучитьПереданныеДанныеОтчета2021(Организация, СокрЛП(РеквизитыРегистрации.КодПоОКТМО), СокрЛП(РеквизитыРегистрации.КПП), ОкончаниеПериода, Запрос.МенеджерВременныхТаблиц, НомерКорректировки, "ФормаОтчета2021Кв4");
			КонецЕсли;
		КонецЕсли;
		
		// Для отменяющей формы нужен только перечень переданных справок.
		Если НомерКорректировки = 99 Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КадровыеДанныеФизЛиц.НомерСправки КАК НомерСправки,
			|	КадровыеДанныеФизЛиц.ИНН КАК ИНН,
			|	КадровыеДанныеФизЛиц.Фамилия КАК Фамилия,
			|	КадровыеДанныеФизЛиц.Имя КАК Имя,
			|	КадровыеДанныеФизЛиц.Отчество КАК Отчество,
			|	КадровыеДанныеФизЛиц.ДатаРождения КАК ДатаРождения,
			|	КадровыеДанныеФизЛиц.СерияДокумента КАК СерияДокумента,
			|	КадровыеДанныеФизЛиц.НомерДокумента КАК НомерДокумента,
			|	КадровыеДанныеФизЛиц.Фамилия + "" "" + КадровыеДанныеФизЛиц.Имя + "" "" + КадровыеДанныеФизЛиц.Отчество КАК Наименование,
			|	КадровыеДанныеФизЛиц.КодСтраныДляОтчетности КАК КодСтраныДляОтчетности,
			|	КадровыеДанныеФизЛиц.КодФНС КАК КодФНС,
			|	КадровыеДанныеФизЛиц.КодМВД КАК КодМВД
			|ИЗ
			|	ВТНалогоплательщикиПереданные КАК КадровыеДанныеФизЛиц
			|
			|УПОРЯДОЧИТЬ ПО
			|	Наименование";
			ОписаниеТаблиц.Приложение1Налогоплательщики = Запрос.Выполнить().Выгрузить();
			Возврат
		КонецЕсли;
		
		// Для исходной и корректирующей форм соберем текущие данные.
		УчетНДФЛ.СоздатьВТСтавкиНалогаЧислом(Запрос.МенеджерВременныхТаблиц);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КадровыеДанныеФизЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|	КадровыеДанныеФизЛиц.ИНН КАК ИНН,
		|	КадровыеДанныеФизЛиц.Фамилия КАК Фамилия,
		|	КадровыеДанныеФизЛиц.Имя КАК Имя,
		|	КадровыеДанныеФизЛиц.Отчество КАК Отчество,
		|	КадровыеДанныеФизЛиц.ДатаРождения КАК ДатаРождения,
		|	ЕСТЬNULL(КадровыеДанныеФизЛиц.ДокументСерия, """") КАК СерияДокумента,
		|	ЕСТЬNULL(КадровыеДанныеФизЛиц.ДокументНомер, """") КАК НомерДокумента,
		|	КадровыеДанныеФизЛиц.Наименование КАК Наименование,
		|	ВЫБОР
		|		КОГДА КадровыеДанныеФизЛиц.Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА КадровыеДанныеФизЛиц.ДокументСтранаВыдачи = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|						ТОГДА ""643""
		|					ИНАЧЕ КадровыеДанныеФизЛиц.ДокументСтранаВыдачи.Код
		|				КОНЕЦ
		|		ИНАЧЕ ЕСТЬNULL(КадровыеДанныеФизЛиц.Страна.Код, """")
		|	КОНЕЦ КАК КодСтраныДляОтчетности,
		|	ВЫБОР
		|		КОГДА КадровыеДанныеФизЛиц.ВидЗастрахованногоЛица В (&ВКС)
		|				И КадровыеДанныеФизЛиц.СтатусНалогоплательщика = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
		|			ТОГДА ""7""
		|		ИНАЧЕ ЕСТЬNULL(СтатусыНалогоплательщиковПоНДФЛ.КодФНС_2015, """")
		|	КОНЕЦ КАК КодФНС,
		|	ЕСТЬNULL(ВидыДокументовФизическихЛиц.КодМВД, """") КАК КодМВД
		|ПОМЕСТИТЬ ВТФизлицаПоТекущимДанным
		|ИЗ
		|	ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизЛиц
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовФизическихЛиц КАК ВидыДокументовФизическихЛиц
		|		ПО КадровыеДанныеФизЛиц.ДокументВид = ВидыДокументовФизическихЛиц.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатусыНалогоплательщиковПоНДФЛ КАК СтатусыНалогоплательщиковПоНДФЛ
		|		ПО КадровыеДанныеФизЛиц.СтатусНалогоплательщика = СтатусыНалогоплательщиковПоНДФЛ.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеИтогов.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеИтогов.Ставка КАК Ставка,
		|	ДанныеИтогов.КБК КАК КБК,
		|	ДанныеИтогов.П000П1М100001 КАК П000П1М100001,
		|	СУММА(ДанныеИтогов.П000П1М100002) КАК П000П1М100002,
		|	СУММА(ДанныеИтогов.П000П1М100003) КАК П000П1М100003,
		|	СУММА(ДанныеИтогов.П000П1М100004) КАК П000П1М100004,
		|	СУММА(ДанныеИтогов.П000П1М100005) КАК П000П1М100005,
		|	СУММА(ДанныеИтогов.П000П1М100006) КАК П000П1М100006,
		|	СУММА(ДанныеИтогов.П000П1М100007) КАК П000П1М100007,
		|	СУММА(ДанныеИтогов.П000П1М100008) КАК П000П1М100008,
		|	ДанныеИтогов.П000П1М100009 КАК П000П1М100009,
		|	СУММА(ДанныеИтогов.П000П1М100010) КАК П000П1М100010
		|ПОМЕСТИТЬ ВТДанныеИтоговПоТекущимДанным
		|ИЗ
		|	(ВЫБРАТЬ
		|		Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|		Налоги.СтавкаНалога КАК Ставка,
		|		Налоги.КБК КАК КБК,
		|		Налоги.СтавкаНалога КАК П000П1М100001,
		|		Налоги.КБК КАК П000П1М100009,
		|		0 КАК П000П1М100002,
		|		0 КАК П000П1М100003,
		|		Налоги.Начислено КАК П000П1М100004,
		|		Налоги.УдержаноЗаНалоговыйПериод КАК П000П1М100005,
		|		Налоги.ЗачтеноАвансов КАК П000П1М100006,
		|		0 КАК П000П1М100007,
		|		0 КАК П000П1М100008,
		|		Налоги.НалогНаПрибыльДляДивидендов КАК П000П1М100010
		|	ИЗ
		|		ВТДанныеПоФизлицам КАК Налоги
		|	ГДЕ
		|		(Налоги.Начислено <> 0
		|				ИЛИ Налоги.ЗачтеноАвансов <> 0
		|				ИЛИ Налоги.УдержаноЗаНалоговыйПериод <> 0)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СведенияОДоходах.ФизическоеЛицо,
		|		СведенияОДоходах.СтавкаНалога,
		|		СведенияОДоходах.КБК,
		|		СведенияОДоходах.СтавкаНалога,
		|		СведенияОДоходах.КБК,
		|		СведенияОДоходах.СуммаДохода,
		|		СведенияОДоходах.СуммаДохода,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		ВТДоходыПоСтавкам КАК СведенияОДоходах
		|	ГДЕ
		|		СведенияОДоходах.ДанныеДляОтчета
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СведенияОДоходах.ФизическоеЛицо,
		|		СведенияОДоходах.СтавкаНалога,
		|		СведенияОДоходах.КБК,
		|		СведенияОДоходах.СтавкаНалога,
		|		СведенияОДоходах.КБК,
		|		0,
		|		-СведенияОДоходах.СуммаВычета,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		ВТВычетыПоСтавкам КАК СведенияОДоходах
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Налоги.ФизическоеЛицо,
		|		Налоги.СтавкаНалога,
		|		Налоги.КБК,
		|		Налоги.СтавкаНалога,
		|		Налоги.КБК,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		Налоги.ИзлишнеУдержано,
		|		0
		|	ИЗ
		|		(ВЫБРАТЬ
		|			Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|			Налоги.СтавкаНалога КАК СтавкаНалога,
		|			Налоги.КБК КАК КБК,
		|			-СУММА(Налоги.Сальдо) КАК ИзлишнеУдержано
		|		ИЗ
		|			ВТНалогиПоСтавкам КАК Налоги
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Налоги.ФизическоеЛицо,
		|			Налоги.КБК,
		|			Налоги.СтавкаНалога
		|		
		|		ИМЕЮЩИЕ
		|			СУММА(Налоги.Сальдо) < 0) КАК Налоги
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо,
		|		СтавкиНалогаЧислом.Размер * 100,
		|		ВЫБОР
		|			КОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
		|				ТОГДА &КБКсПревышения
		|			ИНАЧЕ &ОсновнойКБК
		|		КОНЕЦ,
		|		СтавкиНалогаЧислом.Размер * 100,
		|		ВЫБОР
		|			КОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
		|				ТОГДА &КБКсПревышения
		|			ИНАЧЕ &ОсновнойКБК
		|		КОНЕЦ,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма,
		|		0,
		|		0
		|	ИЗ
		|		РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиНалогаЧислом КАК СтавкиНалогаЧислом
		|			ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка = СтавкиНалогаЧислом.СтавкаНалогообложения
		|	ГДЕ
		|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|		И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане В(&РегистрацияВНалоговомОргане)
		|		И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода) КАК ДанныеИтогов
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеИтогов.Ставка,
		|	ДанныеИтогов.КБК,
		|	ДанныеИтогов.ФизическоеЛицо,
		|	ДанныеИтогов.П000П1М100001,
		|	ДанныеИтогов.П000П1М100009
		|
		|ИМЕЮЩИЕ
		|	СУММА(ДанныеИтогов.П000П1М100002) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) КАК Период,
		|	СведенияОДоходах.СтавкаНалога КАК Ставка,
		|	СведенияОДоходах.КБК КАК КБК,
		|	ЕСТЬNULL(СведенияОДоходах.КодДохода.КодПрименяемыйВНалоговойОтчетностиС2021Года, """") КАК П000П1М500002,
		|	СУММА(СведенияОДоходах.СуммаДохода) КАК П000П1М500003,
		|	ЕСТЬNULL(СведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года, """") КАК П000П1М600004,
		|	СУММА(СведенияОДоходах.СуммаВычета) КАК П000П1М600005
		|ПОМЕСТИТЬ ВТДоходыПоТекущимДанным
		|ИЗ
		|	ВТДоходыПоСтавкам КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.ДанныеДляОтчета
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.КБК,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	ЕСТЬNULL(СведенияОДоходах.КодДохода.КодПрименяемыйВНалоговойОтчетностиС2021Года, """"),
		|	ЕСТЬNULL(СведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года, """"),
		|	СведенияОДоходах.СтавкаНалога,
		|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ)
		|
		|ИМЕЮЩИЕ
		|	(СУММА(СведенияОДоходах.СуммаДохода) <> 0
		|		ИЛИ СУММА(СведенияОДоходах.СуммаВычета) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОВычетах.СтавкаНалога КАК Ставка,
		|	СведенияОВычетах.КБК КАК КБК,
		|	СведенияОВычетах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОВычетах.КодВычета.ГруппаВычета КАК ГруппаВычета,
		|	СведенияОВычетах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года КАК П000П1М200001,
		|	СУММА(СведенияОВычетах.СуммаВычета) КАК П000П1М200002
		|ПОМЕСТИТЬ ВТВычетыПоТекущимДанным
		|ИЗ
		|	ВТВычетыПоСтавкам КАК СведенияОВычетах
		|ГДЕ
		|	СведенияОВычетах.КодВычета.ГруппаВычета <> ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОВычетах.СтавкаНалога,
		|	СведенияОВычетах.КБК,
		|	СведенияОВычетах.ФизическоеЛицо,
		|	СведенияОВычетах.КодВычета.ГруппаВычета,
		|	СведенияОВычетах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года
		|
		|ИМЕЮЩИЕ
		|	СУММА(СведенияОВычетах.СуммаВычета) <> 0";
		Запрос.Выполнить();
		
		НалоговыйПериод = Год(ОкончаниеПериода);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОВычетах.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТВычетыПоТекущимДанным КАК СведенияОВычетах
		|ГДЕ
		|	СведенияОВычетах.ГруппаВычета <> ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.ПустаяСсылка)";
		ДанныеУведомлений = УчетНДФЛ.ДанныеУведомленийНаВычеты(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо"), НалоговыйПериод, Организация);
		ДанныеУведомлений.Колонки.Сотрудник.Имя = "ФизическоеЛицо";
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТДанныеПоФизлицам КАК Налоги
		|ГДЕ
		|	Налоги.ЗачтеноАвансов <> 0";
		ДанныеЗачетаАвансовыхПлатежей = УчетНДФЛ.ДанныеУведомленийНаЗачетАвансовыхПлатежей(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо"), НалоговыйПериод, Организация);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗачетаАвансовыхПлатежей, ДанныеУведомлений);
		
		Если НомерКорректировки = 0 Тогда
			
			// Для исходной формы дополнительных действий не требуется, возвращаем полученные данные.
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КадровыеДанныеФизЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
			|	КадровыеДанныеФизЛиц.ИНН КАК ИНН,
			|	КадровыеДанныеФизЛиц.Фамилия КАК Фамилия,
			|	КадровыеДанныеФизЛиц.Имя КАК Имя,
			|	КадровыеДанныеФизЛиц.Отчество КАК Отчество,
			|	КадровыеДанныеФизЛиц.ДатаРождения КАК ДатаРождения,
			|	КадровыеДанныеФизЛиц.СерияДокумента КАК СерияДокумента,
			|	КадровыеДанныеФизЛиц.НомерДокумента КАК НомерДокумента,
			|	КадровыеДанныеФизЛиц.Наименование КАК Наименование,
			|	КадровыеДанныеФизЛиц.КодСтраныДляОтчетности КАК КодСтраныДляОтчетности,
			|	КадровыеДанныеФизЛиц.КодФНС КАК КодФНС,
			|	КадровыеДанныеФизЛиц.КодМВД КАК КодМВД
			|ИЗ
			|	ВТФизлицаПоТекущимДанным КАК КадровыеДанныеФизЛиц
			|
			|УПОРЯДОЧИТЬ ПО
			|	Наименование";
			ОписаниеТаблиц.Приложение1Налогоплательщики = Запрос.Выполнить().Выгрузить();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ДанныеИтогов.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеИтогов.Ставка КАК Ставка,
			|	ДанныеИтогов.КБК КАК КБК,
			|	ДанныеИтогов.П000П1М100001 КАК П000П1М100001,
			|	ДанныеИтогов.П000П1М100002 КАК П000П1М100002,
			|	ДанныеИтогов.П000П1М100003 КАК П000П1М100003,
			|	ДанныеИтогов.П000П1М100004 КАК П000П1М100004,
			|	ДанныеИтогов.П000П1М100005 КАК П000П1М100005,
			|	ДанныеИтогов.П000П1М100006 КАК П000П1М100006,
			|	ДанныеИтогов.П000П1М100007 КАК П000П1М100007,
			|	ДанныеИтогов.П000П1М100008 КАК П000П1М100008,
			|	ДанныеИтогов.П000П1М100009 КАК П000П1М100009,
			|	ДанныеИтогов.П000П1М100010 КАК П000П1М100010
			|ИЗ
			|	ВТДанныеИтоговПоТекущимДанным КАК ДанныеИтогов
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	Ставка,
			|	КБК"; 
			ОписаниеТаблиц.Приложение1Итоги = Запрос.Выполнить().Выгрузить();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходах.Ставка КАК Ставка,
			|	СведенияОДоходах.КБК КАК КБК,
			|	СведенияОДоходах.П000П1М500002 КАК П000П1М500002,
			|	СведенияОДоходах.Период КАК Период,
			|	СведенияОДоходах.П000П1М500003 КАК П000П1М500003,
			|	СведенияОДоходах.П000П1М600004 КАК П000П1М600004,
			|	СведенияОДоходах.П000П1М600005 КАК П000П1М600005
			|ИЗ
			|	ВТДоходыПоТекущимДанным КАК СведенияОДоходах
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	Ставка,
			|	КБК,
			|	Период,
			|	П000П1М500002";
			ОписаниеТаблиц.Приложение1Доходы = Запрос.Выполнить().Выгрузить();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОВычетах.Ставка КАК Ставка,
			|	СведенияОВычетах.КБК КАК КБК,
			|	СведенияОВычетах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОВычетах.ГруппаВычета КАК ГруппаВычета,
			|	СведенияОВычетах.П000П1М200001 КАК П000П1М200001,
			|	СведенияОВычетах.П000П1М200002 КАК П000П1М200002
			|ИЗ
			|	ВТВычетыПоТекущимДанным КАК СведенияОВычетах
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	Ставка,
			|	КБК,
			|	П000П1М200001";
			ОписаниеТаблиц.Приложение1Вычеты = Запрос.Выполнить().Выгрузить();
			
			ДанныеУведомлений.Колонки.НомерУведомления.Имя = "П000П1М300002";
			ДанныеУведомлений.Колонки.ДатаУведомления.Имя = "П000П1М300003";
			ДанныеУведомлений.Колонки.КодНалоговогоОрганаУведомления.Имя = "П000П1М300004";
			ОписаниеТаблиц.Приложение1УведомленияОВычетах = ДанныеУведомлений;
			
		Иначе
			
			// Для корректирующей формы определим перечень сотрудников, чьи данные отличаются от переданных ранее, и вернем данные учета только для них.
			
			ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(Запрос.МенеджерВременныхТаблиц, ДанныеУведомлений, "ВТУведомленияОВычетахПоТекущимДанным");
			// АПК:96-выкл Использование ОБЪЕДИНИТЬ оправдано
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходах.Ставка КАК Ставка,
			|	СведенияОДоходах.КБК КАК КБК,
			|	СведенияОДоходах.Период КАК Период,
			|	СведенияОДоходах.П000П1М500002 КАК П000П1М500002,
			|	СУММА(СведенияОДоходах.П000П1М500003) КАК П000П1М500003
			|ПОМЕСТИТЬ ВТТолькоДоходыПоТекущимДанным
			|ИЗ
			|	ВТДоходыПоТекущимДанным КАК СведенияОДоходах
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.Ставка,
			|	СведенияОДоходах.КБК,
			|	СведенияОДоходах.Период,
			|	СведенияОДоходах.П000П1М500002
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходах.Ставка КАК Ставка,
			|	СведенияОДоходах.КБК КАК КБК,
			|	СведенияОДоходах.Период КАК Период,
			|	СведенияОДоходах.П000П1М500002 КАК П000П1М500002,
			|	СведенияОДоходах.П000П1М600004 КАК П000П1М600004,
			|	СУММА(СведенияОДоходах.П000П1М600005) КАК П000П1М600005
			|ПОМЕСТИТЬ ВТВычетыКДоходамПоТекущимДанным
			|ИЗ
			|	ВТДоходыПоТекущимДанным КАК СведенияОДоходах
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.Ставка,
			|	СведенияОДоходах.КБК,
			|	СведенияОДоходах.Период,
			|	СведенияОДоходах.П000П1М500002,
			|	СведенияОДоходах.П000П1М600004
			|
			|ИМЕЮЩИЕ
			|	СУММА(СведенияОДоходах.П000П1М600005) <> 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ФизлицаПоТекущимДанным.ФизическоеЛицо КАК ФизическоеЛицо
			|ПОМЕСТИТЬ ВТФизлицаВОтчет
			|ИЗ
			|	ВТФизлицаПоТекущимДанным КАК ФизлицаПоТекущимДанным
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогоплательщикиПереданные КАК ФизлицаПереданные
			|		ПО ФизлицаПоТекущимДанным.ФизическоеЛицо = ФизлицаПереданные.ФизическоеЛицо
			|			И ФизлицаПоТекущимДанным.ИНН = ФизлицаПереданные.ИНН
			|			И ФизлицаПоТекущимДанным.Фамилия = ФизлицаПереданные.Фамилия
			|			И ФизлицаПоТекущимДанным.Имя = ФизлицаПереданные.Имя
			|			И ФизлицаПоТекущимДанным.Отчество = ФизлицаПереданные.Отчество
			|			И ФизлицаПоТекущимДанным.ДатаРождения = ФизлицаПереданные.ДатаРождения
			|			И ФизлицаПоТекущимДанным.КодСтраныДляОтчетности = ФизлицаПереданные.КодСтраныДляОтчетности
			|			И ФизлицаПоТекущимДанным.СерияДокумента = ФизлицаПереданные.СерияДокумента
			|			И ФизлицаПоТекущимДанным.НомерДокумента = ФизлицаПереданные.НомерДокумента
			|			И ФизлицаПоТекущимДанным.КодФНС = ФизлицаПереданные.КодФНС
			|			И ФизлицаПоТекущимДанным.КодМВД = ФизлицаПереданные.КодМВД
			|ГДЕ
			|	ФизлицаПереданные.ФизическоеЛицо ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДанныеИтогов.ФизическоеЛицо
			|ИЗ
			|	ВТДанныеИтоговПоТекущимДанным КАК ДанныеИтогов
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИтогиПереданные КАК ИтогиПереданные
			|		ПО ДанныеИтогов.ФизическоеЛицо = ИтогиПереданные.ФизическоеЛицо
			|			И ДанныеИтогов.П000П1М100001 = ИтогиПереданные.П000П1М100001
			|			И ДанныеИтогов.П000П1М100002 = ИтогиПереданные.П000П1М100002
			|			И ДанныеИтогов.П000П1М100003 = ИтогиПереданные.П000П1М100003
			|			И ДанныеИтогов.П000П1М100004 = ИтогиПереданные.П000П1М100004
			|			И ДанныеИтогов.П000П1М100005 = ИтогиПереданные.П000П1М100005
			|			И ДанныеИтогов.П000П1М100006 = ИтогиПереданные.П000П1М100006
			|			И ДанныеИтогов.П000П1М100007 = ИтогиПереданные.П000П1М100007
			|			И ДанныеИтогов.П000П1М100008 = ИтогиПереданные.П000П1М100008
			|			И ДанныеИтогов.П000П1М100009 = ИтогиПереданные.П000П1М100009
			|			И ДанныеИтогов.П000П1М100010 = ИтогиПереданные.П000П1М100010
			|ГДЕ
			|	ИтогиПереданные.ФизическоеЛицо ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ИтогиПереданные.ФизическоеЛицо
			|ИЗ
			|	ВТИтогиПереданные КАК ИтогиПереданные
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеИтоговПоТекущимДанным КАК ДанныеИтогов
			|		ПО ИтогиПереданные.ФизическоеЛицо = ДанныеИтогов.ФизическоеЛицо
			|			И ИтогиПереданные.П000П1М100001 = ДанныеИтогов.П000П1М100001
			|			И ИтогиПереданные.П000П1М100002 = ДанныеИтогов.П000П1М100002
			|			И ИтогиПереданные.П000П1М100003 = ДанныеИтогов.П000П1М100003
			|			И ИтогиПереданные.П000П1М100004 = ДанныеИтогов.П000П1М100004
			|			И ИтогиПереданные.П000П1М100005 = ДанныеИтогов.П000П1М100005
			|			И ИтогиПереданные.П000П1М100006 = ДанныеИтогов.П000П1М100006
			|			И ИтогиПереданные.П000П1М100007 = ДанныеИтогов.П000П1М100007
			|			И ИтогиПереданные.П000П1М100008 = ДанныеИтогов.П000П1М100008
			|			И ИтогиПереданные.П000П1М100009 = ДанныеИтогов.П000П1М100009
			|			И ИтогиПереданные.П000П1М100010 = ДанныеИтогов.П000П1М100010
			|ГДЕ
			|	ДанныеИтогов.ФизическоеЛицо ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СведенияОДоходах.ФизическоеЛицо
			|ИЗ
			|	ВТТолькоДоходыПоТекущимДанным КАК СведенияОДоходах
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПереданные КАК ДоходыПереданные
			|		ПО СведенияОДоходах.ФизическоеЛицо = ДоходыПереданные.ФизическоеЛицо
			|			И СведенияОДоходах.Ставка = ДоходыПереданные.Ставка
			|			И СведенияОДоходах.КБК = ДоходыПереданные.КБК
			|			И СведенияОДоходах.Период = ДоходыПереданные.Период
			|			И СведенияОДоходах.П000П1М500002 = ДоходыПереданные.П000П1М500002
			|			И СведенияОДоходах.П000П1М500003 = ДоходыПереданные.П000П1М500003
			|ГДЕ
			|	ДоходыПереданные.ФизическоеЛицо ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДоходыПереданные.ФизическоеЛицо
			|ИЗ
			|	ВТДоходыПереданные КАК ДоходыПереданные
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТолькоДоходыПоТекущимДанным КАК СведенияОДоходах
			|		ПО (СведенияОДоходах.ФизическоеЛицо = ДоходыПереданные.ФизическоеЛицо)
			|			И (СведенияОДоходах.Ставка = ДоходыПереданные.Ставка)
			|			И (СведенияОДоходах.КБК = ДоходыПереданные.КБК)
			|			И (СведенияОДоходах.Период = ДоходыПереданные.Период)
			|			И (СведенияОДоходах.П000П1М500002 = ДоходыПереданные.П000П1М500002)
			|			И (СведенияОДоходах.П000П1М500003 = ДоходыПереданные.П000П1М500003)
			|ГДЕ
			|	СведенияОДоходах.ФизическоеЛицо ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВычетыКДоходамПоТекущимДанным.ФизическоеЛицо
			|ИЗ
			|	ВТВычетыКДоходамПоТекущимДанным КАК ВычетыКДоходамПоТекущимДанным
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВычетыКДоходамПереданные КАК ВычетыКДоходамПереданные
			|		ПО ВычетыКДоходамПоТекущимДанным.ФизическоеЛицо = ВычетыКДоходамПереданные.ФизическоеЛицо
			|			И ВычетыКДоходамПоТекущимДанным.Ставка = ВычетыКДоходамПереданные.Ставка
			|			И ВычетыКДоходамПоТекущимДанным.КБК = ВычетыКДоходамПереданные.КБК
			|			И ВычетыКДоходамПоТекущимДанным.Период = ВычетыКДоходамПереданные.Период
			|			И ВычетыКДоходамПоТекущимДанным.П000П1М500002 = ВычетыКДоходамПереданные.П000П1М500002
			|			И ВычетыКДоходамПоТекущимДанным.П000П1М600004 = ВычетыКДоходамПереданные.П000П1М600004
			|			И ВычетыКДоходамПоТекущимДанным.П000П1М600005 = ВычетыКДоходамПереданные.П000П1М600005
			|ГДЕ
			|	ВычетыКДоходамПереданные.ФизическоеЛицо ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВычетыКДоходамПоТекущимДанным.ФизическоеЛицо
			|ИЗ
			|	ВТВычетыКДоходамПереданные КАК ВычетыКДоходамПоТекущимДанным
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВычетыКДоходамПоТекущимДанным КАК ВычетыКДоходамПереданные
			|		ПО ВычетыКДоходамПоТекущимДанным.ФизическоеЛицо = ВычетыКДоходамПереданные.ФизическоеЛицо
			|			И ВычетыКДоходамПоТекущимДанным.Ставка = ВычетыКДоходамПереданные.Ставка
			|			И ВычетыКДоходамПоТекущимДанным.КБК = ВычетыКДоходамПереданные.КБК
			|			И ВычетыКДоходамПоТекущимДанным.Период = ВычетыКДоходамПереданные.Период
			|			И ВычетыКДоходамПоТекущимДанным.П000П1М500002 = ВычетыКДоходамПереданные.П000П1М500002
			|			И ВычетыКДоходамПоТекущимДанным.П000П1М600004 = ВычетыКДоходамПереданные.П000П1М600004
			|			И ВычетыКДоходамПоТекущимДанным.П000П1М600005 = ВычетыКДоходамПереданные.П000П1М600005
			|ГДЕ
			|	ВычетыКДоходамПереданные.ФизическоеЛицо ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СведенияОВычетах.ФизическоеЛицо
			|ИЗ
			|	ВТВычетыПоТекущимДанным КАК СведенияОВычетах
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВычетыПереданные КАК ВычетыПереданные
			|		ПО СведенияОВычетах.ФизическоеЛицо = ВычетыПереданные.ФизическоеЛицо
			|			И СведенияОВычетах.Ставка = ВычетыПереданные.Ставка
			|			И СведенияОВычетах.КБК = ВычетыПереданные.КБК
			|			И СведенияОВычетах.П000П1М200001 = ВычетыПереданные.П000П1М200001
			|			И СведенияОВычетах.П000П1М200002 = ВычетыПереданные.П000П1М200002
			|ГДЕ
			|	ВычетыПереданные.ФизическоеЛицо ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВычетыПереданные.ФизическоеЛицо
			|ИЗ
			|	ВТВычетыПереданные КАК ВычетыПереданные
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВычетыПоТекущимДанным КАК СведенияОВычетах
			|		ПО (СведенияОВычетах.ФизическоеЛицо = ВычетыПереданные.ФизическоеЛицо)
			|			И (СведенияОВычетах.Ставка = ВычетыПереданные.Ставка)
			|			И (СведенияОВычетах.КБК = ВычетыПереданные.КБК)
			|			И (СведенияОВычетах.П000П1М200001 = ВычетыПереданные.П000П1М200001)
			|			И (СведенияОВычетах.П000П1М200002 = ВычетыПереданные.П000П1М200002)
			|ГДЕ
			|	СведенияОВычетах.ФизическоеЛицо ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СведенияОВычетах.ФизическоеЛицо
			|ИЗ
			|	ВТУведомленияОВычетахПоТекущимДанным КАК СведенияОВычетах
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУведомленияОВычетахПереданные КАК ВычетыПереданные
			|		ПО СведенияОВычетах.ФизическоеЛицо = ВычетыПереданные.ФизическоеЛицо
			|			И СведенияОВычетах.ГруппаВычета = ВычетыПереданные.ГруппаВычета
			|			И СведенияОВычетах.НомерУведомления = ВычетыПереданные.П000П1М300002
			|			И СведенияОВычетах.ДатаУведомления = ВычетыПереданные.П000П1М300003
			|			И СведенияОВычетах.КодНалоговогоОрганаУведомления = ВычетыПереданные.П000П1М300004
			|ГДЕ
			|	ВычетыПереданные.ФизическоеЛицо ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВычетыПереданные.ФизическоеЛицо
			|ИЗ
			|	ВТУведомленияОВычетахПереданные КАК ВычетыПереданные
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУведомленияОВычетахПоТекущимДанным КАК СведенияОВычетах
			|		ПО (СведенияОВычетах.ФизическоеЛицо = ВычетыПереданные.ФизическоеЛицо)
			|			И (СведенияОВычетах.ГруппаВычета = ВычетыПереданные.ГруппаВычета)
			|			И (СведенияОВычетах.НомерУведомления = ВычетыПереданные.П000П1М300002)
			|			И (СведенияОВычетах.ДатаУведомления = ВычетыПереданные.П000П1М300003)
			|			И (СведенияОВычетах.КодНалоговогоОрганаУведомления = ВычетыПереданные.П000П1М300004)
			|ГДЕ
			|	СведенияОВычетах.ФизическоеЛицо ЕСТЬ NULL
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ФизическоеЛицо
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(ФизлицаПереданные.НомерСправки, 0) КАК НомерСправки,
			|	ЕСТЬNULL(ФизлицаПереданные.НомерКорректировки, 0) КАК НомерКорректировки,
			|	КадровыеДанныеФизЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
			|	КадровыеДанныеФизЛиц.ИНН КАК ИНН,
			|	КадровыеДанныеФизЛиц.Фамилия КАК Фамилия,
			|	КадровыеДанныеФизЛиц.Имя КАК Имя,
			|	КадровыеДанныеФизЛиц.Отчество КАК Отчество,
			|	КадровыеДанныеФизЛиц.ДатаРождения КАК ДатаРождения,
			|	КадровыеДанныеФизЛиц.СерияДокумента КАК СерияДокумента,
			|	КадровыеДанныеФизЛиц.НомерДокумента КАК НомерДокумента,
			|	КадровыеДанныеФизЛиц.Наименование КАК Наименование,
			|	КадровыеДанныеФизЛиц.КодСтраныДляОтчетности КАК КодСтраныДляОтчетности,
			|	КадровыеДанныеФизЛиц.КодФНС КАК КодФНС,
			|	КадровыеДанныеФизЛиц.КодМВД КАК КодМВД
			|ПОМЕСТИТЬ ВТДанныеНалогоплательщиков
			|ИЗ
			|	ВТФизлицаПоТекущимДанным КАК КадровыеДанныеФизЛиц
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаВОтчет КАК ФизлицаВОтчет
			|		ПО КадровыеДанныеФизЛиц.ФизическоеЛицо = ФизлицаВОтчет.ФизическоеЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогоплательщикиПереданные КАК ФизлицаПереданные
			|		ПО КадровыеДанныеФизЛиц.ФизическоеЛицо = ФизлицаПереданные.ФизическоеЛицо
			|ГДЕ
			|	ФизлицаВОтчет.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ФизлицаПереданные.НомерСправки,
			|	99,
			|	ФизлицаПереданные.ФизическоеЛицо,
			|	ФизлицаПереданные.ИНН,
			|	ФизлицаПереданные.Фамилия,
			|	ФизлицаПереданные.Имя,
			|	ФизлицаПереданные.Отчество,
			|	ФизлицаПереданные.ДатаРождения,
			|	ФизлицаПереданные.СерияДокумента,
			|	ФизлицаПереданные.НомерДокумента,
			|	ФизлицаПереданные.Фамилия + "" "" + ФизлицаПереданные.Имя + "" "" + ФизлицаПереданные.Отчество,
			|	ФизлицаПереданные.КодСтраныДляОтчетности,
			|	ФизлицаПереданные.КодФНС,
			|	ФизлицаПереданные.КодМВД
			|ИЗ
			|	ВТНалогоплательщикиПереданные КАК ФизлицаПереданные
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаПоТекущимДанным КАК ФизлицаПоТекущимДанным
			|		ПО ФизлицаПереданные.ФизическоеЛицо = ФизлицаПоТекущимДанным.ФизическоеЛицо
			|			И ФизлицаПереданные.ИНН = ФизлицаПоТекущимДанным.ИНН
			|			И ФизлицаПереданные.Фамилия = ФизлицаПоТекущимДанным.Фамилия
			|			И ФизлицаПереданные.Имя = ФизлицаПоТекущимДанным.Имя
			|			И ФизлицаПереданные.Отчество = ФизлицаПоТекущимДанным.Отчество
			|			И ФизлицаПереданные.ДатаРождения = ФизлицаПоТекущимДанным.ДатаРождения
			|			И ФизлицаПереданные.КодСтраныДляОтчетности = ФизлицаПоТекущимДанным.КодСтраныДляОтчетности
			|			И ФизлицаПереданные.СерияДокумента = ФизлицаПоТекущимДанным.СерияДокумента
			|			И ФизлицаПереданные.НомерДокумента = ФизлицаПоТекущимДанным.НомерДокумента
			|			И ФизлицаПереданные.КодФНС = ФизлицаПоТекущимДанным.КодФНС
			|			И ФизлицаПереданные.КодМВД = ФизлицаПоТекущимДанным.КодМВД
			|ГДЕ
			|	ФизлицаПоТекущимДанным.ФизическоеЛицо ЕСТЬ NULL
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеНалогоплательщиков.НомерСправки КАК НомерСправки,
			|	ДанныеНалогоплательщиков.НомерКорректировки КАК НомерКорректировки,
			|	ДанныеНалогоплательщиков.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеНалогоплательщиков.ИНН КАК ИНН,
			|	ДанныеНалогоплательщиков.Фамилия КАК Фамилия,
			|	ДанныеНалогоплательщиков.Имя КАК Имя,
			|	ДанныеНалогоплательщиков.Отчество КАК Отчество,
			|	ДанныеНалогоплательщиков.ДатаРождения КАК ДатаРождения,
			|	ДанныеНалогоплательщиков.СерияДокумента КАК СерияДокумента,
			|	ДанныеНалогоплательщиков.НомерДокумента КАК НомерДокумента,
			|	ВЫРАЗИТЬ(ДанныеНалогоплательщиков.Наименование КАК СТРОКА(1000)) КАК Наименование,
			|	ДанныеНалогоплательщиков.КодСтраныДляОтчетности КАК КодСтраныДляОтчетности,
			|	ДанныеНалогоплательщиков.КодФНС КАК КодФНС,
			|	ДанныеНалогоплательщиков.КодМВД КАК КодМВД
			|ИЗ
			|	ВТДанныеНалогоплательщиков КАК ДанныеНалогоплательщиков
			|
			|УПОРЯДОЧИТЬ ПО
			|	Наименование
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(МАКСИМУМ(ДанныеНалогоплательщиков.НомерСправки), 0) КАК НомерСправки
			|ИЗ
			|	ВТНалогоплательщикиПереданные КАК ДанныеНалогоплательщиков";
			Результаты = Запрос.ВыполнитьПакет();
			// АПК:96-вкл
			ВсегоРезультатов = Результаты.Количество();
			ОписаниеТаблиц.Приложение1Налогоплательщики = Результаты[ВсегоРезультатов - 2].Выгрузить();
			МаксимальныйНомерИзПереданныхСправок = 0;
			Если Не Результаты[ВсегоРезультатов - 1].Пустой() Тогда
				Выборка = Результаты[ВсегоРезультатов - 1].Выбрать();
				Выборка.Следующий();
				МаксимальныйНомерИзПереданныхСправок = Выборка.НомерСправки;
			КонецЕсли;
			ОписаниеТаблиц.Вставить("Приложение1МаксимальныйНомерИзПереданныхСправок", МаксимальныйНомерИзПереданныхСправок + 1);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ДанныеИтогов.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеИтогов.Ставка КАК Ставка,
			|	ДанныеИтогов.КБК КАК КБК,
			|	ДанныеИтогов.П000П1М100001 КАК П000П1М100001,
			|	ДанныеИтогов.П000П1М100002 КАК П000П1М100002,
			|	ДанныеИтогов.П000П1М100003 КАК П000П1М100003,
			|	ДанныеИтогов.П000П1М100004 КАК П000П1М100004,
			|	ДанныеИтогов.П000П1М100005 КАК П000П1М100005,
			|	ДанныеИтогов.П000П1М100006 КАК П000П1М100006,
			|	ДанныеИтогов.П000П1М100007 КАК П000П1М100007,
			|	ДанныеИтогов.П000П1М100008 КАК П000П1М100008,
			|	ДанныеИтогов.П000П1М100009 КАК П000П1М100009,
			|	ДанныеИтогов.П000П1М100010 КАК П000П1М100010
			|ИЗ
			|	ВТДанныеИтоговПоТекущимДанным КАК ДанныеИтогов
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаВОтчет КАК ФизлицаВОтчет
			|		ПО ДанныеИтогов.ФизическоеЛицо = ФизлицаВОтчет.ФизическоеЛицо
			|ГДЕ
			|	ФизлицаВОтчет.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	Ставка,
			|	КБК"; 
			ОписаниеТаблиц.Приложение1Итоги = Запрос.Выполнить().Выгрузить();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходах.Ставка КАК Ставка,
			|	СведенияОДоходах.КБК КАК КБК,
			|	СведенияОДоходах.П000П1М500002 КАК П000П1М500002,
			|	СведенияОДоходах.Период КАК Период,
			|	СведенияОДоходах.П000П1М500003 КАК П000П1М500003,
			|	СведенияОДоходах.П000П1М600004 КАК П000П1М600004,
			|	СведенияОДоходах.П000П1М600005 КАК П000П1М600005
			|ИЗ
			|	ВТДоходыПоТекущимДанным КАК СведенияОДоходах
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаВОтчет КАК ФизлицаВОтчет
			|		ПО СведенияОДоходах.ФизическоеЛицо = ФизлицаВОтчет.ФизическоеЛицо
			|ГДЕ
			|	ФизлицаВОтчет.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	Ставка,
			|	КБК,
			|	Период,
			|	П000П1М500002";
			ОписаниеТаблиц.Приложение1Доходы = Запрос.Выполнить().Выгрузить();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОВычетах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОВычетах.Ставка КАК Ставка,
			|	СведенияОВычетах.КБК КАК КБК,
			|	СведенияОВычетах.ГруппаВычета КАК ГруппаВычета,
			|	СведенияОВычетах.П000П1М200001 КАК П000П1М200001,
			|	СведенияОВычетах.П000П1М200002 КАК П000П1М200002
			|ИЗ
			|	ВТВычетыПоТекущимДанным КАК СведенияОВычетах
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаВОтчет КАК ФизлицаВОтчет
			|		ПО СведенияОВычетах.ФизическоеЛицо = ФизлицаВОтчет.ФизическоеЛицо
			|ГДЕ
			|	ФизлицаВОтчет.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	Ставка,
			|	КБК";
			ОписаниеТаблиц.Приложение1Вычеты = Запрос.Выполнить().Выгрузить();
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВременнаяТаблица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВременнаяТаблица.ГруппаВычета КАК ГруппаВычета,
			|	ВременнаяТаблица.НомерУведомления КАК П000П1М300002,
			|	ВременнаяТаблица.ДатаУведомления КАК П000П1М300003,
			|	ВременнаяТаблица.КодНалоговогоОрганаУведомления КАК П000П1М300004
			|ИЗ
			|	ВТУведомленияОВычетахПоТекущимДанным КАК ВременнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаВОтчет КАК ФизлицаВОтчет
			|		ПО ВременнаяТаблица.ФизическоеЛицо = ФизлицаВОтчет.ФизическоеЛицо
			|ГДЕ
			|	ФизлицаВОтчет.ФизическоеЛицо ЕСТЬ НЕ NULL"; 
			ОписаниеТаблиц.Приложение1УведомленияОВычетах = Запрос.Выполнить().Выгрузить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчетПоказателей_6НДФЛ_2021Кв1(НачалоПериода, ОкончаниеПериода, ДатаПодписи, Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц, ПодробныеДанные, НомерКорректировки)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
	Запрос.УстановитьПараметр("НачалоПредыдущегоГода", ДобавитьМесяц(НачалоПериода, -12));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(НачалоПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("ДатаПодписи", КонецДня(ДатаПодписи));
	Запрос.УстановитьПараметр("КБКсПревышения", "18210102080011000110");
	Запрос.УстановитьПараметр("ОсновнойКБК", "18210102010011000110");
	Запрос.УстановитьПараметр("КБКПоОблигациям", "18210102070011000110");
	Запрос.УстановитьПараметр("НачалоОтчетногоКвартала", НачалоКвартала(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериодаОсмотраДоходовВычетов", ?(КонецГода(ОкончаниеПериода) = ОкончаниеПериода Или ЗначениеЗаполнено(НомерКорректировки), Макс(ДатаПодписи, ОкончаниеПериода), ОкончаниеПериода));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда) КАК КатегорияДохода,
	|	&ОсновнойКБК КАК КБК
	|ПОМЕСТИТЬ ВТСоответствиеКатегорийКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходВНатуральнойФормеОтТрудовойДеятельности),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеНатуральныеДоходы),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходы),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке03),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке05),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке06),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке07),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке10),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке15),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходыПредыдущихРедакций),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыОтДолевогоУчастия),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоВыигрышам),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЦБ),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыРЕПО),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЗаймЦБ),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыИИС),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоОблигациям),
	|	&КБКПоОблигациям";
	Запрос.Выполнить();
	
	Если ОписаниеТаблиц.Свойство("Раздел1Налоги") Или ОписаниеТаблиц.Свойство("Раздел2Налоги") Или ОписаниеТаблиц.Свойство("Раздел1Возвраты") Или ОписаниеТаблиц.Свойство("Приложение1Итоги") Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода КАК КатегорияДохода,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор КАК Регистратор,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК ДатаПолученияДохода,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВариантУдержания КАК ВариантУдержания,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения КАК ВидДвижения,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СрокПеречисления КАК СрокПеречисления,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма КАК Сумма,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения КАК СуммаСПревышения,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период КАК Период,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период КАК ДатаУдержания,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование КАК ДокументОснование,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КрайнийСрокУплаты КАК КрайнийСрокУплаты,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РасчетМежрасчетногоПериода КАК РасчетМежрасчетногоПериода,
		|	СоответствиеКатегорийКБК.КБК КАК КБК,
		|	ВЫБОР
		|		КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
		|			ТОГДА ВЫБОР
		|					КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов = 0
		|						ТОГДА 0
		|					КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов > 0
		|							И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения > 0
		|						ТОГДА ВЫБОР
		|								КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения >= РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов
		|									ТОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов
		|								ИНАЧЕ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения
		|							КОНЕЦ
		|					КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов < 0
		|							И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения < 0
		|						ТОГДА ВЫБОР
		|								КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения <= РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов
		|									ТОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов
		|								ИНАЧЕ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НалогНаПрибыльДляДивидендов
		|ПОМЕСТИТЬ ВТНалоги
		|ИЗ
		|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеКатегорийКБК КАК СоответствиеКатегорийКБК
		|		ПО РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода = СоответствиеКатегорийКБК.КатегорияДохода
		|ГДЕ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане В(&РегистрацияВНалоговомОргане)
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И (РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма <> 0
		|			ИЛИ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения <> 0)";
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел1Налоги") Тогда
		
		Если НачалоКвартала(ОкончаниеПериода) = '20210101' Тогда
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СтрокиНалогов.КБК КАК КБК,
			|	СтрокиНалогов.Регистратор КАК Регистратор,
			|	СтрокиНалогов.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СтрокиНалогов.КрайнийСрокУплаты КАК СрокПеречисленияНалога,
			|	СтрокиНалогов.КрайнийСрокУплаты КАК П00001М102101,
			|	СтрокиНалогов.Сумма КАК П00001М102201
			|ПОМЕСТИТЬ ВТСтрокиНалогов
			|ИЗ
			|	ВТНалоги КАК СтрокиНалогов
			|ГДЕ
			|	СтрокиНалогов.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И СтрокиНалогов.ДатаУдержания МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&КБКсПревышения,
			|	СтрокиНалогов.Регистратор,
			|	СтрокиНалогов.ФизическоеЛицо,
			|	СтрокиНалогов.КрайнийСрокУплаты,
			|	СтрокиНалогов.КрайнийСрокУплаты,
			|	СтрокиНалогов.СуммаСПревышения
			|ИЗ
			|	ВТНалоги КАК СтрокиНалогов
			|ГДЕ
			|	СтрокиНалогов.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И СтрокиНалогов.ДатаУдержания МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СтрокиНалогов.КБК,
			|	СтрокиНалогов.Регистратор,
			|	СтрокиНалогов.ФизическоеЛицо,
			|	СтрокиНалогов.КрайнийСрокУплаты,
			|	СтрокиНалогов.КрайнийСрокУплаты,
			|	СтрокиНалогов.Сумма
			|ИЗ
			|	ВТНалоги КАК СтрокиНалогов
			|ГДЕ
			|	СтрокиНалогов.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И СтрокиНалогов.КрайнийСрокУплаты >= ДАТАВРЕМЯ(2021, 1, 1, 0, 0, 0)
			|	И СтрокиНалогов.ДатаУдержания < ДАТАВРЕМЯ(2021, 1, 1, 0, 0, 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НалогиПоДатам.КБК КАК КБК,
			|	НалогиПоДатам.Регистратор КАК Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НалогиПоДатам.СрокПеречисленияНалога КАК СрокПеречисленияНалога,
			|	НалогиПоДатам.П00001М102101 КАК П00001М102101,
			|	СУММА(НалогиПоДатам.П00001М102201) КАК П00001М102201
			|ИЗ
			|	ВТСтрокиНалогов КАК НалогиПоДатам
			|
			|СГРУППИРОВАТЬ ПО
			|	НалогиПоДатам.КБК,
			|	НалогиПоДатам.Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо,
			|	НалогиПоДатам.СрокПеречисленияНалога,
			|	НалогиПоДатам.П00001М102101
			|
			|ИМЕЮЩИЕ
			|	СУММА(НалогиПоДатам.П00001М102201) > 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	СрокПеречисленияНалога";
			
		Иначе
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	НалогиПоДатам.КБК КАК КБК,
			|	НалогиПоДатам.Регистратор КАК Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НалогиПоДатам.КрайнийСрокУплаты КАК СрокПеречисленияНалога,
			|	НалогиПоДатам.КрайнийСрокУплаты КАК П00001М102101,
			|	СУММА(НалогиПоДатам.Сумма) КАК П00001М102201
			|ИЗ
			|	ВТНалоги КАК НалогиПоДатам
			|ГДЕ
			|	НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И НалогиПоДатам.ДатаУдержания МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
			|
			|СГРУППИРОВАТЬ ПО
			|	НалогиПоДатам.КБК,
			|	НалогиПоДатам.Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо,
			|	НалогиПоДатам.КрайнийСрокУплаты,
			|	НалогиПоДатам.КрайнийСрокУплаты
			|
			|ИМЕЮЩИЕ
			|	СУММА(НалогиПоДатам.Сумма) > 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&КБКсПревышения,
			|	НалогиПоДатам.Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо,
			|	НалогиПоДатам.КрайнийСрокУплаты,
			|	НалогиПоДатам.КрайнийСрокУплаты,
			|	СУММА(НалогиПоДатам.СуммаСПревышения)
			|ИЗ
			|	ВТНалоги КАК НалогиПоДатам
			|ГДЕ
			|	НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И НалогиПоДатам.ДатаУдержания МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
			|
			|СГРУППИРОВАТЬ ПО
			|	НалогиПоДатам.Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо,
			|	НалогиПоДатам.КрайнийСрокУплаты,
			|	НалогиПоДатам.КрайнийСрокУплаты
			|
			|ИМЕЮЩИЕ
			|	СУММА(НалогиПоДатам.СуммаСПревышения) > 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	СрокПеречисленияНалога";
			
		КонецЕсли;
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
			МассивПолей.Добавить("Регистратор");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "НалогиПоДатам");
		ОписаниеТаблиц.Раздел1Налоги = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел1Возвраты") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	НалогиПоДатам.КБК КАК КБК,
		|	НалогиПоДатам.Регистратор КАК Регистратор,
		|	НалогиПоДатам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НалогиПоДатам.Период КАК ДатаВозврата,
		|	НалогиПоДатам.Период КАК П00001М203101,
		|	-СУММА(НалогиПоДатам.Сумма) КАК П00001М203201
		|ИЗ
		|	ВТНалоги КАК НалогиПоДатам
		|ГДЕ
		|	НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|	И НалогиПоДатам.Период МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	НалогиПоДатам.КБК,
		|	НалогиПоДатам.Регистратор,
		|	НалогиПоДатам.ФизическоеЛицо,
		|	НалогиПоДатам.Период,
		|	НалогиПоДатам.Период
		|
		|ИМЕЮЩИЕ
		|	СУММА(НалогиПоДатам.Сумма) < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&КБКсПревышения,
		|	НалогиПоДатам.Регистратор,
		|	НалогиПоДатам.ФизическоеЛицо,
		|	НалогиПоДатам.Период,
		|	НалогиПоДатам.Период,
		|	-СУММА(НалогиПоДатам.СуммаСПревышения)
		|ИЗ
		|	ВТНалоги КАК НалогиПоДатам
		|ГДЕ
		|	НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|	И НалогиПоДатам.Период МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	НалогиПоДатам.Регистратор,
		|	НалогиПоДатам.ФизическоеЛицо,
		|	НалогиПоДатам.Период,
		|	НалогиПоДатам.Период
		|
		|ИМЕЮЩИЕ
		|	СУММА(НалогиПоДатам.СуммаСПревышения) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВозврата";
		
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
			МассивПолей.Добавить("Регистратор");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "НалогиПоДатам");
		ОписаниеТаблиц.Раздел1Возвраты = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел2Доходы") Или ОписаниеТаблиц.Свойство("Раздел2Вычеты") Или ОписаниеТаблиц.Свойство("КоличествоПолучателейДохода") 
		Или ОписаниеТаблиц.Свойство("Приложение1Доходы") Или ОписаниеТаблиц.Свойство("Приложение1Вычеты") Тогда
		
		ПараметрыРасчетаНДФЛПоПрогрессивнойШкале = УчетНДФЛ.ПараметрыРасчетаНДФЛПоПрогрессивнойШкале();
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизическиеЛицаОтчета
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
		|ГДЕ
		|	СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|	И (СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ИЛИ СведенияОДоходахНДФЛ.Регистратор <> СведенияОДоходахНДФЛ.ДокументОснование)
		|	И СведенияОДоходахНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане В(&РегистрацияВНалоговомОргане)
		|	И НЕ СведенияОДоходахНДФЛ.КодДохода.НеОблагаетсяУНалоговогоАгента
		|	И СведенияОДоходахНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо
		|
		|ИМЕЮЩИЕ
		|	(СУММА(СведенияОДоходахНДФЛ.СуммаДохода) <> 0
		|		ИЛИ СУММА(СведенияОДоходахНДФЛ.СуммаВычета) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК Период,
		|	СведенияОДоходахНДФЛ.КатегорияДохода КАК КатегорияДохода,
		|	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
		|	СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента
		|ПОМЕСТИТЬ ВТСтрокиДоходов
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
		|ГДЕ
		|	СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|	И (СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ИЛИ СведенияОДоходахНДФЛ.Регистратор <> СведенияОДоходахНДФЛ.ДокументОснование)
		|	И СведенияОДоходахНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И НЕ СведенияОДоходахНДФЛ.КодДохода.НеОблагаетсяУНалоговогоАгента
		|	И СведенияОДоходахНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И СведенияОДоходахНДФЛ.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				ФизическиеЛицаОтчета.ФизическоеЛицо КАК ФизическоеЛицо
		|			ИЗ
		|				ВТФизическиеЛицаОтчета КАК ФизическиеЛицаОтчета)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
		|	СведенияОДоходахНДФЛ.КатегорияДохода,
		|	СведенияОДоходахНДФЛ.КодДохода,
		|	СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента
		|
		|ИМЕЮЩИЕ
		|	(СУММА(СведенияОДоходахНДФЛ.СуммаДохода) <> 0
		|		ИЛИ СУММА(СведенияОДоходахНДФЛ.СуммаВычета) <> 0)";
		Запрос.Выполнить();
		
		УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента(Запрос.МенеджерВременныхТаблиц, "ВТСтрокиДоходов", "УчитыватьИзмененияСтатусаДляОтчетности", ОкончаниеПериода);
		
		Запрос.УстановитьПараметр("ОсновнаяНалоговаяБаза", Перечисления.КатегорииДоходовНДФЛ.ОсновнаяНалоговаяБаза());
		Запрос.УстановитьПараметр("Предел", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел);
		Запрос.УстановитьПараметр("СтавкаСПревышения", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Ставка);
		Запрос.УстановитьПараметр("СтавкаЧисломСПревышения", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.СтавкаЧислом * 100);
		Запрос.УстановитьПараметр("ГодПериода", Год(ОкончаниеПериода));
			
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаЧислом * 100 КАК СтавкаНалога,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ КАК Ставка,
		|	ВЫБОР
		|		КОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ <> ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
		|		КОГДА СведенияОДоходахНДФЛ.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
		|		КОГДА СведенияОДоходахНДФЛ.КатегорияДохода В (&ОсновнаяНалоговаяБаза)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
		|		ИНАЧЕ СведенияОДоходахНДФЛ.КатегорияДохода
		|	КОНЕЦ КАК НалоговаяБаза,
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК Период,
		|	СведенияОДоходахНДФЛ.КатегорияДохода КАК КатегорияДохода,
		|	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
		|	СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
		|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода) КАК СуммаДохода,
		|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
		|	СведенияОДоходахНДФЛ.Начисление КАК Начисление,
		|	ВЫБОР
		|		КОГДА СведенияОДоходахНДФЛ.СуммаВычета = 0
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
		|		ИНАЧЕ СведенияОДоходахНДФЛ.КодВычета
		|	КОНЕЦ КАК КодВычета,
		|	СУММА(СведенияОДоходахНДФЛ.СуммаВычета) КАК СуммаВычета,
		|	СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ КАК ИсточникДоходаЗаПределамиРФ,
		|	СоответствиеКатегорийКБК.КБК КАК КБК,
		|	СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане В (&РегистрацияВНалоговомОргане) КАК ДанныеДляОтчета,
		|	СведенияОДоходахНДФЛ.СтрокаРаздела2Расчета6НДФЛ КАК СтрокаРаздела2
		|ПОМЕСТИТЬ ВТДоходыПоСтавкам
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеКатегорийКБК КАК СоответствиеКатегорийКБК
		|		ПО СведенияОДоходахНДФЛ.КатегорияДохода = СоответствиеКатегорийКБК.КатегорияДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
		|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
		|			И СведенияОДоходахНДФЛ.ДатаПолученияДохода = СтавкаНДФЛПоСтавкеРезидента.Период
		|			И СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
		|			И СведенияОДоходахНДФЛ.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
		|ГДЕ
		|	СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|	И СведенияОДоходахНДФЛ.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				ФизическиеЛицаОтчета.ФизическоеЛицо КАК ФизическоеЛицо
		|			ИЗ
		|				ВТФизическиеЛицаОтчета КАК ФизическиеЛицаОтчета)
		|	И (СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ИЛИ СведенияОДоходахНДФЛ.Регистратор <> СведенияОДоходахНДФЛ.ДокументОснование)
		|	И СведенияОДоходахНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И НЕ СведенияОДоходахНДФЛ.КодДохода.НеОблагаетсяУНалоговогоАгента
		|	И СведенияОДоходахНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И (СведенияОДоходахНДФЛ.СуммаДохода <> 0
		|			ИЛИ СведенияОДоходахНДФЛ.СуммаВычета <> 0)
		|	И (НЕ СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ
		|			ИЛИ СтавкаНДФЛПоСтавкеРезидента.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаЧислом,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ,
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
		|	СведенияОДоходахНДФЛ.КатегорияДохода,
		|	СведенияОДоходахНДФЛ.КодДохода,
		|	СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента,
		|	СведенияОДоходахНДФЛ.Регистратор,
		|	СведенияОДоходахНДФЛ.Начисление,
		|	СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ,
		|	СоответствиеКатегорийКБК.КБК,
		|	СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане В (&РегистрацияВНалоговомОргане),
		|	ВЫБОР
		|		КОГДА СведенияОДоходахНДФЛ.СуммаВычета = 0
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
		|		ИНАЧЕ СведенияОДоходахНДФЛ.КодВычета
		|	КОНЕЦ,
		|	СведенияОДоходахНДФЛ.СтрокаРаздела2Расчета6НДФЛ
		|
		|ИМЕЮЩИЕ
		|	(СУММА(СведенияОДоходахНДФЛ.СуммаДохода) <> 0
		|		ИЛИ СУММА(СведенияОДоходахНДФЛ.СуммаВычета) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Регистратор КАК Регистратор,
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.КодВычета КАК КодВычета,
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Сумма КАК Сумма,
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.РегистрацияВНалоговомОргане В (&РегистрацияВНалоговомОргане) КАК ДанныеДляОтчета
		|ПОМЕСТИТЬ ВТСтандартныеИмущественныеВычеты
		|ИЗ
		|	РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ КАК ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ
		|ГДЕ
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериодаОсмотраДоходовВычетов
		|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Сумма <> 0
		|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				ФизическиеЛицаОтчета.ФизическоеЛицо КАК ФизическоеЛицо
		|			ИЗ
		|				ВТФизическиеЛицаОтчета КАК ФизическиеЛицаОтчета)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИмущественныеВычетыНДФЛ.Регистратор,
		|	ИмущественныеВычетыНДФЛ.ФизическоеЛицо,
		|	ИмущественныеВычетыНДФЛ.КодВычета,
		|	ИмущественныеВычетыНДФЛ.Сумма,
		|	ИмущественныеВычетыНДФЛ.Период,
		|	ИмущественныеВычетыНДФЛ.РегистрацияВНалоговомОргане В (&РегистрацияВНалоговомОргане)
		|ИЗ
		|	РегистрНакопления.ИмущественныеВычетыНДФЛ КАК ИмущественныеВычетыНДФЛ
		|ГДЕ
		|	ИмущественныеВычетыНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериода
		|	И ИмущественныеВычетыНДФЛ.МесяцРегистрации <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|	И ИмущественныеВычетыНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И ИмущественныеВычетыНДФЛ.Сумма <> 0
		|	И ИмущественныеВычетыНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ИмущественныеВычетыНДФЛ.Год = &ГодПериода
		|	И ИмущественныеВычетыНДФЛ.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				ФизическиеЛицаОтчета.ФизическоеЛицо КАК ФизическоеЛицо
		|			ИЗ
		|				ВТФизическиеЛицаОтчета КАК ФизическиеЛицаОтчета)";
		УстановитьПривилегированныйРежим(Истина);
		Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	База.ФизическоеЛицо КАК ФизическоеЛицо,
		|	База.НалоговаяБаза КАК НалоговаяБаза
		|ПОМЕСТИТЬ ВТСотрудникиСПревышением
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
		|		ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
		|		ДоходыПоСтавкам.СуммаДохода - ДоходыПоСтавкам.СуммаВычета КАК ОблагаемаяБаза
		|	ИЗ
		|		ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
		|	ГДЕ
		|		ДоходыПоСтавкам.НалоговаяБаза <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СтандартныеИмущественныеВычеты.ФизическоеЛицо,
		|		ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда),
		|		-СтандартныеИмущественныеВычеты.Сумма
		|	ИЗ
		|		ВТСтандартныеИмущественныеВычеты КАК СтандартныеИмущественныеВычеты) КАК База
		|
		|СГРУППИРОВАТЬ ПО
		|	База.ФизическоеЛицо,
		|	База.НалоговаяБаза
		|
		|ИМЕЮЩИЕ
		|	СУММА(База.ОблагаемаяБаза) > &Предел";
		
		Если Запрос.Выполнить().Выгрузить()[0].Количество > 0 Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.Период КАК Период,
			|	НАЧАЛОПЕРИОДА(СведенияОДоходахНДФЛ.Период, МЕСЯЦ) КАК НачалоМесяца,
			|	СведенияОДоходахНДФЛ.НалоговаяБаза КАК НалоговаяБаза,
			|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода - СведенияОДоходахНДФЛ.СуммаВычета) КАК ОблагаемыйДоход,
			|	0 КАК ОблагаемыйДоходСНачалаГода,
			|	ЛОЖЬ КАК ЭтоДеньПревышенияПредела,
			|	ЛОЖЬ КАК ПределПревышен
			|ИЗ
			|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
			|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
			|			И СведенияОДоходахНДФЛ.НалоговаяБаза = СотрудникиСПревышением.НалоговаяБаза
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.Период,
			|	СведенияОДоходахНДФЛ.НалоговаяБаза
			|
			|ИМЕЮЩИЕ
			|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода - СведенияОДоходахНДФЛ.СуммаВычета) <> 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	НалоговаяБаза,
			|	Период";
			ТаблицаРасчетаНарастающимИтогом = Запрос.Выполнить().Выгрузить();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СУММА(СтандартныеИмущественныеВычеты.Сумма) КАК Сумма,
			|	НАЧАЛОПЕРИОДА(СтандартныеИмущественныеВычеты.МесяцНалоговогоПериода, МЕСЯЦ) КАК НачалоМесяца
			|ИЗ
			|	ВТСтандартныеИмущественныеВычеты КАК СтандартныеИмущественныеВычеты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
			|		ПО СтандартныеИмущественныеВычеты.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
			|			И (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда) = СотрудникиСПревышением.НалоговаяБаза)
			|
			|СГРУППИРОВАТЬ ПО
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо,
			|	НАЧАЛОПЕРИОДА(СтандартныеИмущественныеВычеты.МесяцНалоговогоПериода, МЕСЯЦ)";
			ТаблицаВычетов = Запрос.Выполнить().Выгрузить();
			ИскатьВычеты = ТаблицаВычетов.Количество() > 0;
			Если ИскатьВычеты И ТаблицаВычетов.Количество() > 100 Тогда
				ТаблицаВычетов.Индексы.Добавить("ФизическоеЛицо,НачалоМесяца");
			КонецЕсли;
			ПоискВычетов = Новый Структура("ФизическоеЛицо,НачалоМесяца");
			
			// Расчет облагаемого дохода нарастающим итогом с учетом всех вычетов для каждой даты получения дохода.
			ОблагаемыйДоходСНачалаГода = 0;
			ТекущееФизлицо = Неопределено;
			ТекущаяНалоговаяБаза = Неопределено;
			ТекущееНачалоМесяца = Неопределено;
			Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
				Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Тогда
					ОблагаемыйДоходСНачалаГода = 0;
					ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
					ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
					ТекущееНачалоМесяца = Неопределено;
				КонецЕсли;
				// Стандартные, имущественные вычеты учтем один раз за каждый месяц - в первую дату получения дохода месяца.
				ПредоставленныеВычеты = 0;
				Если ИскатьВычеты И СтрокаТаблицы.НалоговаяБаза = Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда И ТекущееНачалоМесяца <> СтрокаТаблицы.НачалоМесяца Тогда
					ЗаполнитьЗначенияСвойств(ПоискВычетов, СтрокаТаблицы);
					СтрокиВычетов = ТаблицаВычетов.НайтиСтроки(ПоискВычетов);
					Если СтрокиВычетов.Количество() > 0 Тогда
						ПредоставленныеВычеты = СтрокиВычетов[0].Сумма;
					КонецЕсли;
					ТекущееНачалоМесяца = СтрокаТаблицы.НачалоМесяца;
				КонецЕсли;
				СтрокаТаблицы.ЭтоДеньПревышенияПредела = ОблагаемыйДоходСНачалаГода < ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел И ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты > ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел;
				ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты;
				СтрокаТаблицы.ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода;
				СтрокаТаблицы.ПределПревышен = ОблагаемыйДоходСНачалаГода > ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел;
			КонецЦикла;
			
			Запрос.УстановитьПараметр("РасчетНарастающимИтогом", ТаблицаРасчетаНарастающимИтогом); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасчетНарастающимИтогом.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасчетНарастающимИтогом.Период КАК Период,
			|	РасчетНарастающимИтогом.НалоговаяБаза КАК НалоговаяБаза,
			|	РасчетНарастающимИтогом.ОблагаемыйДоход КАК ОблагаемыйДоход,
			|	РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
			|	РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела КАК ЭтоДеньПревышенияПредела,
			|	РасчетНарастающимИтогом.ПределПревышен КАК ПределПревышен
			|ПОМЕСТИТЬ ВТРасчетНарастающимИтогом
			|ИЗ
			|	&РасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоходыПоСтавкам.СтавкаНалога КАК СтавкаНалога,
			|	ДоходыПоСтавкам.Ставка КАК Ставка,
			|	ДоходыПоСтавкам.Регистратор КАК Регистратор,
			|	ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыПоСтавкам.Начисление КАК Начисление,
			|	ДоходыПоСтавкам.Период КАК Период,
			|	ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыПоСтавкам.КатегорияДохода КАК КатегорияДохода,
			|	ДоходыПоСтавкам.КБК КАК КБК,
			|	ДоходыПоСтавкам.ДанныеДляОтчета КАК ДанныеДляОтчета,
			|	ДоходыПоСтавкам.КодДохода КАК КодДохода,
			|	ДоходыПоСтавкам.СуммаДохода КАК СуммаДохода,
			|	ДоходыПоСтавкам.КодВычета КАК КодВычета,
			|	ДоходыПоСтавкам.СуммаВычета КАК СуммаВычета,
			|	ДоходыПоСтавкам.СтрокаРаздела2 КАК СтрокаРаздела2,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода, 0) КАК ОблагаемыйДоходСНачалаГода,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела, ЛОЖЬ) КАК ЭтоДеньПревышенияПредела,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ПределПревышен, ЛОЖЬ) КАК ПределПревышен,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоход, 0) КАК ОблагаемыйДоходЗаДень
			|ПОМЕСТИТЬ ВТРасширенныеДанныеОДоходах
			|ИЗ
			|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|		ПО ДоходыПоСтавкам.ФизическоеЛицо = РасчетНарастающимИтогом.ФизическоеЛицо
			|			И ДоходыПоСтавкам.Период = РасчетНарастающимИтогом.Период
			|			И ДоходыПоСтавкам.НалоговаяБаза = РасчетНарастающимИтогом.НалоговаяБаза
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасширенныеДанныеОДоходах.СтавкаНалога КАК СтавкаНалога,
			|	РасширенныеДанныеОДоходах.Ставка КАК Ставка,
			|	РасширенныеДанныеОДоходах.Регистратор КАК Регистратор,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Начисление КАК Начисление,
			|	РасширенныеДанныеОДоходах.Период КАК Период,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.СтрокаРаздела2 КАК СтрокаРаздела2,
			|	РасширенныеДанныеОДоходах.КБК КАК КБК,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода) КАК СуммаДохода,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаВычета) КАК СуммаВычета,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода - РасширенныеДанныеОДоходах.СуммаВычета) КАК ОблагаемаяСумма,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень КАК ОблагаемыйДоходЗаДень,
			|	РасширенныеДанныеОДоходах.ДанныеДляОтчета КАК ДанныеДляОтчета
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
			|
			|СГРУППИРОВАТЬ ПО
			|	РасширенныеДанныеОДоходах.СтавкаНалога,
			|	РасширенныеДанныеОДоходах.Ставка,
			|	РасширенныеДанныеОДоходах.Регистратор,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Начисление,
			|	РасширенныеДанныеОДоходах.Период,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.КатегорияДохода,
			|	РасширенныеДанныеОДоходах.КБК,
			|	РасширенныеДанныеОДоходах.КодДохода,
			|	РасширенныеДанныеОДоходах.КодВычета,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень,
			|	РасширенныеДанныеОДоходах.ДанныеДляОтчета,
			|	РасширенныеДанныеОДоходах.СтрокаРаздела2
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	НалоговаяБаза,
			|	КодДохода";
			
			ТаблицаРасчетаНарастающимИтогом = Запрос.Выполнить().Выгрузить();
			ДоходыСУточненнымиСтавками = ТаблицаРасчетаНарастающимИтогом.СкопироватьКолонки();
			
			ТекущееФизлицо = Неопределено;
			ТекущаяНалоговаяБаза = Неопределено;
			СтрокиРаспределения = Новый Массив;
			ОблагаемыйДоходДоПредела = 0;
			Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
				Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Тогда
					Если ОблагаемыйДоходДоПредела <> 0 Тогда
						ВыделитьСуммыПревышенияПредела(ОблагаемыйДоходДоПредела, СтрокиРаспределения, ДоходыСУточненнымиСтавками)				
					КонецЕсли;
					СтрокиРаспределения = Новый Массив;
					ОблагаемыйДоходДоПредела = 0;
					ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
					ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
				КонецЕсли;
				Если ОблагаемыйДоходДоПредела = 0 Тогда
					ОблагаемыйДоходДоПредела = СтрокаТаблицы.ОблагаемыйДоходЗаДень - СтрокаТаблицы.ОблагаемыйДоходСНачалаГода + ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел
				КонецЕсли;
				СтрокиРаспределения.Добавить(СтрокаТаблицы);
			КонецЦикла;
			Если ОблагаемыйДоходДоПредела <> 0 Тогда
				ВыделитьСуммыПревышенияПредела(ОблагаемыйДоходДоПредела, СтрокиРаспределения, ДоходыСУточненнымиСтавками)				
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРасчетаНарастающимИтогом, ДоходыСУточненнымиСтавками); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			
			Запрос.УстановитьПараметр("ДоходыСУточненнымиСтавками", ДоходыСУточненнымиСтавками); ДоходыСУточненнымиСтавками = Неопределено;
			Запрос.Текст =
			"УНИЧТОЖИТЬ ВТДоходыПоСтавкам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.СтавкаНалога КАК СтавкаНалога,
			|	ДоходыСУточненнымиСтавками.Ставка КАК Ставка,
			|	ДоходыСУточненнымиСтавками.Регистратор КАК Регистратор,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Начисление КАК Начисление,
			|	ДоходыСУточненнымиСтавками.Период КАК Период,
			|	ДоходыСУточненнымиСтавками.ДанныеДляОтчета КАК ДанныеДляОтчета,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.КатегорияДохода КАК КатегорияДохода,
			|	ДоходыСУточненнымиСтавками.СтрокаРаздела2 КАК СтрокаРаздела2,
			|	ВЫБОР
			|		КОГДА ДоходыСУточненнымиСтавками.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
			|			ТОГДА &КБКсПревышения
			|		ИНАЧЕ ДоходыСУточненнымиСтавками.КБК
			|	КОНЕЦ КАК КБК,
			|	ДоходыСУточненнымиСтавками.КодДохода КАК КодДохода,
			|	ДоходыСУточненнымиСтавками.СуммаДохода КАК СуммаДохода,
			|	ДоходыСУточненнымиСтавками.КодВычета КАК КодВычета,
			|	ДоходыСУточненнымиСтавками.СуммаВычета КАК СуммаВычета
			|ПОМЕСТИТЬ ВТДоходыСУточненнымиСтавками
			|ИЗ
			|	&ДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
			|			ТОГДА &СтавкаЧисломСПревышения
			|		ИНАЧЕ РасширенныеДанныеОДоходах.СтавкаНалога
			|	КОНЕЦ КАК СтавкаНалога,
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
			|			ТОГДА &СтавкаСПревышения
			|		ИНАЧЕ РасширенныеДанныеОДоходах.Ставка
			|	КОНЕЦ КАК Ставка,
			|	РасширенныеДанныеОДоходах.Регистратор КАК Регистратор,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Начисление КАК Начисление,
			|	РасширенныеДанныеОДоходах.Период КАК Период,
			|	РасширенныеДанныеОДоходах.ДанныеДляОтчета КАК ДанныеДляОтчета,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.СтрокаРаздела2 КАК СтрокаРаздела2,
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
			|			ТОГДА &КБКсПревышения
			|		ИНАЧЕ РасширенныеДанныеОДоходах.КБК
			|	КОНЕЦ КАК КБК,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	РасширенныеДанныеОДоходах.СуммаДохода КАК СуммаДохода,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	РасширенныеДанныеОДоходах.СуммаВычета КАК СуммаВычета
			|ПОМЕСТИТЬ ВТДоходыПоСтавкам
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	НЕ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.СтавкаНалога,
			|	ДоходыСУточненнымиСтавками.Ставка,
			|	ДоходыСУточненнымиСтавками.Регистратор,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Начисление,
			|	ДоходыСУточненнымиСтавками.Период,
			|	ДоходыСУточненнымиСтавками.ДанныеДляОтчета,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.КатегорияДохода,
			|	ДоходыСУточненнымиСтавками.СтрокаРаздела2,
			|	ДоходыСУточненнымиСтавками.КБК,
			|	ДоходыСУточненнымиСтавками.КодДохода,
			|	ДоходыСУточненнымиСтавками.СуммаДохода,
			|	ДоходыСУточненнымиСтавками.КодВычета,
			|	ДоходыСУточненнымиСтавками.СуммаВычета
			|ИЗ
			|	ВТДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками";
			Запрос.Выполнить();
		КонецЕсли;
		
		Если ОписаниеТаблиц.Свойство("КоличествоПолучателейДохода") Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СведенияОДоходахНДФЛ.ФизическоеЛицо), 0) КАК П000020012003,
			|	СведенияОДоходахНДФЛ.Ставка КАК Ставка,
			|	СведенияОДоходахНДФЛ.КБК КАК КБК
			|ИЗ
			|	(ВЫБРАТЬ
			|		СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|		СведенияОДоходахНДФЛ.Ставка КАК Ставка,
			|		СведенияОДоходахНДФЛ.КБК КАК КБК,
			|		СУММА(СведенияОДоходахНДФЛ.СуммаДохода) КАК СуммаДохода
			|	ИЗ
			|		ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
			|	ГДЕ
			|		СведенияОДоходахНДФЛ.ДанныеДляОтчета
			|	
			|	СГРУППИРОВАТЬ ПО
			|		СведенияОДоходахНДФЛ.ФизическоеЛицо,
			|		СведенияОДоходахНДФЛ.Ставка,
			|		СведенияОДоходахНДФЛ.КБК) КАК СведенияОДоходахНДФЛ
			|ГДЕ
			|	СведенияОДоходахНДФЛ.СуммаДохода <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходахНДФЛ.Ставка,
			|	СведенияОДоходахНДФЛ.КБК";
			
			ОписаниеТаблиц.КоличествоПолучателейДохода = Запрос.Выполнить().Выгрузить()
			
		КонецЕсли;
	
		Если ОписаниеТаблиц.Свойство("Раздел2Доходы") Тогда
			
			Запрос.УстановитьПараметр("СтрокиРаздела2ПоКодамДохода", УчетНДФЛПовтИсп.СтрокиРаздела2Расчета6НДФЛПоКодамДохода());
			
			ПоДатамТрудовыхДоговоров = Новый Массив;
			ПоДатамТрудовыхДоговоров.Добавить(УчетНДФЛПовтИсп.Доход2710());
			ПоДатамТрудовыхДоговоров.Добавить(Справочники.ВидыДоходовНДФЛ.Код2720);
			ПоДатамТрудовыхДоговоров.Добавить(Справочники.ВидыДоходовНДФЛ.Код2760);
			ПоДатамТрудовыхДоговоров.Добавить(Справочники.ВидыДоходовНДФЛ.Код4800);
			Запрос.УстановитьПараметр("ПоДатамДоговоров", ПоДатамТрудовыхДоговоров);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СтрокиРаздела2ПоКодамДохода.КодДохода КАК КодДохода,
			|	СтрокиРаздела2ПоКодамДохода.СтрокаРаздела2Расчета6НДФЛ КАК СтрокаРаздела2
			|ПОМЕСТИТЬ ВТСтрокиРаздела2ПоКодамДохода
			|ИЗ
			|	&СтрокиРаздела2ПоКодамДохода КАК СтрокиРаздела2ПоКодамДохода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СведенияОДоходахНДФЛ.Период КАК Период,
			|	СведенияОДоходахНДФЛ.СтавкаНалога КАК СтавкаНалога,
			|	СведенияОДоходахНДФЛ.Ставка КАК Ставка,
			|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.Начисление КАК Начисление,
			|	СведенияОДоходахНДФЛ.КБК КАК КБК,
			|	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
			|	СведенияОДоходахНДФЛ.СуммаДохода КАК СуммаДохода,
			|	ВЫБОР
			|		КОГДА СведенияОДоходахНДФЛ.СтрокаРаздела2 <> ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ПустаяСсылка)
			|			ТОГДА СведенияОДоходахНДФЛ.СтрокаРаздела2
			|		ИНАЧЕ СтрокиРаздела2ПоКодамДохода.СтрокаРаздела2
			|	КОНЕЦ КАК СтрокаРаздела2
			|ПОМЕСТИТЬ ВТДоходыСоСтрокамиРаздела2
			|ИЗ
			|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтрокиРаздела2ПоКодамДохода КАК СтрокиРаздела2ПоКодамДохода
			|		ПО СведенияОДоходахНДФЛ.КодДохода = СтрокиРаздела2ПоКодамДохода.КодДохода
			|ГДЕ
			|	СведенияОДоходахНДФЛ.ДанныеДляОтчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ФизЛица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	&НачалоПериода КАК НачалоПериода,
			|	&ОкончаниеПериода КАК ОкончаниеПериода,
			|	&ГоловнаяОрганизация КАК ГоловнаяОрганизация
			|ИЗ
			|	ВТДоходыСоСтрокамиРаздела2 КАК ФизЛица
			|ГДЕ
			|	ФизЛица.СтрокаРаздела2 ЕСТЬ NULL";
			Результат = Запрос.Выполнить();
			Если Не Результат.Пустой() Тогда
				
				ФизЛицаОрганизаций = Результат.Выгрузить();
				Запрос.УстановитьПараметр("ТаблицаДоговоров", КадровыйУчет.ДоговорыФизическихЛиц(ФизЛицаОрганизаций)); ФизЛицаОрганизаций = Неопределено; 
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ТаблицаДоговоров.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ТаблицаДоговоров.ВидДоговора КАК ВидДоговора,
				|	ТаблицаДоговоров.Окончание КАК Окончание,
				|	ТаблицаДоговоров.Начало КАК Начало
				|ПОМЕСТИТЬ ВТДоговоры
				|ИЗ
				|	&ТаблицаДоговоров КАК ТаблицаДоговоров
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
				|	СведенияОДоходахНДФЛ.Период КАК Период,
				|	НЕ МИНИМУМ(ФизЛица.ВидДоговора) КАК ЕстьТрудовойДоговор
				|ПОМЕСТИТЬ ВТДниДоговоров
				|ИЗ
				|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоговоры КАК ФизЛица
				|		ПО (ФизЛица.Начало <= СведенияОДоходахНДФЛ.Период)
				|			И (ФизЛица.Окончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ИЛИ ФизЛица.Окончание >= СведенияОДоходахНДФЛ.Период)
				|			И СведенияОДоходахНДФЛ.ФизическоеЛицо = ФизЛица.ФизическоеЛицо
				|ГДЕ
				|	ФизЛица.ФизическоеЛицо ЕСТЬ НЕ NULL 
				|	И СведенияОДоходахНДФЛ.ДанныеДляОтчета
				|
				|СГРУППИРОВАТЬ ПО
				|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
				|	СведенияОДоходахНДФЛ.Период
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СведенияОДоходахНДФЛ.СтавкаНалога КАК СтавкаНалога,
				|	СведенияОДоходахНДФЛ.Ставка КАК Ставка,
				|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
				|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
				|	СведенияОДоходахНДФЛ.Начисление КАК Начисление,
				|	СведенияОДоходахНДФЛ.КБК КАК КБК,
				|	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
				|	СведенияОДоходахНДФЛ.СуммаДохода КАК СуммаДохода,
				|	ВЫБОР
				|		КОГДА СведенияОДоходахНДФЛ.СтрокаРаздела2 ЕСТЬ НЕ NULL 
				|			ТОГДА СведенияОДоходахНДФЛ.СтрокаРаздела2
				|		КОГДА СведенияОДоходахНДФЛ.КодДохода В (&ПоДатамДоговоров)
				|			ТОГДА ВЫБОР
				|					КОГДА ЕСТЬNULL(ДниДоговоров.ЕстьТрудовойДоговор, ЛОЖЬ)
				|						ТОГДА ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ТрудовойДоговор)
				|					КОГДА НЕ ДниДоговоров.ЕстьТрудовойДоговор
				|						ТОГДА ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ДоговорГПХ)
				|					ИНАЧЕ НЕОПРЕДЕЛЕНО
				|				КОНЕЦ
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК СтрокаРаздела2
				|ПОМЕСТИТЬ ВТПодробныеДоходы
				|ИЗ
				|	ВТДоходыСоСтрокамиРаздела2 КАК СведенияОДоходахНДФЛ
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДниДоговоров КАК ДниДоговоров
				|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = ДниДоговоров.ФизическоеЛицо
				|			И СведенияОДоходахНДФЛ.Период = ДниДоговоров.Период
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТДоходыСоСтрокамиРаздела2
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПодробныеДоходы.СтавкаНалога КАК СтавкаНалога,
				|	ПодробныеДоходы.Ставка КАК Ставка,
				|	ПодробныеДоходы.Регистратор КАК Регистратор,
				|	ПодробныеДоходы.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ПодробныеДоходы.Начисление КАК Начисление,
				|	ПодробныеДоходы.КБК КАК КБК,
				|	ПодробныеДоходы.КодДохода КАК КодДохода,
				|	ПодробныеДоходы.СуммаДохода КАК СуммаДохода,
				|	ПодробныеДоходы.СтрокаРаздела2 КАК СтрокаРаздела2
				|ПОМЕСТИТЬ ВТДоходыСоСтрокамиРаздела2
				|ИЗ
				|	ВТПодробныеДоходы КАК ПодробныеДоходы";
				Запрос.Выполнить();
				
			КонецЕсли;
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходах.КодДохода КАК КодДохода,
			|	СведенияОДоходах.Начисление КАК Начисление,
			|	СведенияОДоходах.Регистратор КАК Регистратор,
			|	СведенияОДоходах.СтавкаНалога КАК СтавкаНалога,
			|	СведенияОДоходах.Ставка КАК Ставка,
			|	СведенияОДоходах.КБК КАК КБК,
			|	СУММА(СведенияОДоходах.СуммаДохода) КАК П000020011003,
			|	СУММА(ВЫБОР
			|			КОГДА СведенияОДоходах.СтрокаРаздела2 = ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.Дивиденды)
			|				ТОГДА СведенияОДоходах.СуммаДохода
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК П000020011103,
			|	СУММА(ВЫБОР
			|			КОГДА СведенияОДоходах.СтрокаРаздела2 = ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ТрудовойДоговор)
			|				ТОГДА СведенияОДоходах.СуммаДохода
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК П000020011203,
			|	СУММА(ВЫБОР
			|			КОГДА СведенияОДоходах.СтрокаРаздела2 = ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ДоговорГПХ)
			|				ТОГДА СведенияОДоходах.СуммаДохода
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК П000020011303
			|ИЗ
			|	ВТДоходыСоСтрокамиРаздела2 КАК СведенияОДоходах
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.Ставка,
			|	СведенияОДоходах.КБК,
			|	СведенияОДоходах.КодДохода,
			|	СведенияОДоходах.Начисление,
			|	СведенияОДоходах.Регистратор,
			|	СведенияОДоходах.СтавкаНалога";
			
			МассивПолей = Новый Массив;
			Если Не ПодробныеДанные Тогда
				МассивПолей.Добавить("ФизическоеЛицо");
				МассивПолей.Добавить("КодДохода");
				МассивПолей.Добавить("Начисление");
				МассивПолей.Добавить("Регистратор");
			КонецЕсли;
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
			ОписаниеТаблиц.Раздел2Доходы = Запрос.Выполнить().Выгрузить()
			
		КонецЕсли;
		
		Если ОписаниеТаблиц.Свойство("Раздел2Вычеты") Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходахНДФЛ.КБК КАК КБК,
			|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.КодВычета КАК КодВычета,
			|	СведенияОДоходахНДФЛ.СтавкаНалога КАК СтавкаНалога,
			|	СведенияОДоходахНДФЛ.Ставка КАК Ставка,
			|	СведенияОДоходахНДФЛ.СуммаВычета КАК СуммаВычета
			|ПОМЕСТИТЬ ВТВычетыПоСтавкам
			|ИЗ
			|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
			|ГДЕ
			|	СведенияОДоходахНДФЛ.СуммаВычета <> 0
			|	И СведенияОДоходахНДФЛ.ДанныеДляОтчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ОсновнойКБК,
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Регистратор,
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ФизическоеЛицо,
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.КодВычета,
			|	13,
			|	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13),
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Сумма
			|ИЗ
			|	ВТСтандартныеИмущественныеВычеты КАК ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ
			|ГДЕ
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ДанныеДляОтчета";
			Запрос.Выполнить();
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СведенияОДоходах.Ставка КАК Ставка,
			|	СведенияОДоходах.КБК КАК КБК,
			|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходах.КодВычета КАК КодВычета,
			|	СведенияОДоходах.Регистратор КАК Регистратор,
			|	СведенияОДоходах.СтавкаНалога КАК СтавкаНалога,
			|	СУММА(СведенияОДоходах.СуммаВычета) КАК П000020013003
			|ИЗ
			|	ВТВычетыПоСтавкам КАК СведенияОДоходах
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.Ставка,
			|	СведенияОДоходах.КБК,
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.КодВычета,
			|	СведенияОДоходах.Регистратор,
			|	СведенияОДоходах.СтавкаНалога";
			
			МассивПолей = Новый Массив;
			Если Не ПодробныеДанные Тогда
				МассивПолей.Добавить("ФизическоеЛицо");
				МассивПолей.Добавить("КодВычета");
				МассивПолей.Добавить("Регистратор");
			КонецЕсли;
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
			ОписаниеТаблиц.Раздел2Вычеты = Запрос.Выполнить().Выгрузить()
			
		КонецЕсли;
		
		Если ОписаниеТаблиц.Свойство("Приложение1Налогоплательщики") Тогда

			НеобходимыеКадровыеДанные = Новый Массив();
			НеобходимыеКадровыеДанные.Добавить("ФизическоеЛицо");
			НеобходимыеКадровыеДанные.Добавить("ИНН");
			НеобходимыеКадровыеДанные.Добавить("Наименование");
			НеобходимыеКадровыеДанные.Добавить("Фамилия");
			НеобходимыеКадровыеДанные.Добавить("Имя");
			НеобходимыеКадровыеДанные.Добавить("Отчество");
			НеобходимыеКадровыеДанные.Добавить("СтатусНалогоплательщика");
			НеобходимыеКадровыеДанные.Добавить("ДатаРождения");	
			НеобходимыеКадровыеДанные.Добавить("ДокументВид");
			НеобходимыеКадровыеДанные.Добавить("ДокументСерия");
			НеобходимыеКадровыеДанные.Добавить("ДокументНомер");
			НеобходимыеКадровыеДанные.Добавить("ДокументСтранаВыдачи");
			НеобходимыеКадровыеДанные.Добавить("Страна");
			
			ОписаниеТаблиц.Приложение1Налогоплательщики = Новый ТаблицаЗначений;
			Если НомерКорректировки = 99 Тогда
			ИначеЕсли НомерКорректировки > 0 Тогда
			Иначе
				
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо
				|ИЗ
				|	ВТДоходыСоСтрокамиРаздела2 КАК СведенияОДоходах";
				КадровыйУчет.СоздатьНаДатуВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, Истина, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо"), НеобходимыеКадровыеДанные, ОкончаниеПериода);

				Запрос.Текст = 
				"ВЫБРАТЬ
				|	КадровыеДанныеФизЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
				|	КадровыеДанныеФизЛиц.ИНН КАК ИНН,
				|	КадровыеДанныеФизЛиц.Фамилия КАК Фамилия,
				|	КадровыеДанныеФизЛиц.Имя КАК Имя,
				|	КадровыеДанныеФизЛиц.Отчество КАК Отчество,
				|	КадровыеДанныеФизЛиц.СтатусНалогоплательщика КАК СтатусНалогоплательщика,
				|	КадровыеДанныеФизЛиц.ДатаРождения КАК ДатаРождения,
				|	ЕСТЬNULL(КадровыеДанныеФизЛиц.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)) КАК Гражданство,
				|	КадровыеДанныеФизЛиц.ДокументСтранаВыдачи КАК СтранаВыдачиДокумента,
				|	КадровыеДанныеФизЛиц.ДокументВид КАК ВидДокумента,
				|	КадровыеДанныеФизЛиц.ДокументСерия КАК СерияДокумента,
				|	КадровыеДанныеФизЛиц.ДокументНомер КАК НомерДокумента,
				|	КадровыеДанныеФизЛиц.Наименование КАК Наименование
				|ИЗ
				|	ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизЛиц
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование";	
				ОписаниеТаблиц.Приложение1Налогоплательщики = Запрос.Выполнить().Выгрузить();
				
			КонецЕсли;
		КонецЕсли;
		
		Если ОписаниеТаблиц.Свойство("Приложение1Доходы") Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) КАК Период,
			|	СведенияОДоходах.СтавкаНалога КАК Ставка,
			|	СведенияОДоходах.КодДохода.КодПрименяемыйВНалоговойОтчетностиС2021Года КАК П000П1М500002,
			|	СУММА(СведенияОДоходах.СуммаДохода) КАК П000П1М500003,
			|	СведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года КАК П000П1М600004,
			|	СУММА(СведенияОДоходах.СуммаВычета) КАК П000П1М600005
			|ИЗ
			|	ВТДоходыПоСтавкам КАК СведенияОДоходах
			|ГДЕ
			|	СведенияОДоходах.ДанныеДляОтчета
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.КодДохода.КодПрименяемыйВНалоговойОтчетностиС2021Года,
			|	СведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года,
			|	СведенияОДоходах.СтавкаНалога,
			|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ)
			|
			|ИМЕЮЩИЕ
			|	(СУММА(СведенияОДоходах.СуммаДохода) <> 0
			|		ИЛИ СУММА(СведенияОДоходах.СуммаВычета) <> 0)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	Ставка,
			|	Период,
			|	П000П1М500002";
			ОписаниеТаблиц.Приложение1Доходы = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Приложение1Вычеты") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.СтавкаНалога КАК Ставка,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.КодВычета.ГруппаВычета КАК ГруппаВычета,
		|	СведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года КАК П000П1М200001,
		|	СУММА(СведенияОДоходах.СуммаВычета) КАК П000П1М200002
		|ИЗ
		|	ВТВычетыПоСтавкам КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.КодВычета.ГруппаВычета <> ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.СтавкаНалога,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.КодВычета.ГруппаВычета,
		|	СведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года";
		ОписаниеТаблиц.Приложение1Вычеты = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел2Налоги") Или ОписаниеТаблиц.Свойство("Приложение1Итоги") Или ОписаниеТаблиц.Свойство("Приложение1УведомленияОВычетах") Тогда
		
		УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента(Запрос.МенеджерВременныхТаблиц, "ВТНалоги", "УчитыватьИзмененияСтатусаДляОтчетности", ОкончаниеПериода, "ВТСтавкаНДФЛПоНалогам");
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НДФЛ.КБК КАК КБК,
		|	НДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаЧислом * 100 КАК СтавкаНалога,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ КАК Ставка,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
		|			ТОГДА НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Начислено,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.КатегорияДохода В (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12))
		|					ИЛИ НДФЛ.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходыПредыдущихРедакций)
		|						И НДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09))
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачисленоПоДивидендам,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЗачтеноАвансов,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаУдержания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Удержано,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА НДФЛ.Сумма
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК УдержаноЗаНалоговыйПериод,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
		|			ТОГДА ВЫБОР
		|					КОГДА НДФЛ.НалогНаПрибыльДляДивидендов = 0
		|						ТОГДА НДФЛ.Сумма
		|					КОГДА ВЫБОР
		|							КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|								ТОГДА ВЫБОР
		|										КОГДА НДФЛ.СуммаСПревышения > 0
		|											ТОГДА ВЫБОР
		|													КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения > 0
		|														ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|													ИНАЧЕ 0
		|												КОНЕЦ
		|										КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения < 0
		|											ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|										ИНАЧЕ 0
		|									КОНЕЦ
		|							ИНАЧЕ НДФЛ.НалогНаПрибыльДляДивидендов
		|						КОНЕЦ * НДФЛ.Сумма > 0
		|						ТОГДА ВЫБОР
		|								КОГДА НДФЛ.Сумма > 0
		|									ТОГДА ВЫБОР
		|											КОГДА НДФЛ.Сумма - ВЫБОР
		|													КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|														ТОГДА ВЫБОР
		|																КОГДА НДФЛ.СуммаСПревышения > 0
		|																	ТОГДА ВЫБОР
		|																			КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения > 0
		|																				ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																			ИНАЧЕ 0
		|																		КОНЕЦ
		|																КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения < 0
		|																	ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																ИНАЧЕ 0
		|															КОНЕЦ
		|													ИНАЧЕ НДФЛ.НалогНаПрибыльДляДивидендов
		|												КОНЕЦ > 0
		|												ТОГДА НДФЛ.Сумма - ВЫБОР
		|														КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|															ТОГДА ВЫБОР
		|																	КОГДА НДФЛ.СуммаСПревышения > 0
		|																		ТОГДА ВЫБОР
		|																				КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения > 0
		|																					ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																				ИНАЧЕ 0
		|																			КОНЕЦ
		|																	КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения < 0
		|																		ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																	ИНАЧЕ 0
		|																КОНЕЦ
		|														ИНАЧЕ НДФЛ.НалогНаПрибыльДляДивидендов
		|													КОНЕЦ
		|											ИНАЧЕ 0
		|										КОНЕЦ
		|								КОГДА НДФЛ.Сумма - ВЫБОР
		|										КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|											ТОГДА ВЫБОР
		|													КОГДА НДФЛ.СуммаСПревышения > 0
		|														ТОГДА ВЫБОР
		|																КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения > 0
		|																	ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																ИНАЧЕ 0
		|															КОНЕЦ
		|													КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения < 0
		|														ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|													ИНАЧЕ 0
		|												КОНЕЦ
		|										ИНАЧЕ НДФЛ.НалогНаПрибыльДляДивидендов
		|									КОНЕЦ < 0
		|									ТОГДА НДФЛ.Сумма - ВЫБОР
		|											КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|												ТОГДА ВЫБОР
		|														КОГДА НДФЛ.СуммаСПревышения > 0
		|															ТОГДА ВЫБОР
		|																	КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения > 0
		|																		ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																	ИНАЧЕ 0
		|																КОНЕЦ
		|														КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения < 0
		|															ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|														ИНАЧЕ 0
		|													КОНЕЦ
		|											ИНАЧЕ НДФЛ.НалогНаПрибыльДляДивидендов
		|										КОНЕЦ
		|								ИНАЧЕ 0
		|							КОНЕЦ
		|					ИНАЧЕ НДФЛ.Сумма
		|				КОНЕЦ
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА -НДФЛ.Сумма
		|		КОГДА (НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|				ИЛИ НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей))
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА -НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Сальдо,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|				И (НДФЛ.ДатаУдержания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА -НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Возвращено
		|ПОМЕСТИТЬ ВТНалогиПоСтавкам
		|ИЗ
		|	ВТНалоги КАК НДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоНалогам КАК СтавкаНДФЛПоСтавкеРезидента
		|		ПО НДФЛ.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
		|			И НДФЛ.Период = СтавкаНДФЛПоСтавкеРезидента.Период
		|			И НДФЛ.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
		|			И НДФЛ.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
		|ГДЕ
		|	НДФЛ.Сумма <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&КБКсПревышения,
		|	НДФЛ.ФизическоеЛицо,
		|	15,
		|	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15),
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
		|			ТОГДА НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.КатегорияДохода В (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12))
		|					ИЛИ НДФЛ.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходыПредыдущихРедакций)
		|						И НДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09))
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаУдержания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
		|			ТОГДА ВЫБОР
		|					КОГДА НДФЛ.НалогНаПрибыльДляДивидендов = 0
		|						ТОГДА НДФЛ.СуммаСПревышения
		|					КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|						ТОГДА ВЫБОР
		|								КОГДА НДФЛ.СуммаСПревышения > 0
		|									ТОГДА ВЫБОР
		|											КОГДА НДФЛ.СуммаСПревышения - НДФЛ.НалогНаПрибыльДляДивидендов > 0
		|												ТОГДА НДФЛ.СуммаСПревышения - НДФЛ.НалогНаПрибыльДляДивидендов
		|											ИНАЧЕ 0
		|										КОНЕЦ
		|								КОГДА НДФЛ.СуммаСПревышения - НДФЛ.НалогНаПрибыльДляДивидендов < 0
		|									ТОГДА НДФЛ.СуммаСПревышения - НДФЛ.НалогНаПрибыльДляДивидендов
		|								ИНАЧЕ 0
		|							КОНЕЦ
		|					ИНАЧЕ НДФЛ.СуммаСПревышения
		|				КОНЕЦ
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА -НДФЛ.СуммаСПревышения
		|		КОГДА (НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|				ИЛИ НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей))
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА -НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|				И (НДФЛ.ДатаУдержания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА -НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	ВТНалоги КАК НДФЛ
		|ГДЕ
		|	НДФЛ.СуммаСПревышения <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Налоги.СтавкаНалога КАК СтавкаНалога,
		|	СУММА(Налоги.Сальдо) КАК НеУдержано,
		|	Налоги.КБК КАК КБК
		|ПОМЕСТИТЬ ВТНеУдержано
		|ИЗ
		|	ВТНалогиПоСтавкам КАК Налоги
		|
		|СГРУППИРОВАТЬ ПО
		|	Налоги.ФизическоеЛицо,
		|	Налоги.СтавкаНалога,
		|	Налоги.КБК
		|
		|ИМЕЮЩИЕ
		|	СУММА(Налоги.Сальдо) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Налоги.СтавкаНалога КАК СтавкаНалога,
		|	Налоги.КБК КАК КБК,
		|	-СУММА(Налоги.Сальдо) КАК ИзлишнеУдержано
		|ПОМЕСТИТЬ ВТИзлишнеУдержаноПоКБК
		|ИЗ
		|	ВТНалогиПоСтавкам КАК Налоги
		|
		|СГРУППИРОВАТЬ ПО
		|	Налоги.ФизическоеЛицо,
		|	Налоги.СтавкаНалога,
		|	Налоги.КБК
		|
		|ИМЕЮЩИЕ
		|	СУММА(Налоги.Сальдо) < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Налоги.СтавкаНалога КАК СтавкаНалога,
		|	СУММА(Налоги.Начислено) КАК Начислено,
		|	СУММА(Налоги.НачисленоПоДивидендам) КАК НачисленоПоДивидендам,
		|	СУММА(Налоги.ЗачтеноАвансов) КАК ЗачтеноАвансов,
		|	СУММА(Налоги.Удержано) КАК Удержано,
		|	СУММА(Налоги.УдержаноЗаНалоговыйПериод) КАК УдержаноЗаНалоговыйПериод,
		|	СУММА(Налоги.Возвращено) КАК Возвращено,
		|	ЕСТЬNULL(МАКСИМУМ(ПоФизлицам.НеУдержано), 0) КАК НеУдержано,
		|	ЕСТЬNULL(МАКСИМУМ(ИзлишнеУдержаноПоКБК.ИзлишнеУдержано), 0) КАК ИзлишнеУдержано,
		|	Налоги.Ставка КАК Ставка,
		|	Налоги.КБК КАК КБК
		|ПОМЕСТИТЬ ВТДанныеПоФизлицам
		|ИЗ
		|	ВТНалогиПоСтавкам КАК Налоги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНеУдержано КАК ПоФизлицам
		|		ПО Налоги.ФизическоеЛицо = ПоФизлицам.ФизическоеЛицо
		|			И Налоги.СтавкаНалога = ПоФизлицам.СтавкаНалога
		|			И Налоги.КБК = ПоФизлицам.КБК
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИзлишнеУдержаноПоКБК КАК ИзлишнеУдержаноПоКБК
		|		ПО Налоги.ФизическоеЛицо = ИзлишнеУдержаноПоКБК.ФизическоеЛицо
		|			И Налоги.КБК = ИзлишнеУдержаноПоКБК.КБК
		|			И Налоги.СтавкаНалога = ИзлишнеУдержаноПоКБК.СтавкаНалога
		|ГДЕ
		|	(Налоги.Начислено <> 0
		|			ИЛИ Налоги.ЗачтеноАвансов <> 0
		|			ИЛИ Налоги.Удержано <> 0
		|			ИЛИ Налоги.Возвращено <> 0
		|			ИЛИ ИзлишнеУдержаноПоКБК.ИзлишнеУдержано <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	Налоги.ФизическоеЛицо,
		|	Налоги.СтавкаНалога,
		|	Налоги.Ставка,
		|	Налоги.КБК";
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел2Налоги") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(Налоги.Начислено) КАК П000020014003,
		|	СУММА(Налоги.НачисленоПоДивидендам) КАК П000020014103,
		|	СУММА(Налоги.ЗачтеноАвансов) КАК П000020015003,
		|	СУММА(Налоги.Удержано) КАК П000020016003,
		|	СУММА(Налоги.НеУдержано) КАК П000020017003,
		|	СУММА(Налоги.Возвращено) КАК П000020019003,
		|	СУММА(Налоги.ИзлишнеУдержано) КАК П000020018003,
		|	Налоги.СтавкаНалога КАК СтавкаНалога,
		|	Налоги.Ставка КАК Ставка,
		|	Налоги.КБК КАК КБК
		|ИЗ
		|	ВТДанныеПоФизлицам КАК Налоги
		|ГДЕ
		|	(Налоги.Начислено <> 0
		|			ИЛИ Налоги.ЗачтеноАвансов <> 0
		|			ИЛИ Налоги.Удержано <> 0
		|			ИЛИ Налоги.Возвращено <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	Налоги.СтавкаНалога,
		|	Налоги.Ставка,
		|	Налоги.КБК,
		|	Налоги.ФизическоеЛицо";
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "Налоги");
		ОписаниеТаблиц.Раздел2Налоги = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Приложение1Итоги") Тогда
		
		УчетНДФЛ.СоздатьВТСтавкиНалогаЧислом(Запрос.МенеджерВременныхТаблиц);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Налоги.СтавкаНалога КАК СтавкаНалога,
		|	-СУММА(Налоги.Сальдо) КАК ИзлишнеУдержано
		|ПОМЕСТИТЬ ВТИзлишнеУдержано
		|ИЗ
		|	ВТНалогиПоСтавкам КАК Налоги
		|
		|СГРУППИРОВАТЬ ПО
		|	Налоги.ФизическоеЛицо,
		|	Налоги.СтавкаНалога
		|
		|ИМЕЮЩИЕ
		|	СУММА(Налоги.Сальдо) < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеИтогов.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеИтогов.Ставка КАК Ставка,
		|	ДанныеИтогов.П000П1М100001 КАК П000П1М100001,
		|	СУММА(ДанныеИтогов.П000П1М100002) КАК П000П1М100002,
		|	СУММА(ДанныеИтогов.П000П1М100003) КАК П000П1М100003,
		|	СУММА(ДанныеИтогов.П000П1М100004) КАК П000П1М100004,
		|	СУММА(ДанныеИтогов.П000П1М100005) КАК П000П1М100005,
		|	СУММА(ДанныеИтогов.П000П1М100006) КАК П000П1М100006,
		|	СУММА(ДанныеИтогов.П000П1М100007) КАК П000П1М100007,
		|	СУММА(ДанныеИтогов.П000П1М100008) КАК П000П1М100008
		|ИЗ
		|	(ВЫБРАТЬ
		|		Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|		Налоги.СтавкаНалога КАК Ставка,
		|		Налоги.СтавкаНалога КАК П000П1М100001,
		|		0 КАК П000П1М100002,
		|		0 КАК П000П1М100003,
		|		Налоги.Начислено КАК П000П1М100004,
		|		Налоги.УдержаноЗаНалоговыйПериод КАК П000П1М100005,
		|		Налоги.ЗачтеноАвансов КАК П000П1М100006,
		|		0 КАК П000П1М100007,
		|		0 КАК П000П1М100008
		|	ИЗ
		|		ВТДанныеПоФизлицам КАК Налоги
		|	ГДЕ
		|		(Налоги.Начислено <> 0
		|				ИЛИ Налоги.ЗачтеноАвансов <> 0
		|				ИЛИ Налоги.УдержаноЗаНалоговыйПериод <> 0)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СведенияОДоходах.ФизическоеЛицо,
		|		СведенияОДоходах.СтавкаНалога,
		|		СведенияОДоходах.СтавкаНалога,
		|		СведенияОДоходах.СуммаДохода,
		|		СведенияОДоходах.СуммаДохода,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		ВТДоходыПоСтавкам КАК СведенияОДоходах
		|	ГДЕ
		|		СведенияОДоходах.ДанныеДляОтчета
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СведенияОДоходах.ФизическоеЛицо,
		|		СведенияОДоходах.СтавкаНалога,
		|		СведенияОДоходах.СтавкаНалога,
		|		0,
		|		-СведенияОДоходах.СуммаВычета,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		ВТВычетыПоСтавкам КАК СведенияОДоходах
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Налоги.ФизическоеЛицо,
		|		Налоги.СтавкаНалога,
		|		Налоги.СтавкаНалога,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		Налоги.ИзлишнеУдержано
		|	ИЗ
		|		ВТИзлишнеУдержано КАК Налоги
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо,
		|		СтавкиНалогаЧислом.Размер * 100,
		|		СтавкиНалогаЧислом.Размер * 100,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма,
		|		0
		|	ИЗ
		|		РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиНалогаЧислом КАК СтавкиНалогаЧислом
		|			ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка = СтавкиНалогаЧислом.СтавкаНалогообложения
		|	ГДЕ
		|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|		И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане В(&РегистрацияВНалоговомОргане)
		|		И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода) КАК ДанныеИтогов
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеИтогов.Ставка,
		|	ДанныеИтогов.ФизическоеЛицо,
		|	ДанныеИтогов.П000П1М100001
		|
		|ИМЕЮЩИЕ
		|	СУММА(ДанныеИтогов.П000П1М100002) <> 0";
					
		ОписаниеТаблиц.Приложение1Итоги = Запрос.Выполнить().Выгрузить()
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Приложение1УведомленияОВычетах") Тогда
		
		НалоговыйПериод = Год(ОкончаниеПериода);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТВычетыПоСтавкам КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.КодВычета.ГруппаВычета <> ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.ПустаяСсылка)";
		ДанныеУведомлений = УчетНДФЛ.ДанныеУведомленийНаВычеты(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо"), НалоговыйПериод, Организация);
		ДанныеУведомлений.Колонки.Сотрудник.Имя = "ФизическоеЛицо";
		ОписаниеТаблиц.Приложение1УведомленияОВычетах = ДанныеУведомлений;
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТДанныеПоФизлицам КАК Налоги
		|ГДЕ
		|	Налоги.ЗачтеноАвансов <> 0";
		ДанныеУведомлений = УчетНДФЛ.ДанныеУведомленийНаЗачетАвансовыхПлатежей(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо"), НалоговыйПериод, Организация);
		ДанныеУведомлений.Колонки.Добавить("ГруппаВычета", Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыВычетовПоНДФЛ"));
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеУведомлений, ОписаниеТаблиц.Приложение1УведомленияОВычетах);
		ОписаниеТаблиц.Приложение1УведомленияОВычетах.Колонки.НомерУведомления.Имя = "П000П1М300002";
		ОписаниеТаблиц.Приложение1УведомленияОВычетах.Колонки.ДатаУведомления.Имя = "П000П1М300003";
		ОписаниеТаблиц.Приложение1УведомленияОВычетах.Колонки.КодНалоговогоОрганаУведомления.Имя = "П000П1М300004";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчетПоказателей_6НДФЛ_2017Кв1(НачалоПериода, ОкончаниеПериода, ДатаПодписи, Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц, ПодробныеДанные, НомерКорректировки)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
	Запрос.УстановитьПараметр("НачалоПредыдущегоГода", ДобавитьМесяц(НачалоПериода, -12));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(НачалоПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("ДатаПодписи", КонецДня(ДатаПодписи));
	Запрос.УстановитьПараметр("ОкончаниеПериодаОсмотраДоходовВычетов", ?(КонецГода(ОкончаниеПериода) = ОкончаниеПериода Или ЗначениеЗаполнено(НомерКорректировки), Макс(ДатаПодписи, ОкончаниеПериода), ОкончаниеПериода));
	
	Если ОписаниеТаблиц.Свойство("Раздел1Доходы") Или ОписаниеТаблиц.Свойство("Раздел1Вычеты") Или ОписаниеТаблиц.Свойство("КоличествоПолучателейДохода") Тогда
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходахНДФЛ.СуммаДохода КАК СуммаДохода,
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК Период,
		|	СведенияОДоходахНДФЛ.КатегорияДохода КАК КатегорияДохода,
		|	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
		|	СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
		|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
		|	СведенияОДоходахНДФЛ.Начисление КАК Начисление,
		|	СведенияОДоходахНДФЛ.КодВычета КАК КодВычета,
		|	СведенияОДоходахНДФЛ.СуммаВычета КАК СуммаВычета,
		|	СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ КАК ИсточникДоходаЗаПределамиРФ
		|ПОМЕСТИТЬ ВТДоходы
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
		|ГДЕ
		|	СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|	И (СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ИЛИ СведенияОДоходахНДФЛ.Регистратор <> СведенияОДоходахНДФЛ.ДокументОснование)
		|	И СведенияОДоходахНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане В(&РегистрацияВНалоговомОргане)
		|	И СведенияОДоходахНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И (СведенияОДоходахНДФЛ.СуммаДохода <> 0
		|			ИЛИ СведенияОДоходахНДФЛ.СуммаВычета <> 0)";
		Запрос.Выполнить();
		
		УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента(Запрос.МенеджерВременныхТаблиц, "ВТДоходы", "УчитыватьИзмененияСтатусаДляОтчетности", ОкончаниеПериода);
		
		Если ОписаниеТаблиц.Свойство("КоличествоПолучателейДохода") Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СведенияОДоходахНДФЛ.ФизическоеЛицо), 0) КАК П000010006001
			|ИЗ
			|	ВТДоходы КАК СведенияОДоходахНДФЛ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
			|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
			|			И СведенияОДоходахНДФЛ.Период = СтавкаНДФЛПоСтавкеРезидента.Период
			|			И СведенияОДоходахНДФЛ.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
			|			И СведенияОДоходахНДФЛ.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
			|ГДЕ
			|	СведенияОДоходахНДФЛ.СуммаДохода <> 0
			|	И (НЕ СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ
			|			ИЛИ СтавкаНДФЛПоСтавкеРезидента.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))";
			
			ОписаниеТаблиц.КоличествоПолучателейДохода = Запрос.Выполнить().Выгрузить()
			
		КонецЕсли;
	
		Если ОписаниеТаблиц.Свойство("Раздел1Доходы") Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходахНДФЛ.Регистратор,
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.КодДохода,
			|	СведенияОДоходахНДФЛ.Начисление,
			|	СтавкаНДФЛПоСтавкеРезидента.СтавкаЧислом * 100 КАК СтавкаНалога,
			|	СведенияОДоходахНДФЛ.СуммаДохода,
			|	ВЫБОР
			|		КОГДА СведенияОДоходахНДФЛ.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010)
			|			ТОГДА СведенияОДоходахНДФЛ.СуммаДохода
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаДивидендов
			|ПОМЕСТИТЬ ВТДоходыПоСтавкам
			|ИЗ
			|	ВТДоходы КАК СведенияОДоходахНДФЛ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
			|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
			|			И СведенияОДоходахНДФЛ.Период = СтавкаНДФЛПоСтавкеРезидента.Период
			|			И СведенияОДоходахНДФЛ.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
			|			И СведенияОДоходахНДФЛ.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
			|ГДЕ
			|	СведенияОДоходахНДФЛ.СуммаДохода <> 0
			|	И (НЕ СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ
			|			ИЛИ СтавкаНДФЛПоСтавкеРезидента.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))";
			Запрос.Выполнить();
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.КодДохода,
			|	СведенияОДоходах.Начисление,
			|	СведенияОДоходах.Регистратор,
			|	СведенияОДоходах.СтавкаНалога КАК П000010001001,
			|	СведенияОДоходах.СтавкаНалога,
			|	СУММА(СведенияОДоходах.СуммаДохода) КАК П000010002001,
			|	СУММА(СведенияОДоходах.СуммаДивидендов) КАК П000010002501
			|ИЗ
			|	ВТДоходыПоСтавкам КАК СведенияОДоходах
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.КодДохода,
			|	СведенияОДоходах.Начисление,
			|	СведенияОДоходах.Регистратор,
			|	СведенияОДоходах.СтавкаНалога";
			
			МассивПолей = Новый Массив;
			Если Не ПодробныеДанные Тогда
				МассивПолей.Добавить("ФизическоеЛицо");
				МассивПолей.Добавить("КодДохода");
				МассивПолей.Добавить("Начисление");
				МассивПолей.Добавить("Регистратор");
			КонецЕсли;
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
			ОписаниеТаблиц.Раздел1Доходы = Запрос.Выполнить().Выгрузить()
			
		КонецЕсли;
		
		Если ОписаниеТаблиц.Свойство("Раздел1Вычеты") Тогда
			
			Запрос.УстановитьПараметр("ГодПериода", Год(ОкончаниеПериода));
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходахНДФЛ.Регистратор,
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.КодВычета,
			|	СтавкаНДФЛПоСтавкеРезидента.СтавкаЧислом * 100 КАК СтавкаНалога,
			|	СведенияОДоходахНДФЛ.СуммаВычета
			|ПОМЕСТИТЬ ВТВычетыПоСтавкам
			|ИЗ
			|	ВТДоходы КАК СведенияОДоходахНДФЛ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
			|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
			|			И СведенияОДоходахНДФЛ.Период = СтавкаНДФЛПоСтавкеРезидента.Период
			|			И СведенияОДоходахНДФЛ.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
			|			И СведенияОДоходахНДФЛ.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
			|ГДЕ
			|	СведенияОДоходахНДФЛ.СуммаВычета <> 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Регистратор,
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ФизическоеЛицо,
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.КодВычета,
			|	13,
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Сумма
			|ИЗ
			|	РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ КАК ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ
			|ГДЕ
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериодаОсмотраДоходовВычетов
			|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
			|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.РегистрацияВНалоговомОргане В(&РегистрацияВНалоговомОргане)
			|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
			|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Сумма <> 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ИмущественныеВычетыНДФЛ.Регистратор,
			|	ИмущественныеВычетыНДФЛ.ФизическоеЛицо,
			|	ИмущественныеВычетыНДФЛ.КодВычета,
			|	13,
			|	ИмущественныеВычетыНДФЛ.Сумма
			|ИЗ
			|	РегистрНакопления.ИмущественныеВычетыНДФЛ КАК ИмущественныеВычетыНДФЛ
			|ГДЕ
			|	ИмущественныеВычетыНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериода
			|	И ИмущественныеВычетыНДФЛ.МесяцРегистрации <= &ОкончаниеПериодаОсмотраДоходовВычетов
			|	И ИмущественныеВычетыНДФЛ.РегистрацияВНалоговомОргане В(&РегистрацияВНалоговомОргане)
			|	И ИмущественныеВычетыНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
			|	И ИмущественныеВычетыНДФЛ.Сумма <> 0
			|	И ИмущественныеВычетыНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|	И ИмущественныеВычетыНДФЛ.Год = &ГодПериода";
			Запрос.Выполнить();
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.КодВычета,
			|	СведенияОДоходах.Регистратор,
			|	СведенияОДоходах.СтавкаНалога КАК П000010001001,
			|	СведенияОДоходах.СтавкаНалога,
			|	СУММА(СведенияОДоходах.СуммаВычета) КАК П000010003001
			|ИЗ
			|	ВТВычетыПоСтавкам КАК СведенияОДоходах
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.КодВычета,
			|	СведенияОДоходах.Регистратор,
			|	СведенияОДоходах.СтавкаНалога";
			
			МассивПолей = Новый Массив;
			Если Не ПодробныеДанные Тогда
				МассивПолей.Добавить("ФизическоеЛицо");
				МассивПолей.Добавить("КодВычета");
				МассивПолей.Добавить("Регистратор");
			КонецЕсли;
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
			ОписаниеТаблиц.Раздел1Вычеты = Запрос.Выполнить().Выгрузить()
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел1Налоги") Или ОписаниеТаблиц.Свойство("Раздел2") Тогда
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода КАК КатегорияДохода,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор КАК Регистратор,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК Период,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК ДатаПолученияДохода,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВариантУдержания КАК ВариантУдержания,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения КАК ВидДвижения,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СрокПеречисления КАК СрокПеречисления,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма КАК Сумма,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период КАК ДатаУдержания,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаВыплаченногоДохода КАК СуммаВыплаченногоДохода,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование КАК ДокументОснование,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КрайнийСрокУплаты КАК КрайнийСрокУплаты,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РасчетМежрасчетногоПериода КАК РасчетМежрасчетногоПериода,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УчитыватьВыплаченныйДоходВ6НДФЛ КАК УчитыватьВыплаченныйДоходВ6НДФЛ
		|ПОМЕСТИТЬ ВТНалоги
		|ИЗ
		|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
		|ГДЕ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане В(&РегистрацияВНалоговомОргане)
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И (РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма <> 0
		|			ИЛИ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УчитыватьВыплаченныйДоходВ6НДФЛ
		|				И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаВыплаченногоДохода <> 0)";
		Запрос.Выполнить();
		
		Если ОписаниеТаблиц.Свойство("Раздел1Налоги") Тогда
			
			УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента(Запрос.МенеджерВременныхТаблиц, "ВТНалоги", "УчитыватьИзмененияСтатусаДляОтчетности", ОкончаниеПериода);
			
			Запрос.УстановитьПараметр("ДатаПервогоОтчетногоПериода", '20160101');
			Запрос.Текст =
			"ВЫБРАТЬ
			|	НДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СтавкаНДФЛПоСтавкеРезидента.СтавкаЧислом * 100 КАК СтавкаНалога,
			|	ВЫБОР
			|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
			|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
			|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
			|			ТОГДА НДФЛ.Сумма
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Начислено,
			|	ВЫБОР
			|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
			|				И (НДФЛ.КатегорияДохода В (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12))
			|					ИЛИ НДФЛ.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходыПредыдущихРедакций)
			|						И НДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09))
			|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
			|			ТОГДА НДФЛ.Сумма
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК НачисленоПоДивидендам,
			|	ВЫБОР
			|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
			|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
			|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
			|			ТОГДА НДФЛ.Сумма
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ЗачтеноАвансов,
			|	ВЫБОР
			|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|				И (НДФЛ.ДатаУдержания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
			|				И НДФЛ.ДатаПолученияДохода >= &ДатаПервогоОтчетногоПериода
			|			ТОГДА НДФЛ.Сумма
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Удержано,
			|	ВЫБОР
			|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
			|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
			|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
			|			ТОГДА НДФЛ.Сумма
			|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
			|			ТОГДА -НДФЛ.Сумма
			|		КОГДА (НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
			|				ИЛИ НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей))
			|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
			|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
			|			ТОГДА -НДФЛ.Сумма
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Сальдо,
			|	ВЫБОР
			|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
			|				И (НДФЛ.ДатаУдержания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
			|			ТОГДА -НДФЛ.Сумма
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Возвращено
			|ПОМЕСТИТЬ ВТНалогиПоСтавкам
			|ИЗ
			|	ВТНалоги КАК НДФЛ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
			|		ПО НДФЛ.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
			|			И НДФЛ.Период = СтавкаНДФЛПоСтавкеРезидента.Период
			|			И НДФЛ.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
			|			И НДФЛ.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
			|	Налоги.СтавкаНалога КАК СтавкаНалога,
			|	СУММА(Налоги.Сальдо) КАК НеУдержано
			|ПОМЕСТИТЬ ВТНеУдержано
			|ИЗ
			|	ВТНалогиПоСтавкам КАК Налоги
			|
			|СГРУППИРОВАТЬ ПО
			|	Налоги.ФизическоеЛицо,
			|	Налоги.СтавкаНалога
			|
			|ИМЕЮЩИЕ
			|	СУММА(Налоги.Сальдо) > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
			|	Налоги.СтавкаНалога КАК СтавкаНалога,
			|	СУММА(Налоги.Начислено) КАК Начислено,
			|	СУММА(Налоги.НачисленоПоДивидендам) КАК НачисленоПоДивидендам,
			|	СУММА(Налоги.ЗачтеноАвансов) КАК ЗачтеноАвансов,
			|	СУММА(Налоги.Удержано) КАК Удержано,
			|	ЕСТЬNULL(МАКСИМУМ(ПоФизлицам.НеУдержано), 0) КАК НеУдержано,
			|	СУММА(Налоги.Возвращено) КАК Возвращено
			|ПОМЕСТИТЬ ВТДанныеПоФизлицам
			|ИЗ
			|	ВТНалогиПоСтавкам КАК Налоги
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНеУдержано КАК ПоФизлицам
			|		ПО Налоги.ФизическоеЛицо = ПоФизлицам.ФизическоеЛицо
			|			И Налоги.СтавкаНалога = ПоФизлицам.СтавкаНалога
			|ГДЕ
			|	(Налоги.Начислено <> 0
			|			ИЛИ Налоги.ЗачтеноАвансов <> 0
			|			ИЛИ Налоги.Удержано <> 0
			|			ИЛИ Налоги.Возвращено <> 0)
			|
			|СГРУППИРОВАТЬ ПО
			|	Налоги.ФизическоеЛицо,
			|	Налоги.СтавкаНалога
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТСтавкаНДФЛПоСтавкеРезидента";
			Запрос.Выполнить();
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Налоги.ФизическоеЛицо,
			|	Налоги.СтавкаНалога КАК П000010001001,
			|	Налоги.СтавкаНалога,
			|	СУММА(Налоги.Начислено) КАК П000010004001,
			|	СУММА(Налоги.НачисленоПоДивидендам) КАК П000010004501,
			|	СУММА(Налоги.ЗачтеноАвансов) КАК П000010005001,
			|	СУММА(Налоги.Удержано) КАК П000010007001,
			|	СУММА(Налоги.НеУдержано) КАК П000010008001,
			|	СУММА(Налоги.Возвращено) КАК П000010009001
			|ИЗ
			|	ВТДанныеПоФизлицам КАК Налоги
			|ГДЕ
			|	(Налоги.Начислено <> 0
			|			ИЛИ Налоги.ЗачтеноАвансов <> 0
			|			ИЛИ Налоги.Удержано <> 0
			|			ИЛИ Налоги.Возвращено <> 0)
			|
			|СГРУППИРОВАТЬ ПО
			|	Налоги.ФизическоеЛицо,
			|	Налоги.СтавкаНалога";
			МассивПолей = Новый Массив;
			Если Не ПодробныеДанные Тогда
				МассивПолей.Добавить("ФизическоеЛицо");
			КонецЕсли;
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "Налоги");
			ОписаниеТаблиц.Раздел1Налоги = Запрос.Выполнить().Выгрузить();
			
		КонецЕсли;
		
		Если ОписаниеТаблиц.Свойство("Раздел2") Тогда
			
			Запрос.УстановитьПараметр("НачалоОтчетногоКвартала", НачалоКвартала(ОкончаниеПериода));
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МАКСИМУМ(ДатыУчета.ДатаПолученияДохода) КАК ПоздняяДатаПолученияДохода,
			|	МИНИМУМ(ДатыУчета.ДатаПолученияДохода) КАК РанняяДатаПолученияДохода
			|ИЗ
			|	ВТНалоги КАК ДатыУчета
			|ГДЕ
			|	ДатыУчета.ДатаУдержания <= &ОкончаниеПериода";
			Выборка = Запрос.Выполнить().Выбрать();
			РанняяДатаПолученияДохода = НачалоПериода;
			ПоздняяДатаПолученияДохода = ДобавитьМесяц(ОкончаниеПериода, 1);
			Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.РанняяДатаПолученияДохода) Тогда
				РанняяДатаПолученияДохода = Мин(РанняяДатаПолученияДохода, Выборка.РанняяДатаПолученияДохода);
				ПоздняяДатаПолученияДохода = Макс(ПоздняяДатаПолученияДохода, Выборка.ПоздняяДатаПолученияДохода);
			КонецЕсли;
			Запрос.УстановитьПараметр("РанняяДатаПолученияДохода", РанняяДатаПолученияДохода);
			Запрос.УстановитьПараметр("ПоздняяДатаПолученияДохода", ПоздняяДатаПолученияДохода);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходахНДФЛ.СуммаДохода КАК СуммаДохода,
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.КатегорияДохода КАК КатегорияДохода,
			|	СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК Период,
			|	СведенияОДоходахНДФЛ.Период КАК ПериодРегистрации,
			|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
			|	СведенияОДоходахНДФЛ.ДоходМежрасчетногоПериода КАК ДоходМежрасчетногоПериода,
			|	СведенияОДоходахНДФЛ.НеУчитыватьДоходВ6НДФЛ КАК НеУчитыватьДоходВ6НДФЛ,
			|	СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ КАК ИсточникДоходаЗаПределамиРФ,
			|	СведенияОДоходахНДФЛ.ДокументОснование КАК ДокументОснование
			|ПОМЕСТИТЬ ВТСтрокиДоходов
			|ИЗ
			|	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
			|ГДЕ
			|	СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериода
			|	И СведенияОДоходахНДФЛ.ДатаПолученияДохода МЕЖДУ &РанняяДатаПолученияДохода И &ПоздняяДатаПолученияДохода
			|	И СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане В(&РегистрацияВНалоговомОргане)
			|	И СведенияОДоходахНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
			|	И СведенияОДоходахНДФЛ.СуммаДохода - СведенияОДоходахНДФЛ.СуммаВычета <> 0";
			Запрос.Выполнить();

			УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента(Запрос.МенеджерВременныхТаблиц, "ВТСтрокиДоходов", "УчитыватьИзмененияСтатусаДляОтчетности", ОкончаниеПериода);
		
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СведенияОДоходахНДФЛ.СуммаДохода КАК СуммаДохода,
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	СведенияОДоходахНДФЛ.ПериодРегистрации КАК Период,
			|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
			|	СведенияОДоходахНДФЛ.ДоходМежрасчетногоПериода КАК ДоходМежрасчетногоПериода,
			|	СведенияОДоходахНДФЛ.НеУчитыватьДоходВ6НДФЛ КАК НеУчитыватьДоходВ6НДФЛ,
			|	СведенияОДоходахНДФЛ.ДокументОснование КАК ДокументОснование
			|ПОМЕСТИТЬ ВТСведенияОДоходахНДФЛ
			|ИЗ
			|	ВТСтрокиДоходов КАК СведенияОДоходахНДФЛ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
			|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
			|			И СведенияОДоходахНДФЛ.Период = СтавкаНДФЛПоСтавкеРезидента.Период
			|			И СведенияОДоходахНДФЛ.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
			|			И СведенияОДоходахНДФЛ.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
			|ГДЕ
			|	(НЕ СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ
			|			ИЛИ СтавкаНДФЛПоСтавкеРезидента.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ ВТРегистраторыНачислений
			|ИЗ
			|	ВТСведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВзаиморасчетыССотрудниками.Регистратор КАК Регистратор,
			|	СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов
			|ПОМЕСТИТЬ ВТНачисленоПоРегистраторам
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
			|ГДЕ
			|	ВзаиморасчетыССотрудниками.Регистратор В
			|			(ВЫБРАТЬ
			|				РегистраторыНачислений.Регистратор
			|			ИЗ
			|				ВТРегистраторыНачислений КАК РегистраторыНачислений)
			|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВзаиморасчетыССотрудниками.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВзаиморасчетыССотрудниками.Регистратор КАК Регистратор,
			|	-СУММА(ВзаиморасчетыССотрудниками.Сумма) КАК Сумма
			|ПОМЕСТИТЬ ВТНДФЛПоРегистраторам
			|ИЗ
			|	ВТНалоги КАК ВзаиморасчетыССотрудниками
			|ГДЕ
			|	ВзаиморасчетыССотрудниками.Регистратор В
			|			(ВЫБРАТЬ
			|				РегистраторыНачислений.Регистратор
			|			ИЗ
			|				ВТРегистраторыНачислений КАК РегистраторыНачислений)
			|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВзаиморасчетыССотрудниками.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НалогиПоДатам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НалогиПоДатам.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	НалогиПоДатам.ДокументОснование КАК ДокументОснование,
			|	НАЧАЛОПЕРИОДА(НалогиПоДатам.ДатаУдержания, ДЕНЬ) КАК ДатаУдержания,
			|	НалогиПоДатам.КрайнийСрокУплаты КАК СрокПеречисления,
			|	НалогиПоДатам.Регистратор КАК Регистратор,
			|	НалогиПоДатам.Сумма КАК Сумма,
			|	НалогиПоДатам.СуммаВыплаченногоДохода КАК СуммаВыплаченногоДохода
			|ПОМЕСТИТЬ ВТИсходныеДанныеПоДокументамОснованиям
			|ИЗ
			|	ВТНалоги КАК НалогиПоДатам
			|ГДЕ
			|	НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И &УсловиеОтбораПоДатам
			|	И НалогиПоДатам.УчитыватьВыплаченныйДоходВ6НДФЛ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
			|	МАКСИМУМ(СведенияОДоходахНДФЛ.ДоходМежрасчетногоПериода
			|			ИЛИ НачисленоПоРегистраторам.Регистратор ЕСТЬ NULL
			|				И НДФЛПоРегистраторам.Регистратор ЕСТЬ НЕ NULL ) КАК ЭтоМежрасчетныйДокумент,
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК ДатаПолученияДохода
			|ПОМЕСТИТЬ ВТОснованияНачислений
			|ИЗ
			|	ВТСведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсходныеДанныеПоДокументамОснованиям КАК ОснованияСУдержаннымНалогом
			|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = ОснованияСУдержаннымНалогом.ФизическоеЛицо
			|			И (СведенияОДоходахНДФЛ.ДокументОснование = ОснованияСУдержаннымНалогом.ДокументОснование
			|				ИЛИ СведенияОДоходахНДФЛ.Регистратор = ОснованияСУдержаннымНалогом.Регистратор)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленоПоРегистраторам КАК НачисленоПоРегистраторам
			|		ПО СведенияОДоходахНДФЛ.Регистратор = НачисленоПоРегистраторам.Регистратор
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДФЛПоРегистраторам КАК НДФЛПоРегистраторам
			|		ПО СведенияОДоходахНДФЛ.Регистратор = НДФЛПоРегистраторам.Регистратор
			|ГДЕ
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
			|	И СведенияОДоходахНДФЛ.Период <= &ОкончаниеПериода
			|	И СведенияОДоходахНДФЛ.СуммаДохода > 0
			|	И ОснованияСУдержаннымНалогом.ФизическоеЛицо ЕСТЬ NULL
			|	И (ЕСТЬNULL(НачисленоПоРегистраторам.СуммаВзаиморасчетов, 0) <= ЕСТЬNULL(НДФЛПоРегистраторам.Сумма, 0)
			|			ИЛИ НачисленоПоРегистраторам.Регистратор ЕСТЬ NULL
			|				И НДФЛПоРегистраторам.Регистратор ЕСТЬ НЕ NULL )
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.Регистратор,
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода) КАК СуммаДохода,
			|	Основания.ФизическоеЛицо КАК ФизическоеЛицо,
			|	Основания.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ ВТДоходыПоОснованиям
			|ИЗ
			|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		Основания.ФизическоеЛицо КАК ФизическоеЛицо,
			|		Основания.Регистратор КАК Регистратор
			|	ИЗ
			|		ВТОснованияНачислений КАК Основания) КАК Основания
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
			|		ПО Основания.ФизическоеЛицо = СведенияОДоходахНДФЛ.ФизическоеЛицо
			|			И Основания.Регистратор = СведенияОДоходахНДФЛ.Регистратор
			|			И (СведенияОДоходахНДФЛ.ДатаПолученияДохода <= &ОкончаниеПериода)
			|
			|СГРУППИРОВАТЬ ПО
			|	Основания.ФизическоеЛицо,
			|	Основания.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОснованияНачислений.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ОснованияНачислений.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ ВТОснованияСНеудержаннымНалогом
			|ИЗ
			|	ВТОснованияНачислений КАК ОснованияНачислений
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалоги КАК НалогиПоДатам
			|		ПО ОснованияНачислений.ФизическоеЛицо = НалогиПоДатам.ФизическоеЛицо
			|			И (ОснованияНачислений.Регистратор = НалогиПоДатам.ДокументОснование
			|				ИЛИ ОснованияНачислений.Регистратор = НалогиПоДатам.Регистратор)
			|			И ОснованияНачислений.ДатаПолученияДохода = НалогиПоДатам.ДатаПолученияДохода
			|ГДЕ
			|	ОснованияНачислений.ЭтоМежрасчетныйДокумент
			|
			|СГРУППИРОВАТЬ ПО
			|	ОснованияНачислений.ФизическоеЛицо,
			|	ОснованияНачислений.Регистратор
			|
			|ИМЕЮЩИЕ
			|	СУММА(ВЫБОР
			|			КОГДА НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|				ТОГДА НалогиПоДатам.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) = 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода) КАК СуммаДохода,
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ОснованияСНеудержаннымНалогом.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ОснованияСНеудержаннымНалогом.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ ВТДоходыПоОснованиямСНеудержаннымНалогом
			|ИЗ
			|	ВТОснованияСНеудержаннымНалогом КАК ОснованияСНеудержаннымНалогом
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
			|		ПО ОснованияСНеудержаннымНалогом.ФизическоеЛицо = СведенияОДоходахНДФЛ.ФизическоеЛицо
			|			И ОснованияСНеудержаннымНалогом.Регистратор = СведенияОДоходахНДФЛ.Регистратор
			|			И (СведенияОДоходахНДФЛ.ДатаПолученияДохода <= &ОкончаниеПериода)
			|			И (СведенияОДоходахНДФЛ.СуммаДохода > 0)
			|
			|СГРУППИРОВАТЬ ПО
			|	ОснованияСНеудержаннымНалогом.ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
			|	ОснованияСНеудержаннымНалогом.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МаксимальныеСуммы.ФизическоеЛицо КАК ФизическоеЛицо,
			|	МаксимальныеСуммы.Регистратор КАК Регистратор,
			|	МИНИМУМ(ДоходыПоОснованиямСНеудержаннымНалогом.ДатаПолученияДохода) КАК ДатаПолученияДохода
			|ПОМЕСТИТЬ ВТДатыОснованийСНеудержаннымНалогом
			|ИЗ
			|	(ВЫБРАТЬ
			|		МАКСИМУМ(ДоходыПоОснованиямСНеудержаннымНалогом.СуммаДохода) КАК СуммаДохода,
			|		ДоходыПоОснованиямСНеудержаннымНалогом.ФизическоеЛицо КАК ФизическоеЛицо,
			|		ДоходыПоОснованиямСНеудержаннымНалогом.Регистратор КАК Регистратор
			|	ИЗ
			|		ВТДоходыПоОснованиямСНеудержаннымНалогом КАК ДоходыПоОснованиямСНеудержаннымНалогом
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ДоходыПоОснованиямСНеудержаннымНалогом.ФизическоеЛицо,
			|		ДоходыПоОснованиямСНеудержаннымНалогом.Регистратор) КАК МаксимальныеСуммы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоОснованиямСНеудержаннымНалогом КАК ДоходыПоОснованиямСНеудержаннымНалогом
			|		ПО МаксимальныеСуммы.СуммаДохода = ДоходыПоОснованиямСНеудержаннымНалогом.СуммаДохода
			|			И МаксимальныеСуммы.ФизическоеЛицо = ДоходыПоОснованиямСНеудержаннымНалогом.ФизическоеЛицо
			|			И МаксимальныеСуммы.Регистратор = ДоходыПоОснованиямСНеудержаннымНалогом.Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	МаксимальныеСуммы.ФизическоеЛицо,
			|	МаксимальныеСуммы.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода) КАК СуммаДохода,
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДатыОснованийСНеудержаннымНалогом.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ ВТНатуральныеДоходы
			|ИЗ
			|	ВТСведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсходныеДанныеПоДокументамОснованиям КАК ОснованияСУдержаннымНалогом
			|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = ОснованияСУдержаннымНалогом.ФизическоеЛицо
			|			И СведенияОДоходахНДФЛ.ДокументОснование = ОснованияСУдержаннымНалогом.ДокументОснование
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияСНеудержаннымНалогом КАК ОснованияСНеудержаннымНалогом
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоОснованиям КАК ДоходыПоОснованиямСНеудержаннымНалогом
			|			ПО ОснованияСНеудержаннымНалогом.ФизическоеЛицо = ДоходыПоОснованиямСНеудержаннымНалогом.ФизическоеЛицо
			|				И ОснованияСНеудержаннымНалогом.Регистратор = ДоходыПоОснованиямСНеудержаннымНалогом.Регистратор
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыОснованийСНеудержаннымНалогом КАК ДатыОснованийСНеудержаннымНалогом
			|			ПО ОснованияСНеудержаннымНалогом.ФизическоеЛицо = ДатыОснованийСНеудержаннымНалогом.ФизическоеЛицо
			|				И ОснованияСНеудержаннымНалогом.Регистратор = ДатыОснованийСНеудержаннымНалогом.Регистратор
			|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = ОснованияСНеудержаннымНалогом.ФизическоеЛицо
			|			И СведенияОДоходахНДФЛ.Регистратор = ОснованияСНеудержаннымНалогом.Регистратор
			|ГДЕ
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода <= &ОкончаниеПериода
			|	И СведенияОДоходахНДФЛ.Период <= &ОкончаниеПериода
			|	И ОснованияСНеудержаннымНалогом.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|	И ОснованияСУдержаннымНалогом.ФизическоеЛицо ЕСТЬ NULL
			|	И ДоходыПоОснованиямСНеудержаннымНалогом.СуммаДохода > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
			|	ДатыОснованийСНеудержаннымНалогом.ДатаПолученияДохода,
			|	СведенияОДоходахНДФЛ.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТДатыОснованийСНеудержаннымНалогом
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТДоходыПоОснованиямСНеудержаннымНалогом
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТОснованияСНеудержаннымНалогом
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТДоходыПоОснованиям
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТРегистраторыНачислений
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТНачисленоПоРегистраторам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТНДФЛПоРегистраторам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТОснованияНачислений
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	НалогиПоДатам.ДокументОснование КАК ДокументОснование
			|ПОМЕСТИТЬ ВТМежрасчетныеДокументыОснования
			|ИЗ
			|	ВТНалоги КАК НалогиПоДатам
			|ГДЕ
			|	НалогиПоДатам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|	И НалогиПоДатам.РасчетМежрасчетногоПериода
			|	И НалогиПоДатам.ДокументОснование <> НЕОПРЕДЕЛЕНО
			|	И НЕ НалогиПоДатам.УчитыватьВыплаченныйДоходВ6НДФЛ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НалогиПоДатам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НалогиПоДатам.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	НалогиПоДатам.ДокументОснование КАК ДокументОснование,
			|	НАЧАЛОПЕРИОДА(НалогиПоДатам.ДатаУдержания, ДЕНЬ) КАК ДатаУдержания,
			|	НалогиПоДатам.КрайнийСрокУплаты КАК СрокПеречисления,
			|	СУММА(НалогиПоДатам.Сумма) КАК Сумма,
			|	МежрасчетныеДокументыОснования.ДокументОснование ЕСТЬ НЕ NULL  КАК ЭтоМежрасчетныйДокумент
			|ПОМЕСТИТЬ ВТИсходныеДанныеПоСтарымДокументамОснованиям
			|ИЗ
			|	ВТНалоги КАК НалогиПоДатам
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМежрасчетныеДокументыОснования КАК МежрасчетныеДокументыОснования
			|		ПО НалогиПоДатам.ДокументОснование = МежрасчетныеДокументыОснования.ДокументОснование
			|ГДЕ
			|	НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И &УсловиеОтбораПоДатам
			|	И НЕ НалогиПоДатам.УчитыватьВыплаченныйДоходВ6НДФЛ
			|
			|СГРУППИРОВАТЬ ПО
			|	НалогиПоДатам.ФизическоеЛицо,
			|	НалогиПоДатам.ДатаПолученияДохода,
			|	НалогиПоДатам.ДокументОснование,
			|	НАЧАЛОПЕРИОДА(НалогиПоДатам.ДатаУдержания, ДЕНЬ),
			|	НалогиПоДатам.КрайнийСрокУплаты,
			|	МежрасчетныеДокументыОснования.ДокументОснование
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НалогиПоДатам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НалогиПоДатам.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	НалогиПоДатам.ДокументОснование КАК ДокументОснование,
			|	ВЫБОР
			|		КОГДА СУММА(ВЫБОР
			|					КОГДА НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|							И &УсловиеОтбораПоДатам
			|						ТОГДА НалогиПоДатам.Сумма
			|					ИНАЧЕ 0
			|				КОНЕЦ) = 0
			|			ТОГДА 0
			|		КОГДА СУММА(ВЫБОР
			|					КОГДА НалогиПоДатам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|						ТОГДА НалогиПоДатам.Сумма
			|					КОГДА НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
			|						ТОГДА -НалогиПоДатам.Сумма
			|					ИНАЧЕ 0
			|				КОНЕЦ) = 0
			|			ТОГДА 1
			|		ИНАЧЕ СУММА(ВЫБОР
			|					КОГДА НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|							И &УсловиеОтбораПоДатам
			|						ТОГДА НалогиПоДатам.Сумма
			|					ИНАЧЕ 0
			|				КОНЕЦ) / СУММА(ВЫБОР
			|					КОГДА НалогиПоДатам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|						ТОГДА НалогиПоДатам.Сумма
			|					КОГДА НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
			|						ТОГДА -НалогиПоДатам.Сумма
			|					ИНАЧЕ 0
			|				КОНЕЦ)
			|	КОНЕЦ КАК Доля
			|ПОМЕСТИТЬ ВТДолиПолученногоДоходаПоДокументамОснованиям
			|ИЗ
			|	ВТНалоги КАК НалогиПоДатам
			|ГДЕ
			|	НалогиПоДатам.ДатаУдержания <= &ОкончаниеПериода
			|	И НЕ НалогиПоДатам.УчитыватьВыплаченныйДоходВ6НДФЛ
			|
			|СГРУППИРОВАТЬ ПО
			|	НалогиПоДатам.ФизическоеЛицо,
			|	НалогиПоДатам.ДатаПолученияДохода,
			|	НалогиПоДатам.ДокументОснование
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеУчета.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеУчета.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ДанныеУчета.ДокументОснование КАК Регистратор,
			|	ЕСТЬNULL(ВЫРАЗИТЬ(СУММА(СведенияОДоходахНДФЛ.СуммаДохода) * ВЫБОР
			|				КОГДА ДанныеУчета.Доля > 1
			|					ТОГДА 1
			|				ИНАЧЕ ДанныеУчета.Доля
			|			КОНЕЦ КАК ЧИСЛО(15, 2)), 0) КАК СуммаДохода
			|ИЗ
			|	ВТДолиПолученногоДоходаПоДокументамОснованиям КАК ДанныеУчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
			|		ПО ДанныеУчета.ФизическоеЛицо = СведенияОДоходахНДФЛ.ФизическоеЛицо
			|			И ДанныеУчета.ДатаПолученияДохода = СведенияОДоходахНДФЛ.ДатаПолученияДохода
			|			И ДанныеУчета.ДокументОснование = СведенияОДоходахНДФЛ.Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеУчета.ФизическоеЛицо,
			|	ДанныеУчета.ДатаПолученияДохода,
			|	ДанныеУчета.Доля,
			|	ДанныеУчета.ДокументОснование
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	ДатаПолученияДохода,
			|	Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИсходныеДанные.ДокументОснование КАК Регистратор,
			|	ИсходныеДанные.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ИсходныеДанные.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ИсходныеДанные.ДатаУдержания КАК ДатаУдержания,
			|	ИсходныеДанные.СрокПеречисления КАК СрокПеречисления,
			|	ИсходныеДанные.Сумма КАК Сумма,
			|	0 КАК СуммаФактическиПолученногоДохода
			|ИЗ
			|	ВТИсходныеДанныеПоСтарымДокументамОснованиям КАК ИсходныеДанные
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	ДатаПолученияДохода,
			|	Регистратор";
			Если ОкончаниеПериода < '20160701' Тогда
				Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораПоДатам", "НалогиПоДатам.ДатаУдержания МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода");
			Иначе
				Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораПоДатам", "НалогиПоДатам.КрайнийСрокУплаты МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода И НалогиПоДатам.ДатаУдержания >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)");
			КонецЕсли;
			Результаты = Запрос.ВыполнитьПакет();
			ВсегоРезультатов = Результаты.Количество();
			НеОбработанныеДанные = Результаты[ВсегоРезультатов - 1].Выгрузить();
			ОбработанныеДанные = НеОбработанныеДанные.СкопироватьКолонки();
			СуммыДоходов = Результаты[ВсегоРезультатов - 2].Выгрузить();
			СтруктураПоиска = Новый Структура("ФизическоеЛицо,ДатаПолученияДохода,Регистратор");
			Для каждого СтрокаДохода Из СуммыДоходов Цикл
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаДохода);
				ВременнаяТаблица = НеОбработанныеДанные.Скопировать(НеОбработанныеДанные.НайтиСтроки(СтруктураПоиска));
				Если ВременнаяТаблица.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаДохода.СуммаДохода) Тогда
					Если ВременнаяТаблица.Количество() = 1 Тогда
						ВременнаяТаблица[0].СуммаФактическиПолученногоДохода = СтрокаДохода.СуммаДохода
					Иначе
						КоэффициентыРаспределения = ВременнаяТаблица.ВыгрузитьКолонку("Сумма");
						РаспределениеРесурса = ЗарплатаКадрыКлиентСервер.РаспределитьПропорциональноКоэффициентам(СтрокаДохода.СуммаДохода, КоэффициентыРаспределения);
						Если РаспределениеРесурса <> Неопределено Тогда
							ВременнаяТаблица.ЗагрузитьКолонку(РаспределениеРесурса, "СуммаФактическиПолученногоДохода");
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ВременнаяТаблица, ОбработанныеДанные)
			КонецЦикла;
			Запрос.УстановитьПараметр("ОбработанныеДанные", ОбработанныеДанные); НеОбработанныеДанные = Неопределено; СуммыДоходов = Неопределено; ОбработанныеДанные = Неопределено; ВременнаяТаблица = Неопределено;
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Данные.Регистратор,
			|	Данные.ФизическоеЛицо,
			|	Данные.ДатаПолученияДохода,
			|	Данные.ДатаУдержания,
			|	Данные.СрокПеречисления,
			|	Данные.СуммаФактическиПолученногоДохода,
			|	Данные.Сумма
			|ПОМЕСТИТЬ ВТОбработанныеДанныеПоДокументамОснованиям
			|ИЗ
			|	&ОбработанныеДанные КАК Данные
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НалогиПоДатам.ФизическоеЛицо,
			|	НалогиПоДатам.ДатаПолученияДохода,
			|	ВЫБОР
			|		КОГДА СУММА(ВЫБОР
			|					КОГДА НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|							И &УсловиеОтбораПоДатам
			|						ТОГДА НалогиПоДатам.Сумма
			|					ИНАЧЕ 0
			|				КОНЕЦ) = 0
			|			ТОГДА 0
			|		КОГДА СУММА(ВЫБОР
			|					КОГДА НалогиПоДатам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|						ТОГДА НалогиПоДатам.Сумма
			|					КОГДА НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
			|						ТОГДА -НалогиПоДатам.Сумма
			|					ИНАЧЕ 0
			|				КОНЕЦ) = 0
			|			ТОГДА 1
			|		ИНАЧЕ СУММА(ВЫБОР
			|					КОГДА НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|							И &УсловиеОтбораПоДатам
			|						ТОГДА НалогиПоДатам.Сумма
			|					ИНАЧЕ 0
			|				КОНЕЦ) / СУММА(ВЫБОР
			|					КОГДА НалогиПоДатам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|						ТОГДА НалогиПоДатам.Сумма
			|					КОГДА НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
			|						ТОГДА -НалогиПоДатам.Сумма
			|					ИНАЧЕ 0
			|				КОНЕЦ)
			|	КОНЕЦ КАК Доля
			|ПОМЕСТИТЬ ВТДолиПолученногоДохода
			|ИЗ
			|	ВТНалоги КАК НалогиПоДатам
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМежрасчетныеДокументыОснования КАК МежрасчетныеДокументыОснования
			|		ПО НалогиПоДатам.ДокументОснование = МежрасчетныеДокументыОснования.ДокументОснование
			|ГДЕ
			|	НалогиПоДатам.ДатаУдержания <= &ОкончаниеПериода
			|	И МежрасчетныеДокументыОснования.ДокументОснование ЕСТЬ NULL 
			|	И НЕ НалогиПоДатам.УчитыватьВыплаченныйДоходВ6НДФЛ
			|
			|СГРУППИРОВАТЬ ПО
			|	НалогиПоДатам.ФизическоеЛицо,
			|	НалогиПоДатам.ДатаПолученияДохода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИсходныеДанные.ФизическоеЛицо,
			|	ИсходныеДанные.ДатаПолученияДохода,
			|	МАКСИМУМ(ИсходныеДанные.ДатаУдержания) КАК ДатаУдержания
			|ПОМЕСТИТЬ ВТДатыУчета
			|ИЗ
			|	ВТИсходныеДанныеПоСтарымДокументамОснованиям КАК ИсходныеДанные
			|ГДЕ
			|	НЕ ИсходныеДанные.ЭтоМежрасчетныйДокумент
			|
			|СГРУППИРОВАТЬ ПО
			|	ИсходныеДанные.ФизическоеЛицо,
			|	ИсходныеДанные.ДатаПолученияДохода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДатыУчета.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.Регистратор
			|ПОМЕСТИТЬ ВТОснованияСУдержаннымНалогом
			|ИЗ
			|	ВТДатыУчета КАК ДатыУчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
			|		ПО ДатыУчета.ФизическоеЛицо = СведенияОДоходахНДФЛ.ФизическоеЛицо
			|			И ДатыУчета.ДатаПолученияДохода = СведенияОДоходахНДФЛ.ДатаПолученияДохода
			|			И (ВЫБОР
			|				КОГДА ДатыУчета.ДатаУдержания > ДатыУчета.ДатаПолученияДохода
			|					ТОГДА ДатыУчета.ДатаУдержания
			|				ИНАЧЕ ДатыУчета.ДатаПолученияДохода
			|			КОНЕЦ >= НАЧАЛОПЕРИОДА(СведенияОДоходахНДФЛ.Период, ДЕНЬ))
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДолиПолученногоДохода КАК ДолиПолученногоДохода
			|		ПО ДатыУчета.ДатаПолученияДохода = ДолиПолученногоДохода.ДатаПолученияДохода
			|			И ДатыУчета.ФизическоеЛицо = ДолиПолученногоДохода.ФизическоеЛицо
			|ГДЕ
			|	НЕ СведенияОДоходахНДФЛ.Регистратор В
			|				(ВЫБРАТЬ
			|					ДанныеПоДокументамОснованиям.Регистратор
			|				ИЗ
			|					ВТОбработанныеДанныеПоДокументамОснованиям КАК ДанныеПоДокументамОснованиям
			|				ГДЕ
			|					ДанныеПоДокументамОснованиям.СуммаФактическиПолученногоДохода <> 0)
			|	И ЕСТЬNULL(ДолиПолученногоДохода.Доля, 0) <> 0
			|	И НЕ СведенияОДоходахНДФЛ.НеУчитыватьДоходВ6НДФЛ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОбработанныеДанныеПоДокументамОснованиям.ФизическоеЛицо,
			|	ОбработанныеДанныеПоДокументамОснованиям.Регистратор
			|ИЗ
			|	ВТОбработанныеДанныеПоДокументамОснованиям КАК ОбработанныеДанныеПоДокументамОснованиям
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
			|	МАКСИМУМ(СведенияОДоходахНДФЛ.ДоходМежрасчетногоПериода) КАК ЭтоМежрасчетныйДокумент
			|ПОМЕСТИТЬ ВТОснованияНачислений
			|ИЗ
			|	ВТСведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияСУдержаннымНалогом КАК ОснованияСУдержаннымНалогом
			|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = ОснованияСУдержаннымНалогом.ФизическоеЛицо
			|			И СведенияОДоходахНДФЛ.Регистратор = ОснованияСУдержаннымНалогом.Регистратор
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
			|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = ВзаиморасчетыССотрудниками.ФизическоеЛицо
			|			И СведенияОДоходахНДФЛ.Регистратор = ВзаиморасчетыССотрудниками.Регистратор
			|ГДЕ
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
			|	И СведенияОДоходахНДФЛ.Период <= &ОкончаниеПериода
			|	И СведенияОДоходахНДФЛ.СуммаДохода > 0
			|	И ОснованияСУдержаннымНалогом.ФизическоеЛицо ЕСТЬ NULL 
			|	И НЕ СведенияОДоходахНДФЛ.НеУчитыватьДоходВ6НДФЛ
			|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.Регистратор,
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода) КАК СуммаДохода,
			|	Основания.ФизическоеЛицо,
			|	Основания.Регистратор
			|ПОМЕСТИТЬ ВТДоходыПоОснованиям
			|ИЗ
			|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		Основания.ФизическоеЛицо КАК ФизическоеЛицо,
			|		Основания.Регистратор КАК Регистратор
			|	ИЗ
			|		ВТОснованияНачислений КАК Основания) КАК Основания
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
			|		ПО Основания.ФизическоеЛицо = СведенияОДоходахНДФЛ.ФизическоеЛицо
			|			И Основания.Регистратор = СведенияОДоходахНДФЛ.Регистратор
			|			И (СведенияОДоходахНДФЛ.ДатаПолученияДохода <= &ОкончаниеПериода)
			|
			|СГРУППИРОВАТЬ ПО
			|	Основания.ФизическоеЛицо,
			|	Основания.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОснованияНачислений.ФизическоеЛицо,
			|	ОснованияНачислений.Регистратор
			|ПОМЕСТИТЬ ВТОснованияСНеудержаннымНалогом
			|ИЗ
			|	ВТОснованияНачислений КАК ОснованияНачислений
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалоги КАК НалогиПоДатам
			|		ПО ОснованияНачислений.ФизическоеЛицо = НалогиПоДатам.ФизическоеЛицо
			|			И ОснованияНачислений.Регистратор = НалогиПоДатам.ДокументОснование
			|			И ОснованияНачислений.ДатаПолученияДохода = НалогиПоДатам.ДатаПолученияДохода
			|ГДЕ
			|	ОснованияНачислений.ЭтоМежрасчетныйДокумент
			|
			|СГРУППИРОВАТЬ ПО
			|	ОснованияНачислений.ФизическоеЛицо,
			|	ОснованияНачислений.Регистратор
			|
			|ИМЕЮЩИЕ
			|	СУММА(ВЫБОР
			|			КОГДА НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|				ТОГДА НалогиПоДатам.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) = 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода) КАК СуммаДохода,
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
			|	ОснованияСНеудержаннымНалогом.ФизическоеЛицо,
			|	ОснованияСНеудержаннымНалогом.Регистратор
			|ПОМЕСТИТЬ ВТДоходыПоОснованиямСНеудержаннымНалогом
			|ИЗ
			|	ВТОснованияСНеудержаннымНалогом КАК ОснованияСНеудержаннымНалогом
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
			|		ПО ОснованияСНеудержаннымНалогом.ФизическоеЛицо = СведенияОДоходахНДФЛ.ФизическоеЛицо
			|			И ОснованияСНеудержаннымНалогом.Регистратор = СведенияОДоходахНДФЛ.Регистратор
			|			И (СведенияОДоходахНДФЛ.ДатаПолученияДохода <= &ОкончаниеПериода)
			|			И (СведенияОДоходахНДФЛ.СуммаДохода > 0)
			|
			|СГРУППИРОВАТЬ ПО
			|	ОснованияСНеудержаннымНалогом.ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
			|	ОснованияСНеудержаннымНалогом.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МаксимальныеСуммы.ФизическоеЛицо,
			|	МаксимальныеСуммы.Регистратор,
			|	МИНИМУМ(ДоходыПоОснованиямСНеудержаннымНалогом.ДатаПолученияДохода) КАК ДатаПолученияДохода
			|ПОМЕСТИТЬ ВТДатыОснованийСНеудержаннымНалогом
			|ИЗ
			|	(ВЫБРАТЬ
			|		МАКСИМУМ(ДоходыПоОснованиямСНеудержаннымНалогом.СуммаДохода) КАК СуммаДохода,
			|		ДоходыПоОснованиямСНеудержаннымНалогом.ФизическоеЛицо КАК ФизическоеЛицо,
			|		ДоходыПоОснованиямСНеудержаннымНалогом.Регистратор КАК Регистратор
			|	ИЗ
			|		ВТДоходыПоОснованиямСНеудержаннымНалогом КАК ДоходыПоОснованиямСНеудержаннымНалогом
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ДоходыПоОснованиямСНеудержаннымНалогом.ФизическоеЛицо,
			|		ДоходыПоОснованиямСНеудержаннымНалогом.Регистратор) КАК МаксимальныеСуммы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоОснованиямСНеудержаннымНалогом КАК ДоходыПоОснованиямСНеудержаннымНалогом
			|		ПО МаксимальныеСуммы.СуммаДохода = ДоходыПоОснованиямСНеудержаннымНалогом.СуммаДохода
			|			И МаксимальныеСуммы.ФизическоеЛицо = ДоходыПоОснованиямСНеудержаннымНалогом.ФизическоеЛицо
			|			И МаксимальныеСуммы.Регистратор = ДоходыПоОснованиямСНеудержаннымНалогом.Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	МаксимальныеСуммы.ФизическоеЛицо,
			|	МаксимальныеСуммы.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОснованияНачислений.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ОснованияНачислений.ДатаПолученияДохода КАК ДатаПолученияДохода
			|ПОМЕСТИТЬ ВТОставшиесяДатыПолученияДохода
			|ИЗ
			|	ВТОснованияНачислений КАК ОснованияНачислений
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияСНеудержаннымНалогом КАК ОснованияСНеудержаннымНалогом
			|		ПО ОснованияНачислений.Регистратор = ОснованияСНеудержаннымНалогом.Регистратор
			|			И ОснованияНачислений.ФизическоеЛицо = ОснованияСНеудержаннымНалогом.ФизическоеЛицо
			|ГДЕ
			|	ОснованияСНеудержаннымНалогом.ФизическоеЛицо ЕСТЬ NULL 
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДатыПолученияДохода.ФизическоеЛицо,
			|	ДатыПолученияДохода.ДатаПолученияДохода
			|ПОМЕСТИТЬ ВТДатыПолученияДоходаБезНалогов
			|ИЗ
			|	ВТОставшиесяДатыПолученияДохода КАК ДатыПолученияДохода
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалоги КАК НалогиПоДатам
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияСУдержаннымНалогом КАК ОснованияСУдержаннымНалогом
			|			ПО НалогиПоДатам.ФизическоеЛицо = ОснованияСУдержаннымНалогом.ФизическоеЛицо
			|				И НалогиПоДатам.ДокументОснование = ОснованияСУдержаннымНалогом.Регистратор
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияСНеудержаннымНалогом КАК ОснованияСНеудержаннымНалогом
			|			ПО НалогиПоДатам.ДокументОснование = ОснованияСНеудержаннымНалогом.Регистратор
			|				И НалогиПоДатам.ФизическоеЛицо = ОснованияСНеудержаннымНалогом.ФизическоеЛицо
			|		ПО ДатыПолученияДохода.ФизическоеЛицо = НалогиПоДатам.ФизическоеЛицо
			|			И ДатыПолученияДохода.ДатаПолученияДохода = НалогиПоДатам.ДатаПолученияДохода
			|	И НЕ НалогиПоДатам.УчитыватьВыплаченныйДоходВ6НДФЛ
			|ГДЕ
			|	ОснованияСНеудержаннымНалогом.ФизическоеЛицо ЕСТЬ NULL 
			|	И ОснованияСУдержаннымНалогом.ФизическоеЛицо ЕСТЬ NULL 
			|
			|СГРУППИРОВАТЬ ПО
			|	ДатыПолученияДохода.ФизическоеЛицо,
			|	ДатыПолученияДохода.ДатаПолученияДохода
			|
			|ИМЕЮЩИЕ
			|	СУММА(ВЫБОР
			|			КОГДА НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|				ТОГДА НалогиПоДатам.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) = 0 И
			|	СУММА(ВЫБОР
			|			КОГДА НалогиПоДатам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|				ТОГДА НалогиПоДатам.Сумма
			|			КОГДА НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
			|				ТОГДА -НалогиПоДатам.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) = 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(Доходы.СуммаДохода) КАК СуммаДохода,
			|	Доходы.ФизическоеЛицо,
			|	Доходы.ДатаПолученияДохода,
			|	Доходы.Регистратор
			|ПОМЕСТИТЬ ВТДоходыБезНалогов
			|ИЗ
			|	(ВЫБРАТЬ
			|		СведенияОДоходахНДФЛ.СуммаДохода КАК СуммаДохода,
			|		СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|		СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|		СведенияОДоходахНДФЛ.Регистратор КАК Регистратор
			|	ИЗ
			|		ВТСведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоОснованиям КАК ДоходыПоОснованиям
			|			ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = ДоходыПоОснованиям.ФизическоеЛицо
			|				И СведенияОДоходахНДФЛ.Регистратор = ДоходыПоОснованиям.Регистратор
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыПолученияДоходаБезНалогов КАК ДатыПолученияДоходаБезНалогов
			|			ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = ДатыПолученияДоходаБезНалогов.ФизическоеЛицо
			|				И СведенияОДоходахНДФЛ.ДатаПолученияДохода = ДатыПолученияДоходаБезНалогов.ДатаПолученияДохода
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияСУдержаннымНалогом КАК ОснованияСУдержаннымНалогом
			|			ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = ОснованияСУдержаннымНалогом.ФизическоеЛицо
			|				И СведенияОДоходахНДФЛ.Регистратор = ОснованияСУдержаннымНалогом.Регистратор
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияСНеудержаннымНалогом КАК ОснованияСНеудержаннымНалогом
			|			ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = ОснованияСНеудержаннымНалогом.ФизическоеЛицо
			|				И СведенияОДоходахНДФЛ.Регистратор = ОснованияСНеудержаннымНалогом.Регистратор
			|	ГДЕ
			|		СведенияОДоходахНДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
			|		И СведенияОДоходахНДФЛ.Период <= &ОкончаниеПериода
			|		И НЕ СведенияОДоходахНДФЛ.НеУчитыватьДоходВ6НДФЛ
			|		И ДатыПолученияДоходаБезНалогов.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|		И ОснованияСНеудержаннымНалогом.ФизическоеЛицо ЕСТЬ NULL 
			|		И ОснованияСУдержаннымНалогом.ФизическоеЛицо ЕСТЬ NULL 
			|		И ДоходыПоОснованиям.СуммаДохода > 0
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		СведенияОДоходахНДФЛ.СуммаДохода,
			|		СведенияОДоходахНДФЛ.ФизическоеЛицо,
			|		ДатыОснованийСНеудержаннымНалогом.ДатаПолученияДохода,
			|		СведенияОДоходахНДФЛ.Регистратор
			|	ИЗ
			|		ВТСведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияСУдержаннымНалогом КАК ОснованияСУдержаннымНалогом
			|			ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = ОснованияСУдержаннымНалогом.ФизическоеЛицо
			|				И СведенияОДоходахНДФЛ.Регистратор = ОснованияСУдержаннымНалогом.Регистратор
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияСНеудержаннымНалогом КАК ОснованияСНеудержаннымНалогом
			|				ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоОснованиям КАК ДоходыПоОснованиямСНеудержаннымНалогом
			|				ПО ОснованияСНеудержаннымНалогом.ФизическоеЛицо = ДоходыПоОснованиямСНеудержаннымНалогом.ФизическоеЛицо
			|					И ОснованияСНеудержаннымНалогом.Регистратор = ДоходыПоОснованиямСНеудержаннымНалогом.Регистратор
			|				ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыОснованийСНеудержаннымНалогом КАК ДатыОснованийСНеудержаннымНалогом
			|				ПО ОснованияСНеудержаннымНалогом.ФизическоеЛицо = ДатыОснованийСНеудержаннымНалогом.ФизическоеЛицо
			|					И ОснованияСНеудержаннымНалогом.Регистратор = ДатыОснованийСНеудержаннымНалогом.Регистратор
			|			ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = ОснованияСНеудержаннымНалогом.ФизическоеЛицо
			|				И СведенияОДоходахНДФЛ.Регистратор = ОснованияСНеудержаннымНалогом.Регистратор
			|	ГДЕ
			|		СведенияОДоходахНДФЛ.ДатаПолученияДохода <= &ОкончаниеПериода
			|		И СведенияОДоходахНДФЛ.Период <= &ОкончаниеПериода
			|		И НЕ СведенияОДоходахНДФЛ.НеУчитыватьДоходВ6НДФЛ
			|		И ОснованияСНеудержаннымНалогом.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|		И ОснованияСУдержаннымНалогом.ФизическоеЛицо ЕСТЬ NULL 
			|		И ДоходыПоОснованиямСНеудержаннымНалогом.СуммаДохода > 0) КАК Доходы
			|
			|СГРУППИРОВАТЬ ПО
			|	Доходы.ФизическоеЛицо,
			|	Доходы.ДатаПолученияДохода,
			|	Доходы.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДатыУчета.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДатыУчета.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ЕСТЬNULL(ВЫРАЗИТЬ(СУММА(СведенияОДоходахНДФЛ.СуммаДохода) * ВЫБОР
			|				КОГДА ДолиПолученногоДохода.Доля > 1
			|					ТОГДА 1
			|				ИНАЧЕ ДолиПолученногоДохода.Доля
			|			КОНЕЦ КАК ЧИСЛО(15, 2)), 0) КАК СуммаДохода
			|ИЗ
			|	ВТДатыУчета КАК ДатыУчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
			|		ПО ДатыУчета.ФизическоеЛицо = СведенияОДоходахНДФЛ.ФизическоеЛицо
			|			И ДатыУчета.ДатаПолученияДохода = СведенияОДоходахНДФЛ.ДатаПолученияДохода
			|			И (ВЫБОР
			|				КОГДА ДатыУчета.ДатаУдержания > ДатыУчета.ДатаПолученияДохода
			|					ТОГДА ДатыУчета.ДатаУдержания
			|				ИНАЧЕ ДатыУчета.ДатаПолученияДохода
			|			КОНЕЦ >= НАЧАЛОПЕРИОДА(СведенияОДоходахНДФЛ.Период, ДЕНЬ))
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДолиПолученногоДохода КАК ДолиПолученногоДохода
			|		ПО ДатыУчета.ДатаПолученияДохода = ДолиПолученногоДохода.ДатаПолученияДохода
			|			И ДатыУчета.ФизическоеЛицо = ДолиПолученногоДохода.ФизическоеЛицо
			|ГДЕ
			|	НЕ СведенияОДоходахНДФЛ.Регистратор В
			|				(ВЫБРАТЬ
			|					ДанныеПоДокументамОснованиям.Регистратор
			|				ИЗ
			|					ВТОбработанныеДанныеПоДокументамОснованиям КАК ДанныеПоДокументамОснованиям
			|				ГДЕ
			|					ДанныеПоДокументамОснованиям.СуммаФактическиПолученногоДохода <> 0)
			|	И НЕ СведенияОДоходахНДФЛ.НеУчитыватьДоходВ6НДФЛ
			|
			|СГРУППИРОВАТЬ ПО
			|	ДатыУчета.ФизическоеЛицо,
			|	ДатыУчета.ДатаПолученияДохода,
			|	ДолиПолученногоДохода.Доля
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	ДатаПолученияДохода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИсходныеДанные.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ИсходныеДанные.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ИсходныеДанные.ДатаУдержания,
			|	ИсходныеДанные.СрокПеречисления,
			|	СУММА(ИсходныеДанные.Сумма) КАК Сумма,
			|	0 КАК СуммаФактическиПолученногоДохода
			|ИЗ
			|	ВТИсходныеДанныеПоСтарымДокументамОснованиям КАК ИсходныеДанные
			|ГДЕ
			|	НЕ ИсходныеДанные.ЭтоМежрасчетныйДокумент
			|
			|СГРУППИРОВАТЬ ПО
			|	ИсходныеДанные.ФизическоеЛицо,
			|	ИсходныеДанные.ДатаПолученияДохода,
			|	ИсходныеДанные.ДатаУдержания,
			|	ИсходныеДанные.СрокПеречисления
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	ДатаПолученияДохода";
			Если ОкончаниеПериода < '20160701' Тогда
				Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораПоДатам", "НалогиПоДатам.ДатаУдержания МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода");
			Иначе
				Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораПоДатам", "НалогиПоДатам.КрайнийСрокУплаты МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода И НалогиПоДатам.ДатаУдержания >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)");
			КонецЕсли;
			
			Результаты = Запрос.ВыполнитьПакет();
			ВсегоРезультатов = Результаты.Количество();
			НеОбработанныеДанные = Результаты[ВсегоРезультатов - 1].Выгрузить();
			СуммыДоходов = Результаты[ВсегоРезультатов - 2].Выгрузить();
			ОбработанныеДанные = НеОбработанныеДанные.СкопироватьКолонки();
			СтруктураПоиска = Новый Структура("ФизическоеЛицо,ДатаПолученияДохода");
			Для каждого СтрокаДохода Из СуммыДоходов Цикл
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаДохода);
				ВременнаяТаблица = НеОбработанныеДанные.Скопировать(НеОбработанныеДанные.НайтиСтроки(СтруктураПоиска));
				Если ВременнаяТаблица.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаДохода.СуммаДохода) Тогда
					Если ВременнаяТаблица.Количество() = 1 Тогда
						ВременнаяТаблица[0].СуммаФактическиПолученногоДохода = СтрокаДохода.СуммаДохода
					Иначе
						КоэффициентыРаспределения = ВременнаяТаблица.ВыгрузитьКолонку("Сумма");
						РаспределениеРесурса = ЗарплатаКадрыКлиентСервер.РаспределитьПропорциональноКоэффициентам(СтрокаДохода.СуммаДохода, КоэффициентыРаспределения);
						Если РаспределениеРесурса <> Неопределено Тогда
							ВременнаяТаблица.ЗагрузитьКолонку(РаспределениеРесурса, "СуммаФактическиПолученногоДохода");
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ВременнаяТаблица, ОбработанныеДанные)
			КонецЦикла;
			
			Запрос.УстановитьПараметр("ОбработанныеДанные", ОбработанныеДанные); 
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Данные.ФизическоеЛицо,
			|	Данные.ДатаПолученияДохода,
			|	Данные.ДатаУдержания,
			|	Данные.СрокПеречисления,
			|	Данные.СуммаФактическиПолученногоДохода
			|ПОМЕСТИТЬ ВТОбработанныеДанные
			|ИЗ
			|	&ОбработанныеДанные КАК Данные";
			Запрос.Выполнить();
			
			НеОбработанныеДанные = Неопределено; СуммыДоходов = Неопределено; ОбработанныеДанные = Неопределено; ВременнаяТаблица = Неопределено;

			ТекстЗапроса =
			"ВЫБРАТЬ
			|	НалогиПоДатам.Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо,
			|	НалогиПоДатам.ДатаПолученияДохода КАК ДатаФактическогоПолученияДохода,
			|	НалогиПоДатам.ДатаПолученияДохода КАК П000020010001,
			|	НалогиПоДатам.ДатаУдержания КАК ДатаУдержанияНалога,
			|	НалогиПоДатам.ДатаУдержания КАК П000020011001,
			|	НалогиПоДатам.СрокПеречисления КАК СрокПеречисленияНалога,
			|	НалогиПоДатам.СрокПеречисления КАК П000020012001,
			|	СУММА(НалогиПоДатам.СуммаФактическиПолученногоДохода) < 0 КАК ОтрицательныйДоход,
			|	СУММА(НалогиПоДатам.СуммаФактическиПолученногоДохода) КАК П000020013001,
			|	СУММА(НалогиПоДатам.Сумма) КАК П000020014001
			|ИЗ
			|	(ВЫБРАТЬ
			|		Данные.ДокументОснование КАК Регистратор,
			|		Данные.ФизическоеЛицо КАК ФизическоеЛицо,
			|		Данные.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|		Данные.ДатаУдержания КАК ДатаУдержания,
			|		Данные.СрокПеречисления КАК СрокПеречисления,
			|		Данные.СуммаВыплаченногоДохода КАК СуммаФактическиПолученногоДохода,
			|		Данные.Сумма КАК Сумма
			|	ИЗ
			|		ВТИсходныеДанныеПоДокументамОснованиям КАК Данные
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Данные.Регистратор,
			|		Данные.ФизическоеЛицо,
			|		Данные.ДатаПолученияДохода,
			|		ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
			|		ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
			|		Данные.СуммаДохода,
			|		0
			|	ИЗ
			|		ВТНатуральныеДоходы КАК Данные
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		НЕОПРЕДЕЛЕНО,
			|		Данные.ФизическоеЛицо,
			|		Данные.ДатаПолученияДохода,
			|		Данные.ДатаУдержания,
			|		Данные.СрокПеречисления,
			|		Данные.СуммаФактическиПолученногоДохода,
			|		0
			|	ИЗ
			|		ВТОбработанныеДанные КАК Данные
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Данные.Регистратор,
			|		Данные.ФизическоеЛицо,
			|		Данные.ДатаПолученияДохода,
			|		ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
			|		ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
			|		Данные.СуммаДохода,
			|		0
			|	ИЗ
			|		ВТДоходыБезНалогов КАК Данные
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Данные.Регистратор,
			|		Данные.ФизическоеЛицо,
			|		Данные.ДатаПолученияДохода,
			|		Данные.ДатаУдержания,
			|		Данные.СрокПеречисления,
			|		Данные.СуммаФактическиПолученногоДохода,
			|		Данные.Сумма
			|	ИЗ
			|		ВТОбработанныеДанныеПоДокументамОснованиям КАК Данные) КАК НалогиПоДатам
			|
			|СГРУППИРОВАТЬ ПО
			|	НалогиПоДатам.Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо,
			|	НалогиПоДатам.ДатаПолученияДохода,
			|	НалогиПоДатам.ДатаУдержания,
			|	НалогиПоДатам.СрокПеречисления,
			|	НалогиПоДатам.ДатаПолученияДохода,
			|	НалогиПоДатам.ДатаУдержания,
			|	НалогиПоДатам.СрокПеречисления
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаУдержанияНалога,
			|	СрокПеречисленияНалога,
			|	ДатаФактическогоПолученияДохода";
			
			МассивПолей = Новый Массив;
			МассивПолей.Добавить("ФизическоеЛицо");
			МассивПолей.Добавить("Регистратор");
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "НалогиПоДатам");
			СводныйРезультат = Запрос.Выполнить().Выгрузить();
			
			Если СводныйРезультат.Найти(Истина,"ОтрицательныйДоход") <> Неопределено Тогда
				
				Запрос.Текст = ТекстЗапроса;
				ВременнаяТаблица = Запрос.Выполнить().Выгрузить();
				
				ОстатокПересчета = 0;
				ОстаткиПересчетаПоФизлицам = Новый Соответствие;
				ОстатокНалогов = 0;
				ОстаткиНалоговПоФизлицам = Новый Соответствие;
				Для каждого СтрокаТЗ Из ВременнаяТаблица Цикл
					Если СтрокаТЗ.П000020013001 = 0 Тогда
					ИначеЕсли СтрокаТЗ.П000020013001 > 0 Тогда
						Если ОстатокПересчета > 0 Тогда
							ОстатокФизлица = ОстаткиПересчетаПоФизлицам[СтрокаТЗ.ФизическоеЛицо];
							Если ЗначениеЗаполнено(ОстатокФизлица) Тогда
								КЗачету = Мин(СтрокаТЗ.П000020013001, ОстатокФизлица);
								СтрокаТЗ.П000020013001 = СтрокаТЗ.П000020013001 - КЗачету;
								ОстатокПересчета = ОстатокПересчета - КЗачету;
								ОстаткиПересчетаПоФизлицам.Вставить(СтрокаТЗ.ФизическоеЛицо, ОстатокФизлица - КЗачету);
							КонецЕсли;
						КонецЕсли;
						Если ОстатокНалогов > 0 Тогда
							ОстатокФизлица = ОстаткиНалоговПоФизлицам[СтрокаТЗ.ФизическоеЛицо];
							Если ЗначениеЗаполнено(ОстатокФизлица) Тогда
								КЗачету = Мин(СтрокаТЗ.П000020014001, ОстатокФизлица);
								СтрокаТЗ.П000020014001 = СтрокаТЗ.П000020014001 - КЗачету;
								ОстатокНалогов = ОстатокНалогов - КЗачету;
								ОстаткиНалоговПоФизлицам.Вставить(СтрокаТЗ.ФизическоеЛицо, ОстатокФизлица - КЗачету);
							КонецЕсли;
						КонецЕсли;
					Иначе
						ОстатокПересчета = ОстатокПересчета - СтрокаТЗ.П000020013001;
						ОстаткиПересчетаПоФизлицам.Вставить(СтрокаТЗ.ФизическоеЛицо, ?(ЗначениеЗаполнено(ОстаткиПересчетаПоФизлицам[СтрокаТЗ.ФизическоеЛицо]),ОстаткиПересчетаПоФизлицам[СтрокаТЗ.ФизическоеЛицо],0) - СтрокаТЗ.П000020013001);
						Если СтрокаТЗ.П000020014001 < 0 Тогда
							ОстатокНалогов = ОстатокНалогов - СтрокаТЗ.П000020014001;
							ОстаткиНалоговПоФизлицам.Вставить(СтрокаТЗ.ФизическоеЛицо, ?(ЗначениеЗаполнено(ОстаткиНалоговПоФизлицам[СтрокаТЗ.ФизическоеЛицо]),ОстаткиНалоговПоФизлицам[СтрокаТЗ.ФизическоеЛицо],0) - СтрокаТЗ.П000020014001);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если ОстатокПересчета > 0 Тогда
					ВсегоСтрок = ВременнаяТаблица.Количество();
					Для Счетчик = 1 По ВсегоСтрок Цикл
						СтрокаТЗ = ВременнаяТаблица[ВсегоСтрок - Счетчик];
						Если СтрокаТЗ.П000020013001 < 0 Тогда
							Если ОстатокПересчета = 0 Тогда
							ИначеЕсли СтрокаТЗ.П000020013001 < -ОстатокПересчета Тогда
								ОстатокПересчета = 0;
							Иначе
								ОстатокПересчета = ОстатокПересчета + СтрокаТЗ.П000020013001;
							КонецЕсли;
							СтрокаТЗ.П000020013001 = 0;
						КонецЕсли;
						Если ОстатокНалогов > 0 Тогда
							Если СтрокаТЗ.П000020014001 < 0 Тогда
								Если ОстатокНалогов = 0 Тогда
								ИначеЕсли СтрокаТЗ.П000020014001 < -ОстатокНалогов Тогда
									ОстатокНалогов = 0;
								Иначе
									ОстатокНалогов = ОстатокНалогов + СтрокаТЗ.П000020014001;
								КонецЕсли;
								СтрокаТЗ.П000020014001 = 0;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				Иначе
					Для каждого СтрокаТЗ Из ВременнаяТаблица Цикл
						Если СтрокаТЗ.П000020013001 < 0 Тогда
							СтрокаТЗ.П000020013001 = 0;
							Если ОстатокНалогов = 0 И СтрокаТЗ.П000020014001 < 0 Тогда
								СтрокаТЗ.П000020014001 = 0;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				ОписаниеТаблиц.Раздел2 = ВременнаяТаблица.СкопироватьКолонки();
				ВременнаяТаблица.Свернуть("ДатаФактическогоПолученияДохода,П000020010001,ДатаУдержанияНалога,П000020011001,СрокПеречисленияНалога,П000020012001" + ?(ПодробныеДанные, ",ФизическоеЛицо", ""),"П000020014001,П000020013001");
				Для каждого СтрокаТЗ Из ВременнаяТаблица Цикл
					Если СтрокаТЗ.П000020013001 <> 0 Или СтрокаТЗ.П000020014001 <> 0 Тогда
						ЗаполнитьЗначенияСвойств(ОписаниеТаблиц.Раздел2.Добавить(), СтрокаТЗ);
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли ПодробныеДанные Тогда
				Запрос.Текст = ТекстЗапроса;
				ОписаниеТаблиц.Раздел2 = Запрос.Выполнить().Выгрузить();
			Иначе
				ОписаниеТаблиц.Раздел2 = СводныйРезультат.СкопироватьКолонки();
				Для каждого СтрокаТЗ Из СводныйРезультат Цикл
					Если СтрокаТЗ.П000020013001 <> 0 Или СтрокаТЗ.П000020014001 <> 0 Тогда
						ЗаполнитьЗначенияСвойств(ОписаниеТаблиц.Раздел2.Добавить(), СтрокаТЗ);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчетПоказателей_6НДФЛ_2016Кв1(НачалоПериода, ОкончаниеПериода, ДатаПодписи, Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц, ПодробныеДанные = Ложь)
	УчетНДФЛАрхивныеАлгоритмы.РасчетПоказателей_6НДФЛ_2016Кв1(НачалоПериода, ОкончаниеПериода, ДатаПодписи, Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц, ПодробныеДанные);
КонецПроцедуры


Функция ДанныеОДоходахНалогахВычетах(Сотрудники, НалоговыйПериод, Организация, РегистрацияВНалоговомОргане, ДатаАктуальности, КППОтправки, ВРазрезеРегистраторов, ДополнительныйОтбор) Экспорт
	
	Если НалоговыйПериод < 2021 Или ЗначениеЗаполнено(КППОтправки) Тогда
		Возврат УчетНДФЛАрхивныеАлгоритмы.ДанныеОДоходахНалогахВычетах2020(Сотрудники, НалоговыйПериод, Организация, РегистрацияВНалоговомОргане, ДатаАктуальности, КППОтправки, ВРазрезеРегистраторов, ДополнительныйОтбор)
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ГодНП",НалоговыйПериод);
	НачалоНалоговогоПериода = Дата(НалоговыйПериод, 1, 1);
	КонецНалоговогоПериода = КонецГода(НачалоНалоговогоПериода);
	Запрос.УстановитьПараметр("КонецНП",КонецНалоговогоПериода);
	Запрос.УстановитьПараметр("НачалоНП", НачалоНалоговогоПериода);
	Запрос.УстановитьПараметр("НачалоСледующегоНП", КонецНалоговогоПериода + 1); // Начало следующего налогового периода.
	Запрос.УстановитьПараметр("ДатаПодачиСведений", ?(Не ЗначениеЗаполнено(ДатаАктуальности), ТекущаяДатаСеанса(), ДатаАктуальности));
	Запрос.УстановитьПараметр("ДатаДоПодачиСведений", ?(Не ЗначениеЗаполнено(ДатаАктуальности), ТекущаяДатаСеанса(), ДатаАктуальности) - 1);
	Запрос.УстановитьПараметр("ЧитатьСводныеДанные", РегистрацияВНалоговомОргане = Неопределено Или ВРазрезеРегистраторов);
	Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("ДополнительныйОтбор", Истина);
	
	ПараметрыРасчетаНДФЛПоПрогрессивнойШкале = УчетНДФЛ.ПараметрыРасчетаНДФЛПоПрогрессивнойШкале();
	Запрос.УстановитьПараметр("ОсновнаяНалоговаяБаза", Перечисления.КатегорииДоходовНДФЛ.ОсновнаяНалоговаяБаза());
	Запрос.УстановитьПараметр("Предел", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел);
	Запрос.УстановитьПараметр("СтавкаСПревышения", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Ставка);
	
	// АПК:96-выкл Использование ОБЪЕДИНИТЬ для таблицы ВТСтрокиУчета необходимо
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокСотрудников.Ссылка КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТФизлица
	|ИЗ
	|	Справочник.ФизическиеЛица КАК СписокСотрудников
	|ГДЕ
	|	СписокСотрудников.Ссылка В(&Сотрудники)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(СведенияОДоходахНДФЛ.МесяцНалоговогоПериода) КАК Месяц,
	|	КОНЕЦПЕРИОДА(СведенияОДоходахНДФЛ.МесяцНалоговогоПериода, ГОД) КАК КонецГода,
	|	СведенияОДоходахНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОДоходахНДФЛ.КатегорияДохода КАК КатегорияДохода,
	|	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
	|	СведенияОДоходахНДФЛ.КодДохода.КодПрименяемыйВНалоговойОтчетностиС2010Года КАК КодДоходаКодДляОтчетности,
	|	СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента КАК КодДоходаСтавкаНалогообложенияРезидента,
	|	СведенияОДоходахНДФЛ.СуммаДохода КАК СуммаДохода,
	|	ВЫБОР
	|		КОГДА СведенияОДоходахНДФЛ.КодВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ СведенияОДоходахНДФЛ.СуммаВычета
	|	КОНЕЦ КАК СуммаВычета,
	|	ВЫБОР
	|		КОГДА СведенияОДоходахНДФЛ.СуммаВычета = 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
	|		ИНАЧЕ СведенияОДоходахНДФЛ.КодВычета
	|	КОНЕЦ КАК КодВычета,
	|	СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ КАК ИсточникДоходаЗаПределамиРФ,
	|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
	|	СведенияОДоходахНДФЛ.Сотрудник КАК Сотрудник,
	|	НАЧАЛОПЕРИОДА(СведенияОДоходахНДФЛ.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|	СведенияОДоходахНДФЛ.Подразделение КАК Подразделение,
	|	СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	&ЧитатьСводныеДанные
	|			И СведенияОДоходахНДФЛ.Организация = &Организация
	|		ИЛИ СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане КАК ДанныеДляОтчета
	|ПОМЕСТИТЬ ВТДоходы
	|ИЗ
	|	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизлица КАК Сотрудники
	|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = Сотрудники.ФизическоеЛицо
	|			И (СведенияОДоходахНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация)
	|			И (СведенияОДоходахНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	|			И (СведенияОДоходахНДФЛ.Период <= &ДатаПодачиСведений)
	|			И (&ДополнительныйОтбор)
	|ГДЕ
	|	НЕ СведенияОДоходахНДФЛ.КодДохода.НеОблагаетсяУНалоговогоАгента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.КодВычета КАК КодВычета,
	|	СУММА(ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Сумма) КАК СуммаОборот,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Регистратор КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Подразделение КАК Подразделение,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	&ЧитатьСводныеДанные
	|			И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Организация = &Организация
	|		ИЛИ ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане КАК ДанныеДляОтчета
	|ПОМЕСТИТЬ ВТПредоставленныеСтандартныеИСоциальныеВычетыНДФЛОбороты
	|ИЗ
	|	ВТФизлица КАК Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ КАК ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ
	|		ПО Сотрудники.ФизическоеЛицо = ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ФизическоеЛицо
	|ГДЕ
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Период <= &ДатаПодачиСведений
	|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
	|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП
	|	И &ДополнительныйОтбор
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ФизическоеЛицо,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.МесяцНалоговогоПериода,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.КодВычета,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Регистратор,
	|	НАЧАЛОПЕРИОДА(ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Период, МЕСЯЦ),
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Подразделение,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.РегистрацияВНалоговомОргане,
	|	&ЧитатьСводныеДанные
	|			И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Организация = &Организация
	|		ИЛИ ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛОбороты.КодВычета КАК КодВычета,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛОбороты.СуммаОборот КАК СуммаВычета,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛОбороты.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛОбороты.КодВычета.ГруппаВычета КАК КодВычетаГруппаВычета,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛОбороты.Регистратор КАК Регистратор,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛОбороты.ПериодРегистрации КАК ПериодРегистрации,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛОбороты.Подразделение КАК Подразделение,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛОбороты.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛОбороты.ДанныеДляОтчета КАК ДанныеДляОтчета
	|ПОМЕСТИТЬ ВТВычеты
	|ИЗ
	|	ВТПредоставленныеСтандартныеИСоциальныеВычетыНДФЛОбороты КАК ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИмущественныеВычетыНДФЛ.КодВычета,
	|	ИмущественныеВычетыНДФЛ.Сумма,
	|	НАЧАЛОПЕРИОДА(ИмущественныеВычетыНДФЛ.Период, МЕСЯЦ),
	|	СотрудникиОрганизаций.ФизическоеЛицо,
	|	ИмущественныеВычетыНДФЛ.КодВычета.ГруппаВычета,
	|	ИмущественныеВычетыНДФЛ.Регистратор,
	|	НАЧАЛОПЕРИОДА(ИмущественныеВычетыНДФЛ.МесяцРегистрации, МЕСЯЦ),
	|	ИмущественныеВычетыНДФЛ.Подразделение,
	|	ИмущественныеВычетыНДФЛ.РегистрацияВНалоговомОргане,
	|	&ЧитатьСводныеДанные
	|			И ИмущественныеВычетыНДФЛ.Организация = &Организация
	|		ИЛИ ИмущественныеВычетыНДФЛ.РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТФизлица КАК СотрудникиОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ИмущественныеВычетыНДФЛ КАК ИмущественныеВычетыНДФЛ
	|		ПО СотрудникиОрганизаций.ФизическоеЛицо = ИмущественныеВычетыНДФЛ.ФизическоеЛицо
	|			И (ИмущественныеВычетыНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И (ИмущественныеВычетыНДФЛ.МесяцРегистрации <= &ДатаПодачиСведений)
	|			И (ИмущественныеВычетыНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация)
	|			И (ИмущественныеВычетыНДФЛ.Год = &ГодНП)
	|			И (&ДополнительныйОтбор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НДФЛРасчетыСБюджетом.ВариантУдержания КАК ВариантУдержания,
	|	НДФЛРасчетыСБюджетом.ВидДвижения КАК ВидДвижения,
	|	НДФЛРасчетыСБюджетом.Сумма КАК Сумма,
	|	НДФЛРасчетыСБюджетом.СуммаСПревышения КАК СуммаСПревышения,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И НДФЛРасчетыСБюджетом.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|				И НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода >= ДАТАВРЕМЯ(2021, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов = 0
	|						ТОГДА 0
	|					КОГДА НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов > 0
	|							И НДФЛРасчетыСБюджетом.Сумма + НДФЛРасчетыСБюджетом.СуммаСПревышения > 0
	|						ТОГДА ВЫБОР
	|								КОГДА НДФЛРасчетыСБюджетом.Сумма + НДФЛРасчетыСБюджетом.СуммаСПревышения >= НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|									ТОГДА НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|								ИНАЧЕ НДФЛРасчетыСБюджетом.Сумма + НДФЛРасчетыСБюджетом.СуммаСПревышения
	|							КОНЕЦ
	|					КОГДА НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов < 0
	|							И НДФЛРасчетыСБюджетом.Сумма + НДФЛРасчетыСБюджетом.СуммаСПревышения < 0
	|						ТОГДА ВЫБОР
	|								КОГДА НДФЛРасчетыСБюджетом.Сумма + НДФЛРасчетыСБюджетом.СуммаСПревышения <= НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|									ТОГДА НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов
	|								ИНАЧЕ НДФЛРасчетыСБюджетом.Сумма + НДФЛРасчетыСБюджетом.СуммаСПревышения
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогНаПрибыльДляДивидендов,
	|	НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	НДФЛРасчетыСБюджетом.КатегорияДохода КАК КатегорияДохода,
	|	НДФЛРасчетыСБюджетом.КодДохода КАК КодДохода,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.Регистратор КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(НДФЛРасчетыСБюджетом.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|	НДФЛРасчетыСБюджетом.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТСтрокиНалогов
	|ИЗ
	|	ВТФизлица КАК СправкиОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК НДФЛРасчетыСБюджетом
	|		ПО СправкиОДоходах.ФизическоеЛицо = НДФЛРасчетыСБюджетом.ФизическоеЛицо
	|			И (НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	|			И (НДФЛРасчетыСБюджетом.Период < &ДатаПодачиСведений)
	|			И (НДФЛРасчетыСБюджетом.ГоловнаяОрганизация = &ГоловнаяОрганизация)
	|			И (&ЧитатьСводныеДанные
	|					И НДФЛРасчетыСБюджетом.Организация = &Организация
	|				ИЛИ НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане)
	|			И (&ДополнительныйОтбор)
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.ФизическоеЛицо ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Перечислено.Ставка КАК Ставка,
	|	Перечислено.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СУММА(Перечислено.СуммаРасход) КАК СуммаРасход,
	|	Перечислено.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ВЫБОР
	|		КОГДА Перечислено.ИсчисленоПоДивидендам
	|			ТОГДА ВЫБОР
	|					КОГДА Перечислено.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка05)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05)
	|					КОГДА Перечислено.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка10)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10)
	|					КОГДА Перечислено.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка12)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|				КОНЕЦ
	|		КОГДА Перечислено.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка03)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке03)
	|		КОГДА Перечислено.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка05)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке05)
	|		КОГДА Перечислено.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка06)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке06)
	|		КОГДА Перечислено.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка07)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке07)
	|		КОГДА Перечислено.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка10)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке10)
	|		КОГДА Перечислено.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке15)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|	КОНЕЦ КАК КатегорияДохода,
	|	Перечислено.ИсчисленоПоДивидендам КАК ИсчисленоПоДивидендам
	|ПОМЕСТИТЬ ВТПеречисленоНДФЛПоМесяцам
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка КАК Ставка,
	|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.СуммаРасход КАК СуммаРасход,
	|		КОНЕЦПЕРИОДА(РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.ИсчисленоПоДивидендам КАК ИсчисленоПоДивидендам
	|	ИЗ
	|		РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Обороты(
	|				&НачалоНП,
	|				&ДатаДоПодачиСведений,
	|				,
	|				ФизическоеЛицо В
	|						(ВЫБРАТЬ
	|							ФизическиеЛица.ФизическоеЛицо
	|						ИЗ
	|							ВТФизлица КАК ФизическиеЛица)
	|					И (МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	|					И (&ЧитатьСводныеДанные
	|							И Организация = &Организация
	|						ИЛИ РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане)) КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты) КАК Перечислено
	|
	|СГРУППИРОВАТЬ ПО
	|	Перечислено.Ставка,
	|	Перечислено.ФизическоеЛицо,
	|	Перечислено.МесяцНалоговогоПериода,
	|	Перечислено.ИсчисленоПоДивидендам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Доходы.ДатаПолученияДохода КАК Период,
	|	Доходы.КодДохода.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Доходы.КатегорияДохода КАК КатегорияДохода
	|ПОМЕСТИТЬ ВТСтрокиУчета
	|ИЗ
	|	ВТДоходы КАК Доходы
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Вычеты.МесяцНалоговогоПериода,
	|	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13),
	|	Вычеты.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
	|ИЗ
	|	ВТВычеты КАК Вычеты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиНалогов.МесяцНалоговогоПериода,
	|	СтрокиНалогов.СтавкаНалогообложенияРезидента,
	|	СтрокиНалогов.ФизическоеЛицо,
	|	СтрокиНалогов.КатегорияДохода
	|ИЗ
	|	ВТСтрокиНалогов КАК СтрокиНалогов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПеречисленоНДФЛПоМесяцам.МесяцНалоговогоПериода,
	|	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13),
	|	ПеречисленоНДФЛПоМесяцам.ФизическоеЛицо,
	|	ПеречисленоНДФЛПоМесяцам.КатегорияДохода
	|ИЗ
	|	ВТПеречисленоНДФЛПоМесяцам КАК ПеречисленоНДФЛПоМесяцам
	|ГДЕ
	|	НЕ ПеречисленоНДФЛПоМесяцам.ИсчисленоПоДивидендам
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПеречисленоНДФЛПоМесяцам.МесяцНалоговогоПериода,
	|	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09),
	|	ПеречисленоНДФЛПоМесяцам.ФизическоеЛицо,
	|	ПеречисленоНДФЛПоМесяцам.КатегорияДохода
	|ИЗ
	|	ВТПеречисленоНДФЛПоМесяцам КАК ПеречисленоНДФЛПоМесяцам
	|ГДЕ
	|	ПеречисленоНДФЛПоМесяцам.ИсчисленоПоДивидендам";
	// АПК:96-вкл 
	Запрос.Текст = ?(ЗначениеЗаполнено(ДополнительныйОтбор), СтрЗаменить(ТекстЗапроса, "&ДополнительныйОтбор", ДополнительныйОтбор), ТекстЗапроса);
	Запрос.Выполнить();
	
	УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента(Запрос.МенеджерВременныхТаблиц, "ВТСтрокиУчета", "УчитыватьИзмененияСтатусаДляОтчетности");
	
	Если ВРазрезеРегистраторов Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.КодДоходаСтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ КАК Ставка,
		|	Доходы.ПериодРегистрации КАК ПериодРегистрации,
		|	Доходы.Сотрудник КАК Сотрудник,
		|	Доходы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	Доходы.Подразделение КАК Подразделение,
		|	Доходы.ДатаПолученияДохода КАК ДатаПолученияДохода,
		|	Доходы.Регистратор КАК Регистратор,
		|	Доходы.КодДохода КАК КодДохода,
		|	Доходы.КодВычета КАК КодВычета,
		|	СУММА(Доходы.СуммаДохода) КАК СуммаДохода,
		|	СУММА(Доходы.СуммаВычета) КАК СуммаВычета
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
		|		ПО Доходы.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
		|			И Доходы.КодДоходаСтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
		|			И Доходы.ДатаПолученияДохода = СтавкаНДФЛПоСтавкеРезидента.Период
		|			И Доходы.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
		|ГДЕ
		|	(НЕ Доходы.ИсточникДоходаЗаПределамиРФ
		|			ИЛИ СтавкаНДФЛПоСтавкеРезидента.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
		|	И Доходы.ДанныеДляОтчета
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.ПериодРегистрации,
		|	Доходы.Сотрудник,
		|	Доходы.ФизическоеЛицо,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ,
		|	Доходы.КодДохода,
		|	Доходы.КодДоходаСтавкаНалогообложенияРезидента,
		|	Доходы.РегистрацияВНалоговомОргане,
		|	Доходы.Подразделение,
		|	Доходы.КодВычета,
		|	Доходы.Регистратор,
		|	Доходы.ДатаПолученияДохода
		|
		|ИМЕЮЩИЕ
		|	(СУММА(Доходы.СуммаДохода) <> 0
		|		ИЛИ СУММА(Доходы.СуммаВычета) <> 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	СтавкаНалогообложенияРезидента,
		|	Ставка,
		|	ПериодРегистрации,
		|	Сотрудник,
		|	РегистрацияВНалоговомОргане,
		|	Подразделение,
		|	ДатаПолученияДохода,
		|	КодДохода,
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вычеты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Вычеты.ПериодРегистрации КАК ПериодРегистрации,
		|	Вычеты.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	КОНЕЦПЕРИОДА(Вычеты.МесяцНалоговогоПериода, МЕСЯЦ) КАК ДатаПолученияДохода,
		|	Вычеты.Подразделение КАК Подразделение,
		|	Вычеты.Регистратор КАК Регистратор,
		|	Вычеты.КодВычета КАК КодВычета,
		|	СУММА(Вычеты.СуммаВычета) КАК СуммаВычета
		|ИЗ
		|	ВТВычеты КАК Вычеты
		|ГДЕ
		|	Вычеты.КодВычета ЕСТЬ НЕ NULL 
		|	И Вычеты.ДанныеДляОтчета
		|
		|СГРУППИРОВАТЬ ПО
		|	Вычеты.КодВычета,
		|	Вычеты.РегистрацияВНалоговомОргане,
		|	Вычеты.Подразделение,
		|	Вычеты.ПериодРегистрации,
		|	Вычеты.Регистратор,
		|	Вычеты.ФизическоеЛицо,
		|	КОНЕЦПЕРИОДА(Вычеты.МесяцНалоговогоПериода, МЕСЯЦ)
		|
		|ИМЕЮЩИЕ
		|	СУММА(Вычеты.СуммаВычета) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	ПериодРегистрации,
		|	Вычеты.РегистрацияВНалоговомОргане,
		|	Вычеты.Подразделение,
		|	ДатаПолученияДохода,
		|	КодВычета,
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДФЛРасчетыСБюджетом.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НДФЛРасчетыСБюджетом.ПериодРегистрации КАК ПериодРегистрации,
		|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	НДФЛРасчетыСБюджетом.Регистратор КАК Регистратор,
		|	НДФЛРасчетыСБюджетом.Подразделение КАК Подразделение,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА НДФЛРасчетыСБюджетом.Сумма
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК Начислено,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА НДФЛРасчетыСБюджетом.СуммаСПревышения
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК НачисленоСПревышения,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
		|					ТОГДА НДФЛРасчетыСБюджетом.Сумма
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК Зачтено,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ КАК Ставка,
		|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК ДатаПолученияДохода,
		|	НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента
		|ИЗ
		|	ВТСтрокиНалогов КАК НДФЛРасчетыСБюджетом
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
		|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
		|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
		|			И НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода = СтавкаНДФЛПоСтавкеРезидента.Период
		|			И НДФЛРасчетыСБюджетом.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
		|
		|СГРУППИРОВАТЬ ПО
		|	НДФЛРасчетыСБюджетом.ФизическоеЛицо,
		|	НДФЛРасчетыСБюджетом.ПериодРегистрации,
		|	НДФЛРасчетыСБюджетом.Регистратор,
		|	НДФЛРасчетыСБюджетом.Подразделение,
		|	НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ,
		|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
		|	НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	СтавкаНалогообложенияРезидента,
		|	Ставка,
		|	ПериодРегистрации,
		|	РегистрацияВНалоговомОргане,
		|	Подразделение,
		|	ДатаПолученияДохода,
		|	Регистратор";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаНДФЛ.ФизическоеЛицо,
		|	ТаблицаНДФЛ.Статус,
		|	ТаблицаНДФЛ.Период,
		|	ТаблицаНДФЛ.КатегорияДохода,
		|	ТаблицаНДФЛ.СтавкаНалогообложенияРезидента,
		|	ТаблицаНДФЛ.СтавкаНДФЛ,
		|	ТаблицаНДФЛ.СтавкаЧислом
		|ПОМЕСТИТЬ ВТСтавкаНДФЛСУчетомИзмененияСтатуса
		|ИЗ
		|	ВТСтавкаНДФЛПоСтавкеРезидента КАК ТаблицаНДФЛ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСтавкаНДФЛПоСтавкеРезидента";
		Запрос.Выполнить();
		
		УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента(Запрос.МенеджерВременныхТаблиц, "ВТСтрокиУчета", "НеУчитыватьИзмененияСтатуса");
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Доходы.Месяц КАК Месяц,
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.КодДохода КАК КодДохода,
		|	Доходы.КатегорияДохода КАК КатегорияДохода,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ КАК СтавкаНДФЛ,
		|	ВЫБОР
		|		КОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ <> ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
		|		КОГДА Доходы.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
		|		КОГДА Доходы.КатегорияДохода В (&ОсновнаяНалоговаяБаза)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
		|		ИНАЧЕ Доходы.КатегорияДохода
		|	КОНЕЦ КАК НалоговаяБаза,
		|	Доходы.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
		|	Доходы.КодДоходаСтавкаНалогообложенияРезидента КАК КодДоходаСтавкаНалогообложенияРезидента,
		|	Доходы.СуммаДохода КАК СуммаДохода,
		|	Доходы.СуммаВычета КАК СуммаВычета,
		|	Доходы.КодВычета КАК КодВычета,
		|	Доходы.Регистратор КАК Регистратор,
		|	Доходы.ДанныеДляОтчета КАК ДанныеДляОтчета,
		|	Доходы.ДатаПолученияДохода КАК ДатаПолученияДохода
		|ПОМЕСТИТЬ ВТДоходыОбъектаОбложения
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛСУчетомИзмененияСтатуса КАК СтавкаНДФЛПоСтавкеРезидента
		|		ПО Доходы.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
		|			И Доходы.КодДоходаСтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
		|			И Доходы.ДатаПолученияДохода = СтавкаНДФЛПоСтавкеРезидента.Период
		|			И Доходы.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
		|ГДЕ
		|	(НЕ Доходы.ИсточникДоходаЗаПределамиРФ
		|			ИЛИ СтавкаНДФЛПоСтавкеРезидента.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 0
		|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
		|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда) КАК НалоговаяБаза,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТМесяцыПослеПревышения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	База.ФизическоеЛицо КАК ФизическоеЛицо,
		|	База.НалоговаяБаза КАК НалоговаяБаза
		|ПОМЕСТИТЬ ВТСотрудникиСПревышением
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
		|		ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
		|		ДоходыПоСтавкам.СуммаДохода - ДоходыПоСтавкам.СуммаВычета КАК ОблагаемаяБаза
		|	ИЗ
		|		ВТДоходыОбъектаОбложения КАК ДоходыПоСтавкам
		|	ГДЕ
		|		ДоходыПоСтавкам.НалоговаяБаза <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СтандартныеИмущественныеВычеты.ФизическоеЛицо,
		|		ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда),
		|		-СтандартныеИмущественныеВычеты.СуммаВычета
		|	ИЗ
		|		ВТВычеты КАК СтандартныеИмущественныеВычеты) КАК База
		|
		|СГРУППИРОВАТЬ ПО
		|	База.ФизическоеЛицо,
		|	База.НалоговаяБаза
		|
		|ИМЕЮЩИЕ
		|	СУММА(База.ОблагаемаяБаза) > &Предел";
		Если Запрос.Выполнить().Выгрузить()[0].Количество > 0 Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК Период,
			|	НАЧАЛОПЕРИОДА(СведенияОДоходахНДФЛ.ДатаПолученияДохода, МЕСЯЦ) КАК НачалоМесяца,
			|	СведенияОДоходахНДФЛ.НалоговаяБаза КАК НалоговаяБаза,
			|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода - СведенияОДоходахНДФЛ.СуммаВычета) КАК ОблагаемыйДоход,
			|	0 КАК ОблагаемыйДоходСНачалаГода,
			|	ЛОЖЬ КАК ЭтоДеньПревышенияПредела,
			|	ЛОЖЬ КАК ПределПревышен
			|ИЗ
			|	ВТДоходыОбъектаОбложения КАК СведенияОДоходахНДФЛ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
			|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
			|			И СведенияОДоходахНДФЛ.НалоговаяБаза = СотрудникиСПревышением.НалоговаяБаза
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
			|	СведенияОДоходахНДФЛ.НалоговаяБаза
			|
			|ИМЕЮЩИЕ
			|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода - СведенияОДоходахНДФЛ.СуммаВычета) <> 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	НалоговаяБаза,
			|	Период";
			ТаблицаРасчетаНарастающимИтогом = Запрос.Выполнить().Выгрузить();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СУММА(СтандартныеИмущественныеВычеты.СуммаВычета) КАК Сумма,
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НАЧАЛОПЕРИОДА(СтандартныеИмущественныеВычеты.МесяцНалоговогоПериода, МЕСЯЦ) КАК НачалоМесяца
			|ИЗ
			|	ВТВычеты КАК СтандартныеИмущественныеВычеты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
			|		ПО СтандартныеИмущественныеВычеты.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
			|			И (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда) = СотрудникиСПревышением.НалоговаяБаза)
			|
			|СГРУППИРОВАТЬ ПО
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо,
			|	НАЧАЛОПЕРИОДА(СтандартныеИмущественныеВычеты.МесяцНалоговогоПериода, МЕСЯЦ)";
			ТаблицаВычетов = Запрос.Выполнить().Выгрузить();
			ИскатьВычеты = ТаблицаВычетов.Количество() > 0;
			Если ИскатьВычеты И ТаблицаВычетов.Количество() > 100 Тогда
				ТаблицаВычетов.Индексы.Добавить("ФизическоеЛицо,НачалоМесяца");
			КонецЕсли;
			ПоискВычетов = Новый Структура("ФизическоеЛицо,НачалоМесяца");
			
			// Расчет облагаемого дохода нарастающим итогом с учетом всех вычетов для каждой даты получения дохода.
			ОблагаемыйДоходСНачалаГода = 0;
			ТекущееФизлицо = Неопределено;
			ТекущаяНалоговаяБаза = Неопределено;
			ТекущееНачалоМесяца = Неопределено;
			Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
				Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Тогда
					ОблагаемыйДоходСНачалаГода = 0;
					ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
					ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
					ТекущееНачалоМесяца = Неопределено;
				КонецЕсли;
				// Стандартные, имущественные вычеты учтем один раз за каждый месяц - в первую дату получения дохода месяца.
				ПредоставленныеВычеты = 0;
				Если ИскатьВычеты И СтрокаТаблицы.НалоговаяБаза = Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда И ТекущееНачалоМесяца <> СтрокаТаблицы.НачалоМесяца Тогда
					ЗаполнитьЗначенияСвойств(ПоискВычетов, СтрокаТаблицы);
					СтрокиВычетов = ТаблицаВычетов.НайтиСтроки(ПоискВычетов);
					Если СтрокиВычетов.Количество() > 0 Тогда
						ПредоставленныеВычеты = СтрокиВычетов[0].Сумма;
					КонецЕсли;
					ТекущееНачалоМесяца = СтрокаТаблицы.НачалоМесяца;
				КонецЕсли;
				СтрокаТаблицы.ЭтоДеньПревышенияПредела = ОблагаемыйДоходСНачалаГода < ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел И ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты > ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел;
				ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты;
				СтрокаТаблицы.ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода;
				СтрокаТаблицы.ПределПревышен = ОблагаемыйДоходСНачалаГода > ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел;
			КонецЦикла;
			
			Запрос.УстановитьПараметр("РасчетНарастающимИтогом", ТаблицаРасчетаНарастающимИтогом); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасчетНарастающимИтогом.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасчетНарастающимИтогом.Период КАК Период,
			|	РасчетНарастающимИтогом.НалоговаяБаза КАК НалоговаяБаза,
			|	РасчетНарастающимИтогом.ОблагаемыйДоход КАК ОблагаемыйДоход,
			|	РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
			|	РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела КАК ЭтоДеньПревышенияПредела,
			|	РасчетНарастающимИтогом.ПределПревышен КАК ПределПревышен
			|ПОМЕСТИТЬ ВТРасчетНарастающимИтогом
			|ИЗ
			|	&РасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоходыПоСтавкам.СтавкаНДФЛ КАК Ставка,
			|	ДоходыПоСтавкам.Регистратор КАК Регистратор,
			|	ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыПоСтавкам.Месяц КАК Месяц,
			|	ДоходыПоСтавкам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
			|	ДоходыПоСтавкам.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыПоСтавкам.КатегорияДохода КАК КатегорияДохода,
			|	ДоходыПоСтавкам.КодДохода КАК КодДохода,
			|	ДоходыПоСтавкам.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	ДоходыПоСтавкам.КодДоходаСтавкаНалогообложенияРезидента КАК КодДоходаСтавкаНалогообложенияРезидента,
			|	ДоходыПоСтавкам.СуммаДохода КАК СуммаДохода,
			|	ДоходыПоСтавкам.КодВычета КАК КодВычета,
			|	ДоходыПоСтавкам.СуммаВычета КАК СуммаВычета,
			|	ДоходыПоСтавкам.ДанныеДляОтчета КАК ДанныеДляОтчета,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода, 0) КАК ОблагаемыйДоходСНачалаГода,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела, ЛОЖЬ) КАК ЭтоДеньПревышенияПредела,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ПределПревышен, ЛОЖЬ) КАК ПределПревышен,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоход, 0) КАК ОблагаемыйДоходЗаДень
			|ПОМЕСТИТЬ ВТРасширенныеДанныеОДоходах
			|ИЗ
			|	ВТДоходыОбъектаОбложения КАК ДоходыПоСтавкам
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|		ПО ДоходыПоСтавкам.ФизическоеЛицо = РасчетНарастающимИтогом.ФизическоеЛицо
			|			И ДоходыПоСтавкам.ДатаПолученияДохода = РасчетНарастающимИтогом.Период
			|			И ДоходыПоСтавкам.НалоговаяБаза = РасчетНарастающимИтогом.НалоговаяБаза
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасширенныеДанныеОДоходах.Ставка КАК Ставка,
			|	РасширенныеДанныеОДоходах.Регистратор КАК Регистратор,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Месяц КАК Месяц,
			|	РасширенныеДанныеОДоходах.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.КодДоходаСтавкаНалогообложенияРезидента КАК КодДоходаСтавкаНалогообложенияРезидента,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень КАК ОблагаемыйДоходЗаДень,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода) КАК СуммаДохода,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаВычета) КАК СуммаВычета,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода - РасширенныеДанныеОДоходах.СуммаВычета) КАК ОблагаемаяСумма,
			|	РасширенныеДанныеОДоходах.ДанныеДляОтчета КАК ДанныеДляОтчета
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
			|
			|СГРУППИРОВАТЬ ПО
			|	РасширенныеДанныеОДоходах.Ставка,
			|	РасширенныеДанныеОДоходах.Регистратор,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.КатегорияДохода,
			|	РасширенныеДанныеОДоходах.МесяцНалоговогоПериода,
			|	РасширенныеДанныеОДоходах.Месяц,
			|	РасширенныеДанныеОДоходах.КодДохода,
			|	РасширенныеДанныеОДоходах.КодВычета,
			|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.КодДоходаСтавкаНалогообложенияРезидента,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень,
			|	РасширенныеДанныеОДоходах.ДанныеДляОтчета
			|
			|УПОРЯДОЧИТЬ ПО
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.КодДохода";
			
			ТаблицаРасчетаНарастающимИтогом = Запрос.Выполнить().Выгрузить();
			ДоходыСУточненнымиСтавками = ТаблицаРасчетаНарастающимИтогом.СкопироватьКолонки();
			
			ТекущееФизлицо = Неопределено;
			ТекущаяНалоговаяБаза = Неопределено;
			СтрокиРаспределения = Новый Массив;
			ОблагаемыйДоходДоПредела = 0;
			Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
				Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Тогда
					Если ОблагаемыйДоходДоПредела <> 0 Тогда
						ВыделитьСуммыПревышенияПредела(ОблагаемыйДоходДоПредела, СтрокиРаспределения, ДоходыСУточненнымиСтавками)				
					КонецЕсли;
					СтрокиРаспределения = Новый Массив;
					ОблагаемыйДоходДоПредела = 0;
					ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
					ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
				КонецЕсли;
				Если ОблагаемыйДоходДоПредела = 0 Тогда
					ОблагаемыйДоходДоПредела = СтрокаТаблицы.ОблагаемыйДоходЗаДень - СтрокаТаблицы.ОблагаемыйДоходСНачалаГода + ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел
				КонецЕсли;
				СтрокиРаспределения.Добавить(СтрокаТаблицы);
			КонецЦикла;
			Если ОблагаемыйДоходДоПредела <> 0 Тогда
				ВыделитьСуммыПревышенияПредела(ОблагаемыйДоходДоПредела, СтрокиРаспределения, ДоходыСУточненнымиСтавками)				
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРасчетаНарастающимИтогом, ДоходыСУточненнымиСтавками); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			
			Запрос.УстановитьПараметр("ДоходыСУточненнымиСтавками", ДоходыСУточненнымиСтавками); ДоходыСУточненнымиСтавками = Неопределено;
			Запрос.Текст =
			"УНИЧТОЖИТЬ ВТДоходыОбъектаОбложения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.Ставка КАК Ставка,
			|	ДоходыСУточненнымиСтавками.Регистратор КАК Регистратор,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Месяц КАК Месяц,
			|	ДоходыСУточненнымиСтавками.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.КатегорияДохода КАК КатегорияДохода,
			|	ДоходыСУточненнымиСтавками.ДанныеДляОтчета КАК ДанныеДляОтчета,
			|	ДоходыСУточненнымиСтавками.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.КодДоходаСтавкаНалогообложенияРезидента КАК КодДоходаСтавкаНалогообложенияРезидента,
			|	ДоходыСУточненнымиСтавками.КодДохода КАК КодДохода,
			|	ДоходыСУточненнымиСтавками.СуммаДохода КАК СуммаДохода,
			|	ДоходыСУточненнымиСтавками.КодВычета КАК КодВычета,
			|	ДоходыСУточненнымиСтавками.СуммаВычета КАК СуммаВычета
			|ПОМЕСТИТЬ ВТДоходыСУточненнымиСтавками
			|ИЗ
			|	&ДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
			|			ТОГДА &СтавкаСПревышения
			|		ИНАЧЕ РасширенныеДанныеОДоходах.Ставка
			|	КОНЕЦ КАК СтавкаНДФЛ,
			|	РасширенныеДанныеОДоходах.Регистратор КАК Регистратор,
			|	РасширенныеДанныеОДоходах.Месяц КАК Месяц,
			|	РасширенныеДанныеОДоходах.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.ДанныеДляОтчета КАК ДанныеДляОтчета,
			|	РасширенныеДанныеОДоходах.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
			|	РасширенныеДанныеОДоходах.КодДоходаСтавкаНалогообложенияРезидента КАК КодДоходаСтавкаНалогообложенияРезидента,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	РасширенныеДанныеОДоходах.СуммаДохода КАК СуммаДохода,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	РасширенныеДанныеОДоходах.СуммаВычета КАК СуммаВычета
			|ПОМЕСТИТЬ ВТДоходыОбъектаОбложения
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	НЕ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.Ставка,
			|	ДоходыСУточненнымиСтавками.Регистратор,
			|	ДоходыСУточненнымиСтавками.Месяц,
			|	ДоходыСУточненнымиСтавками.МесяцНалоговогоПериода,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.ДатаПолученияДохода,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.КатегорияДохода,
			|	ДоходыСУточненнымиСтавками.ДанныеДляОтчета,
			|	ДоходыСУточненнымиСтавками.КодДоходаКодДляОтчетности,
			|	ДоходыСУточненнымиСтавками.КодДоходаСтавкаНалогообложенияРезидента,
			|	ДоходыСУточненнымиСтавками.КодДохода,
			|	ДоходыСУточненнымиСтавками.СуммаДохода,
			|	ДоходыСУточненнымиСтавками.КодВычета,
			|	ДоходыСУточненнымиСтавками.СуммаВычета
			|ИЗ
			|	ВТДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками";
			Запрос.Выполнить();
			
			Если ИскатьВычеты Тогда
				Запрос.Текст =
				"УНИЧТОЖИТЬ ВТМесяцыПослеПревышения
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
				|	ДоходыПоСтавкам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
				|ПОМЕСТИТЬ ВТУникальныеМесяцы
				|ИЗ
				|	ВТДоходыОбъектаОбложения КАК ДоходыПоСтавкам
				|ГДЕ
				|	ДоходыПоСтавкам.НалоговаяБаза <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
				|
				|СГРУППИРОВАТЬ ПО
				|	ДоходыПоСтавкам.НалоговаяБаза,
				|	ДоходыПоСтавкам.ФизическоеЛицо,
				|	ДоходыПоСтавкам.МесяцНалоговогоПериода
				|
				|ИМЕЮЩИЕ
				|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДоходыПоСтавкам.СтавкаНДФЛ) = 1
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	МесяцыУникальныхКБК.ФизическоеЛицо КАК ФизическоеЛицо,
				|	МесяцыУникальныхКБК.НалоговаяБаза КАК НалоговаяБаза,
				|	МесяцыУникальныхКБК.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
				|ПОМЕСТИТЬ ВТМесяцыПослеПревышения
				|ИЗ
				|	ВТУникальныеМесяцы КАК МесяцыУникальныхКБК
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыОбъектаОбложения КАК ДоходыПоСтавкам
				|		ПО МесяцыУникальныхКБК.ФизическоеЛицо = ДоходыПоСтавкам.ФизическоеЛицо
				|			И МесяцыУникальныхКБК.НалоговаяБаза = ДоходыПоСтавкам.НалоговаяБаза
				|			И МесяцыУникальныхКБК.МесяцНалоговогоПериода = ДоходыПоСтавкам.МесяцНалоговогоПериода
				|ГДЕ
				|	ДоходыПоСтавкам.СтавкаНДФЛ = &СтавкаСПревышения";
				Запрос.Выполнить();
			КонецЕсли;
		КонецЕсли;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоходыИВычеты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(ДоходыИВычеты.ОбщаяСуммаДохода) КАК ОбщаяСуммаДохода,
		|	СУММА(ДоходыИВычеты.ОблагаемаяСуммаДохода) КАК ОблагаемаяСуммаДохода,
		|	ДоходыИВычеты.СтавкаНДФЛ КАК Ставка
		|ПОМЕСТИТЬ ВТИтогиДоходов
		|ИЗ
		|	(ВЫБРАТЬ
		|		Доходы.ДатаПолученияДохода КАК Период,
		|		Доходы.СуммаДохода КАК ОбщаяСуммаДохода,
		|		Доходы.СуммаДохода - Доходы.СуммаВычета КАК ОблагаемаяСуммаДохода,
		|		Доходы.СтавкаНДФЛ КАК СтавкаНДФЛ,
		|		Доходы.КатегорияДохода КАК КатегорияДохода,
		|		Доходы.ФизическоеЛицо КАК ФизическоеЛицо
		|	ИЗ
		|		ВТДоходыОбъектаОбложения КАК Доходы
		|	ГДЕ
		|		Доходы.ДанныеДляОтчета
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Вычеты.МесяцНалоговогоПериода,
		|		0,
		|		-Вычеты.СуммаВычета,
		|		ВЫБОР
		|			КОГДА СотрудникиСПревышением.ФизическоеЛицо ЕСТЬ NULL
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
		|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
		|		КОНЕЦ,
		|		ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда),
		|		Вычеты.ФизическоеЛицо
		|	ИЗ
		|		ВТВычеты КАК Вычеты
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТМесяцыПослеПревышения КАК СотрудникиСПревышением
		|			ПО Вычеты.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
		|				И НАЧАЛОПЕРИОДА(Вычеты.МесяцНалоговогоПериода, МЕСЯЦ) = СотрудникиСПревышением.МесяцНалоговогоПериода
		|				И (СотрудникиСПревышением.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда))
		|	ГДЕ
		|		Вычеты.ДанныеДляОтчета) КАК ДоходыИВычеты
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоходыИВычеты.ФизическоеЛицо,
		|	ДоходыИВычеты.СтавкаНДФЛ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДФЛРасчетыСБюджетом.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						И (НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
		|					ТОГДА НДФЛРасчетыСБюджетом.Сумма
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК НачисленоЗаТекущийГод,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
		|						И (НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
		|					ТОГДА НДФЛРасчетыСБюджетом.Сумма
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ЗачтеноАвансовыхПлатежейЗаТекущийГод,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА (НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|						ИЛИ НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом))
		|						И (НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
		|					ТОГДА НДФЛРасчетыСБюджетом.Сумма
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК УдержаноЗаТекущийГод,
		|	0 КАК ВозвращеноЗаТекущийГод,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
		|						И (НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
		|					ТОГДА НДФЛРасчетыСБюджетом.Сумма
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПереданоНаВзысканиеЗаТекущийГод,
		|	НДФЛРасчетыСБюджетом.СтавкаНДФЛ КАК Ставка,
		|	ЕСТЬNULL(СУММА(НДФЛРасчетыСБюджетом.НалогНаПрибыльДляДивидендов), 0) КАК НалогНаПрибыльДляДивидендов
		|ПОМЕСТИТЬ ВТНалоги
		|ИЗ
		|	(ВЫБРАТЬ
		|		СтрокиНалогов.ВидДвижения КАК ВидДвижения,
		|		СтрокиНалогов.ВариантУдержания КАК ВариантУдержания,
		|		СтрокиНалогов.Сумма КАК Сумма,
		|		СтрокиНалогов.ФизическоеЛицо КАК ФизическоеЛицо,
		|		СтрокиНалогов.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
		|		СтрокиНалогов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		СтрокиНалогов.КатегорияДохода КАК КатегорияДохода,
		|		СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ КАК СтавкаНДФЛ,
		|		ВЫБОР
		|			КОГДА СтрокиНалогов.НалогНаПрибыльДляДивидендов * СтрокиНалогов.Сумма > 0
		|				ТОГДА СтрокиНалогов.НалогНаПрибыльДляДивидендов - ВЫБОР
		|						КОГДА СтрокиНалогов.НалогНаПрибыльДляДивидендов * СтрокиНалогов.СуммаСПревышения > 0
		|							ТОГДА ВЫБОР
		|									КОГДА СтрокиНалогов.НалогНаПрибыльДляДивидендов * СтрокиНалогов.НалогНаПрибыльДляДивидендов < СтрокиНалогов.СуммаСПревышения * СтрокиНалогов.СуммаСПревышения
		|										ТОГДА СтрокиНалогов.НалогНаПрибыльДляДивидендов
		|									ИНАЧЕ СтрокиНалогов.СуммаСПревышения
		|								КОНЕЦ
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК НалогНаПрибыльДляДивидендов
		|	ИЗ
		|		ВТСтрокиНалогов КАК СтрокиНалогов
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛСУчетомИзмененияСтатуса КАК СтавкаНДФЛПоСтавкеРезидента
		|			ПО СтрокиНалогов.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
		|				И СтрокиНалогов.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
		|				И СтрокиНалогов.МесяцНалоговогоПериода = СтавкаНДФЛПоСтавкеРезидента.Период
		|				И СтрокиНалогов.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СтрокиНалогов.ВидДвижения,
		|		СтрокиНалогов.ВариантУдержания,
		|		СтрокиНалогов.СуммаСПревышения,
		|		СтрокиНалогов.ФизическоеЛицо,
		|		СтрокиНалогов.СтавкаНалогообложенияРезидента,
		|		СтрокиНалогов.МесяцНалоговогоПериода,
		|		СтрокиНалогов.КатегорияДохода,
		|		ВЫБОР
		|			КОГДА СтавкаНДФЛПоСтавкеРезидента.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
		|				ТОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ
		|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА СтрокиНалогов.НалогНаПрибыльДляДивидендов * СтрокиНалогов.СуммаСПревышения > 0
		|				ТОГДА ВЫБОР
		|						КОГДА СтрокиНалогов.НалогНаПрибыльДляДивидендов * СтрокиНалогов.НалогНаПрибыльДляДивидендов < СтрокиНалогов.СуммаСПревышения * СтрокиНалогов.СуммаСПревышения
		|							ТОГДА СтрокиНалогов.НалогНаПрибыльДляДивидендов
		|						ИНАЧЕ СтрокиНалогов.СуммаСПревышения
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		ВТСтрокиНалогов КАК СтрокиНалогов
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛСУчетомИзмененияСтатуса КАК СтавкаНДФЛПоСтавкеРезидента
		|			ПО СтрокиНалогов.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
		|				И СтрокиНалогов.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
		|				И СтрокиНалогов.МесяцНалоговогоПериода = СтавкаНДФЛПоСтавкеРезидента.Период
		|				И СтрокиНалогов.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода) КАК НДФЛРасчетыСБюджетом
		|
		|СГРУППИРОВАТЬ ПО
		|	НДФЛРасчетыСБюджетом.ФизическоеЛицо,
		|	НДФЛРасчетыСБюджетом.СтавкаНДФЛ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ КАК Ставка,
		|	КОНЕЦПЕРИОДА(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
		|	НДФЛРасчетыСБюджетом.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НДФЛРасчетыСБюджетом.Сумма) КАК Налог
		|ПОМЕСТИТЬ ВТУдержаноНДФЛПо13или30ПоМесяцам
		|ИЗ
		|	ВТСтрокиНалогов КАК НДФЛРасчетыСБюджетом
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛСУчетомИзмененияСтатуса КАК СтавкаНДФЛПоСтавкеРезидента
		|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
		|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
		|			И НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода = СтавкаНДФЛПоСтавкеРезидента.Период
		|			И НДФЛРасчетыСБюджетом.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛБезУчетаИзмененияСтатуса
		|		ПО НДФЛРасчетыСБюджетом.ФизическоеЛицо = СтавкаНДФЛБезУчетаИзмененияСтатуса.ФизическоеЛицо
		|			И НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = СтавкаНДФЛБезУчетаИзмененияСтатуса.СтавкаНалогообложенияРезидента
		|			И НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода = СтавкаНДФЛБезУчетаИзмененияСтатуса.Период
		|			И НДФЛРасчетыСБюджетом.КатегорияДохода = СтавкаНДФЛБезУчетаИзмененияСтатуса.КатегорияДохода
		|ГДЕ
		|	НДФЛРасчетыСБюджетом.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|	И НДФЛРасчетыСБюджетом.ФизическоеЛицо ЕСТЬ НЕ NULL 
		|	И НДФЛРасчетыСБюджетом.РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане
		|	И СтавкаНДФЛБезУчетаИзмененияСтатуса.СтавкаНДФЛ В (ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13), ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30))
		|
		|СГРУППИРОВАТЬ ПО
		|	КОНЕЦПЕРИОДА(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ),
		|	НДФЛРасчетыСБюджетом.ФизическоеЛицо,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ КАК СтавкаПоСтатусу,
		|	ЕСТЬNULL(УдержаноНДФЛПоСтавке30.Налог, 0) КАК УдержаноНДФЛПоСтавке30,
		|	ЕСТЬNULL(УдержаноНДФЛПоСтавке13.Налог, 0) КАК УдержаноНДФЛПоСтавке13,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.СуммаРасход КАК СуммаРасход
		|ПОМЕСТИТЬ ВТПеречисленоПоСтавке13_30
		|ИЗ
		|	ВТПеречисленоНДФЛПоМесяцам КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержаноНДФЛПо13или30ПоМесяцам КАК УдержаноНДФЛПоСтавке13
		|		ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.ФизическоеЛицо = УдержаноНДФЛПоСтавке13.ФизическоеЛицо
		|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.МесяцНалоговогоПериода = УдержаноНДФЛПоСтавке13.МесяцНалоговогоПериода
		|			И (УдержаноНДФЛПоСтавке13.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержаноНДФЛПо13или30ПоМесяцам КАК УдержаноНДФЛПоСтавке30
		|		ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.ФизическоеЛицо = УдержаноНДФЛПоСтавке30.ФизическоеЛицо
		|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.МесяцНалоговогоПериода = УдержаноНДФЛПоСтавке30.МесяцНалоговогоПериода
		|			И (УдержаноНДФЛПоСтавке30.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛСУчетомИзмененияСтатуса КАК СтавкаНДФЛПоСтавкеРезидента
		|		ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
		|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.МесяцНалоговогоПериода = СтавкаНДФЛПоСтавкеРезидента.Период
		|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
		|			И (ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13) = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента)
		|ГДЕ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка В (ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30), ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13))
		|	И НЕ РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.ИсчисленоПоДивидендам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Перечислено.Ставка КАК Ставка,
		|	СУММА(Перечислено.Сумма) КАК Сумма,
		|	Перечислено.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТПеречисленоНДФЛ
		|ИЗ
		|	(ВЫБРАТЬ
		|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка КАК Ставка,
		|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
		|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.СуммаРасход КАК Сумма
		|	ИЗ
		|		ВТПеречисленоНДФЛПоМесяцам КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты
		|	ГДЕ
		|		НЕ РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка В (ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30), ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13))
		|		И НЕ РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.ИсчисленоПоДивидендам
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
		|				ТОГДА ВЫБОР
		|						КОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.МесяцНалоговогоПериода < ДАТАВРЕМЯ(2021, 1, 1, 0, 0, 0)
		|							ТОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ
		|						КОГДА СтавкаНДФЛПоСтавкеРезидента.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
		|							ТОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка
		|						ИНАЧЕ СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ
		|					КОНЕЦ
		|			ИНАЧЕ РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка
		|		КОНЕЦ,
		|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.ФизическоеЛицо,
		|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.СуммаРасход
		|	ИЗ
		|		ВТПеречисленоНДФЛПоМесяцам КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛСУчетомИзмененияСтатуса КАК СтавкаНДФЛПоСтавкеРезидента
		|			ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
		|				И РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.МесяцНалоговогоПериода = СтавкаНДФЛПоСтавкеРезидента.Период
		|				И (ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09) = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента)
		|				И РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
		|	ГДЕ
		|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.ИсчисленоПоДивидендам
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30),
		|		ПеречисленоПоСтавке13_30.ФизическоеЛицо,
		|		ВЫБОР
		|			КОГДА ПеречисленоПоСтавке13_30.УдержаноНДФЛПоСтавке30 + ПеречисленоПоСтавке13_30.УдержаноНДФЛПоСтавке13 = 0
		|				ТОГДА 0
		|			КОГДА ПеречисленоПоСтавке13_30.УдержаноНДФЛПоСтавке13 = 0
		|				ТОГДА ПеречисленоПоСтавке13_30.СуммаРасход
		|			ИНАЧЕ ВЫРАЗИТЬ(ПеречисленоПоСтавке13_30.СуммаРасход * ПеречисленоПоСтавке13_30.УдержаноНДФЛПоСтавке30 / (ПеречисленоПоСтавке13_30.УдержаноНДФЛПоСтавке30 + ПеречисленоПоСтавке13_30.УдержаноНДФЛПоСтавке13) КАК ЧИСЛО(22, 0))
		|		КОНЕЦ
		|	ИЗ
		|		ВТПеречисленоПоСтавке13_30 КАК ПеречисленоПоСтавке13_30
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13),
		|		ПеречисленоПоСтавке13_30.ФизическоеЛицо,
		|		ВЫБОР
		|			КОГДА ПеречисленоПоСтавке13_30.УдержаноНДФЛПоСтавке30 + ПеречисленоПоСтавке13_30.УдержаноНДФЛПоСтавке13 = 0
		|				ТОГДА 0
		|			КОГДА ПеречисленоПоСтавке13_30.УдержаноНДФЛПоСтавке30 = 0
		|				ТОГДА ПеречисленоПоСтавке13_30.СуммаРасход
		|			ИНАЧЕ ПеречисленоПоСтавке13_30.СуммаРасход - (ВЫРАЗИТЬ(ПеречисленоПоСтавке13_30.СуммаРасход * ПеречисленоПоСтавке13_30.УдержаноНДФЛПоСтавке30 / (ПеречисленоПоСтавке13_30.УдержаноНДФЛПоСтавке30 + ПеречисленоПоСтавке13_30.УдержаноНДФЛПоСтавке13) КАК ЧИСЛО(22, 0)))
		|		КОНЕЦ
		|	ИЗ
		|		ВТПеречисленоПоСтавке13_30 КАК ПеречисленоПоСтавке13_30
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПеречисленоПоСтавке13_30.СтавкаПоСтатусу,
		|		ПеречисленоПоСтавке13_30.ФизическоеЛицо,
		|		ВЫБОР
		|			КОГДА ПеречисленоПоСтавке13_30.УдержаноНДФЛПоСтавке30 + ПеречисленоПоСтавке13_30.УдержаноНДФЛПоСтавке13 = 0
		|				ТОГДА ПеречисленоПоСтавке13_30.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		ВТПеречисленоПоСтавке13_30 КАК ПеречисленоПоСтавке13_30) КАК Перечислено
		|
		|СГРУППИРОВАТЬ ПО
		|	Перечислено.Ставка,
		|	Перечислено.ФизическоеЛицо
		|
		|ИМЕЮЩИЕ
		|	СУММА(Перечислено.Сумма) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.Месяц КАК Месяц,
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.СтавкаНДФЛ КАК Ставка,
		|	Доходы.КодДохода КАК КодДохода,
		|	Доходы.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
		|	Доходы.КодВычета КАК КодВычета,
		|	СУММА(Доходы.СуммаДохода) КАК СуммаДохода,
		|	СУММА(Доходы.СуммаВычета) КАК СуммаВычета,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.НалоговаяБаза КАК НалоговаяБаза
		|ПОМЕСТИТЬ ВТДоходыПоМесяцам
		|ИЗ
		|	ВТДоходыОбъектаОбложения КАК Доходы
		|ГДЕ
		|	Доходы.Месяц ЕСТЬ НЕ NULL 
		|	И Доходы.ДанныеДляОтчета
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Месяц,
		|	Доходы.МесяцНалоговогоПериода,
		|	Доходы.СтавкаНДФЛ,
		|	Доходы.КодДохода,
		|	Доходы.КодДоходаКодДляОтчетности,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.КодВычета,
		|	Доходы.НалоговаяБаза
		|
		|ИМЕЮЩИЕ
		|	(СУММА(Доходы.СуммаДохода) <> 0
		|		ИЛИ СУММА(Доходы.СуммаВычета) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.КодДохода КАК КодДохода,
		|	Доходы.Месяц КАК Месяц,
		|	Доходы.Ставка КАК Ставка
		|ПОМЕСТИТЬ ВТОсобыеМесяцы
		|ИЗ
		|	ВТДоходыПоМесяцам КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.ФизическоеЛицо,
		|	Доходы.КодДохода,
		|	Доходы.Месяц,
		|	Доходы.Ставка
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА Доходы.КодВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) = 2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МесяцыОсобыхВычетов.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МесяцыОсобыхВычетов.КодДохода КАК КодДохода,
		|	МесяцыОсобыхВычетов.Месяц КАК Месяц,
		|	МАКСИМУМ(Доходы.КодВычета) КАК КодВычета,
		|	МесяцыОсобыхВычетов.Ставка КАК Ставка
		|ПОМЕСТИТЬ ВТСтрокиСУказаннымВычетом
		|ИЗ
		|	ВТОсобыеМесяцы КАК МесяцыОсобыхВычетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоМесяцам КАК Доходы
		|		ПО МесяцыОсобыхВычетов.ФизическоеЛицо = Доходы.ФизическоеЛицо
		|			И МесяцыОсобыхВычетов.КодДохода = Доходы.КодДохода
		|			И МесяцыОсобыхВычетов.Месяц = Доходы.Месяц
		|			И МесяцыОсобыхВычетов.Ставка = Доходы.Ставка
		|ГДЕ
		|	Доходы.КодВычета <> ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	МесяцыОсобыхВычетов.ФизическоеЛицо,
		|	МесяцыОсобыхВычетов.КодДохода,
		|	МесяцыОсобыхВычетов.Месяц,
		|	МесяцыОсобыхВычетов.Ставка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МесяцыОсобыхВычетов.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МесяцыОсобыхВычетов.КодДохода КАК КодДохода,
		|	МесяцыОсобыхВычетов.Месяц КАК Месяц,
		|	СУММА(Доходы.СуммаДохода) КАК СуммаДохода,
		|	МесяцыОсобыхВычетов.Ставка КАК Ставка
		|ПОМЕСТИТЬ ВТДоходыИзСтрокБезВычетов
		|ИЗ
		|	ВТОсобыеМесяцы КАК МесяцыОсобыхВычетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоМесяцам КАК Доходы
		|		ПО МесяцыОсобыхВычетов.ФизическоеЛицо = Доходы.ФизическоеЛицо
		|			И МесяцыОсобыхВычетов.КодДохода = Доходы.КодДохода
		|			И МесяцыОсобыхВычетов.Месяц = Доходы.Месяц
		|			И МесяцыОсобыхВычетов.Ставка = Доходы.Ставка
		|ГДЕ
		|	Доходы.КодВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	МесяцыОсобыхВычетов.ФизическоеЛицо,
		|	МесяцыОсобыхВычетов.КодДохода,
		|	МесяцыОсобыхВычетов.Месяц,
		|	МесяцыОсобыхВычетов.Ставка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.Месяц КАК МесяцНалоговогоПериода,
		|	Доходы.Ставка КАК Ставка,
		|	Доходы.КодДохода КАК КодДохода,
		|	Доходы.КодДоходаКодДляОтчетности КАК КодДоходаКодДляОтчетности,
		|	Доходы.КодВычета КАК КодВычета,
		|	Доходы.СуммаДохода + ВЫБОР
		|		КОГДА СтрокиСУказаннымВычетом.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ДоходыИзСтрокБезВычетов.СуммаДохода, 0)
		|	КОНЕЦ КАК СуммаДохода,
		|	Доходы.СуммаВычета КАК СуммаВычета,
		|	Доходы.ФизическоеЛицо КАК Сотрудник,
		|	Доходы.НалоговаяБаза КАК НалоговаяБаза,
		|	ЛОЖЬ КАК ВключатьВДекларациюПоНалогуНаПрибыль
		|ИЗ
		|	ВТДоходыПоМесяцам КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсобыеМесяцы КАК СтрокиБезКодаВычета
		|		ПО Доходы.ФизическоеЛицо = СтрокиБезКодаВычета.ФизическоеЛицо
		|			И Доходы.КодДохода = СтрокиБезКодаВычета.КодДохода
		|			И Доходы.Месяц = СтрокиБезКодаВычета.Месяц
		|			И (Доходы.КодВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка))
		|			И Доходы.Ставка = СтрокиБезКодаВычета.Ставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыИзСтрокБезВычетов КАК ДоходыИзСтрокБезВычетов
		|		ПО Доходы.ФизическоеЛицо = ДоходыИзСтрокБезВычетов.ФизическоеЛицо
		|			И Доходы.Месяц = ДоходыИзСтрокБезВычетов.Месяц
		|			И Доходы.КодДохода = ДоходыИзСтрокБезВычетов.КодДохода
		|			И Доходы.Ставка = ДоходыИзСтрокБезВычетов.Ставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтрокиСУказаннымВычетом КАК СтрокиСУказаннымВычетом
		|		ПО Доходы.ФизическоеЛицо = СтрокиСУказаннымВычетом.ФизическоеЛицо
		|			И Доходы.Месяц = СтрокиСУказаннымВычетом.Месяц
		|			И Доходы.КодДохода = СтрокиСУказаннымВычетом.КодДохода
		|			И Доходы.КодВычета = СтрокиСУказаннымВычетом.КодВычета
		|			И Доходы.Ставка = СтрокиСУказаннымВычетом.Ставка
		|ГДЕ
		|	СтрокиБезКодаВычета.ФизическоеЛицо ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ставка,
		|	МесяцНалоговогоПериода,
		|	Доходы.КодДоходаКодДляОтчетности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вычеты.КодВычета КАК КодВычета,
		|	Вычеты.КодВычетаГруппаВычета КАК ГруппаВычета,
		|	СУММА(Вычеты.СуммаВычета) КАК СуммаВычета,
		|	Вычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года + Вычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года КАК КодВычетаКод,
		|	ЛОЖЬ КАК ВключатьВДекларациюПоНалогуНаПрибыль,
		|	ВЫБОР
		|		КОГДА СотрудникиСПревышением.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
		|	КОНЕЦ КАК Ставка,
		|	Вычеты.ФизическоеЛицо КАК Сотрудник
		|ИЗ
		|	ВТВычеты КАК Вычеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМесяцыПослеПревышения КАК СотрудникиСПревышением
		|		ПО Вычеты.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
		|			И НАЧАЛОПЕРИОДА(Вычеты.МесяцНалоговогоПериода, МЕСЯЦ) = СотрудникиСПревышением.МесяцНалоговогоПериода
		|			И (СотрудникиСПревышением.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда))
		|ГДЕ
		|	Вычеты.КодВычета ЕСТЬ НЕ NULL 
		|	И Вычеты.ДанныеДляОтчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА СотрудникиСПревышением.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
		|	КОНЕЦ,
		|	Вычеты.КодВычета,
		|	Вычеты.КодВычетаГруппаВычета,
		|	Вычеты.ФизическоеЛицо,
		|	Вычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2011Года + Вычеты.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2010Года
		|
		|ИМЕЮЩИЕ
		|	СУММА(Вычеты.СуммаВычета) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодВычетаКод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиОрганизаций.ФизическоеЛицо КАК Сотрудник,
		|	ЕСТЬNULL(Ставки.Ссылка, ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)) КАК Ставка,
		|	ИтогиДоходов.ОбщаяСуммаДохода КАК ОбщаяСуммаДохода,
		|	ИтогиДоходов.ОблагаемаяСуммаДохода КАК ОблагаемаяСуммаДохода,
		|	Налоги.НачисленоЗаТекущийГод КАК Исчислено,
		|	Налоги.ЗачтеноАвансовыхПлатежейЗаТекущийГод КАК ЗачтеноАвансовыхПлатежей,
		|	Налоги.НалогНаПрибыльДляДивидендов КАК НалогНаПрибыльДляДивидендов,
		|	Налоги.УдержаноЗаТекущийГод - Налоги.ВозвращеноЗаТекущийГод КАК Удержано,
		|	ЕСТЬNULL(ПеречисленоНДФЛ.Сумма, 0) КАК Перечислено,
		|	ВЫБОР
		|		КОГДА Налоги.НачисленоЗаТекущийГод - Налоги.ЗачтеноАвансовыхПлатежейЗаТекущийГод - Налоги.УдержаноЗаТекущийГод - Налоги.НалогНаПрибыльДляДивидендов + Налоги.ВозвращеноЗаТекущийГод > 0
		|			ТОГДА Налоги.НачисленоЗаТекущийГод - Налоги.ЗачтеноАвансовыхПлатежейЗаТекущийГод - Налоги.УдержаноЗаТекущийГод - Налоги.НалогНаПрибыльДляДивидендов + Налоги.ВозвращеноЗаТекущийГод
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Задолженность,
		|	ВЫБОР
		|		КОГДА Налоги.НачисленоЗаТекущийГод - Налоги.ЗачтеноАвансовыхПлатежейЗаТекущийГод - Налоги.УдержаноЗаТекущийГод - Налоги.НалогНаПрибыльДляДивидендов + Налоги.ВозвращеноЗаТекущийГод < 0
		|			ТОГДА -(Налоги.НачисленоЗаТекущийГод - Налоги.ЗачтеноАвансовыхПлатежейЗаТекущийГод - Налоги.УдержаноЗаТекущийГод - Налоги.НалогНаПрибыльДляДивидендов + Налоги.ВозвращеноЗаТекущийГод)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ИзлишнеУдержано,
		|	ЛОЖЬ КАК ВключатьВДекларациюПоНалогуНаПрибыль
		|ИЗ
		|	ВТФизлица КАК СотрудникиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.НДФЛСтавки КАК Ставки
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИтогиДоходов КАК ИтогиДоходов
		|		ПО СотрудникиОрганизаций.ФизическоеЛицо = ИтогиДоходов.ФизическоеЛицо
		|			И (ЕСТЬNULL(Ставки.Ссылка, ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)) = ИтогиДоходов.Ставка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалоги КАК Налоги
		|		ПО СотрудникиОрганизаций.ФизическоеЛицо = Налоги.ФизическоеЛицо
		|			И (ЕСТЬNULL(Ставки.Ссылка, ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)) = Налоги.Ставка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПеречисленоНДФЛ КАК ПеречисленоНДФЛ
		|		ПО СотрудникиОрганизаций.ФизическоеЛицо = ПеречисленоНДФЛ.ФизическоеЛицо
		|			И (ЕСТЬNULL(Ставки.Ссылка, ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)) = ПеречисленоНДФЛ.Ставка)
		|ГДЕ
		|	(ИтогиДоходов.ФизическоеЛицо ЕСТЬ НЕ NULL 
		|				И (ИтогиДоходов.ОбщаяСуммаДохода <> 0
		|					ИЛИ ИтогиДоходов.ОблагаемаяСуммаДохода <> 0)
		|			ИЛИ Налоги.ФизическоеЛицо ЕСТЬ НЕ NULL 
		|				И (Налоги.НачисленоЗаТекущийГод <> 0
		|					ИЛИ Налоги.НачисленоЗаТекущийГод - Налоги.ЗачтеноАвансовыхПлатежейЗаТекущийГод - Налоги.УдержаноЗаТекущийГод + Налоги.ВозвращеноЗаТекущийГод <> 0)
		|			ИЛИ ЕСТЬNULL(ПеречисленоНДФЛ.Сумма, 0) <> 0)";		
		
	КонецЕсли;
	
	Результаты = Запрос.ВыполнитьПакет();
	ВсегоЗапросов = Результаты.Количество();
	
	Возврат Новый Структура("Доходы, Вычеты, Налоги", 
						Результаты[ВсегоЗапросов - 3].Выгрузить(), 
						Результаты[ВсегоЗапросов - 2].Выгрузить(), 
						Результаты[ВсегоЗапросов - 1].Выгрузить());
КонецФункции


Процедура ВыделитьСуммыПревышенияПредела(ОблагаемыйДоходДоПредела, СтрокиРаспределения, СтрокиДоходовПревышающихПредел) Экспорт 

	Если ОблагаемыйДоходДоПредела = 0 Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыРасчетаНДФЛПоПрогрессивнойШкале = УчетНДФЛ.ПараметрыРасчетаНДФЛПоПрогрессивнойШкале();
	ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Вставить("СтавкаНалога", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.СтавкаЧислом * 100);
	
	Если СтрокиРаспределения.Количество() = 1 Тогда
		СтрокаТаблицы = СтрокиРаспределения[0];
		СтрокаПревышения = СтрокиДоходовПревышающихПредел.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПревышения, СтрокаТаблицы);
		СтрокаТаблицы.СуммаДохода = ОблагаемыйДоходДоПредела;
		Если СтрокаТаблицы.СуммаВычета <> 0 Тогда
			СтрокаТаблицы.СуммаВычета = Окр(СтрокаТаблицы.СуммаВычета * ОблагаемыйДоходДоПредела / СтрокаТаблицы.ОблагаемыйДоходЗаДень, 2);
			СтрокаТаблицы.СуммаДохода = СтрокаТаблицы.СуммаДохода + СтрокаТаблицы.СуммаВычета;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаПревышения, ПараметрыРасчетаНДФЛПоПрогрессивнойШкале);
		СтрокаПревышения.СуммаДохода = СтрокаПревышения.СуммаДохода - СтрокаТаблицы.СуммаДохода;
		Если СтрокаПревышения.СуммаВычета <> 0 Тогда
			СтрокаПревышения.СуммаВычета = СтрокаПревышения.СуммаВычета - СтрокаТаблицы.СуммаВычета;
		КонецЕсли;
	Иначе
		
		МаксимальныйКоэффициент = 0;
		РаспределеннаяСумма = 0;
		РаспределенныеДоходы = Новый Соответствие;
		Для Каждого СтрокаТаблицы Из СтрокиРаспределения Цикл
			АбсолютноеЗначениеКоэффициента = (СтрокаТаблицы.СуммаДохода - СтрокаТаблицы.СуммаВычета) * (СтрокаТаблицы.СуммаДохода - СтрокаТаблицы.СуммаВычета);
			Если МаксимальныйКоэффициент < АбсолютноеЗначениеКоэффициента Тогда
				МаксимальныйКоэффициент = АбсолютноеЗначениеКоэффициента;
				СтрокаМаксимальногоКоэффициента = СтрокаТаблицы;
			КонецЕсли;
			СуммаСтроки = Окр(ОблагаемыйДоходДоПредела * (СтрокаТаблицы.СуммаДохода - СтрокаТаблицы.СуммаВычета) / СтрокаТаблицы.ОблагаемыйДоходЗаДень, 2, 1);
			РаспределенныеДоходы.Вставить(СтрокаТаблицы, СуммаСтроки);
			РаспределеннаяСумма = РаспределеннаяСумма + СуммаСтроки;
		КонецЦикла;
		Если Не РаспределеннаяСумма = ОблагаемыйДоходДоПредела Тогда
			РаспределенныеДоходы.Вставить(СтрокаМаксимальногоКоэффициента, РаспределенныеДоходы[СтрокаМаксимальногоКоэффициента] + ОблагаемыйДоходДоПредела - РаспределеннаяСумма)
		КонецЕсли;
		Для Каждого СтрокаТаблицы Из СтрокиРаспределения Цикл
			Если СтрокаТаблицы.СуммаДохода = СтрокаТаблицы.СуммаВычета Тогда
				 Продолжить;
			КонецЕсли;
			СтрокаПревышения = СтрокиДоходовПревышающихПредел.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПревышения, СтрокаТаблицы);
			Если СтрокаТаблицы.СуммаВычета <> 0 И СтрокаТаблицы.СуммаДохода <> 0 Тогда
				СтрокаТаблицы.СуммаВычета = Окр(СтрокаТаблицы.СуммаВычета * РаспределенныеДоходы[СтрокаТаблицы] / (СтрокаТаблицы.СуммаДохода - СтрокаТаблицы.СуммаВычета), 2);
			КонецЕсли;
			СтрокаТаблицы.СуммаДохода = РаспределенныеДоходы[СтрокаТаблицы];
			Если СтрокаТаблицы.СуммаВычета <> 0 И СтрокаТаблицы.СуммаДохода <> 0 Тогда
				СтрокаТаблицы.СуммаДохода = СтрокаТаблицы.СуммаДохода + СтрокаТаблицы.СуммаВычета;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаПревышения, ПараметрыРасчетаНДФЛПоПрогрессивнойШкале);
			СтрокаПревышения.СуммаДохода = СтрокаПревышения.СуммаДохода - СтрокаТаблицы.СуммаДохода;
			Если СтрокаПревышения.СуммаВычета <> 0 Тогда
				СтрокаПревышения.СуммаВычета = СтрокаПревышения.СуммаВычета - СтрокаТаблицы.СуммаВычета;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, СтруктураПолей)

	Значение = Неопределено;
	
	Для каждого КлючИЗначение Из СтруктураПолей Цикл
		Если ПоказателиОтчета.Свойство(КлючИЗначение.Ключ, Значение) Тогда
			ТипПоля = ТипЗнч(СтруктураПолей[КлючИЗначение.Ключ]);
			Если ТипПоля = Тип("Строка") Тогда
				СтруктураПолей[КлючИЗначение.Ключ] = ""
			ИначеЕсли ТипПоля = Тип("Дата") Тогда
				СтруктураПолей[КлючИЗначение.Ключ] = '00010101'
			Иначе
				СтруктураПолей[КлючИЗначение.Ключ] = 0
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция НовоеПустоеДеревоДляОтчета()
	
	ПустоеДерево = Новый ДеревоЗначений;
	ПустоеДерево.Колонки.Добавить("Данные", Новый ОписаниеТипов("Структура"));
	ПустоеДерево.Колонки.Добавить("ДанныеМногострочныхЧастей", Новый ОписаниеТипов("Структура"));
	
	Возврат ПустоеДерево
	
КонецФункции

Функция НовыеПустыеДанныеМногострочныхЧастей(ИменаМногострочныхЧастей)
	
	ПустыеДанные = Новый Структура();
	Ключи = СтрРазделить(ИменаМногострочныхЧастей, ",", Ложь);
	Для каждого Имя Из Ключи Цикл
		ПустыеДанные.Вставить(Имя, НовоеПустоеДеревоДляОтчета())
	КонецЦикла;
	
	Возврат ПустыеДанные
	
КонецФункции

Функция УдалитьПоляРасшифровкиИзЗапроса(Знач ТекстЗапроса, МассивПолей, ИмяТаблицы = "СведенияОДоходах")
	
	Для каждого ПолеРасшифровки Из МассивПолей Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,ИмяТаблицы + "." + ПолеРасшифровки,"Неопределено");
	КонецЦикла;
	
	Возврат ТекстЗапроса
	
КонецФункции	

Процедура ПолучитьПереданныеДанныеОтчета2021(Организация, ОКТМО, КПП, ДатаОкончания, МенеджерВременныхТаблиц, НомерКорректировки, ИмяФормы)
	
	НачалоПериода = НачалоГода(ДатаОкончания);
	Данные = ИнтерфейсыВзаимодействияБРО.СправкиОДоходахИСуммахНалогаФизическихЛицИзОтчетов6_НДФЛ(Новый Структура("Организация, ДатаОкончания, ИмяФормыОтчета", Организация, ДатаОкончания, ИмяФормы));
	Если Данные.Количество() > 0 Тогда
		
		Физлица = Новый ТаблицаЗначений;
		Физлица.Колонки.Добавить("НомерСправки", Новый ОписаниеТипов("Число"));
		Физлица.Колонки.Добавить("НомерКорректировки", Новый ОписаниеТипов("Число"));
		Физлица.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12)));
		Физлица.Колонки.Добавить("Фамилия", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		Физлица.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		Физлица.Колонки.Добавить("Отчество", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		Физлица.Колонки.Добавить("ДатаРождения", Новый ОписаниеТипов("Дата,Строка", , Новый КвалификаторыСтроки(100)));
		Физлица.Колонки.Добавить("КодФНС", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1)));
		Физлица.Колонки.Добавить("КодСтраныДляОтчетности", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(3)));
		Физлица.Колонки.Добавить("КодМВД", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(2)));
		Физлица.Колонки.Добавить("СерияДокумента", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		Физлица.Колонки.Добавить("НомерДокумента", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
		Итоги = Новый ТаблицаЗначений;
		Итоги.Колонки.Добавить("НомерСправки", Новый ОписаниеТипов("Число"));
		Итоги.Колонки.Добавить("НомерКорректировки", Новый ОписаниеТипов("Число"));
		Итоги.Колонки.Добавить("П000П1М100009", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));
		Итоги.Колонки.Добавить("П000П1М100001", Новый ОписаниеТипов("Число"));
		Итоги.Колонки.Добавить("П000П1М100002", Новый ОписаниеТипов("Число"));
		Итоги.Колонки.Добавить("П000П1М100003", Новый ОписаниеТипов("Число"));
		Итоги.Колонки.Добавить("П000П1М100004", Новый ОписаниеТипов("Число"));
		Итоги.Колонки.Добавить("П000П1М100005", Новый ОписаниеТипов("Число"));
		Итоги.Колонки.Добавить("П000П1М100006", Новый ОписаниеТипов("Число"));
		Итоги.Колонки.Добавить("П000П1М100007", Новый ОписаниеТипов("Число"));
		Итоги.Колонки.Добавить("П000П1М100008", Новый ОписаниеТипов("Число"));
		Итоги.Колонки.Добавить("П000П1М100010", Новый ОписаниеТипов("Число"));
		Вычеты = Новый ТаблицаЗначений;
		Вычеты.Колонки.Добавить("НомерСправки", Новый ОписаниеТипов("Число"));
		Вычеты.Колонки.Добавить("НомерКорректировки", Новый ОписаниеТипов("Число"));
		Вычеты.Колонки.Добавить("КБК", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));
		Вычеты.Колонки.Добавить("Ставка", Новый ОписаниеТипов("Число"));
		Вычеты.Колонки.Добавить("П000П1М200001", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(4)));
		Вычеты.Колонки.Добавить("П000П1М200002", Новый ОписаниеТипов("Число"));
		УведомленияОВычетах = Новый ТаблицаЗначений;
		УведомленияОВычетах.Колонки.Добавить("НомерСправки", Новый ОписаниеТипов("Число"));
		УведомленияОВычетах.Колонки.Добавить("НомерКорректировки", Новый ОписаниеТипов("Число"));
		УведомленияОВычетах.Колонки.Добавить("ГруппаВычета", Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыВычетовПоНДФЛ"));
		УведомленияОВычетах.Колонки.Добавить("П000П1М300002", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
		УведомленияОВычетах.Колонки.Добавить("П000П1М300003", Новый ОписаниеТипов("Дата,Строка", , Новый КвалификаторыСтроки(100)));
		УведомленияОВычетах.Колонки.Добавить("П000П1М300004", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(4)));
		Доходы = Новый ТаблицаЗначений;
		Доходы.Колонки.Добавить("НомерСправки", Новый ОписаниеТипов("Число"));
		Доходы.Колонки.Добавить("НомерКорректировки", Новый ОписаниеТипов("Число"));
		Доходы.Колонки.Добавить("КБК", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));
		Доходы.Колонки.Добавить("Ставка", Новый ОписаниеТипов("Число"));
		Доходы.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата,Строка", , Новый КвалификаторыСтроки(100)));
		Доходы.Колонки.Добавить("П000П1М500002", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(4)));
		Доходы.Колонки.Добавить("П000П1М500003", Новый ОписаниеТипов("Число"));
		Доходы.Колонки.Добавить("П000П1М600004", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(4)));
		Доходы.Колонки.Добавить("П000П1М600005", Новый ОписаниеТипов("Число"));
		
		НомерСведения = 0;
		Для каждого ДанныеОтчета Из Данные Цикл
			
			Если ДанныеОтчета.НомерКорректировки >= НомерКорректировки Тогда
				Прервать;
			КонецЕсли;
			
			// АПК:1036-выкл 
			ОКТМОизДанных = Неопределено; КППизДанных = Неопределено;
			ПроверятьОКТМОиКПП = ДанныеОтчета.Свойство("ОКТМО", ОКТМОизДанных) И ДанныеОтчета.Свойство("КПП", КППизДанных);
			Если ПроверятьОКТМОиКПП И (ОКТМОизДанных <> ОКТМО Или КППизДанных <> КПП) Тогда
				Прервать;
			КонецЕсли;
			// АПК:1036-вкл 
			
			Для каждого СтрокаСправки Из ДанныеОтчета.СправкиОДоходахИСуммахНалогаФизическихЛиц.Строки Цикл
				
				ДанныеСправки = СтрокаСправки.Данные;
				Если ДанныеСправки.П000П10000002 = "99" Тогда // отменяющую пропустим
					Продолжить;
				КонецЕсли;
				 
				НомерСправки = ДанныеСправки.П000П10000001;
				НомерКорректировкиСправки = Число(ДанныеСправки.П000П10000002);
				
				СтрокаДанных = Физлица.Добавить();
				СтрокаДанных.НомерСправки = НомерСправки;
				СтрокаДанных.НомерКорректировки = НомерКорректировкиСправки;
				СтрокаДанных.ИНН = ДанныеСправки.П000П10000003;
				СтрокаДанных.Фамилия = ДанныеСправки.П000П10000004;
				СтрокаДанных.Имя = ДанныеСправки.П000П10000005;
				СтрокаДанных.Отчество = ДанныеСправки.П000П10000006;
				СтрокаДанных.КодФНС = ДанныеСправки.П000П10000007;
				СтрокаДанных.ДатаРождения = ДанныеСправки.П000П10000008;
				Если ТипЗнч(ДанныеСправки.П000П10000008) <> Тип("Дата") Тогда
					Если ЗначениеЗаполнено(ДанныеСправки.П000П10000008) И ДанныеСправки.П000П10000008 <> "0" Тогда
						СтрокаДанных.ДатаРождения = Дата(ДанныеСправки.П000П10000008);
					Иначе
						СтрокаДанных.ДатаРождения = '00010101'
					КонецЕсли;
				КонецЕсли;
				СтрокаДанных.КодСтраныДляОтчетности = ДанныеСправки.П000П10000009;
				СтрокаДанных.КодМВД = ДанныеСправки.П000П10000010;
				СтрокаДанных.СерияДокумента = ДанныеСправки.П000П10000011;
				СтрокаДанных.НомерДокумента = ДанныеСправки.П000П10000012;
				
				Для каждого СтрокаСтавкиКБК Из СтрокаСправки.ДанныеМногострочныхЧастей.П000П1М1.Строки Цикл
					
					Ставка = СтрокаСтавкиКБК.Данные.П000П1М100001;
					КБК = СтрокаСтавкиКБК.Данные.П000П1М100009;
					Если Не ЗначениеЗаполнено(Ставка) Или Не ЗначениеЗаполнено(КБК) Тогда
						Продолжить;	
					КонецЕсли;
					
					СтрокаДанных = Итоги.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаСтавкиКБК.Данные);
					СтрокаДанных.НомерСправки = НомерСправки;
					СтрокаДанных.НомерКорректировки = НомерКорректировкиСправки;
					Для каждого СтрокаВычетов Из СтрокаСтавкиКБК.ДанныеМногострочныхЧастей.П000П1М2.Строки Цикл
						Если Не ЗначениеЗаполнено(СтрокаВычетов.Данные.П000П1М200002) Тогда
							Продолжить;
						КонецЕсли;
						СтрокаДанных = Вычеты.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаВычетов.Данные);
						СтрокаДанных.НомерСправки = НомерСправки;
						СтрокаДанных.НомерКорректировки = НомерКорректировкиСправки;
						СтрокаДанных.КБК = КБК;
						СтрокаДанных.Ставка = Ставка;
					КонецЦикла;
					Для каждого СтрокаУведомленийОВычетах Из СтрокаСтавкиКБК.ДанныеМногострочныхЧастей.П000П1М3.Строки Цикл
						Если Не ЗначениеЗаполнено(СтрокаУведомленийОВычетах.Данные.П000П1М300002) Тогда
							Продолжить;
						КонецЕсли;
						СтрокаДанных = УведомленияОВычетах.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаУведомленийОВычетах.Данные);
						СтрокаДанных.НомерСправки = НомерСправки;
						СтрокаДанных.НомерКорректировки = НомерКорректировкиСправки;
						КодУведомления = СтрокаУведомленийОВычетах.Данные.П000П1М300001;
						Если КодУведомления = "1" Тогда
							СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.Имущественные
						ИначеЕсли КодУведомления = "2" Тогда
							СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.Социальные
						КонецЕсли;
					КонецЦикла;
					Для каждого СтрокаДоходов Из СтрокаСтавкиКБК.ДанныеМногострочныхЧастей.П000П1М5.Строки Цикл
						Если Не ЗначениеЗаполнено(СтрокаДоходов.Данные.П000П1М500001) Тогда
							Продолжить;
						КонецЕсли;
						СтрокаДанных = Доходы.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаДоходов.Данные);
						СтрокаДанных.НомерСправки = НомерСправки;
						СтрокаДанных.НомерКорректировки = НомерКорректировкиСправки;
						СтрокаДанных.КБК = КБК;
						СтрокаДанных.Ставка = Ставка;
		 				СтрокаДанных.Период = ДобавитьМесяц(НачалоПериода, Число(СтрокаДоходов.Данные.П000П1М500001) - 1);
						СтрокиВычетов = СтрокаДоходов.ДанныеМногострочныхЧастей.П000П1М6.Строки;
						Если СтрокиВычетов.Количество() = 1 Тогда
							ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокиВычетов[0].Данные);
						ИначеЕсли СтрокиВычетов.Количество() > 1 Тогда
							Для каждого СтрокаВычетов Из СтрокиВычетов Цикл
								Если СтрокиВычетов.Индекс(СтрокаВычетов) = 0 Тогда
									ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаВычетов.Данные);
								Иначе
									ДопСтрокаДанных = Доходы.Добавить();
									ЗаполнитьЗначенияСвойств(ДопСтрокаДанных, СтрокаДанных, , "П000П1М500003");
									ЗаполнитьЗначенияСвойств(ДопСтрокаДанных, СтрокаВычетов.Данные);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если Физлица.Количество() > 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			
			ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, Физлица, "ВТВременнаяТаблица");
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВременнаяТаблица.ИНН КАК ИНН,
			|	ВременнаяТаблица.Фамилия КАК Фамилия,
			|	ВременнаяТаблица.Имя КАК Имя,
			|	ВременнаяТаблица.Отчество КАК Отчество,
			|	ВременнаяТаблица.ДатаРождения КАК ДатаРождения,
			|	ВременнаяТаблица.СерияДокумента КАК СерияДокумента,
			|	ВременнаяТаблица.НомерДокумента КАК НомерДокумента,
			|	ВременнаяТаблица.КодСтраныДляОтчетности КАК КодСтраныДляОтчетности,
			|	ВременнаяТаблица.КодМВД КАК КодМВД,
			|	МАКСИМУМ(ВременнаяТаблица.НомерКорректировки) КАК НомерКорректировки
			|ПОМЕСТИТЬ ВТПоследниеКорректировки
			|ИЗ
			|	ВТВременнаяТаблица КАК ВременнаяТаблица
			|
			|СГРУППИРОВАТЬ ПО
			|	ВременнаяТаблица.ИНН,
			|	ВременнаяТаблица.Фамилия,
			|	ВременнаяТаблица.Имя,
			|	ВременнаяТаблица.Отчество,
			|	ВременнаяТаблица.ДатаРождения,
			|	ВременнаяТаблица.СерияДокумента,
			|	ВременнаяТаблица.НомерДокумента,
			|	ВременнаяТаблица.КодСтраныДляОтчетности,
			|	ВременнаяТаблица.КодМВД";
			Запрос.Выполнить(); 
			
			// Для отменяющей формы нужен только перечень переданных справок.
			Если НомерКорректировки = 99 Тогда 
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВременнаяТаблица.НомерСправки КАК НомерСправки,
				|	ВременнаяТаблица.ИНН КАК ИНН,
				|	ВременнаяТаблица.Фамилия КАК Фамилия,
				|	ВременнаяТаблица.Имя КАК Имя,
				|	ВременнаяТаблица.Отчество КАК Отчество,
				|	ВременнаяТаблица.ДатаРождения КАК ДатаРождения,
				|	ВременнаяТаблица.СерияДокумента КАК СерияДокумента,
				|	ВременнаяТаблица.НомерДокумента КАК НомерДокумента,
				|	ВременнаяТаблица.КодСтраныДляОтчетности КАК КодСтраныДляОтчетности,
				|	ВременнаяТаблица.КодМВД КАК КодМВД,
				|	ВременнаяТаблица.КодФНС КАК КодФНС
				|ПОМЕСТИТЬ ВТНалогоплательщикиПереданные
				|ИЗ
				|	ВТВременнаяТаблица КАК ВременнаяТаблица
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоследниеКорректировки КАК ПоследниеКорректировки
				|		ПО ВременнаяТаблица.НомерКорректировки = ПоследниеКорректировки.НомерКорректировки
				|			И ВременнаяТаблица.ИНН = ПоследниеКорректировки.ИНН
				|			И ВременнаяТаблица.Фамилия = ПоследниеКорректировки.Фамилия
				|			И ВременнаяТаблица.Имя = ПоследниеКорректировки.Имя
				|			И ВременнаяТаблица.Отчество = ПоследниеКорректировки.Отчество
				|			И ВременнаяТаблица.ДатаРождения = ПоследниеКорректировки.ДатаРождения
				|			И ВременнаяТаблица.СерияДокумента = ПоследниеКорректировки.СерияДокумента
				|			И ВременнаяТаблица.НомерДокумента = ПоследниеКорректировки.НомерДокумента
				|			И ВременнаяТаблица.КодМВД = ПоследниеКорректировки.КодМВД
				|			И ВременнаяТаблица.КодСтраныДляОтчетности = ПоследниеКорректировки.КодСтраныДляОтчетности
				|ГДЕ
				|	ПоследниеКорректировки.НомерКорректировки ЕСТЬ НЕ NULL ";
				Запрос.Выполнить(); 
				Возврат	
			КонецЕсли;
			
			// Для корректирующей формы нужны все переданные данные.
			
			СтруктураПараметров = КадровыйУчет.ПараметрыПолученияВсехСотрудниковОрганизацийПоСпискуФизическихЛиц();
			СтруктураПараметров.КадровыеДанные = "ФизическоеЛицо, ИНН, Фамилия, Имя, Отчество, ДатаРождения, ДокументВид, ДокументСерия, ДокументНомер, ДокументСтранаВыдачи, Страна";
			СтруктураПараметров.Организация = Организация;
			СтруктураПараметров.НачалоПериода = НачалоПериода;
			СтруктураПараметров.ОкончаниеПериода = КонецМесяца(ДатаОкончания);
			КадровыйУчет.СоздатьВТСотрудникиОрганизации(МенеджерВременныхТаблиц, Ложь, СтруктураПараметров, "ВТСотрудники");
			
			// АПК:96-выкл Использование ОБЪЕДИНИТЬ оправдано
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	КадровыеДанныеФизЛиц.ФизическоеЛицо КАК ФизическоеЛицо
			|ПОМЕСТИТЬ ВТФизлицаИзИБ
			|ИЗ
			|	ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизЛиц
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Сотрудники.ФизическоеЛицо
			|ИЗ
			|	ВТСотрудники КАК Сотрудники
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Физлица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВЫБОР
			|		КОГДА КадровыеДанныеФизЛиц.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА КадровыеДанныеФизЛиц.ИНН
			|		КОГДА Сотрудники.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА Сотрудники.ИНН
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ИНН,
			|	ВЫБОР
			|		КОГДА КадровыеДанныеФизЛиц.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА КадровыеДанныеФизЛиц.Фамилия
			|		КОГДА Сотрудники.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА Сотрудники.Фамилия
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК Фамилия,
			|	ВЫБОР
			|		КОГДА КадровыеДанныеФизЛиц.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА КадровыеДанныеФизЛиц.Имя
			|		КОГДА Сотрудники.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА Сотрудники.Имя
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК Имя,
			|	ВЫБОР
			|		КОГДА КадровыеДанныеФизЛиц.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА КадровыеДанныеФизЛиц.Отчество
			|		КОГДА Сотрудники.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА Сотрудники.Отчество
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК Отчество,
			|	ВЫБОР
			|		КОГДА КадровыеДанныеФизЛиц.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА КадровыеДанныеФизЛиц.ДатаРождения
			|		КОГДА Сотрудники.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА Сотрудники.ДатаРождения
			|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|	КОНЕЦ КАК ДатаРождения,
			|	ВЫБОР
			|		КОГДА КадровыеДанныеФизЛиц.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА ЕСТЬNULL(КадровыеДанныеФизЛиц.ДокументСерия, """")
			|		КОГДА Сотрудники.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА ЕСТЬNULL(Сотрудники.ДокументСерия, """")
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК СерияДокумента,
			|	ВЫБОР
			|		КОГДА КадровыеДанныеФизЛиц.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА ЕСТЬNULL(КадровыеДанныеФизЛиц.ДокументНомер, """")
			|		КОГДА Сотрудники.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА ЕСТЬNULL(Сотрудники.ДокументНомер, """")
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК НомерДокумента,
			|	ВЫБОР
			|		КОГДА КадровыеДанныеФизЛиц.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА ВЫБОР
			|					КОГДА КадровыеДанныеФизЛиц.Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
			|						ТОГДА ВЫБОР
			|								КОГДА КадровыеДанныеФизЛиц.ДокументСтранаВыдачи = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
			|									ТОГДА ""643""
			|								ИНАЧЕ КадровыеДанныеФизЛиц.ДокументСтранаВыдачи.Код
			|							КОНЕЦ
			|					ИНАЧЕ ЕСТЬNULL(КадровыеДанныеФизЛиц.Страна.Код, """")
			|				КОНЕЦ
			|		КОГДА Сотрудники.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА ВЫБОР
			|					КОГДА Сотрудники.Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
			|						ТОГДА ВЫБОР
			|								КОГДА Сотрудники.ДокументСтранаВыдачи = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
			|									ТОГДА ""643""
			|								ИНАЧЕ ЕСТЬNULL(Сотрудники.ДокументСтранаВыдачи.Код, """")
			|							КОНЕЦ
			|					ИНАЧЕ Сотрудники.Страна.Код
			|				КОНЕЦ
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК КодСтраныДляОтчетности,
			|	ВЫБОР
			|		КОГДА КадровыеДанныеФизЛиц.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА ЕСТЬNULL(ВидыДокументовФизическихЛиц.КодМВД, """")
			|		КОГДА Сотрудники.ФизическоеЛицо ЕСТЬ НЕ NULL 
			|			ТОГДА ЕСТЬNULL(ВидыДокументовСотрудников.КодМВД, """")
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК КодМВД
			|ПОМЕСТИТЬ ВТДанныеФизлицИзИБ
			|ИЗ
			|	ВТФизлицаИзИБ КАК Физлица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизЛиц
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовФизическихЛиц КАК ВидыДокументовФизическихЛиц
			|			ПО КадровыеДанныеФизЛиц.ДокументВид = ВидыДокументовФизическихЛиц.Ссылка
			|		ПО Физлица.ФизическоеЛицо = КадровыеДанныеФизЛиц.ФизическоеЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовФизическихЛиц КАК ВидыДокументовСотрудников
			|			ПО Сотрудники.ДокументВид = ВидыДокументовСотрудников.Ссылка
			|		ПО Физлица.ФизическоеЛицо = Сотрудники.ФизическоеЛицо
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(ЕСТЬNULL(ЕСТЬNULL(ФизическиеЛица.Ссылка, ДанныеФизлицИзИБ.ФизическоеЛицо), ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))) КАК ФизическоеЛицо,
			|	ВременнаяТаблица.НомерСправки КАК НомерСправки,
			|	ВременнаяТаблица.НомерКорректировки КАК НомерКорректировки,
			|	ВременнаяТаблица.ИНН КАК ИНН,
			|	ВременнаяТаблица.Фамилия КАК Фамилия,
			|	ВременнаяТаблица.Имя КАК Имя,
			|	ВременнаяТаблица.Отчество КАК Отчество,
			|	ВременнаяТаблица.ДатаРождения КАК ДатаРождения,
			|	ВременнаяТаблица.СерияДокумента КАК СерияДокумента,
			|	ВременнаяТаблица.НомерДокумента КАК НомерДокумента,
			|	ВременнаяТаблица.КодСтраныДляОтчетности КАК КодСтраныДляОтчетности,
			|	ВременнаяТаблица.КодМВД КАК КодМВД,
			|	ВременнаяТаблица.КодФНС КАК КодФНС
			|ПОМЕСТИТЬ ВТНалогоплательщикиПереданные
			|ИЗ
			|	ВТВременнаяТаблица КАК ВременнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
			|		ПО ВременнаяТаблица.ИНН = ФизическиеЛица.ИНН
			|			И (ВременнаяТаблица.ИНН <> """")
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеФизлицИзИБ КАК ДанныеФизлицИзИБ
			|		ПО ВременнаяТаблица.Фамилия = ДанныеФизлицИзИБ.Фамилия
			|			И ВременнаяТаблица.Имя = ДанныеФизлицИзИБ.Имя
			|			И ВременнаяТаблица.Отчество = ДанныеФизлицИзИБ.Отчество
			|			И ВременнаяТаблица.ДатаРождения = ДанныеФизлицИзИБ.ДатаРождения
			|			И ВременнаяТаблица.СерияДокумента = ДанныеФизлицИзИБ.СерияДокумента
			|			И ВременнаяТаблица.НомерДокумента = ДанныеФизлицИзИБ.НомерДокумента
			|			И ВременнаяТаблица.КодМВД = ДанныеФизлицИзИБ.КодМВД
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоследниеКорректировки КАК ПоследниеКорректировки
			|		ПО ВременнаяТаблица.НомерКорректировки = ПоследниеКорректировки.НомерКорректировки
			|			И ВременнаяТаблица.ИНН = ПоследниеКорректировки.ИНН
			|			И ВременнаяТаблица.Фамилия = ПоследниеКорректировки.Фамилия
			|			И ВременнаяТаблица.Имя = ПоследниеКорректировки.Имя
			|			И ВременнаяТаблица.Отчество = ПоследниеКорректировки.Отчество
			|			И ВременнаяТаблица.ДатаРождения = ПоследниеКорректировки.ДатаРождения
			|			И ВременнаяТаблица.СерияДокумента = ПоследниеКорректировки.СерияДокумента
			|			И ВременнаяТаблица.НомерДокумента = ПоследниеКорректировки.НомерДокумента
			|			И ВременнаяТаблица.КодМВД = ПоследниеКорректировки.КодМВД
			|			И ВременнаяТаблица.КодСтраныДляОтчетности = ПоследниеКорректировки.КодСтраныДляОтчетности
			|ГДЕ
			|	ПоследниеКорректировки.НомерКорректировки ЕСТЬ НЕ NULL 
			|
			|СГРУППИРОВАТЬ ПО
			|	ВременнаяТаблица.НомерСправки,
			|	ВременнаяТаблица.НомерКорректировки,
			|	ВременнаяТаблица.ИНН,
			|	ВременнаяТаблица.Фамилия,
			|	ВременнаяТаблица.Имя,
			|	ВременнаяТаблица.Отчество,
			|	ВременнаяТаблица.ДатаРождения,
			|	ВременнаяТаблица.СерияДокумента,
			|	ВременнаяТаблица.НомерДокумента,
			|	ВременнаяТаблица.КодСтраныДляОтчетности,
			|	ВременнаяТаблица.КодМВД,
			|	ВременнаяТаблица.КодФНС";
			Запрос.Выполнить(); 
			// АПК:96-вкл
			ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТВременнаяТаблица");
			
			ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, Итоги, "ВТВременнаяТаблица");
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВременнаяТаблица.П000П1М100001 КАК П000П1М100001,
			|	ВременнаяТаблица.П000П1М100002 КАК П000П1М100002,
			|	ВременнаяТаблица.П000П1М100003 КАК П000П1М100003,
			|	ВременнаяТаблица.П000П1М100004 КАК П000П1М100004,
			|	ВременнаяТаблица.П000П1М100005 КАК П000П1М100005,
			|	ВременнаяТаблица.П000П1М100006 КАК П000П1М100006,
			|	ВременнаяТаблица.П000П1М100007 КАК П000П1М100007,
			|	ВременнаяТаблица.П000П1М100008 КАК П000П1М100008,
			|	ВременнаяТаблица.П000П1М100009 КАК П000П1М100009,
			|	ВременнаяТаблица.П000П1М100010 КАК П000П1М100010
			|ПОМЕСТИТЬ ВТИтогиПереданные
			|ИЗ
			|	ВТВременнаяТаблица КАК ВременнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогоплательщикиПереданные КАК ФизическиеЛица
			|		ПО ВременнаяТаблица.НомерСправки = ФизическиеЛица.НомерСправки
			|			И ВременнаяТаблица.НомерКорректировки = ФизическиеЛица.НомерКорректировки";
			Запрос.Выполнить(); 
			ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТВременнаяТаблица");
			
			ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, Вычеты, "ВТВременнаяТаблица");
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВременнаяТаблица.КБК КАК КБК,
			|	ВременнаяТаблица.Ставка КАК Ставка,
			|	ВременнаяТаблица.П000П1М200001 КАК П000П1М200001,
			|	ВременнаяТаблица.П000П1М200002 КАК П000П1М200002
			|ПОМЕСТИТЬ ВТВычетыПереданные
			|ИЗ
			|	ВТВременнаяТаблица КАК ВременнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогоплательщикиПереданные КАК ФизическиеЛица
			|		ПО ВременнаяТаблица.НомерСправки = ФизическиеЛица.НомерСправки
			|			И ВременнаяТаблица.НомерКорректировки = ФизическиеЛица.НомерКорректировки";
			Запрос.Выполнить(); 
			ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТВременнаяТаблица");
			
			ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, УведомленияОВычетах, "ВТВременнаяТаблица");
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВременнаяТаблица.ГруппаВычета КАК ГруппаВычета,
			|	ВременнаяТаблица.П000П1М300002 КАК П000П1М300002,
			|	ВременнаяТаблица.П000П1М300003 КАК П000П1М300003,
			|	ВременнаяТаблица.П000П1М300004 КАК П000П1М300004
			|ПОМЕСТИТЬ ВТУведомленияОВычетахПереданные
			|ИЗ
			|	ВТВременнаяТаблица КАК ВременнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогоплательщикиПереданные КАК ФизическиеЛица
			|		ПО ВременнаяТаблица.НомерСправки = ФизическиеЛица.НомерСправки
			|			И ВременнаяТаблица.НомерКорректировки = ФизическиеЛица.НомерКорректировки";
			Запрос.Выполнить(); 
			ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТВременнаяТаблица");
			
			ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, Доходы, "ВТВременнаяТаблица");
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВременнаяТаблица.КБК КАК КБК,
			|	ВременнаяТаблица.Ставка КАК Ставка,
			|	ВременнаяТаблица.Период КАК Период,
			|	ВременнаяТаблица.П000П1М500002 КАК П000П1М500002,
			|	СУММА(ВременнаяТаблица.П000П1М500003) КАК П000П1М500003
			|ПОМЕСТИТЬ ВТДоходыПереданные
			|ИЗ
			|	ВТВременнаяТаблица КАК ВременнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогоплательщикиПереданные КАК ФизическиеЛица
			|		ПО ВременнаяТаблица.НомерСправки = ФизическиеЛица.НомерСправки
			|			И ВременнаяТаблица.НомерКорректировки = ФизическиеЛица.НомерКорректировки
			|
			|СГРУППИРОВАТЬ ПО
			|	ФизическиеЛица.ФизическоеЛицо,
			|	ВременнаяТаблица.КБК,
			|	ВременнаяТаблица.Ставка,
			|	ВременнаяТаблица.Период,
			|	ВременнаяТаблица.П000П1М500002
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВременнаяТаблица.КБК КАК КБК,
			|	ВременнаяТаблица.Ставка КАК Ставка,
			|	ВременнаяТаблица.Период КАК Период,
			|	ВременнаяТаблица.П000П1М500002 КАК П000П1М500002,
			|	ВременнаяТаблица.П000П1М600004 КАК П000П1М600004,
			|	СУММА(ВременнаяТаблица.П000П1М600005) КАК П000П1М600005
			|ПОМЕСТИТЬ ВТВычетыКДоходамПереданные
			|ИЗ
			|	ВТВременнаяТаблица КАК ВременнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогоплательщикиПереданные КАК ФизическиеЛица
			|		ПО ВременнаяТаблица.НомерСправки = ФизическиеЛица.НомерСправки
			|			И ВременнаяТаблица.НомерКорректировки = ФизическиеЛица.НомерКорректировки
			|
			|СГРУППИРОВАТЬ ПО
			|	ФизическиеЛица.ФизическоеЛицо,
			|	ВременнаяТаблица.КБК,
			|	ВременнаяТаблица.Ставка,
			|	ВременнаяТаблица.Период,
			|	ВременнаяТаблица.П000П1М500002,
			|	ВременнаяТаблица.П000П1М600004
			|
			|ИМЕЮЩИЕ
			|	СУММА(ВременнаяТаблица.П000П1М600005) <> 0";
			Запрос.Выполнить(); 
			ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТВременнаяТаблица");
			
		Иначе
			СоздатьПустыеВТПереданныхДанныхОтчета2021(МенеджерВременныхТаблиц)
		КонецЕсли;
		
	Иначе
		СоздатьПустыеВТПереданныхДанныхОтчета2021(МенеджерВременныхТаблиц)
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьПустыеВТПереданныхДанныхОтчета2021(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	0 КАК НомерСправки,
	|	0 КАК НомерКорректировки,
	|	"""" КАК ИНН,
	|	"""" КАК Фамилия,
	|	"""" КАК Имя,
	|	"""" КАК Отчество,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаРождения,
	|	"""" КАК КодФНС,
	|	"""" КАК КодСтраныДляОтчетности,
	|	"""" КАК КодМВД,
	|	"""" КАК СерияДокумента,
	|	"""" КАК НомерДокумента
	|ПОМЕСТИТЬ ВТНалогоплательщикиПереданные
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	0 КАК П000П1М100001,
	|	0 КАК П000П1М100002,
	|	0 КАК П000П1М100003,
	|	0 КАК П000П1М100004,
	|	0 КАК П000П1М100005,
	|	0 КАК П000П1М100006,
	|	0 КАК П000П1М100007,
	|	0 КАК П000П1М100008,
	|	"""" КАК П000П1М100009,
	|	0 КАК П000П1М100010
	|ПОМЕСТИТЬ ВТИтогиПереданные
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	0 КАК Ставка,
	|	"""" КАК КБК,
	|	"""" КАК П000П1М200001,
	|	0 КАК П000П1М200002
	|ПОМЕСТИТЬ ВТВычетыПереданные
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.ПустаяСсылка) КАК ГруппаВычета,
	|	"""" КАК П000П1М300002,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК П000П1М300003,
	|	"""" КАК П000П1М300004
	|ПОМЕСТИТЬ ВТУведомленияОВычетахПереданные
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	0 КАК Ставка,
	|	"""" КАК КБК,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК Период,
	|	"""" КАК П000П1М500002,
	|	0 КАК П000П1М500003
	|ПОМЕСТИТЬ ВТДоходыПереданные
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	0 КАК Ставка,
	|	"""" КАК КБК,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК Период,
	|	"""" КАК П000П1М500002,
	|	"""" КАК П000П1М600004,
	|	0 КАК П000П1М600005
	|ПОМЕСТИТЬ ВТВычетыКДоходамПереданные
	|ГДЕ
	|	ЛОЖЬ";
	Запрос.Выполнить(); 
	
КонецПроцедуры

#КонецОбласти

