
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 Бланк 				 = Параметры.Бланк;
	 РежимРаботыСДанными = Параметры.РежимРаботыСДанными;
	 
	 Если РежимРаботыСДанными Тогда	 
		 НастройкаШкалыВремениАдрес = Параметры.НастройкаШкалыВремениАдрес;	 
	 КонецЕсли;	 
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	НастройкиМасштабаВремени.ДетализацияДни,
	                |	НастройкиМасштабаВремени.ДетализацияМесяцы,
	                |	НастройкиМасштабаВремени.ДетализацияКварталы,
	                |	НастройкиМасштабаВремени.ДетализацияПолугодия,
	                |	НастройкиМасштабаВремени.ДетализацияГоды,
	                |	НастройкиМасштабаВремени.НаследоватьНастройкиРегламента,
	                |	НастройкиМасштабаВремени.ВыбранныйПериод,
	                |	НастройкиМасштабаВремени.Масштаб,
	                |	НастройкиМасштабаВремени.ПредставлениеПериода,
	                |	НастройкиМасштабаВремени.КлючПериода,
	                |	НастройкиМасштабаВремени.Сдвиг
	                |ИЗ
	                |	РегистрСведений.НастройкиМасштабаВремени КАК НастройкиМасштабаВремени
	                |ГДЕ
	                |	НастройкиМасштабаВремени.Бланк = &Бланк";
	 
	 Запрос.УстановитьПараметр("Бланк",Параметры.Бланк);
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 
		 Элементы.ГруппаПериоды.Доступность=НЕ Выборка.НаследоватьНастройкиРегламента; 
		 ДетализацияШкалы = Выборка.Масштаб;
		 ПредставлениеПериода = Выборка.ПредставлениеПериода;
		 УстановитьОграничениеДетализации();
		 НаследоватьНастройки = Выборка.НаследоватьНастройкиРегламента;
		 Начало_финансового_года = Выборка.Сдвиг;
		 
		 Если РежимРаботыСДанными Тогда	 
			 НастройкаШкалыВремени = ПолучитьИзВременногоХранилища(НастройкаШкалыВремениАдрес).НастройкаШкалыВремени[0]; 
			 ВыводитьИтогиПоГоду 		= НастройкаШкалыВремени.ДетализацияГоды;
			 ВыводитьИтогиПоДням		= НастройкаШкалыВремени.ДетализацияДни;
			 ВыводитьИтогиПоКварталу 	= НастройкаШкалыВремени.ДетализацияКварталы;
			 ВыводитьИтогиПоМесяцам 	= НастройкаШкалыВремени.ДетализацияМесяцы;
			 ВыводитьИтогиПоПолугодию 	= НастройкаШкалыВремени.ДетализацияПолугодия;		 
			 НарастающийИтог            = НастройкаШкалыВремени.НарастающийИтог
		 Иначе	 	 
			 ВыводитьИтогиПоГоду 		= Выборка.ДетализацияГоды;
			 ВыводитьИтогиПоДням 		= Выборка.ДетализацияДни;
			 ВыводитьИтогиПоКварталу 	= Выборка.ДетализацияКварталы;
			 ВыводитьИтогиПоМесяцам 	= Выборка.ДетализацияМесяцы;
			 ВыводитьИтогиПоПолугодию 	= Выборка.ДетализацияПолугодия;
			 ВыбранныйПериод 			= Выборка.ВыбранныйПериод;	 
		 КонецЕсли;
		 
		 КлючШкалы = Выборка.КлючПериода;
		 Если  ПредставлениеПериода = "" Тогда
			   ПредставлениеПериода = "Краткое";
		 КонецЕсли;
	 КонецЦикла;
	 
	 Если ДетализацияШкалы ="" Тогда
		  ДетализацияШкалы = "Месяц";
	 КонецЕсли;
		
	 Элементы.ГруппаПериодичность.Доступность = НЕ РежимРаботыСДанными;
	 Элементы.ГруппаПериоды.Доступность = НЕ НарастающийИтог;
	 Элементы.ГруппаПредставлениеПериода.Видимость = РежимРаботыСДанными;
	 
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Периодичность =  Перечисления.Периодичность[ДетализацияШкалы];
	Параметры_ = Новый Структура();
	Параметры_.Вставить("Периодичность",Перечисления.Периодичность[ДетализацияШкалы]);
	Параметры_.Вставить("ИтогиПоКварталам",ВыводитьИтогиПоКварталу);
    Параметры_.Вставить("ИтогиПоГодам",ВыводитьИтогиПоГоду);
    Параметры_.Вставить("ИтогиПоМесяцам",ВыводитьИтогиПоМесяцам);
	Параметры_.Вставить("ИтогиПоПолугодиям",ВыводитьИтогиПоПолугодию);
	Параметры_.Вставить("ИтогиПоНеделям",ВыводитьИтогиПоНеделям);
    Параметры_.Вставить("ИтогиПоДням",ВыводитьИтогиПоДням);
	Параметры_.Вставить("Сдвиг",Число(Начало_финансового_года));

	
	КлючШкалы = Справочники.КлючиШкалы.ПроверитьКлючПериода(Параметры_);	
	
	НаборЗаписейШкалыВремени = РегистрыСведений.НастройкиМасштабаВремени.СоздатьНаборЗаписей();
	НаборЗаписейШкалыВремени.Отбор.Бланк.Установить(Бланк);
	НаборЗаписейШкалыВремени.Отбор.ВыбранныйПериод.Установить(ВыбранныйПериод);
	
	нНаборЗаписейШкалыВремени = НаборЗаписейШкалыВремени.Добавить();
	нНаборЗаписейШкалыВремени.Бланк = Бланк;
	нНаборЗаписейШкалыВремени.ВыбранныйПериод = ВыбранныйПериод;
	нНаборЗаписейШкалыВремени.ДетализацияДни = ВыводитьИтогиПоДням;
	нНаборЗаписейШкалыВремени.ДетализацияМесяцы = ВыводитьИтогиПоМесяцам;
    нНаборЗаписейШкалыВремени.ДетализацияКварталы = ВыводитьИтогиПоКварталу;
    нНаборЗаписейШкалыВремени.ДетализацияПолугодия = ВыводитьИтогиПоПолугодию;
	нНаборЗаписейШкалыВремени.ДетализацияГоды = ВыводитьИтогиПоГоду;
	нНаборЗаписейШкалыВремени.НаследоватьНастройкиРегламента = НаследоватьНастройки;		
	нНаборЗаписейШкалыВремени.Масштаб =ДетализацияШкалы;
	нНаборЗаписейШкалыВремени.ПредставлениеПериода =ПредставлениеПериода;
	нНаборЗаписейШкалыВремени.Сдвиг = Число(Начало_финансового_года);
	нНаборЗаписейШкалыВремени.КлючПериода =КлючШкалы;
	
	НаборЗаписейШкалыВремени.Записать(Истина);
	
КонецПроцедуры


#КонецОбласти


&НаКлиенте
Процедура УменьшитьМасштабШкалы(Команда)
	
	Если ДетализацияШкалы = "День" Тогда
		Элементы.УвеличитьМасштабШкалы.Доступность = Истина;
		Элементы.УменьшитьМасштабШкалы.Доступность = Ложь;
	ИначеЕсли ДетализацияШкалы = "Месяц" Тогда
		Элементы.УвеличитьМасштабШкалы.Доступность = Истина;
		Элементы.УменьшитьМасштабШкалы.Доступность = Истина;
		ДетализацияШкалы = "День";	
	ИначеЕсли ДетализацияШкалы = "Квартал" Тогда
		Элементы.УвеличитьМасштабШкалы.Доступность = Истина;
		Элементы.УменьшитьМасштабШкалы.Доступность = Истина;
		ДетализацияШкалы = "Месяц";		
	ИначеЕсли ДетализацияШкалы = "Год" Тогда
		ДетализацияШкалы = "Квартал";	
		Элементы.УменьшитьМасштабШкалы.Доступность = Истина;
		Элементы.УвеличитьМасштабШкалы.Доступность = Истина;
	КонецЕсли;	  
	
	УстановитьОграничениеДетализации();
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьМасштабШкалы(Команда)
	
	Если ДетализацияШкалы = "День" Тогда
		Элементы.УвеличитьМасштабШкалы.Доступность = Истина;
		Элементы.УменьшитьМасштабШкалы.Доступность = Истина;
		ДетализацияШкалы = "Месяц";
	ИначеЕсли ДетализацияШкалы = "Месяц" Тогда
		Элементы.УвеличитьМасштабШкалы.Доступность = Истина;
		Элементы.УменьшитьМасштабШкалы.Доступность = Истина;
		ДетализацияШкалы = "Квартал";	
	ИначеЕсли ДетализацияШкалы = "Квартал" Тогда
		Элементы.УвеличитьМасштабШкалы.Доступность = Ложь;
		Элементы.УменьшитьМасштабШкалы.Доступность = Истина;
		ДетализацияШкалы = "Год";	
	ИначеЕсли ДетализацияШкалы = "Год" Тогда
		//Элементы.УвеличитьМасштабШкалы.Доступность = Ложь;
		Элементы.УменьшитьМасштабШкалы.Доступность = Истина;
	КонецЕсли;	  	
	
	УстановитьОграничениеДетализации();	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеДетализации()
		
	ВыводитьИтогиПоНеделям = Ложь;
	ВыводитьИтогиПоМесяцам = Ложь;
    ВыводитьИтогиПоКварталу = Ложь;
    ВыводитьИтогиПоПолугодию = Ложь;
    ВыводитьИтогиПоГоду = Ложь;
    ВыводитьИтогиПоДням = Ложь;
	
	Если ДетализацияШкалы = "День" Тогда
		
		Элементы.ВыводитьИтогиПоДням.Доступность = Истина;
		Элементы.ВыводитьИтогиПоНеделям.Доступность = Истина;
		Элементы.ВыводитьИтогиПоМесяцам.Доступность = Истина;
        Элементы.ВыводитьИтогиПоКварталу.Доступность = Истина;
        Элементы.ВыводитьИтогиПоПолугодию.Доступность = Истина;
        Элементы.ВыводитьИтогиПоГоду.Доступность = Истина;
		
	ИначеЕсли ДетализацияШкалы = "Месяц" Тогда
			
		Элементы.ВыводитьИтогиПоДням.Доступность = Ложь;
		Элементы.ВыводитьИтогиПоНеделям.Доступность = Ложь;
		Элементы.ВыводитьИтогиПоМесяцам.Доступность = Истина;
        Элементы.ВыводитьИтогиПоКварталу.Доступность = Истина;
        Элементы.ВыводитьИтогиПоПолугодию.Доступность = Истина;
        Элементы.ВыводитьИтогиПоГоду.Доступность = Истина;

		
	ИначеЕсли ДетализацияШкалы = "Квартал" Тогда
		
		Элементы.ВыводитьИтогиПоДням.Доступность = Ложь;
		Элементы.ВыводитьИтогиПоНеделям.Доступность = Ложь;
		Элементы.ВыводитьИтогиПоМесяцам.Доступность = Ложь;
		Элементы.ВыводитьИтогиПоКварталу.Доступность = Истина;
        Элементы.ВыводитьИтогиПоПолугодию.Доступность = Истина;
        Элементы.ВыводитьИтогиПоГоду.Доступность = Истина;

	ИначеЕсли ДетализацияШкалы = "Год" Тогда
		
		Элементы.ВыводитьИтогиПоДням.Доступность = Ложь;
		Элементы.ВыводитьИтогиПоНеделям.Доступность = Ложь;
		Элементы.ВыводитьИтогиПоМесяцам.Доступность = Ложь;
        Элементы.ВыводитьИтогиПоКварталу.Доступность = Ложь;
        Элементы.ВыводитьИтогиПоПолугодию.Доступность = Ложь;
        Элементы.ВыводитьИтогиПоГоду.Доступность = Истина;

	КонецЕсли;	  

	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	Если РежимРаботыСДанными Тогда	
		ОбновитьНастройкиНаСервере();	
	Иначе	
		ЗаписатьНаСервере();
	КонецЕсли;
	СтруктураПараметров = Новый Структура("Периодичность",Периодичность);
	Закрыть(СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиНаСервере()
	
	НастройкаШкалыВремени = ПолучитьИзВременногоХранилища(НастройкаШкалыВремениАдрес).НастройкаШкалыВремени; 
	
	Для Каждого Стр Из НастройкаШкалыВремени Цикл
		
		Стр.ДетализацияДни = ВыводитьИтогиПоДням;
		Стр.ДетализацияМесяцы = ВыводитьИтогиПоМесяцам;
		Стр.ДетализацияКварталы = ВыводитьИтогиПоКварталу;
		Стр.ДетализацияПолугодия = ВыводитьИтогиПоПолугодию;
		Стр.ДетализацияГоды = ВыводитьИтогиПоГоду;
			
	КонецЦикла;	
	
	Периодичность =  Перечисления.Периодичность[ДетализацияШкалы];
	Параметры_ = Новый Структура();
	Параметры_.Вставить("Периодичность",Перечисления.Периодичность[ДетализацияШкалы]);
	Параметры_.Вставить("ИтогиПоКварталам",?(НарастающийИтог,Ложь,ВыводитьИтогиПоКварталу));
    Параметры_.Вставить("ИтогиПоГодам",?(НарастающийИтог,Ложь,ВыводитьИтогиПоГоду));
    Параметры_.Вставить("ИтогиПоМесяцам",?(НарастающийИтог,Ложь,ВыводитьИтогиПоМесяцам));
	Параметры_.Вставить("ИтогиПоПолугодиям",?(НарастающийИтог,Ложь,ВыводитьИтогиПоПолугодию));
	Параметры_.Вставить("ИтогиПоНеделям",?(НарастающийИтог,Ложь,ВыводитьИтогиПоНеделям));
    Параметры_.Вставить("ИтогиПоДням",?(НарастающийИтог,Ложь,ВыводитьИтогиПоДням));
    Параметры_.Вставить("Сдвиг",Число(Начало_финансового_года));
	
	Если НарастающийИтог Тогда
		Если Периодичность = Перечисления.Периодичность.Год Тогда
			Параметры_.Вставить("ИтогиПоГодам",Истина);
		ИначеЕсли Периодичность = Перечисления.Периодичность.Полугодие Тогда	
			Параметры_.Вставить("ИтогиПоПолугодиям",Истина);
		ИначеЕсли  Периодичность = Перечисления.Периодичность.Квартал Тогда
			Параметры_.Вставить("ИтогиПоКварталам",Истина);
		ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
			Параметры_.Вставить("ИтогиПоМесяцам",Истина);
		ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
			Параметры_.Вставить("ИтогиПоНеделям",Истина);
		ИначеЕсли Периодичность = Перечисления.Периодичность.День Тогда	
			Параметры_.Вставить("ИтогиПоДням",Истина);
		КонецЕсли;	
	КонецЕсли;
	
	КлючШкалы = Справочники.КлючиШкалы.ПроверитьКлючПериода(Параметры_);
	Стр.КлючПериода = КлючШкалы;
	Стр.НачалоПериода = КлючШкалы.НачалоПериода;
	Стр.КонецПериода  = КлючШкалы.КонецПериода;
    Стр.НарастающийИтог = НарастающийИтог;
	
КонецПроцедуры

&НаКлиенте
Процедура НарастающийИтогПриИзменении(Элемент)
	
	Элементы.ГруппаПериоды.Доступность = НЕ НарастающийИтог;
	
КонецПроцедуры




