
&НаКлиенте
Процедура СоставГруппировкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ Поле.Имя = "СоставГруппировкиТипИерархии" Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ТекущиеАналитикиГруппы 	= ЗначениеИзСтрокиВнутр(Параметры.ТекущиеАналитикиГруппы);
			
	Для Каждого Стр Из ТекущиеАналитикиГруппы Цикл	
		нСтрока = СоставГруппировки.Добавить();
        нСтрока.АналитикаПредставление 		= Стр.Значение[0].АналитикаПредставление;
		нСтрока.АналитикаКод 				= Стр.Ключ;		
		нСтрока.СтруктураАналитикСтрока     = ЗначениеВСтрокуВнутр(Стр.Значение);
		Если ЗначениеЗаполнено(Стр.Значение[0].ИерархииАналитики) Тогда
			нСтрока.ТипИерархии 			= Стр.Значение[0].ИерархииАналитики;
		КонецЕсли;	
	КонецЦикла;	
	
	ДоступныеАналитикиСтрока = Параметры.ДоступныеАналитикиСтрока;
	
	Если НЕ Параметры.РедактироватьСостав Тогда	
		 Элементы.СоставГруппировки.ИзменятьПорядокСтрок 	= Ложь;
		 Элементы.СоставГруппировки.ИзменятьСоставСтрок 	= Ложь;	 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставГруппировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДоступныеАналитикиСтрока",ДоступныеАналитикиСтрока);
	
	Оповещение = Новый ОписаниеОповещения("ФормаВыбораРеквизитовЗавершение", ЭтаФорма);
	ОткрытьФорму("Обработка.АналитическийБланк.Форма.ФормаВыбораРеквизитов",СтруктураПараметров,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ФормаВыбораРеквизитовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено  Или Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;	
		
	НэлДерева = СоставГруппировки.Добавить();
	НэлДерева.АналитикаПредставление 		 			 = Результат.ПолеПредставление;
	НэлДерева.АналитикаКод					 			 = Результат.Поле;	 
	
	СоставГруппировкиПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	 Закрыть(ПодготовитьСтруктуруПараметров());
	 
КонецПроцедуры
  
&НаСервере
Функция ПодготовитьСтруктуруПараметров()
	
	СтруктураАналитик = Новый Структура;
	СтруктураИерархии = Новый Структура;
	
	Для Каждого Стр Из СоставГруппировки Цикл		
		
		ТаблицаСвойствАналитики = Обработки.АналитическийБланк.ПолучитьОписаниеТаблицыНастроекАналитик();
		
		Нстр 					 			= ТаблицаСвойствАналитики.Добавить();
		Нстр.АналитикаКод       			= Стр.АналитикаКод;
		Нстр.АналитикаПредставление       	= Стр.АналитикаПредставление;
		Нстр.ИерархииАналитики       		= Стр.ТипИерархии;

		СтруктураАналитик.Вставить(Стр.АналитикаКод,ТаблицаСвойствАналитики);	
					
	КонецЦикла;	
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("СтруктураАналитикСтрока",		ЗначениеВстрокуВнутр(СтруктураАналитик));
	
	Возврат СтруктураОтвета;
	
КонецФункции

&НаКлиенте
Процедура СоставГруппировкиПриИзменении(Элемент)
	
	Элементы.ФормаВыполнить.Доступность = СоставГруппировки.Количество()>0;
	
КонецПроцедуры
  
  
  
  
