
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбработатьОтборПоПроекции();
КонецПроцедуры

&НаКлиенте
Процедура ПроекцияПриИзменении(Элемент)
	ОбработатьОтборПоПроекции();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтборПоПроекции()
	
	Если ЗначениеЗаполнено(Проекция) Тогда
		ТиповыеОтчеты_КлиентУХ.ДобавитьОтбор(Список.Отбор, Новый ПолеКомпоновкиДанных("Проекция"), Проекция);
	Иначе
		ТиповыеОтчеты_КлиентУХ.УдалитьОтбор(Список.Отбор, Новый ПолеКомпоновкиДанных("Проекция"));
	КонецЕсли;
	
КонецПроцедуры

