
&НаСервере
Процедура ллл_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// +++ 3L, Конилов Д.А. [06.06.2022] Задача ERP1C-117
	// Делаем недоступной галочку доп. реквизита "Создано автоматически", чтобы пользователи руками не меняли.
	// --- 3L, Конилов Д.А. [06.06.2022] Задача ERP1C-117  
	
	
	ИмяДопРеквизитаЗаполненоАвтоматически=неопределено;	
	для каждого стр из ЭтаФорма.Свойства_ОписаниеДополнительныхРеквизитов цикл
		если стр.Свойство.Имя="СозданоАвтоматически" тогда
			ИмяДопРеквизитаЗаполненоАвтоматически=стр.ИмяРеквизитаЗначение
		КонецЕсли;
		
	КонецЦикла;                                       
	
	Если ЗначениеЗаполнено(ИмяДопРеквизитаЗаполненоАвтоматически) тогда	
		для каждого эл из ЭтаФорма.Элементы цикл   
			Если не типЗнч(эл)=тип("ПолеФормы") тогда 
				продолжить; 
			конецЕсли;
			Если эл.ПутьКДанным=ИмяДопРеквизитаЗаполненоАвтоматически тогда
				Если не РольДоступна("ПолныеПрава") тогда
					эл.Доступность=ложь;	
				КонецЕсли;	
				прервать;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;                                         
	
	
	// Задача https://jira.corp.3l.ru/browse/ERP1C-206
	// Конилов 25.07.2022
	Если не ЗначениеЗаполнено(Объект.Ссылка) тогда
		//ЭтаФорма.Элементы.Валюта.ТолькоПросмотр=ложь;
		ЭтаФорма.Элементы.ВалютаОплаты.ТолькоПросмотр=ложь;
	иначе
		Запрос = Новый Запрос;
        Запрос.УстановитьПараметр("Объект", Объект.Ссылка);

		Запрос.Текст =
				"ВЫБРАТЬ
				|	истина КАК МожноРедактироватьВалюту
				|ИЗ
				|	(ВЫБРАТЬ
				|		РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК состояние
				|	ИЗ
				|		РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних КАК РегистрСостоянийОбъектовСрезПоследних
				|	ГДЕ
				|		РегистрСостоянийОбъектовСрезПоследних.Объект = &Объект) КАК з
				|ГДЕ
				|	(з.состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Возвращена)
				|			ИЛИ з.состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Черновик))";
		 Результат = Запрос.Выполнить();	
		 Выборка=Результат.Выбрать();
		 Если Выборка.Следующий() тогда
				//ЭтаФорма.Элементы.Валюта.ТолькоПросмотр=не Выборка.МожноРедактироватьВалюту;
				ЭтаФорма.Элементы.ВалютаОплаты.ТолькоПросмотр=не Выборка.МожноРедактироватьВалюту;
		 КонецЕсли;	 
	КонецЕсли;
	
	
	// <<< Наработка не понадобилась
	//ГруппаКазначеев=Справочники.ГруппыДоступа.найтипоНаименованию("Доступность изменения реквизитов казначейства");
	//текПользователь=ПараметрыСеанса.ТекущийПОльзователь;
	//_ПользовательНайден=ложь;
	//
	//для каждого стр из ГруппаКазначеев.Пользователи цикл
	//	если стр.Пользователь=текПользователь тогда
	//		_ПользовательНайден=истина;
	//		прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Если _ПользовательНайден тогда
	//	ЭтаФорма.Доступность=истина;
	//	ЭтаФОрма.ТолькоПросмотр=ложь;  
	// 
	//	ЭтаФорма.Элементы.ГруппаСтраницы.ТолькоПРосмотр=ложь;
	//	ЭтаФОрма.Элементы.СтраницаОсновное.ТолькоПросмотр=ложь;
	//	ЭтаФорма.Элементы.СтраницаРасшифровка.ТолькоПросмотр=ложь; 
	//	РазблокироватьПодчиненныеЭлементы(ЭтаФОрма.Элементы.СтраницаОсновное);
	//	
	//	РазблокироватьПодчиненныеЭлементы(ЭтаФорма.Элементы.СтраницаРасшифровка);
	//		
	//	
	//	ЭтаФорма.Элементы.БанковскийСчетКонтрагента.Доступность=истина;
	//	ЭтаФОрма.Элементы.СтатьяДвиженияДенежныхСредств.Доступность=истина;
	//	ЭтаФОрма.Элементы.РасшифровкаБезРазбиенияСтатьяДвиженияДенежныхСредств.Доступность=истина;
	//	
	//	
	//КонецЕсли;                    
	//  Наработка не понадобилась>>>
	
	
	Если ЗначениеЗаполнено(Объект.ллл_СсылкаДиадок) тогда
		      Элементы.КнопкаПерейтиСсылкаДиадок.Доступность=истина;
		  иначе
			  Элементы.КнопкаПерейтиСсылкаДиадок.Доступность=ложь;
		
		
	КонецЕсли;
	
	
	Элементы.КнопкаЗаполнитьСсылкаДиадок.Доступность=истина;
	
	// Конилов. Сам придумал, на всякий случай
	Если не ЗначениеЗаполнено(Объект.Подразделение) и значениезаполнено(Объект.КтоЗаявил) тогда
		Объект.Подразделение = Объект.КтоЗаявил.Подразделение;	
		
	КонецЕсли;	
	
	
	
	
	
КонецПроцедуры        


Процедура РазблокироватьПодчиненныеЭлементы(текЭлемент)
	для каждого стр из текЭлемент.ПодчиненныеЭлементы цикл
		Если типЗнч(стр) =тип("ПолеФормы") или типЗнч(стр)=тип("СтраницаФормы") или типЗнч(стр)=тип("ГруппаФормы") тогда
			стр.толькоПросмотр=ложь;                                                     
		КонецЕсли;
		если типЗнч(стр)=тип("ДекорацияФормы") или типзнч(стр)=тип("ПолеФлажкаФормы") или типЗнч(стр)=тип("ПолеФормы")
			или типЗнч(стр)=тип("КоманднаяПанельФормы") или типЗнч(стр)=тип("ДекорацияКартинкаФормы") или типЗнч(стр)=тип("ДекорацияТекстФормы")
			или типЗнч(стр)=тип("КнопкаФормы")
			
			тогда
			продолжить;
		иначе	
		
		РазблокироватьПодчиненныеЭлементы(стр);
	    конецЕсли;
		
		
	КонеццИКЛА;	
	
	
КонецПроцедуры	


&Вместо("ИнициализироватьДоговорКонтрагента")

Процедура ллл_ИнициализироватьДоговорКонтрагента()

	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
		Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию Тогда
		
		Объект.Договор = Справочники.ДоговорыМеждуОрганизациями.ПустаяСсылка();
		Элементы.Договор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ДоговорыМеждуОрганизациями");
	Иначе  
		// Закомментировано:
		// Объект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		
		// Конилов. У нас и так договор нормально подбирается.
		
		Элементы.Договор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ллл_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи=РежимЗаписиДокумента.Проведение тогда
	
		Если не ЗначениеЗаполнено(Объект.КрайняяДата) тогда 
			Если Объект.РасшифровкаПлатежа.Количество()<2 тогда
			      С=Новый СообщениеПОльзователю();
				  С.ПутьКДанным="КрайняяДата";
				  С.Поле="КрайняяДата";
				  С.Текст="Укажите крайнюю дату платежа."; 
				  С.УстановитьДанные(Объект.Ссылка);
			      С.Сообщить();
				  Отказ=истина;
			  КонецЕсли;                                
		иначе	  
			
			
				Если Объект.КрайняяДата<НачалоДня(ТекущаяДата())  тогда 
					Объект.КрайняяДата=НачалоДня(ТекущаяДата());
						  //С=Новый СообщениеПОльзователю();
						  //С.ПутьКДанным="КрайняяДата";
						  //С.Поле="КрайняяДата";
						  //С.Текст="Крайняя дата платежа не может быть меньше текущей."; 
						  //С.УстановитьДанные(Объект.Ссылка);
						  //С.Сообщить();
						  //Отказ=истина;
				КонецЕсли;

			  
		КонецЕсли;
		
		Если не ЗначениеЗаполнено(Объект.СтатьяДвиженияДенежныхСредств) и элементы.СтатьяДвиженияДенежныхСредств.Видимость 
			и Объект.РасшифровкаПлатежа.Количество()<2 тогда
			
				С=Новый СообщениеПОльзователю();
				  С.ПутьКДанным="СтатьяДвиженияДенежныхСредств";
				  С.Поле="СтатьяДвиженияДенежныхСредств";
				  С.Текст="Укажите статью ДДС."; 
				  С.УстановитьДанные(Объект.Ссылка);
			      С.Сообщить();
				  Отказ=истина;
			
			
		КонецЕсли;	
		
		
		Если не ЗначениеЗаполнено(Объект.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств) и элементы.РасшифровкаБезРазбиенияСтатьяДвиженияДенежныхСредств.Видимость 
			и Объект.РасшифровкаПлатежа.Количество()<2 тогда
			
				С=Новый СообщениеПОльзователю();
				 
				  С.Поле="РасшифровкаБезРазбиенияСтатьяДвиженияДенежныхСредств";
				  С.Текст="Укажите статью ДДС."; 
				  С.УстановитьДанные(Объект.Ссылка);
			      С.Сообщить();
				  Отказ=истина;
			
			
		КонецЕсли;	
			  
			  
		
		      
		
		
		
		
		Если не ЗначениеЗаполнено(Объект.БанковскийСчетКонтрагента) и элементы.БанковскийСчетКонтрагента.Видимость тогда
			
				С=Новый СообщениеПОльзователю();
				  С.ПутьКДанным="БанковскийСчетКонтрагента";
				  С.Поле="БанковскийСчетКонтрагента";
				  С.Текст="Укажите банковский счет контрагента."; 
				  С.УстановитьДанные(Объект.Ссылка);
			      С.Сообщить();
				  Отказ=истина;
			
			
		КонецЕсли;
			  
		
			Если не ЗначениеЗаполнено(Объект.Договор)  и Элементы.Договор.Видимость тогда
			
				С=Новый СообщениеПОльзователю();
				  С.ПутьКДанным="Договор";
				  С.Поле="Договор";
				  С.Текст="Укажите договор."; 
				  С.УстановитьДанные(Объект.Ссылка);
			      С.Сообщить();
				  Отказ=истина;
			
			
		КонецЕсли;
			  
			  
			  
			  
		  
	КонецЕсли;
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ллл_ПослеЗаписиПосле(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи=режимЗаписиДокумента.ОтменаПроведения тогда
		элементы.СтраницаОсновное.ТолькоПросмотр=ложь;    
		

		
		элементы.СтраницаРасшифровка.ТолькоПросмотр=ложь;
		
		
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ллл_ПерейтиСсылкаДиадокПосле(Команда)
	Если ЗначениеЗаполнено(Объект.ллл_СсылкаДиадок) тогда
		ЗапуститьПриложение(Объект.ллл_СсылкаДиадок);        
	КонецЕсли;
КонецПроцедуры 


&НаКлиенте
Процедура ллл_ЗаполнитьСсылкаДиадокПосле(Команда) 
	 Оп=Новый ОписаниеОповещения("ллл_ДоступностьОткрытияСсылки",ЭтаФорма);
	 ПоказатьВводСтроки(Оп,Объект.ллл_СсылкаДиадок,"Введите ссылку Диадок",900,истина);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСсылкуДиадокНаСервере()
	_Объект=РеквизитФормыВЗначение("Объект");
	_Объект.ЗаписатьВРежимеЗагрузки();
	ЗначениеВРеквизитФормы(_Объект,"Объект");
	
КонецПроцедуры	


&НаКлиенте 
Процедура ллл_ДоступностьОткрытияСсылки(Результат,ДополнительныеПараметры) экспорт
	Если Результат=неопределено тогда возврат; конецЕсли; //была отмена ввода значения, ничего не делать
	
	
	Если Результат<>Объект.ллл_СсылкаДиадок тогда
		
		Объект.ллл_СсылкаДиадок=Результат;    
		Если не стрНачинаетсяС(Объект.ллл_СсылкаДиадок ,"www.") и не стрНачинаетсяС(Объект.ллл_СсылкаДиадок,"http")
		и не стрНайти(Объект.ллл_СсылкаДиадок,"kontur.ru")>0 тогда
			Объект.ллл_СсылкаДиадок="";
			Сообщить("Вероятно, введенное значение не адрес ссылки Диадок.");
		КонецЕсли;
		ЗаписатьСсылкуДиадокНаСервере();	
		
	КонецЕсли;	
		
	
	
	Если ЗначениеЗаполнено(Объект.ллл_СсылкаДиадок) тогда
		Элементы.КнопкаПерейтиСсылкаДиадок.Доступность=истина;
	иначе
		Элементы.КнопкаПерейтиСсылкаДиадок.Доступность=ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеОперацииОплатаПоставщику()
	возврат(Перечисления.ХозяйственныеОперации.ОплатаПоставщику);	
КонецФункции

&НаКлиенте
Процедура ллл_КонтрагентПриИзмененииПосле(Элемент)
	
	// Конилов ERP1C-240
	Если Объект.ХозяйственнаяОперация=ЗначениеОперацииОплатаПоставщику() тогда
		Элементы.КрайняяДата.Видимость=истина;
		Объект.ЭтоВнутригрупповоеПеремещение=ложь;
	
	КонецЕсли;
КонецПроцедуры

//+++ ERP1C-231 Стрепков К. 11.08.2022
&НаКлиенте
Процедура ллл_ПриОткрытииПосле(Отказ)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОчистимСтатьяДДСНаСервере()	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОчистимСтатьяДДСНаСервере()
	ПустаяСтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	Объект.СтатьяДвиженияДенежныхСредств = ПустаяСтатьяДДС;
	Если Объект.РасшифровкаПлатежа.Количество() Тогда
		Для КАЖДОГО стрРасшифровки ИЗ Объект.РасшифровкаПлатежа Цикл
			стрРасшифровки.СтатьяДвиженияДенежныхСредств = ПустаяСтатьяДДС;
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры
//--- ERP1C-231 Стрепков К. 11.08.2022