
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьСхемыДанных(Команда)
	
	ОтправитьСхемыДанныхНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтправитьСхемыДанныхНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СП_СхемыДанных.Ссылка КАК Ссылка,
	|	СП_СхемыДанных.ИмяОбъекта КАК ИмяОбъекта
	|ИЗ
	|	Справочник.СП_СхемыДанных КАК СП_СхемыДанных
	|ГДЕ
	|	НЕ СП_СхемыДанных.ПометкаУдаления";
	
	// Регистрируем сообщения обмена.
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Только схемы текущей конфигурации.
		Если Метаданные.НайтиПоПолномуИмени(Выборка.ИмяОбъекта) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
				
		СП_РаботаССообщениями.ЗарегистрироватьИсходящееСообщение(Выборка.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
