#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПриУточненииРезерваПереноситьПланыНаНовыйДокумент = Истина;
	
	Если Параметры.Отбор.Свойство("Предназначение") Тогда
		
		Если ПриУточненииРезерваПереноситьПланыНаНовыйДокумент 
			ИЛИ Параметры.Отбор.Предназначение = Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияРесурсов Тогда
			Элементы.КнопкаПоказатьСкрытьАктуальные.Видимость = Истина;
		Иначе
			Элементы.КнопкаПоказатьСкрытьАктуальные.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	//
	ИспользоватьЦЗ = ВстраиваниеОПКПереопределяемый.КонстантаИспользоватьЦентрализованноеУправлениеЗакупками();
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ИспользоватьЦентрализованноеУправлениеЗакупками", ИспользоватьЦЗ);
	
	//
	ВстраиваниеОПКПереопределяемый.УстановитьПредставлениеОтбора(ЭтотОбъект, , Метаданные.Документы.ОперативныйПлан);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Элементы.КнопкаПоказатьСкрытьАктуальные.Видимость Тогда
		ПоказатьСкрытьАктуальные(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПоказатьСкрытьАктуальные(Команда)
	
	Элементы.КнопкаПоказатьСкрытьАктуальные.Пометка = НЕ Элементы.КнопкаПоказатьСкрытьАктуальные.Пометка;
	
	Если Элементы.КнопкаПоказатьСкрытьАктуальные.Пометка Тогда
		// Кнопка нажата - установить отбор
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"СледующийДокумент",
			,
			ВидСравненияКомпоновкиДанных.НеЗаполнено,
			,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	Иначе
		//// Кнопка отжата - сбросить отбор
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "СледующийДокумент");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

