#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидБюджета = Параметры.ВидБюджета;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ВидБюджета", ВидБюджета);
	
	Если Параметры.Свойство("ТекущаяСтрока") Тогда
		Элементы.Список.ТекущаяСтрока = Параметры.ТекущаяСтрока;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыполнитьВыбор(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ВыполнитьВыбор(Элемент.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьВыбор(ДанныеВыбора)
	Результат = Новый Структура;
	Результат.Вставить("ВидБюджета");
	Результат.Вставить("ИспользоватьЛимитирование");
	Результат.Вставить("ПериодичностьЛимитирования");
	Результат.Вставить("ПериодЛимитирования");
	Результат.Вставить("СпособОпределенияВалютыЛимитирования");
	ЗаполнитьЗначенияСвойств(Результат, ДанныеВыбора);
	Закрыть(Результат);
КонецПроцедуры

#КонецОбласти
