////////////////////////////////////////////////////////////////////////////////
// Служебный модуль "Распределение запасов", содержит процедуры и функции
// чтения и записи в регистр сведений "Распределение запасов".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура АктуализацияПотребностейПоГраницеОбеспеченияРегламентноеЗадание() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.АктуализацияПотребностейПоГраницеОбеспечения);
		
	УстановитьПривилегированныйРежим(Истина);
	ДосчитыватьРегистрРегламентнымЗаданием = ДосчитыватьРегистрРегламентнымЗаданием();
	
	Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеИБ.Номенклатура    КАК Номенклатура,
		|	ДанныеИБ.Характеристика  КАК Характеристика,
		|	ДанныеИБ.Склад           КАК Склад,
		|	ДанныеИБ.Назначение      КАК Назначение
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК ДанныеИБ
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетПереопределяемый ПО ИСТИНА
		|		
		|ГДЕ
		|	ДанныеИБ.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
		|		И ВЫБОР КОГДА ЕСТЬNULL(РасчетПереопределяемый.ГраницаПериода, ДанныеИБ.ЖелаемаяДатаОтгрузки) >= ДанныеИБ.ЖелаемаяДатаОтгрузки
		|						ИЛИ РасчетПереопределяемый.ГраницаПериода = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
		|					ДанныеИБ.ОтложитьОбеспечение > 0
		|				ИНАЧЕ
		|					ДанныеИБ.КОбеспечению > 0
		|			КОНЕЦ";
	
	Подстановки = ОбеспечениеВДокументахСервер.ПодстановкиГраницыОбеспечиваемогоПериода(
		"ДанныеИБ.Номенклатура", "ДанныеИБ.Характеристика", "ДанныеИБ.Склад", "&НачалоТекущегоДня", "ИСТИНА");
	
	Текст = СтрЗаменить(Текст, "РасчетПереопределяемый.ГраницаПериода",             Подстановки.Поле);
	Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетПереопределяемый ПО ИСТИНА", Подстановки.Соединения);
	
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДатаСеанса()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Текст =
		"ВЫБРАТЬ
		|	ДанныеИБ.Состояние                     КАК Состояние,
		|	ДанныеИБ.Номенклатура                  КАК Номенклатура,
		|	ДанныеИБ.Характеристика                КАК Характеристика,
		|	ДанныеИБ.Склад                         КАК Склад,
		|	ДанныеИБ.Назначение                    КАК Назначение,
		|	ДанныеИБ.ЗаказНаОтгрузку               КАК ЗаказНаОтгрузку,
		|	ДанныеИБ.ЖелаемаяДатаОтгрузки          КАК ЖелаемаяДатаОтгрузки,
		|	ДанныеИБ.ЗаказНаПоступление            КАК ЗаказНаПоступление,
		|	ДанныеИБ.ДатаПоступления               КАК ДатаПоступления,
		|	ДанныеИБ.ТипЗаписиРаспределенияЗапасов КАК ТипЗаписиРаспределенияЗапасов,
		|	ДанныеИБ.Резервировать                 КАК Резервировать,
		|	ДанныеИБ.НеОбеспечивать                КАК НеОбеспечивать,
		// Ресурсы меняются местами.
		|	ДанныеИБ.ОтложитьОбеспечение           КАК КОбеспечению,
		|	ДанныеИБ.КОбеспечению                  КАК ОтложитьОбеспечение
		|ПОМЕСТИТЬ ТаблицаИзменений
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК ДанныеИБ
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетПереопределяемый ПО ИСТИНА
		|		
		|ГДЕ
		|	ДанныеИБ.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
		|		И ВЫБОР КОГДА ЕСТЬNULL(РасчетПереопределяемый.ГраницаПериода, ДанныеИБ.ЖелаемаяДатаОтгрузки) >= ДанныеИБ.ЖелаемаяДатаОтгрузки
		|						ИЛИ РасчетПереопределяемый.ГраницаПериода = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
		|					ДанныеИБ.ОтложитьОбеспечение > 0
		|				ИНАЧЕ
		|					ДанныеИБ.КОбеспечению > 0
		|			КОНЕЦ
		|		И ДанныеИБ.Номенклатура = &Номенклатура
		|		И ДанныеИБ.Характеристика = &Характеристика
		|		И ДанныеИБ.Склад = &Склад
		|		И ДанныеИБ.Назначение = &Назначение
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, ЗаказНаОтгрузку
		|;
		|
		|/////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.Номенклатура                  КАК Номенклатура,
		|	Таблица.Характеристика                КАК Характеристика,
		|	Таблица.Склад                         КАК Склад,
		|	Таблица.Назначение                    КАК Назначение,
		|	Таблица.ЗаказНаОтгрузку               КАК ЗаказНаОтгрузку,
		|	МАКСИМУМ(ЕСТЬNULL(ДанныеИБ.КОбеспечениюИтогНаДату, 0)) КАК КОбеспечениюИтогНаДату
		|ПОМЕСТИТЬ ТаблицаКОбеспечениюИтогНаДату
		|ИЗ
		|	ТаблицаИзменений КАК Таблица
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ДанныеИБ
		|		ПО ДанныеИБ.Номенклатура = Таблица.Номенклатура
		|		 И ДанныеИБ.Характеристика = Таблица.Характеристика
		|		 И ДанныеИБ.Склад = Таблица.Склад
		|		 И ДанныеИБ.Назначение = Таблица.Назначение
		|		 И ДанныеИБ.ЗаказНаОтгрузку = Таблица.ЗаказНаОтгрузку
		|		 И ДанныеИБ.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
		|СГРУППИРОВАТЬ ПО
		|	Таблица.Номенклатура,
		|	Таблица.Характеристика,
		|	Таблица.Склад,
		|	Таблица.Назначение,
		|	Таблица.ЗаказНаОтгрузку
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, ЗаказНаОтгрузку
		|;
		|
		|/////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеИБ.Состояние                     КАК Состояние,
		|	ДанныеИБ.Номенклатура                  КАК Номенклатура,
		|	ДанныеИБ.Характеристика                КАК Характеристика,
		|	ДанныеИБ.Склад                         КАК Склад,
		|	ДанныеИБ.Назначение                    КАК Назначение,
		|	ДанныеИБ.ЗаказНаОтгрузку               КАК ЗаказНаОтгрузку,
		|	ДанныеИБ.ЖелаемаяДатаОтгрузки          КАК ЖелаемаяДатаОтгрузки,
		|	ДанныеИБ.ЗаказНаПоступление            КАК ЗаказНаПоступление,
		|	ДанныеИБ.ДатаПоступления               КАК ДатаПоступления,
		|	ДанныеИБ.ТипЗаписиРаспределенияЗапасов КАК ТипЗаписиРаспределенияЗапасов,
		|	ДанныеИБ.Резервировать                 КАК Резервировать,
		|	ДанныеИБ.НеОбеспечивать                КАК НеОбеспечивать,
		|	ДанныеИБ.КОбеспечению                  КАК КОбеспечению,
		|	ДанныеИБ.ОтложитьОбеспечение           КАК ОтложитьОбеспечение,
		|	Таблица.КОбеспечениюИтогНаДату         КАК КОбеспечениюИтогНаДату
		|ИЗ
		|	ТаблицаИзменений КАК ДанныеИБ
		|		
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКОбеспечениюИтогНаДату КАК Таблица
		|		ПО Таблица.Номенклатура = ДанныеИБ.Номенклатура
		|		 И Таблица.Характеристика = ДанныеИБ.Характеристика
		|		 И Таблица.Склад = ДанныеИБ.Склад
		|		 И Таблица.Назначение = ДанныеИБ.Назначение
		|		 И Таблица.ЗаказНаОтгрузку = ДанныеИБ.ЗаказНаОтгрузку
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказНаОтгрузку, ЖелаемаяДатаОтгрузки";
	
	Подстановки = ОбеспечениеВДокументахСервер.ПодстановкиГраницыОбеспечиваемогоПериода(
		"ДанныеИБ.Номенклатура", "ДанныеИБ.Характеристика", "ДанныеИБ.Склад", "&НачалоТекущегоДня", "ИСТИНА");
	
	Текст = СтрЗаменить(Текст, "РасчетПереопределяемый.ГраницаПериода",             Подстановки.Поле);
	Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетПереопределяемый ПО ИСТИНА", Подстановки.Соединения);
	
	Запрос.Текст = Текст;
	
	Набор = РегистрыСведений.РаспределениеЗапасов.СоздатьНаборЗаписей();
	НаборРаспределенияЗапасов = РегистрыСведений.РаспределениеЗапасов.СоздатьНаборЗаписей();
	
	НовыйРазделитель = Новый УникальныйИдентификатор();
	НаборЗаданий = РегистрыСведений.ЗаданияКРаспределениюЗапасов.СоздатьНаборЗаписей();
	НаборЗаданий.Отбор.РазделительЗаписи.Установить(НовыйРазделитель);
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	РезультатРаспределенияЗапасов = РегистрыСведений.РаспределениеЗапасов.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	ЗаказыНаОтгрузку = Новый Соответствие();
	МассивЗаказов = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			БлокировкаДанных = Новый БлокировкаДанных();
			
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.РаспределениеЗапасов");
			ЭлементБлокировки.УстановитьЗначение("Номенклатура", Выборка.Номенклатура);
			ЭлементБлокировки.УстановитьЗначение("Характеристика", Выборка.Характеристика);
			ЭлементБлокировки.УстановитьЗначение("Склад", Выборка.Склад);
			ЭлементБлокировки.УстановитьЗначение("Назначение", Выборка.Назначение);
			ЭлементБлокировки.УстановитьЗначение("ТипЗаписиРаспределенияЗапасов", 1);
			БлокировкаДанных.Заблокировать();
			
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ЗаданияКРаспределениюЗапасов");
			ЭлементБлокировки.УстановитьЗначение("РазделительЗаписи", НовыйРазделитель);
			БлокировкаДанных.Заблокировать();
			
			Запрос.УстановитьПараметр("Номенклатура", Выборка.Номенклатура);
			Запрос.УстановитьПараметр("Характеристика", Выборка.Характеристика);
			Запрос.УстановитьПараметр("Склад", Выборка.Склад);
			Запрос.УстановитьПараметр("Назначение", Выборка.Назначение);
			
			Запись = Запрос.Выполнить().Выбрать();
			
			ЗаказыНаОтгрузку.Очистить();
			МассивЗаказов.Очистить();
			ТекущийЗаказ = Неопределено;
			ТекущийИтог = 0;
			Пока Запись.Следующий() Цикл
				
				Если ТекущийЗаказ <> Запись.ЗаказНаОтгрузку Тогда
					ТекущийЗаказ = Запись.ЗаказНаОтгрузку;
					ТекущийИтог = Запись.КОбеспечениюИтогНаДату;
				КонецЕсли;
				
				Набор.Очистить();
				Набор.Отбор.ТипЗаписиРаспределенияЗапасов.Установить(Запись.ТипЗаписиРаспределенияЗапасов);
				Набор.Отбор.Состояние.Установить(Запись.Состояние);
				Набор.Отбор.Номенклатура.Установить(Запись.Номенклатура);
				Набор.Отбор.Характеристика.Установить(Запись.Характеристика);
				Набор.Отбор.Склад.Установить(Запись.Склад);
				Набор.Отбор.Назначение.Установить(Запись.Назначение);
				Набор.Отбор.ЗаказНаОтгрузку.Установить(Запись.ЗаказНаОтгрузку);
				Набор.Отбор.ЖелаемаяДатаОтгрузки.Установить(Запись.ЖелаемаяДатаОтгрузки);
				Набор.Отбор.ЗаказНаПоступление.Значение = Запись.ЗаказНаПоступление;
				Набор.Отбор.ЗаказНаПоступление.Использование = Истина;
				Набор.Отбор.ДатаПоступления.Установить(Запись.ДатаПоступления);
				
				НоваяСтрока = Набор.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
				Если НоваяСтрока.ОтложитьОбеспечение > 0 Тогда
					НоваяСтрока.КОбеспечениюИтогНаДату = 0;
				Иначе
					ТекущийИтог = ТекущийИтог + НоваяСтрока.КОбеспечению;
					НоваяСтрока.КОбеспечениюИтогНаДату = ТекущийИтог;
				КонецЕсли;
				
				Набор.Записать();
				
				Если ЗаказыНаОтгрузку.Получить(Запись.ЗаказНаОтгрузку) = Неопределено Тогда
					
					ЗаказыНаОтгрузку.Вставить(Запись.ЗаказНаОтгрузку);
					Если ДосчитыватьРегистрРегламентнымЗаданием Тогда
						
						Задание = НаборЗаданий.Добавить();
						ЗаполнитьЗначенияСвойств(Задание, Выборка);
						Задание.ЗаказНаОтгрузку = Запись.ЗаказНаОтгрузку;
						Задание.РазделительЗаписи = НовыйРазделитель;
						Задание.ДатаЗаписи = ТекущаяДатаСеанса;
						
					Иначе
						МассивЗаказов.Добавить(Запись.ЗаказНаОтгрузку);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ЗапросТоваров = Новый Запрос();
			ЗапросТоваров.УстановитьПараметр("Номенклатура", Выборка.Номенклатура);
			ЗапросТоваров.УстановитьПараметр("Характеристика", Выборка.Характеристика);
			ЗапросТоваров.УстановитьПараметр("Склад", Выборка.Склад);
			ЗапросТоваров.УстановитьПараметр("Назначение", Выборка.Назначение);
			ЗапросТоваров.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
			ЗапросТоваров.Текст =
				"ВЫБРАТЬ
				|	&Номенклатура   КАК Номенклатура,
				|	&Характеристика КАК Характеристика,
				|	&Склад          КАК Склад,
				|	&Назначение     КАК Назначение,
				|	ЛОЖЬ            КАК РаспределятьЕслиОстатокНеотрицательный
				|ПОМЕСТИТЬ РазличныеТовары";
				
			ЗапросТоваров.Выполнить();
			РаспределениеЗапасовДвижения.ЗаписатьРаспределениеЗапасовНаПотребностиПоТаблицеРазличныеТовары(ЗапросТоваров);
			
			Если ДосчитыватьРегистрРегламентнымЗаданием Тогда
				
				НаборЗаданий.Записать();
				
			Иначе
				
				ЗапросТоваров.Текст = ТекстЗапросаРаспределенияЗапасов(Истина, "РазличныеТовары");
				ЗапросТоваров.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДатаСеанса()));
				Пакет = ЗапросТоваров.ВыполнитьПакет();
				Таблица = Пакет[8].Выгрузить();
				График = Пакет[9].Выгрузить();
				
				РезультатРаспределенияЗапасов.Очистить();
				РаспределитьЗапасыВТаблицу(РезультатРаспределенияЗапасов, Таблица, График, Ложь);
				НаборРаспределенияЗапасов.Отбор.ТипЗаписиРаспределенияЗапасов.Установить(0);
				НаборРаспределенияЗапасов.Отбор.Номенклатура.Установить(Запись.Номенклатура);
				НаборРаспределенияЗапасов.Отбор.Характеристика.Установить(Запись.Характеристика);
				НаборРаспределенияЗапасов.Отбор.Склад.Установить(Запись.Склад);
				НаборРаспределенияЗапасов.Отбор.Назначение.Установить(Запись.Назначение);
				
				НаборРаспределенияЗапасов.Загрузить(РезультатРаспределенияЗапасов);
				НаборРаспределенияЗапасов.Записать();
				
				ИсключитьСсылкиТребующиеОтложенногоОбновления(МассивЗаказов);
				РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(МассивЗаказов, Ложь, Ложь);
				РегистрыСведений.СостоянияВнутреннихЗаказов.ОтразитьСостояниеЗаказа(МассивЗаказов);
				//++ НЕ УТКА
				ОбеспечениеПроизводства.ПриИзмененииОбеспечения(МассивЗаказов);
				//-- НЕ УТКА
				
			КонецЕсли;
			
			ЗапросТоваров.МенеджерВременныхТаблиц.Закрыть();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Регламентное задание ""Актуализация потребностей по границе обеспечения"" завершилось неудачно по причине: %Причина%';
									|en = 'The ""Update demand based on the supply boundary"" scheduled job failed. Reason: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			СобытиеЖурнала = НСтр("ru = 'Распределение запасов';
									|en = 'Inventory allocation'", ОбщегоНазначения.КодОсновногоЯзыка());
			ЗаписьЖурналаРегистрации(СобытиеЖурнала,
			                         УровеньЖурналаРегистрации.Ошибка,
			                         Метаданные.РегламентныеЗадания.АктуализацияПотребностейПоГраницеОбеспечения,
			                         ,
			                         ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РаспределениеЗапасовРегламентноеЗадание() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.РаспределениеЗапасов);
	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", Метаданные.РегламентныеЗадания.РаспределениеЗапасов.Ключ);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	ТекущиеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	
	Если ТекущиеФоновыеЗадания.Количество() < 2 Тогда // РЗ имеет такой же ключ как и ФЗ, поэтому тоже учитывается.
		
		ФоновыеЗадания.Выполнить(
			"РаспределениеЗапасов.ВыполнитьРаспределениеВФоне",
			Новый Массив(),
			Метаданные.РегламентныеЗадания.РаспределениеЗапасов.Ключ,
			НСтр("ru = 'Выполняется распределение запасов';
				|en = 'Allocating inventory'"));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьРаспределениеВФоне() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если БлокироватьРаспределениеЗапасов() Тогда
		Возврат;
	КонецЕсли;
	
	Пока Истина Цикл
		
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Задания.Номенклатура КАК Номенклатура,
			|	Задания.Характеристика КАК Характеристика,
			|	Задания.Склад КАК Склад,
			|	Задания.Назначение КАК Назначение
			|ПОМЕСТИТЬ ТоварыДляРаспределенияЗапасов
			|ИЗ(
			|	ВЫБРАТЬ ПЕРВЫЕ 1000
			|		Задания.Номенклатура КАК Номенклатура,
			|		Задания.Характеристика КАК Характеристика,
			|		Задания.Склад КАК Склад,
			|		Задания.Назначение КАК Назначение,
			|		Задания.ДатаЗаписи КАК ДатаЗаписи
			|	ИЗ
			|		РегистрСведений.ЗаданияКРаспределениюЗапасов КАК Задания
			|	УПОРЯДОЧИТЬ ПО
			|		ДатаЗаписи) КАК Задания
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение
			|;
			|
			|////////////////////////////////////////
			|ВЫБРАТЬ
			|	Задания.Номенклатура КАК Номенклатура,
			|	Задания.Характеристика КАК Характеристика,
			|	Задания.Склад КАК Склад,
			|	Задания.Назначение КАК Назначение,
			|	Задания.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|	Задания.РазделительЗаписи КАК РазделительЗаписи
			|ПОМЕСТИТЬ ЗаданияКРаспределениюЗапасов
			|ИЗ
			|	ТоварыДляРаспределенияЗапасов КАК Товары
			|		
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗаданияКРаспределениюЗапасов КАК Задания
			|		ПО Задания.Номенклатура = Товары.Номенклатура
			|		 И Задания.Характеристика = Товары.Характеристика
			|		 И Задания.Склад = Товары.Склад
			|		 И Задания.Назначение = Товары.Назначение
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Если РезультатЗапроса[1].Выгрузить()[0].Количество = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапросаРаспределенияЗапасов();
		Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДатаСеанса()));
		Пакет = Запрос.ВыполнитьПакет();
		
		Таблица = Пакет[8].Выгрузить();
		График = Пакет[9].Выгрузить();
		
		Набор = РегистрыСведений.РаспределениеЗапасов.СоздатьНаборЗаписей();
		Набор.Отбор.ТипЗаписиРаспределенияЗапасов.Установить(0);
		
		ТаблицаРезультат = Набор.ВыгрузитьКолонки();
		ТаблицаРезультат.Колонки.Добавить("Пустая", Новый ОписаниеТипов("Булево"));
		РаспределитьЗапасыВТаблицу(ТаблицаРезультат, Таблица, График, Истина);
		
		Отбор = Новый Структура();
		Отбор.Вставить("Номенклатура");
		Отбор.Вставить("Характеристика");
		Отбор.Вставить("Склад");
		Отбор.Вставить("Назначение");
		
		Для Индекс = 0 По ТаблицаРезультат.Количество() - 1 Цикл
			
			Строка = ТаблицаРезультат[Индекс];
			
			Если Отбор.Номенклатура <> Строка.Номенклатура
					Или Отбор.Характеристика <> Строка.Характеристика
					Или Отбор.Склад <> Строка.Склад
					Или Отбор.Назначение <> Строка.Назначение Тогда
						
						Если Отбор.Номенклатура <> Неопределено Тогда
							
							НачатьТранзакцию();
							Попытка
								Набор.Записать();
								ЗафиксироватьТранзакцию();
							Исключение
								ОтменитьТранзакцию();
								СообщитьОНеудачнойОбработкеНоменклатуры();
							КонецПопытки;
							
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(Отбор, Строка);
						
						Набор.Очистить();
						Набор.Отбор.Номенклатура.Установить(Отбор.Номенклатура);
						Набор.Отбор.Характеристика.Установить(Отбор.Характеристика);
						Набор.Отбор.Склад.Установить(Отбор.Склад);
						Набор.Отбор.Назначение.Установить(Отбор.Назначение);
						
			КонецЕсли;
			
			Если Не Строка.Пустая Тогда
				ЗаполнитьЗначенияСвойств(Набор.Добавить(), Строка);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТаблицаРезультат.Количество() > 0 Тогда
			НачатьТранзакцию();
			Попытка
				Набор.Записать();
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				СообщитьОНеудачнойОбработкеНоменклатуры();
			КонецПопытки;
		КонецЕсли;
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Набор.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВсеЗаказы
			|ИЗ(
			|	ВЫБРАТЬ
			|		Задания.ЗаказНаОтгрузку КАК Ссылка
			|	ИЗ
			|		ЗаданияКРаспределениюЗапасов КАК Задания
			|	ГДЕ
			|		Задания.ЗаказНаОтгрузку <> НЕОПРЕДЕЛЕНО
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ОжидаемаяОтгрузка.ЗаказНаОтгрузку КАК Ссылка
			|	ИЗ
			|		ЗаданияКРаспределениюЗапасов КАК Заказы
			|			
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ОжидаемаяОтгрузка
			|			ПО ОжидаемаяОтгрузка.Номенклатура = Заказы.Номенклатура
			|			 И ОжидаемаяОтгрузка.Характеристика = Заказы.Характеристика
			|			 И ОжидаемаяОтгрузка.Склад = Заказы.Склад
			|			 И ОжидаемаяОтгрузка.Назначение = Заказы.Назначение
			|	ГДЕ
			|		Заказы.ЗаказНаОтгрузку = НЕОПРЕДЕЛЕНО
			|			И ОжидаемаяОтгрузка.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)) КАК Набор
			|ИНДЕКСИРОВАТЬ ПО
			|	Ссылка
			|;
			|
			|/////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВсеЗаказы.Ссылка КАК Ссылка
			|ИЗ
			|	ВсеЗаказы КАК ВсеЗаказы
			|ГДЕ
			|	НЕ ИСТИНА В(
			|		ВЫБРАТЬ ПЕРВЫЕ 1
			|			ИСТИНА КАК ЗаказЕстьВНеобработанныхЗаданиях
			|		ИЗ
			|			РегистрСведений.ЗаданияКРаспределениюЗапасов КАК ВсеЗадания
			|		ГДЕ
			|			ВсеЗадания.ЗаказНаОтгрузку = ВсеЗаказы.Ссылка
			|				И НЕ ИСТИНА В(
			|					ВЫБРАТЬ
			|						ИСТИНА КАК ЭтаНоменклатураОтработана
			|					ИЗ
			|						ЗаданияКРаспределениюЗапасов КАК ОтработанныеЗадания
			|					ГДЕ
			|						ОтработанныеЗадания.Номенклатура = ВсеЗадания.Номенклатура
			|							И ОтработанныеЗадания.Характеристика = ВсеЗадания.Характеристика
			|							И ОтработанныеЗадания.Склад = ВсеЗадания.Склад
			|							И ОтработанныеЗадания.Назначение = ВсеЗадания.Назначение))
			|	И НЕ ИСТИНА В(
			|		ВЫБРАТЬ ПЕРВЫЕ 1
			|			ИСТИНА КАК НоменклатураЗаказаЕстьВНеотработанныхЗаданиях
			|		ИЗ
			|			РегистрСведений.РаспределениеЗапасов КАК ОжидаемаяОтгрузка
			|		ГДЕ
			|			ОжидаемаяОтгрузка.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
			|				И ОжидаемаяОтгрузка.ЗаказНаОтгрузку = ВсеЗаказы.Ссылка
			|				И ИСТИНА В(
			|					ВЫБРАТЬ
			|						ИСТИНА КАК ЭтаНоменклатураЕстьВЗаданиях
			|					ИЗ
			|						РегистрСведений.ЗаданияКРаспределениюЗапасов КАК ВсеЗадания
			|					ГДЕ
			|						ВсеЗадания.Номенклатура = ОжидаемаяОтгрузка.Номенклатура
			|							И ВсеЗадания.Характеристика = ОжидаемаяОтгрузка.Характеристика
			|							И ВсеЗадания.Склад = ОжидаемаяОтгрузка.Склад
			|							И ВсеЗадания.Назначение = ОжидаемаяОтгрузка.Назначение)
			|					
			|				И НЕ ИСТИНА В(
			|					ВЫБРАТЬ
			|						ИСТИНА КАК ЭтаНоменклатураОтработана
			|					ИЗ
			|						ЗаданияКРаспределениюЗапасов КАК ОтработанныеЗадания
			|					ГДЕ
			|						ОтработанныеЗадания.Номенклатура = ОжидаемаяОтгрузка.Номенклатура
			|							И ОтработанныеЗадания.Характеристика = ОжидаемаяОтгрузка.Характеристика
			|							И ОтработанныеЗадания.Склад = ОжидаемаяОтгрузка.Склад
			|							И ОтработанныеЗадания.Назначение = ОжидаемаяОтгрузка.Назначение))";
		
		Заказы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		ИсключитьСсылкиТребующиеОтложенногоОбновления(Заказы);
		РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(Заказы, Ложь, Ложь);
		РегистрыСведений.СостоянияВнутреннихЗаказов.ОтразитьСостояниеЗаказа(Заказы);
		//++ НЕ УТКА
		ОбеспечениеПроизводства.ПриИзмененииОбеспечения(Заказы);
		//-- НЕ УТКА
		
		РезультатЗапроса = Запрос.МенеджерВременныхТаблиц.Таблицы["ЗаданияКРаспределениюЗапасов"].ПолучитьДанные(); // РезультатЗапроса
		ВыборкаЗаданий = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаЗаданий.Следующий() Цикл
			
			НаборЗаданий = РегистрыСведений.ЗаданияКРаспределениюЗапасов.СоздатьНаборЗаписей();
			НаборЗаданий.Отбор.Номенклатура.Установить(ВыборкаЗаданий.Номенклатура);
			НаборЗаданий.Отбор.Характеристика.Установить(ВыборкаЗаданий.Характеристика);
			НаборЗаданий.Отбор.Склад.Установить(ВыборкаЗаданий.Склад);
			НаборЗаданий.Отбор.Назначение.Установить(ВыборкаЗаданий.Назначение);
			НаборЗаданий.Отбор.ЗаказНаОтгрузку.Установить(ВыборкаЗаданий.ЗаказНаОтгрузку);
			НаборЗаданий.Отбор.РазделительЗаписи.Установить(ВыборкаЗаданий.РазделительЗаписи);
			НаборЗаданий.Записать();
			
		КонецЦикла;
		Запрос.МенеджерВременныхТаблиц.Закрыть();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаРаспределенияЗапасов(ПолучатьГраницыПериодаОбеспечения = Истина, ИмяТаблицыТовары = "ТоварыДляРаспределенияЗапасов") Экспорт
	
	Текст = "";
	Если ПолучатьГраницыПериодаОбеспечения Тогда
		
		Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Номенклатура   КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Склад          КАК Склад
		|ПОМЕСТИТЬ РазличныеТоварыБезНазначений
		|ИЗ
		|	ТоварыДляРаспределенияЗапасовПереопределяемый КАК Товары
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад
		|;
		|
		|///////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура                 КАК Номенклатура,
		|	Товары.Характеристика               КАК Характеристика,
		|	Товары.Склад                        КАК Склад,
		|	РасчетПереопределяемый.ДатаПоставки КАК ДатаПоставки,
		|	ЕСТЬNULL(НастройкаКонтроляОбеспечения.ПерераспределятьСкладскиеЗапасы, ЛОЖЬ)
		|		ИЛИ НЕ ЕСТЬNULL(НастройкаКонтроляОбеспеченияХарактеристика.КонтролироватьСвободныеОстатки,
		|				ЕСТЬNULL(НастройкаКонтроляОбеспеченияНоменклатура.КонтролироватьСвободныеОстатки,
		|					ЕСТЬNULL(НастройкаКонтроляОбеспечения.КонтролироватьСвободныеОстатки, ЛОЖЬ)))
		|		ИЛИ ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура).ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) КАК ПерераспределятьСкладскиеЗапасы
		|ПОМЕСТИТЬ ГраницыПериодаОбеспечения
		|ИЗ
		|	РазличныеТоварыБезНазначений КАК Товары
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетПереопределяемый ПО ИСТИНА
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаКонтроляОбеспеченияХарактеристика
		|		ПО НастройкаКонтроляОбеспеченияХарактеристика.Склад = Товары.Склад
		|		 И НастройкаКонтроляОбеспеченияХарактеристика.Номенклатура = Товары.Номенклатура
		|		 И НастройкаКонтроляОбеспеченияХарактеристика.Характеристика = Товары.Характеристика
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаКонтроляОбеспеченияНоменклатура
		|		ПО НастройкаКонтроляОбеспеченияНоменклатура.Склад = Товары.Склад
		|		 И НастройкаКонтроляОбеспеченияНоменклатура.Номенклатура = Товары.Номенклатура
		|		 И НастройкаКонтроляОбеспеченияНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|		 И НастройкаКонтроляОбеспеченияХарактеристика.Номенклатура ЕСТЬ NULL
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаКонтроляОбеспечения
		|		ПО НастройкаКонтроляОбеспечения.Склад = Товары.Склад
		|		 И НастройкаКонтроляОбеспечения.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		 И НастройкаКонтроляОбеспечения.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|		 И НастройкаКонтроляОбеспеченияХарактеристика.Номенклатура ЕСТЬ NULL
		|		 И НастройкаКонтроляОбеспеченияНоменклатура.Номенклатура ЕСТЬ NULL
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад
		|;
		|
		|//////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	Текст = Текст +
		"ВЫБРАТЬ
		|	Товары.Номенклатура          КАК Номенклатура,
		|	Товары.Характеристика        КАК Характеристика,
		|	Товары.Склад                 КАК Склад,
		|	Товары.Назначение            КАК Назначение,
		|	Сведения.ЗаказНаОтгрузку     КАК ЗаказНаОтгрузку,
		|	СУММА(Сведения.Распределено) КАК Распределено
		|ПОМЕСТИТЬ РаспределеноПоЗаказам
		|ИЗ
		|	ТоварыДляРаспределенияЗапасовПереопределяемый КАК Товары
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК Сведения
		|		ПО Сведения.Номенклатура  = Товары.Номенклатура
		|		 И Сведения.Характеристика = Товары.Характеристика
		|		 И Сведения.Склад          = Товары.Склад
		|		 И Сведения.Назначение     = Товары.Назначение
		|		 И Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе)
		|ГДЕ
		|	НЕ Сведения.Номенклатура ЕСТЬ NULL
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура,
		|	Товары.Характеристика,
		|	Товары.Склад,
		|	Товары.Назначение,
		|	Сведения.ЗаказНаОтгрузку
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, ЗаказНаОтгрузку
		|;
		|
		|//////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура          КАК Номенклатура,
		|	Товары.Характеристика        КАК Характеристика,
		|	Товары.Склад                 КАК Склад,
		|	Товары.Назначение            КАК Назначение,
		|	Сведения.ЗаказНаОтгрузку     КАК ЗаказНаОтгрузку,
		|	СУММА(Сведения.КОбеспечению) КАК КОбеспечению
		|ПОМЕСТИТЬ ПотребностиПоЗаказамГруппировка
		|ИЗ
		|	ТоварыДляРаспределенияЗапасовПереопределяемый КАК Товары
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК Сведения
		|		ПО Сведения.Номенклатура  = Товары.Номенклатура
		|		 И Сведения.Характеристика = Товары.Характеристика
		|		 И Сведения.Склад          = Товары.Склад
		|		 И Сведения.Назначение     = Товары.Назначение
		|		 И Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
		|		 И Сведения.КОбеспечению > 0
		|ГДЕ
		|	НЕ Сведения.Номенклатура ЕСТЬ NULL
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура,
		|	Товары.Характеристика,
		|	Товары.Склад,
		|	Товары.Назначение,
		|	Сведения.ЗаказНаОтгрузку
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, ЗаказНаОтгрузку
		|;
		|
		|/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Потребности.Номенклатура    КАК Номенклатура,
		|	Потребности.Характеристика  КАК Характеристика,
		|	Потребности.Склад           КАК Склад,
		|	Потребности.Назначение      КАК Назначение,
		|	Потребности.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
		|	Потребности.КОбеспечению    КАК КОбеспечению,
		|	ВЫБОР КОГДА Потребности.КОбеспечению < ЕСТЬNULL(РаспределеноПоЗаказам.Распределено, 0) ТОГДА
		|				Потребности.КОбеспечению
		|			ИНАЧЕ
		|				ЕСТЬNULL(РаспределеноПоЗаказам.Распределено, 0)
		|		КОНЕЦ КАК Распределено
		|ПОМЕСТИТЬ ПотребностиПоЗаказам
		|ИЗ
		|	ПотребностиПоЗаказамГруппировка КАК Потребности
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределеноПоЗаказам КАК РаспределеноПоЗаказам
		|		ПО РаспределеноПоЗаказам.Номенклатура    = Потребности.Номенклатура
		|		 И РаспределеноПоЗаказам.Характеристика  = Потребности.Характеристика
		|		 И РаспределеноПоЗаказам.Склад           = Потребности.Склад
		|		 И РаспределеноПоЗаказам.Назначение      = Потребности.Назначение
		|		 И РаспределеноПоЗаказам.ЗаказНаОтгрузку = Потребности.ЗаказНаОтгрузку
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, ЗаказНаОтгрузку
		|;
		|
		|/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Потребности.Номенклатура    КАК Номенклатура,
		|	Потребности.Характеристика  КАК Характеристика,
		|	Потребности.Склад           КАК Склад,
		|	Потребности.Назначение      КАК Назначение,
		|	СУММА(ВЫБОР КОГДА ГраницыПериодаОбеспечения.ПерераспределятьСкладскиеЗапасы ТОГДА
		|				0
		|			ИНАЧЕ
		|				Потребности.Распределено
		|		КОНЕЦ) КАК Распределено,
		|	СУММА(Потребности.КОбеспечению) КАК КОбеспечению
		|ПОМЕСТИТЬ ПотребностиПоТовару
		|ИЗ
		|	ПотребностиПоЗаказам КАК Потребности
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГраницыПериодаОбеспечения КАК ГраницыПериодаОбеспечения
		|		ПО ГраницыПериодаОбеспечения.Номенклатура   = Потребности.Номенклатура
		|		 И ГраницыПериодаОбеспечения.Характеристика = Потребности.Характеристика
		|		 И ГраницыПериодаОбеспечения.Склад          = Потребности.Склад
		|СГРУППИРОВАТЬ ПО
		|	Потребности.Номенклатура,
		|	Потребности.Характеристика,
		|	Потребности.Склад,
		|	Потребности.Назначение
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение
		|;
		|
		|/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура         КАК Номенклатура,
		|	Товары.Характеристика       КАК Характеристика,
		|	Товары.Склад                КАК Склад,
		|	Товары.Назначение           КАК Назначение,
		|	Сведения.ЗаказНаПоступление КАК ЗаказНаПоступление,
		|	Сведения.ДатаПоступления    КАК ДатаПоступления,
		|	ВЫБОР КОГДА Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление) ТОГДА
		|				ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченКДате)
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу)
		|		КОНЕЦ КАК Состояние,
		|	ЕСТЬNULL(Сведения.Запас - Сведения.Свободно, 0) КАК Распределить,
		|	ВЫБОР КОГДА Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление) ТОГДА
		|				1
		|			ИНАЧЕ
		|				2
		|		КОНЕЦ КАК ПорядокПоСостоянию
		|ПОМЕСТИТЬ ГрафикПоступления
		|ИЗ
		|	ТоварыДляРаспределенияЗапасовПереопределяемый КАК Товары
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК Сведения
		|		ПО Сведения.Номенклатура    = Товары.Номенклатура
		|		 И Сведения.Характеристика  = Товары.Характеристика
		|		 И Сведения.Склад           = Товары.Склад
		|		 И Сведения.Назначение      = Товары.Назначение
		|		 И Сведения.Запас - Сведения.Свободно > 0
		|		 И Сведения.Состояние В(
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеподтвержденное))
		|;
		|
		|//////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сведения.Номенклатура        КАК Номенклатура,
		|	Сведения.Характеристика      КАК Характеристика,
		|	Сведения.Склад               КАК Склад,
		|	Сведения.Назначение          КАК Назначение,
		|	СУММА(Сведения.Распределить) КАК Распределить
		|ПОМЕСТИТЬ ГрафикПоступленияПоТовару
		|ИЗ
		|	ГрафикПоступления КАК Сведения
		|СГРУППИРОВАТЬ ПО
		|	Сведения.Номенклатура,
		|	Сведения.Характеристика,
		|	Сведения.Склад,
		|	Сведения.Назначение
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение
		|;
		|
		|//////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сведения.Номенклатура                                                    КАК Номенклатура,
		|	Сведения.Характеристика                                                  КАК Характеристика,
		|	Сведения.Склад                                                           КАК Склад,
		|	Сведения.Назначение                                                      КАК Назначение,
		|	Сведения.ЗаказНаОтгрузку                                                 КАК ЗаказНаОтгрузку,
		|	Сведения.ЖелаемаяДатаОтгрузки                                            КАК ЖелаемаяДатаОтгрузки,
		|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОтложитьОбеспечение) КАК Состояние,
		|	Сведения.ОтложитьОбеспечение                                             КАК НеОбеспечено,
		|	0                                                                        КАК КОбеспечению,
		|	0                                                                        КАК КОбеспечениюИтогНаДату,
		|	0                                                                        КАК КОбеспечениюПоТовару,
		|	0                                                                        КАК КОбеспечениюПоЗаказу,
		|	0                                                                        КАК РаспределеноПоЗаказу,
		|	0                                                                        КАК РаспределитьНаВсеСтроки,
		|	0                                                                        КАК СвободноПоТовару,
		|	0                                                                        КАК ВсегоВГрафике,
		|	-1                                                                       КАК Приоритет,
		|	ДАТАВРЕМЯ(1,1,1)                                                         КАК ПорядокОсновной,
		|	ДАТАВРЕМЯ(1,1,1)                                                         КАК ПорядокДополнительный
		|ИЗ
		|	ТоварыДляРаспределенияЗапасовПереопределяемый КАК Товары
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК Сведения
		|		ПО Сведения.Номенклатура    = Товары.Номенклатура
		|		 И Сведения.Характеристика  = Товары.Характеристика
		|		 И Сведения.Склад           = Товары.Склад
		|		 И Сведения.Назначение      = Товары.Назначение
		|ГДЕ
		|	Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
		|		И Сведения.ОтложитьОбеспечение > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Товары.Номенклатура                                             КАК Номенклатура,
		|	Товары.Характеристика                                           КАК Характеристика,
		|	Товары.Склад                                                    КАК Склад,
		|	Товары.Назначение                                               КАК Назначение,
		|	Сведения.ЗаказНаОтгрузку                                        КАК ЗаказНаОтгрузку,
		|	Сведения.ЖелаемаяДатаОтгрузки                                   КАК ЖелаемаяДатаОтгрузки,
		|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.Обеспечить) КАК Состояние,
		|	0                                                               КАК НеОбеспечено,
		|	ЕСТЬNULL(Сведения.КОбеспечению, 0)                              КАК КОбеспечению,
		|	ЕСТЬNULL(Сведения.КОбеспечениюИтогНаДату, 0)                    КАК КОбеспечениюИтогНаДату,
		|	ЕСТЬNULL(ПотребностиПоТовару.КОбеспечению, 0)                   КАК КОбеспечениюПоТовару,
		|	ЕСТЬNULL(ПотребностиПоЗаказам.КОбеспечению, 0)                  КАК КОбеспечениюПоЗаказу,
		|	ЕСТЬNULL(ПотребностиПоЗаказам.Распределено, 0)                  КАК РаспределеноПоЗаказу,
		|	ЕСТЬNULL(ОстатокНаСкладе.Запас - ОстатокНаСкладе.Резерв, 0)     КАК РаспределитьНаВсеСтроки,
		|	ЕСТЬNULL(ОстатокНаСкладе.Запас - ОстатокНаСкладе.Резерв, 0)
		|		- ЕСТЬNULL(ПотребностиПоТовару.Распределено, 0)             КАК СвободноПоТовару,
		|	ГрафикПоТовару.Распределить                                     КАК ВсегоВГрафике,
		// Порядок обхода заказов.
		|	ЗаказыРеестра.Приоритет.РеквизитДопУпорядочивания КАК Приоритет,
		|	
		|	ВЫБОР КОГДА ЕСТЬNULL(Сведения.Склад.ПерераспределятьСкладскиеЗапасы, ИСТИНА) ТОГДА
		|				Сведения.ЖелаемаяДатаОтгрузки
		|			КОГДА ГраницыПериодаОбеспечения.ДатаПоставки < Сведения.ЖелаемаяДатаОтгрузки ТОГДА
		|				Сведения.ЖелаемаяДатаОтгрузки
		|			КОГДА ЗаказыРеестра.ДатаДокументаИБ < ДОБАВИТЬКДАТЕ(&НачалоТекущегоДня, ДЕНЬ, 1) ТОГДА
		|				ДОБАВИТЬКДАТЕ(ЗаказыРеестра.ДатаДокументаИБ, ДЕНЬ, -1)
		|			ИНАЧЕ
		|				&НачалоТекущегоДня
		|		КОНЕЦ КАК ПорядокОсновной,
		|		ЗаказыРеестра.ДатаДокументаИБ ПорядокДополнительный
		|ИЗ
		|	ТоварыДляРаспределенияЗапасовПереопределяемый КАК Товары
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПотребностиПоЗаказам КАК ПотребностиПоЗаказам
		|		ПО ПотребностиПоЗаказам.Номенклатура    = Товары.Номенклатура
		|		 И ПотребностиПоЗаказам.Характеристика  = Товары.Характеристика
		|		 И ПотребностиПоЗаказам.Склад           = Товары.Склад
		|		 И ПотребностиПоЗаказам.Назначение      = Товары.Назначение
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГраницыПериодаОбеспечения КАК ГраницыПериодаОбеспечения
		|		ПО ГраницыПериодаОбеспечения.Номенклатура    = Товары.Номенклатура
		|		 И ГраницыПериодаОбеспечения.Характеристика  = Товары.Характеристика
		|		 И ГраницыПериодаОбеспечения.Склад           = Товары.Склад
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПотребностиПоТовару КАК ПотребностиПоТовару
		|		ПО ПотребностиПоТовару.Номенклатура    = Товары.Номенклатура
		|		 И ПотребностиПоТовару.Характеристика  = Товары.Характеристика
		|		 И ПотребностиПоТовару.Склад           = Товары.Склад
		|		 И ПотребностиПоТовару.Назначение      = Товары.Назначение
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ОстатокНаСкладе
		|		ПО ОстатокНаСкладе.Номенклатура   = Товары.Номенклатура
		|		 И ОстатокНаСкладе.Характеристика = Товары.Характеристика
		|		 И ОстатокНаСкладе.Склад          = Товары.Склад
		|		 И ОстатокНаСкладе.Назначение     = Товары.Назначение
		|		 И ОстатокНаСкладе.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикПоступленияПоТовару КАК ГрафикПоТовару
		|		ПО ГрафикПоТовару.Номенклатура   = Товары.Номенклатура
		|		 И ГрафикПоТовару.Характеристика = Товары.Характеристика
		|		 И ГрафикПоТовару.Склад          = Товары.Склад
		|		 И ГрафикПоТовару.Назначение     = Товары.Назначение
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК Сведения
		|		ПО Сведения.ЗаказНаОтгрузку = ПотребностиПоЗаказам.ЗаказНаОтгрузку
		|		 И Сведения.Номенклатура    = ПотребностиПоЗаказам.Номенклатура
		|		 И Сведения.Характеристика  = ПотребностиПоЗаказам.Характеристика
		|		 И Сведения.Склад           = ПотребностиПоЗаказам.Склад
		|		 И Сведения.Назначение      = ПотребностиПоЗаказам.Назначение
		|		 И Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
		|		 И Сведения.КОбеспечению > 0
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК ЗаказыРеестра
		|		ПО ЗаказыРеестра.Ссылка = ПотребностиПоЗаказам.ЗаказНаОтгрузку
		|		 И НЕ ЗаказыРеестра.ДополнительнаяЗапись
		|		
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, Приоритет, ПорядокОсновной, ПорядокДополнительный, ЗаказНаОтгрузку
		|;
		|
		|//////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрафикПоступления.Номенклатура              КАК Номенклатура,
		|	ГрафикПоступления.Характеристика            КАК Характеристика,
		|	ГрафикПоступления.Склад                     КАК Склад,
		|	ГрафикПоступления.Назначение                КАК Назначение,
		|	ГрафикПоступления.Состояние                 КАК Состояние,
		|	ГрафикПоступления.ЗаказНаПоступление        КАК ЗаказНаПоступление,
		|	ГрафикПоступления.ДатаПоступления           КАК ДатаПоступления,
		|	ГрафикПоступления.Распределить              КАК Распределить,
		|	ГрафикПоступления.ПорядокПоСостоянию        КАК ПорядокПоСостоянию
		|ИЗ
		|	ГрафикПоступления КАК ГрафикПоступления
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, ПорядокПоСостоянию, ДатаПоступления, ЗаказНаПоступление";
		
	Подстановки = ОбеспечениеВДокументахСервер.ПодстановкиГраницыОбеспечиваемогоПериода(
		"Товары.Номенклатура", "Товары.Характеристика", "Товары.Склад", "&НачалоТекущегоДня", "ИСТИНА");
	
	Текст = СтрЗаменить(Текст, "РасчетПереопределяемый.ДатаПоставки",               Подстановки.ПолеДатаПоставки);
	Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетПереопределяемый ПО ИСТИНА", Подстановки.Соединения);
	Текст = СтрЗаменить(Текст, "ТоварыДляРаспределенияЗапасовПереопределяемый",     ИмяТаблицыТовары);
	Возврат Текст;
	
КонецФункции

Процедура РаспределитьЗапасыВТаблицу(Набор, Таблица, График, ДобавлятьПустуюЗаписьПоТовару) Экспорт
	
	Номенклатура   = Неопределено;
	Характеристика = Неопределено;
	Склад          = Неопределено;
	Назначение     = Неопределено;
	
	ИндексВГрафике = 0;
	
	Свободно                = 0;
	РаспределитьНаВсеСтроки = 0;
	КОбеспечению            = 0;
	СвободноВГрафике        = 0;
	
	ВсегоСтрок = Таблица.Количество();
	Для Индекс = 0 По ВсегоСтрок - 1 Цикл
		
		ТекСтрока = Таблица[Индекс];
		
		Если ТекСтрока.Состояние = Перечисления.РаспределениеЗапасовСостояния.ОтложитьОбеспечение Тогда
			НоваяЗапись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока,
				"Номенклатура,Характеристика,Склад,Назначение,ЗаказНаОтгрузку,ЖелаемаяДатаОтгрузки,Состояние,НеОбеспечено");
			Продолжить;
		КонецЕсли;
		
		Если Номенклатура <> ТекСтрока.Номенклатура
				Или Характеристика <> ТекСтрока.Характеристика
				Или Склад <> ТекСтрока.Склад
				Или Назначение <> ТекСтрока.Назначение Тогда
					
					Номенклатура   = ТекСтрока.Номенклатура;
					Характеристика = ТекСтрока.Характеристика;
					Склад          = ТекСтрока.Склад;
					Назначение     = ТекСтрока.Назначение;
					
					РаспределитьНаВсеСтроки = Макс(ТекСтрока.РаспределитьНаВсеСтроки, 0);
					Свободно                = Макс(ТекСтрока.СвободноПоТовару, 0);
					КОбеспечению            = ТекСтрока.КОбеспечениюПоТовару;
					
					СвободноВГрафике = Мин(Макс(КОбеспечению - РаспределитьНаВсеСтроки, 0), ТекСтрока.ВсегоВГрафике);
					
					Если ДобавлятьПустуюЗаписьПоТовару Тогда
						НоваяЗапись = Набор.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока, "Номенклатура,Характеристика,Склад,Назначение");
						НоваяЗапись.Пустая = Истина;
					КонецЕсли;
					
					
		КонецЕсли;
		
		// Распределяем то, что уже было распределено на заказ ранее.
		РаспределитьНаСтроку = Мин(
			Макс(ТекСтрока.РаспределеноПоЗаказу - ТекСтрока.КОбеспечениюИтогНаДату + ТекСтрока.КОбеспечению, 0),
			ТекСтрока.КОбеспечению);
		
		// Распределяем свободный остаток.
		Если РаспределитьНаСтроку < ТекСтрока.КОбеспечению Тогда
			СвободноНаСтроку = Мин(Свободно, ТекСтрока.КОбеспечению - РаспределитьНаСтроку);
			РаспределитьНаСтроку = РаспределитьНаСтроку + СвободноНаСтроку;
			Свободно = Свободно - СвободноНаСтроку;
		КонецЕсли;
		
		РаспределитьНаВсеСтроки = РаспределитьНаВсеСтроки - РаспределитьНаСтроку;
		СнятьРаспределение = Макс(0, -РаспределитьНаВсеСтроки);
		РаспределитьНаСтроку = РаспределитьНаСтроку - СнятьРаспределение;
		РаспределитьНаВсеСтроки = РаспределитьНаВсеСтроки + СнятьРаспределение;
		
		РаспределитьНаСтрокуВГрафике = 0;
		Если РаспределитьНаСтроку < ТекСтрока.КОбеспечению Тогда
			РаспределитьНаСтрокуВГрафике = Мин(ТекСтрока.КОбеспечению - РаспределитьНаСтроку, СвободноВГрафике);
			СвободноВГрафике = СвободноВГрафике - РаспределитьНаСтрокуВГрафике;
		КонецЕсли;
		
		НеОбеспечено = ТекСтрока.КОбеспечению - РаспределитьНаСтроку - РаспределитьНаСтрокуВГрафике;
		Если РаспределитьНаСтроку > 0 Тогда
			
			НоваяЗапись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока,
				"Номенклатура,Характеристика,Склад,Назначение,ЗаказНаОтгрузку,ЖелаемаяДатаОтгрузки");
			НоваяЗапись.Состояние = Перечисления.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе;
			НоваяЗапись.Распределено = РаспределитьНаСтроку;
			
		КонецЕсли;
		
		Пока РаспределитьНаСтрокуВГрафике > 0 Цикл
			
			Если Номенклатура <> График[ИндексВГрафике].Номенклатура
					Или Характеристика <> График[ИндексВГрафике].Характеристика
					Или Склад <> График[ИндексВГрафике].Склад
					Или Назначение <> График[ИндексВГрафике].Назначение
					Или График[ИндексВГрафике].Распределить = 0 Тогда
				ИндексВГрафике = ИндексВГрафике + 1;
				Продолжить;
			КонецЕсли;
			
			РаспределитьНаСтроку = Мин(График[ИндексВГрафике].Распределить, РаспределитьНаСтрокуВГрафике);
			График[ИндексВГрафике].Распределить = График[ИндексВГрафике].Распределить - РаспределитьНаСтроку;
			РаспределитьНаСтрокуВГрафике = РаспределитьНаСтрокуВГрафике - РаспределитьНаСтроку;
			
			НоваяЗапись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока,
				"Номенклатура,Характеристика,Склад,Назначение,ЗаказНаОтгрузку,ЖелаемаяДатаОтгрузки");
			ЗаполнитьЗначенияСвойств(НоваяЗапись, График[ИндексВГрафике], "ЗаказНаПоступление,ДатаПоступления,Состояние");
			НоваяЗапись.Распределено = РаспределитьНаСтроку;
			
		КонецЦикла;
		
		Если НеОбеспечено > 0 Тогда
			
			НоваяЗапись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока,
				"Номенклатура,Характеристика,Склад,Назначение,ЗаказНаОтгрузку,ЖелаемаяДатаОтгрузки,Состояние");
			НоваяЗапись.НеОбеспечено = НеОбеспечено;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СостояниеСУчетомОтраженияИзменений(Заказ, ТаблицаДвижений, МенеджерВременныхТаблиц, ТаблицаИмитацияРеестра) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	УстановитьПривилегированныйРежим(Истина);
	
	//
	
	Запрос.УстановитьПараметр("ТаблицаИмитацияРеестра", ТаблицаИмитацияРеестра);
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказыРеестра.ЗаказНаОтгрузку КАК Ссылка,
		|	ЗаказыРеестра.Приоритет КАК Приоритет,
		|	ЗаказыРеестра.ДатаДокумента КАК ДатаДокументаИБ
		|ПОМЕСТИТЬ ТаблицаИмитацияРеестра
		|ИЗ
		|	&ТаблицаИмитацияРеестра КАК ЗаказыРеестра
		|;
		|
		|///////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыРеестра.Ссылка КАК Ссылка,
		|	ЗаказыРеестра.Приоритет КАК Приоритет,
		|	ЗаказыРеестра.ДатаДокументаИБ КАК ДатаДокументаИБ,
		|	ЛОЖЬ КАК ДополнительнаяЗапись
		|ПОМЕСТИТЬ РеестрДокументовСУчетомИзменений
		|ИЗ
		|	РегистрСведений.РеестрДокументов КАК ЗаказыРеестра
		|ГДЕ
		|	НЕ Ссылка В(
		|		ВЫБРАТЬ
		|			ЗаказыРеестра.Ссылка КАК Ссылка
		|		ИЗ
		|			ТаблицаИмитацияРеестра КАК ЗаказыРеестра)
		|		И НЕ ЗаказыРеестра.ДополнительнаяЗапись
		|		И ИСТИНА В(
		|			ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				РегистрСведений.РаспределениеЗапасов КАК Сведения
		|			ГДЕ
		|				Сведения.ЗаказНаОтгрузку = ЗаказыРеестра.Ссылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказыРеестра.Ссылка КАК Ссылка,
		|	ЗаказыРеестра.Приоритет КАК Приоритет,
		|	ЗаказыРеестра.ДатаДокументаИБ КАК ДатаДокументаИБ,
		|	ЛОЖЬ КАК ДополнительнаяЗапись
		|ИЗ
		|	ТаблицаИмитацияРеестра КАК ЗаказыРеестра";
	
	Запрос.Выполнить();
	
	//
	
	Запрос.УстановитьПараметр("НаборЗаписейРаспределениеЗапасовДвижения", ТаблицаДвижений);
	РаспределениеЗапасовДвижения.ДвиженияПриЗаписиВоВременнуюТаблицу(Запрос);
	
	Запрос.УстановитьПараметр("Регистратор", Заказ);
	РаспределениеЗапасовДвижения.РаспределениеЗапасовДвиженияИзменениеВоВременнуюТаблицу(Запрос);
	
	//
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Изменения.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку
		|ПОМЕСТИТЬ ИзмененныеЗаказыНаОтгрузку
		|ИЗ
		|	РаспределениеЗапасовДвиженияИзменение КАК Изменения
		|ГДЕ
		|	Изменения.КОбеспечению <> 0
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказНаОтгрузку
		|;
		|
		|///////////////////////////////
		|ВЫБРАТЬ
		|	Набор.Номенклатура         КАК Номенклатура,
		|	Набор.Характеристика       КАК Характеристика,
		|	Набор.Склад                КАК Склад,
		|	Набор.Назначение           КАК Назначение,
		|	Набор.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	Набор.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	СУММА(Набор.КОбеспечению)  КАК КОбеспечению
		|ИЗ(
		|	ВЫБРАТЬ
		|		ДанныеИБ.Номенклатура         КАК Номенклатура,
		|		ДанныеИБ.Характеристика       КАК Характеристика,
		|		ДанныеИБ.Склад                КАК Склад,
		|		ДанныеИБ.Назначение           КАК Назначение,
		|		ДанныеИБ.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|		ДанныеИБ.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|		ДанныеИБ.КОбеспечению         КАК КОбеспечению
		|	ИЗ
		|		ИзмененныеЗаказыНаОтгрузку КАК ЗаказыНаОтгрузку
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РаспределениеЗапасовДвижения КАК ДанныеИБ
		|			ПО ДанныеИБ.ЗаказНаОтгрузку = ЗаказыНаОтгрузку.ЗаказНаОтгрузку
		|	ГДЕ
		|		ДанныеИБ.КОбеспечению <> 0
		|			И НЕ ДанныеИБ.Регистратор В(&Регистратор)
		|			И ДанныеИБ.Активность
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Движения.Номенклатура         КАК Номенклатура,
		|		Движения.Характеристика       КАК Характеристика,
		|		Движения.Склад                КАК Склад,
		|		Движения.Назначение           КАК Назначение,
		|		Движения.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|		Движения.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|		Движения.КОбеспечению         КАК КОбеспечению
		|	ИЗ
		|		ИзмененныеЗаказыНаОтгрузку КАК ЗаказыНаОтгрузку
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияПриЗаписи КАК Движения
		|			ПО Движения.ЗаказНаОтгрузку = ЗаказыНаОтгрузку.ЗаказНаОтгрузку
		|	ГДЕ
		|		Движения.КОбеспечению <> 0) КАК Набор
		|СГРУППИРОВАТЬ ПО
		|	Набор.Номенклатура,
		|	Набор.Характеристика,
		|	Набор.Склад,
		|	Набор.Назначение,
		|	Набор.ЗаказНаОтгрузку,
		|	Набор.ЖелаемаяДатаОтгрузки
		|ИМЕЮЩИЕ
		|	СУММА(Набор.КОбеспечению) > 0
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказНаОтгрузку, Номенклатура, Характеристика, Склад, Назначение, ЖелаемаяДатаОтгрузки";
	ТаблицаКОбеспечению = Запрос.Выполнить().Выгрузить();
	ТаблицаКОбеспечению.Колонки.Добавить("КОбеспечениюИтогНаДату", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	
	ЗаказНаОтгрузку = Неопределено;
	Номенклатура = Неопределено; Характеристика = Неопределено; Склад = Неопределено; Назначение = Неопределено;
	Итог = 0;
	
	Для Индекс = 0 По ТаблицаКОбеспечению.Количество() - 1 Цикл
		
		Строка = ТаблицаКОбеспечению[Индекс];
		
		Если ЗаказНаОтгрузку <> Строка.ЗаказНаОтгрузку
			Или Строка.Номенклатура <> Номенклатура
			Или Строка.Характеристика <> Строка.Номенклатура
			Или Строка.Склад <> Склад
			Или Строка.Назначение <> Назначение Тогда
			
			ЗаказНаОтгрузку     = Строка.ЗаказНаОтгрузку;
			Номенклатура        = Строка.Номенклатура;
			Характеристика      = Строка.Характеристика;
			Склад               = Строка.Склад;
			Назначение          = Строка.Назначение;
			Итог = 0;
			
		КонецЕсли;
		
		Итог = Итог + Строка.КОбеспечению;
		Строка.КОбеспечениюИтогНаДату = Итог;
		
	КонецЦикла;
	
	//
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Изменения.ЗаказНаПоступление КАК ЗаказНаПоступление
		|ПОМЕСТИТЬ ИзмененныеЗаказыНаПоступление
		|ИЗ
		|	РаспределениеЗапасовДвиженияИзменение КАК Изменения
		|ГДЕ
		|	Изменения.ПоступитКДате <> 0
		|		ИЛИ Изменения.ПоставкаНаСогласовании <> 0
		|		ИЛИ Изменения.ЗакрытьГрафикПоступления <> 0
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказНаПоступление
		|;
		|
		|///////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеИБ.Номенклатура             КАК Номенклатура,
		|	ДанныеИБ.Характеристика           КАК Характеристика,
		|	ДанныеИБ.Склад                    КАК Склад,
		|	ДанныеИБ.Назначение               КАК Назначение,
		|	ДанныеИБ.ЗаказНаПоступление       КАК ЗаказНаПоступление,
		|	ДанныеИБ.ДатаПоступления          КАК ДатаПоступления,
		|	ДанныеИБ.ПоставкаНаСогласовании   КАК ПоставкаНаСогласовании,
		|	ДанныеИБ.ПоступитКДате            КАК ПоступитКДате,
		|	ДанныеИБ.ЗакрытьГрафикПоступления КАК ЗакрытьГрафикПоступления
		|ПОМЕСТИТЬ ДанныеСУчетомИзменений
		|ИЗ
		|	ИзмененныеЗаказыНаПоступление КАК ЗаказыНаПоступление
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РаспределениеЗапасовДвижения КАК ДанныеИБ
		|		ПО ДанныеИБ.ЗаказНаПоступление = ЗаказыНаПоступление.ЗаказНаПоступление
		|ГДЕ
		|	ДанныеИБ.Активность
		|		И НЕ ДанныеИБ.Регистратор В(&Регистратор)
		|		И (ДанныеИБ.ПоступитКДате <> 0
		|			ИЛИ ДанныеИБ.ПоставкаНаСогласовании <> 0
		|			ИЛИ ДанныеИБ.ЗакрытьГрафикПоступления <> 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДвиженияПриЗаписи.Номенклатура             КАК Номенклатура,
		|	ДвиженияПриЗаписи.Характеристика           КАК Характеристика,
		|	ДвиженияПриЗаписи.Склад                    КАК Склад,
		|	ДвиженияПриЗаписи.Назначение               КАК Назначение,
		|	ДвиженияПриЗаписи.ЗаказНаПоступление       КАК ЗаказНаПоступление,
		|	ДвиженияПриЗаписи.ДатаПоступления          КАК ДатаПоступления,
		|	ДвиженияПриЗаписи.ПоставкаНаСогласовании   КАК ПоставкаНаСогласовании,
		|	ДвиженияПриЗаписи.ПоступитКДате            КАК ПоступитКДате,
		|	ДвиженияПриЗаписи.ЗакрытьГрафикПоступления КАК ЗакрытьГрафикПоступления
		|ИЗ
		|	ДвиженияПриЗаписи КАК ДвиженияПриЗаписи
		|ГДЕ
		|	ДвиженияПриЗаписи.ПоступитКДате <> 0
		|		ИЛИ ДвиженияПриЗаписи.ПоставкаНаСогласовании <> 0
		|		ИЛИ ДвиженияПриЗаписи.ЗакрытьГрафикПоступления <> 0
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказНаПоступление, Номенклатура, Характеристика, Склад, Назначение
		|;
		|
		|///////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Движения.ЗаказНаПоступление КАК ЗаказНаПоступление,
		|	Движения.Номенклатура       КАК Номенклатура,
		|	Движения.Характеристика     КАК Характеристика,
		|	Движения.Склад              КАК Склад,
		|	Движения.Назначение         КАК Назначение,
		|	
		|	СУММА(Движения.ПоставкаНаСогласовании + Движения.ПоступитКДате - Движения.ЗакрытьГрафикПоступления) КАК Количество
		|	
		|ПОМЕСТИТЬ ОстаткиПланируемыхПоступлений
		|ИЗ
		|	ДанныеСУчетомИзменений КАК Движения
		|СГРУППИРОВАТЬ ПО
		|	Движения.ЗаказНаПоступление,
		|	Движения.Номенклатура,
		|	Движения.Характеристика,
		|	Движения.Склад,
		|	Движения.Назначение
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказНаПоступление, Номенклатура, Характеристика, Склад, Назначение
		|;
		|
		|////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.Номенклатура       КАК Номенклатура,
		|	Остатки.Характеристика     КАК Характеристика,
		|	Остатки.Склад              КАК Склад,
		|	Остатки.Назначение         КАК Назначение,
		|	Остатки.ЗаказНаПоступление КАК ЗаказНаПоступление,
		|
		|	ВЫБОР КОГДА Движения.ДатаПоступления <> ДАТАВРЕМЯ(1, 1, 1) ТОГДА
		|				ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление)
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеподтвержденное)
		|		КОНЕЦ КАК Состояние,
		|	
		|	Движения.ДатаПоступления КАК ДатаПоступления,
		|	МАКСИМУМ(Остатки.Количество) КАК Распределить,
		|	СУММА(Движения.ПоставкаНаСогласовании + Движения.ПоступитКДате) КАК Запас
		|ИЗ
		|	ОстаткиПланируемыхПоступлений КАК Остатки
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеСУчетомИзменений КАК Движения
		|		ПО Движения.Номенклатура         = Остатки.Номенклатура
		|		 И Движения.Характеристика       = Остатки.Характеристика
		|		 И Движения.Склад                = Остатки.Склад
		|		 И Движения.Назначение           = Остатки.Назначение
		|		 И Движения.ЗаказНаПоступление   = Остатки.ЗаказНаПоступление
		|ГДЕ
		|	Остатки.Количество > 0
		|СГРУППИРОВАТЬ ПО
		|	Остатки.ЗаказНаПоступление,
		|	Остатки.Номенклатура,
		|	Остатки.Характеристика,
		|	Остатки.Склад,
		|	Остатки.Назначение,
		|	Движения.ДатаПоступления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказНаПоступление, Номенклатура, Характеристика, Склад, Назначение, ДатаПоступления УБЫВ";
	ТаблицаОжидаемыхПоступлений = Запрос.Выполнить().Выгрузить();
	
	ТаблицаОжидаемыхПоступлений.Колонки.Добавить("Пустая");
	ЗаказНаПоступление = Неопределено;
	Номенклатура = Неопределено; Характеристика = Неопределено; Склад = Неопределено; Назначение = Неопределено;
	Распределить = 0;
	
	Для Индекс = 0 По ТаблицаОжидаемыхПоступлений.Количество() - 1 Цикл
		
		Строка = ТаблицаОжидаемыхПоступлений[Индекс];
		
		Если ЗаказНаПоступление <> Строка.ЗаказНаПоступление
			Или Строка.Номенклатура <> Номенклатура
			Или Строка.Характеристика <> Строка.Номенклатура
			Или Строка.Склад <> Склад
			Или Строка.Назначение <> Назначение Тогда
			
			ЗаказНаПоступление  = Строка.ЗаказНаПоступление;
			Номенклатура        = Строка.Номенклатура;
			Характеристика      = Строка.Характеристика;
			Склад               = Строка.Склад;
			Назначение          = Строка.Назначение;
			Распределить = Строка.Распределить;
			
		КонецЕсли;
		
		Запас = Макс(Мин(Распределить, Строка.Запас), 0);
		Распределить = Распределить - Запас;
		Строка.Запас = Запас;
		Строка.Пустая = Запас = 0;
		
	КонецЦикла;
	
	ТаблицаОжидаемыхПоступлений = ТаблицаОжидаемыхПоступлений.Скопировать(Новый Структура("Пустая", Ложь));
	
	//
	
	Запрос.УстановитьПараметр("ТаблицаКОбеспечению", ТаблицаКОбеспечению);
	Запрос.УстановитьПараметр("ТаблицаОжидаемыхПоступлений", ТаблицаОжидаемыхПоступлений);
	Текст =
		"ВЫБРАТЬ
		|	Таблица.Номенклатура           КАК Номенклатура,
		|	Таблица.Характеристика         КАК Характеристика,
		|	Таблица.Склад                  КАК Склад,
		|	Таблица.Назначение             КАК Назначение,
		|	Таблица.ЗаказНаОтгрузку        КАК ЗаказНаОтгрузку,
		|	Таблица.ЖелаемаяДатаОтгрузки   КАК ЖелаемаяДатаОтгрузки,
		|	Таблица.КОбеспечению           КАК КОбеспечению,
		|	Таблица.КОбеспечениюИтогНаДату КАК КОбеспечениюИтогНаДату
		|ПОМЕСТИТЬ ТаблицаКОбеспечениюСУчетомИзменений
		|ИЗ
		|	&ТаблицаКОбеспечению КАК Таблица
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение
		|;
		|
		|///////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таблица.Номенклатура           КАК Номенклатура,
		|	Таблица.Характеристика         КАК Характеристика,
		|	Таблица.Склад                  КАК Склад
		|ПОМЕСТИТЬ РазличныеТоварыБезНазначений
		|ИЗ
		|	ТаблицаКОбеспечениюСУчетомИзменений КАК Таблица
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад
		|;
		|
		|/////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Склад КАК Склад,
		|	РасчетПереопределяемый.ГраницаПериода КАК ГраницаПериода
		|ПОМЕСТИТЬ ГраницыПериодаОбеспечения
		|ИЗ
		|	РазличныеТоварыБезНазначений КАК Товары
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетПереопределяемый ПО ИСТИНА
		|		
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад
		|;
		|
		|/////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.Состояние              КАК Состояние,
		|	Таблица.Номенклатура           КАК Номенклатура,
		|	Таблица.Характеристика         КАК Характеристика,
		|	Таблица.Склад                  КАК Склад,
		|	Таблица.Назначение             КАК Назначение,
		|	Таблица.ЗаказНаПоступление     КАК ЗаказНаПоступление,
		|	Таблица.ДатаПоступления        КАК ДатаПоступления,
		|	Таблица.Запас                  КАК Запас
		|ПОМЕСТИТЬ ТаблицаОжидаемыхПоступленийСУчетомИзменений
		|ИЗ
		|	&ТаблицаОжидаемыхПоступлений КАК Таблица
		|;
		|
		|//////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзмененияДвижений.Номенклатура          КАК Номенклатура,
		|	ИзмененияДвижений.Характеристика        КАК Характеристика,
		|	ИзмененияДвижений.Склад                 КАК Склад,
		|	ИзмененияДвижений.Назначение            КАК Назначение,
		|	СУММА(ИзмененияДвижений.Отгрузить)      КАК Отгрузить,
		|	СУММА(ИзмененияДвижений.Резервировать)  КАК Резервировать,
		|	СУММА(ИзмененияДвижений.Поступило)      КАК Поступило
		|ПОМЕСТИТЬ ИзмененияПоТовару
		|ИЗ
		|	РаспределениеЗапасовДвиженияИзменение КАК ИзмененияДвижений
		|СГРУППИРОВАТЬ ПО
		|	ИзмененияДвижений.Номенклатура,
		|	ИзмененияДвижений.Характеристика,
		|	ИзмененияДвижений.Склад,
		|	ИзмененияДвижений.Назначение
		|;
		|
		|////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка) КАК Состояние,
		|	Таблица.Номенклатура           КАК Номенклатура,
		|	Таблица.Характеристика         КАК Характеристика,
		|	Таблица.Склад                  КАК Склад,
		|	Таблица.Назначение             КАК Назначение,
		|	Таблица.ЗаказНаОтгрузку        КАК ЗаказНаОтгрузку,
		|	Таблица.ЖелаемаяДатаОтгрузки   КАК ЖелаемаяДатаОтгрузки,
		|	НЕОПРЕДЕЛЕНО                   КАК ЗаказНаПоступление,
		|	ДАТАВРЕМЯ(1, 1, 1)             КАК ДатаПоступления,
		|	ВЫБОР КОГДА Границы.ГраницаПериода = ДАТАВРЕМЯ(1,1,1)
		|					ИЛИ Границы.ГраницаПериода >= Таблица.ЖелаемаяДатаОтгрузки ТОГДА
		|				Таблица.КОбеспечению
		|			ИНАЧЕ
		|				0
		|		КОНЕЦ КАК КОбеспечению,
		|	ВЫБОР КОГДА Границы.ГраницаПериода = ДАТАВРЕМЯ(1,1,1)
		|					ИЛИ Границы.ГраницаПериода >= Таблица.ЖелаемаяДатаОтгрузки ТОГДА
		|				0
		|			ИНАЧЕ
		|				Таблица.КОбеспечению
		|		КОНЕЦ КАК ОтложитьОбеспечение,
		|	ВЫБОР КОГДА Границы.ГраницаПериода = ДАТАВРЕМЯ(1,1,1)
		|					ИЛИ Границы.ГраницаПериода >= Таблица.ЖелаемаяДатаОтгрузки ТОГДА
		|				Таблица.КОбеспечениюИтогНаДату
		|			ИНАЧЕ
		|				0
		|		КОНЕЦ КАК КОбеспечениюИтогНаДату,
		|	0                              КАК Запас,
		|	0                              КАК Резерв,
		|	0                              КАК Свободно,
		|	0                              КАК Распределено
		|ПОМЕСТИТЬ РаспределениеЗапасовСУчетомИзменений
		|ИЗ
		|	ИзмененияПоТовару КАК ИзмененияПоТовару
		|		
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКОбеспечениюСУчетомИзменений КАК Таблица
		|		ПО Таблица.Номенклатура = ИзмененияПоТовару.Номенклатура
		|		 И Таблица.Характеристика = ИзмененияПоТовару.Характеристика
		|		 И Таблица.Склад = ИзмененияПоТовару.Склад
		|		 И Таблица.Назначение = ИзмененияПоТовару.Назначение
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГраницыПериодаОбеспечения КАК Границы
		|		ПО Границы.Номенклатура = ИзмененияПоТовару.Номенклатура
		|		 И Границы.Характеристика = ИзмененияПоТовару.Характеристика
		|		 И Границы.Склад = ИзмененияПоТовару.Склад
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.Состояние              КАК Состояние,
		|	Таблица.Номенклатура           КАК Номенклатура,
		|	Таблица.Характеристика         КАК Характеристика,
		|	Таблица.Склад                  КАК Склад,
		|	Таблица.Назначение             КАК Назначение,
		|	Таблица.ЗаказНаОтгрузку        КАК ЗаказНаОтгрузку,
		|	Таблица.ЖелаемаяДатаОтгрузки   КАК ЖелаемаяДатаОтгрузки,
		|	НЕОПРЕДЕЛЕНО                   КАК ЗаказНаПоступление,
		|	ДАТАВРЕМЯ(1, 1, 1)             КАК ДатаПоступления,
		|	Таблица.КОбеспечению           КАК КОбеспечению,
		|	0                              КАК ОтложитьОбеспечение,
		|	Таблица.КОбеспечениюИтогНаДату КАК КОбеспечениюИтогНаДату,
		|	0                              КАК Запас,
		|	0                              КАК Резерв,
		|	0                              КАК Свободно,
		|	0                              КАК Распределено
		|ИЗ
		|	ИзмененияПоТовару КАК Изменения
		|		
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК Таблица
		|		ПО Таблица.Номенклатура   = Изменения.Номенклатура
		|		 И Таблица.Характеристика = Изменения.Характеристика
		|		 И Таблица.Склад          = Изменения.Склад
		|		 И Таблица.Назначение     = Изменения.Назначение
		|		 И Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
		|		 И Таблица.КОбеспечению <> 0
		|ГДЕ
		|	НЕ Таблица.ЗаказНаОтгрузку В(
		|		ВЫБРАТЬ
		|			ЗаказыНаОтгрузку.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку
		|		ИЗ
		|			ИзмененныеЗаказыНаОтгрузку КАК ЗаказыНаОтгрузку)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.Состояние              КАК Состояние,
		|	Таблица.Номенклатура           КАК Номенклатура,
		|	Таблица.Характеристика         КАК Характеристика,
		|	Таблица.Склад                  КАК Склад,
		|	Таблица.Назначение             КАК Назначение,
		|	НЕОПРЕДЕЛЕНО                   КАК ЗаказНаОтгрузку,
		|	ДАТАВРЕМЯ(1, 1, 1)             КАК ЖелаемаяДатаОтгрузки,
		|	Таблица.ЗаказНаПоступление     КАК ЗаказНаПоступление,
		|	Таблица.ДатаПоступления        КАК ДатаПоступления,
		|	0                              КАК КОбеспечению,
		|	0                              КАК ОтложитьОбеспечение,
		|	0                              КАК КОбеспечениюИтогНаДату,
		|	Таблица.Запас                  КАК Запас,
		|	0                              КАК Резерв,
		|	0                              КАК Свободно,
		|	0                              КАК Распределено
		|ИЗ
		|	ИзмененияПоТовару КАК ИзмененияПоТовару
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОжидаемыхПоступленийСУчетомИзменений КАК Таблица
		|		ПО Таблица.Номенклатура = ИзмененияПоТовару.Номенклатура
		|		 И Таблица.Характеристика = ИзмененияПоТовару.Характеристика
		|		 И Таблица.Склад = ИзмененияПоТовару.Склад
		|		 И Таблица.Назначение = ИзмененияПоТовару.Назначение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.Состояние              КАК Состояние,
		|	Таблица.Номенклатура           КАК Номенклатура,
		|	Таблица.Характеристика         КАК Характеристика,
		|	Таблица.Склад                  КАК Склад,
		|	Таблица.Назначение             КАК Назначение,
		|	НЕОПРЕДЕЛЕНО                   КАК ЗаказНаОтгрузку,
		|	ДАТАВРЕМЯ(1, 1, 1)             КАК ЖелаемаяДатаОтгрузки,
		|	Таблица.ЗаказНаПоступление     КАК ЗаказНаПоступление,
		|	Таблица.ДатаПоступления        КАК ДатаПоступления,
		|	0                              КАК КОбеспечению,
		|	0                              КАК ОтложитьОбеспечение,
		|	0                              КАК КОбеспечениюИтогНаДату,
		|	Таблица.Запас                  КАК Запас,
		|	0                              КАК Резерв,
		|	0                              КАК Свободно,
		|	0                              КАК Распределено
		|ИЗ
		|	ИзмененияПоТовару КАК Изменения
		|		
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК Таблица
		|		ПО Таблица.Номенклатура   = Изменения.Номенклатура
		|		 И Таблица.Характеристика = Изменения.Характеристика
		|		 И Таблица.Склад          = Изменения.Склад
		|		 И Таблица.Назначение     = Изменения.Назначение
		|		 И Таблица.Состояние В(
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеподтвержденное))
		|ГДЕ
		|	НЕ Таблица.ЗаказНаПоступление В(
		|		ВЫБРАТЬ
		|			ЗаказыНаПоступление.ЗаказНаПоступление КАК ЗаказНаПоступление
		|		ИЗ
		|			ИзмененныеЗаказыНаПоступление КАК ЗаказыНаПоступление)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе) КАК Состояние,
		|	Таблица.Номенклатура        КАК Номенклатура,
		|	Таблица.Характеристика      КАК Характеристика,
		|	Таблица.Склад               КАК Склад,
		|	Таблица.Назначение          КАК Назначение,
		|	НЕОПРЕДЕЛЕНО                КАК ЗаказНаОтгрузку,
		|	ДАТАВРЕМЯ(1, 1, 1)          КАК ЖелаемаяДатаОтгрузки,
		|	НЕОПРЕДЕЛЕНО                КАК ЗаказНаПоступление,
		|	ДАТАВРЕМЯ(1, 1, 1)          КАК ДатаПоступления,
		|	0                           КАК КОбеспечению,
		|	0                           КАК ОтложитьОбеспечение,
		|	0                           КАК КОбеспечениюИтогНаДату,
		|	Таблица.Поступило - Таблица.Отгрузить + ЕСТЬNULL(ДанныеИБ.Запас, 0) КАК Запас,
		|	Таблица.Резервировать + ЕСТЬNULL(ДанныеИБ.Резерв, 0) КАК Резерв,
		|	0 КАК Свободно,
		|	0 КАК Распределено
		|ИЗ
		|	ИзмененияПоТовару КАК Таблица
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ДанныеИБ
		|		ПО ДанныеИБ.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
		|		 И ДанныеИБ.Номенклатура   = Таблица.Номенклатура
		|		 И ДанныеИБ.Характеристика = Таблица.Характеристика
		|		 И ДанныеИБ.Склад          = Таблица.Склад
		|		 И ДанныеИБ.Назначение     = Таблица.Назначение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе) КАК Состояние,
		|	Таблица.Номенклатура          КАК Номенклатура,
		|	Таблица.Характеристика        КАК Характеристика,
		|	Таблица.Склад                 КАК Склад,
		|	Таблица.Назначение            КАК Назначение,
		|	Сведения.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	Сведения.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	НЕОПРЕДЕЛЕНО                  КАК ЗаказНаПоступление,
		|	ДАТАВРЕМЯ(1, 1, 1)            КАК ДатаПоступления,
		|	0                             КАК КОбеспечению,
		|	0                             КАК ОтложитьОбеспечение,
		|	0                             КАК КОбеспечениюИтогНаДату,
		|	0                             КАК Запас,
		|	0                             КАК Резерв,
		|	0                             КАК Свободно,
		|	Сведения.Распределено         КАК Распределено
		|ИЗ
		|	ИзмененияПоТовару КАК Таблица
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК Сведения
		|		ПО Сведения.Номенклатура   = Таблица.Номенклатура
		|		 И Сведения.Характеристика = Таблица.Характеристика
		|		 И Сведения.Склад          = Таблица.Склад
		|		 И Сведения.Назначение     = Таблица.Назначение
		|		 И Сведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе)
		|ГДЕ
		|	НЕ Сведения.Номенклатура ЕСТЬ NULL
		|	
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, Состояние, ЗаказНаОтгрузку, ЖелаемаяДатаОтгрузки, ЗаказНаПоступление, ДатаПоступления
		|;
		|///////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаОжидаемыхПоступленийСУчетомИзменений;
		|УНИЧТОЖИТЬ ГраницыПериодаОбеспечения;
		|УНИЧТОЖИТЬ РазличныеТоварыБезНазначений";
	
	Подстановки = ОбеспечениеВДокументахСервер.ПодстановкиГраницыОбеспечиваемогоПериода(
		"Товары.Номенклатура", "Товары.Характеристика", "Товары.Склад", "&НачалоТекущегоДня", "ИСТИНА");
	
	Текст = СтрЗаменить(Текст, "РасчетПереопределяемый.ГраницаПериода",             Подстановки.Поле);
	Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетПереопределяемый ПО ИСТИНА", Подстановки.Соединения);
	Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДатаСеанса()));
	
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.Выполнить();
	
	// Расчет свободного остатка
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РазличныеТовары.Номенклатура                                         КАК Номенклатура,
		|	РазличныеТовары.Характеристика                                       КАК Характеристика,
		|	РазличныеТовары.Склад                                                КАК Склад,
		|	РазличныеТовары.Назначение                                           КАК Назначение,
		|	СУММА(ЕСТЬNULL(ОжидаемаяОтгрузка.КОбеспечению, 0))                   КАК Количество
		|ПОМЕСТИТЬ Потребности
		|ИЗ
		|	ИзмененияПоТовару КАК РазличныеТовары
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеЗапасовСУчетомИзменений КАК ОжидаемаяОтгрузка
		|		ПО ОжидаемаяОтгрузка.Номенклатура    = РазличныеТовары.Номенклатура
		|		 И ОжидаемаяОтгрузка.Характеристика  = РазличныеТовары.Характеристика
		|		 И ОжидаемаяОтгрузка.Склад           = РазличныеТовары.Склад
		|		 И ОжидаемаяОтгрузка.Назначение      = РазличныеТовары.Назначение
		|		 И ОжидаемаяОтгрузка.Состояние       = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
		|		 И ОжидаемаяОтгрузка.КОбеспечению > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	РазличныеТовары.Номенклатура,
		|	РазличныеТовары.Характеристика,
		|	РазличныеТовары.Склад,
		|	РазличныеТовары.Назначение
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение
		|;
		|
		|/////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Потребности.Количество         КАК Количество,
		|	Остатки.Состояние              КАК Состояние,
		|	1                              КАК ТипЗаписиРаспределенияЗапасов,
		|	Остатки.Номенклатура           КАК Номенклатура,
		|	Остатки.Характеристика         КАК Характеристика,
		|	Остатки.Склад                  КАК Склад,
		|	Остатки.Назначение             КАК Назначение,
		|	Остатки.ЗаказНаПоступление     КАК ЗаказНаПоступление,
		|	Остатки.ДатаПоступления        КАК ДатаПоступления,
		|	Остатки.Запас                  КАК Запас,
		|	Остатки.Резерв                 КАК Резерв,
		|	Остатки.Свободно               КАК Свободно,
		|	ВЫБОР КОГДА Остатки.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе) ТОГДА
		|					1
		|				КОГДА Остатки.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление) ТОГДА
		|					2
		|				КОГДА Остатки.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеподтвержденное) ТОГДА
		|					3
		|		КОНЕЦ КАК Порядок
		|ИЗ
		|	Потребности КАК Потребности
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспределениеЗапасовСУчетомИзменений КАК Остатки
		|		ПО Остатки.Номенклатура    = Потребности.Номенклатура
		|		 И Остатки.Характеристика  = Потребности.Характеристика
		|		 И Остатки.Склад           = Потребности.Склад
		|		 И Остатки.Назначение      = Потребности.Назначение
		|		 И Остатки.Состояние       В(
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеподтвержденное))
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, Порядок, ДатаПоступления, ЗаказНаПоступление
		|;
		|
		|/////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Потребности";
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Выборка = Пакет[1].Выбрать();
	
	Количество = 0;
	
	ТаблицаОстатков = РегистрыСведений.РаспределениеЗапасов.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	Номенклатура   = Неопределено;
	Характеристика = Неопределено;
	Склад          = Неопределено;
	Назначение     = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Номенклатура <> Номенклатура
				Или Выборка.Характеристика <> Характеристика
				Или Выборка.Склад <> Склад
				Или Выборка.Назначение <> Назначение Тогда
				
				Количество = Выборка.Количество;
				
		КонецЕсли;
		
		КоличествоРаспределить = Мин(Количество, Макс(Выборка.Запас - Выборка.Резерв, 0));
		Свободно = Выборка.Запас - Выборка.Резерв - КоличествоРаспределить;
		Количество = Количество - КоличествоРаспределить;
		
		Если Выборка.Запас <> 0
				Или Выборка.Резерв <> 0
				Или Свободно <> 0 Тогда
				
			НоваяСтрока = ТаблицаОстатков.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Свободно = Свободно;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Распределение запасов
	Набор = РегистрыСведений.РаспределениеЗапасов.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	Текст = ТекстЗапросаРаспределенияЗапасов();
	Текст = СтрЗаменить(Текст, "РегистрСведений.РаспределениеЗапасов", "РаспределениеЗапасовСУчетомИзменений");
	Текст = СтрЗаменить(Текст, "РегистрСведений.РеестрДокументов", "РеестрДокументовСУчетомИзменений");
	Запрос.Текст = СтрЗаменить(Текст, "ТоварыДляРаспределенияЗапасов", "ИзмененияПоТовару");
	Пакет = Запрос.ВыполнитьПакет();
	
	Таблица = Пакет[8].Выгрузить();
	График = Пакет[9].Выгрузить();
	
	РаспределитьЗапасыВТаблицу(Набор, Таблица, График, Ложь);
	
	Запрос.УстановитьПараметр("Набор", Набор);
	Запрос.УстановитьПараметр("ТаблицаОстатков", ТаблицаОстатков);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.Состояние            КАК Состояние,
		|	Таблица.Номенклатура         КАК Номенклатура,
		|	Таблица.Характеристика       КАК Характеристика,
		|	Таблица.Склад                КАК Склад,
		|	Таблица.Назначение           КАК Назначение,
		|	Таблица.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	Таблица.ЗаказНаПоступление   КАК ЗаказНаПоступление,
		|	Таблица.ДатаПоступления      КАК ДатаПоступления,
		|	Таблица.Распределено         КАК Распределено,
		|	Таблица.НеОбеспечено         КАК НеОбеспечено
		|ПОМЕСТИТЬ Набор
		|ИЗ
		|	&Набор КАК Таблица
		|;
		|//////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	Таблица.Состояние            КАК Состояние,
		|	Таблица.Номенклатура         КАК Номенклатура,
		|	Таблица.Характеристика       КАК Характеристика,
		|	Таблица.Склад                КАК Склад,
		|	Таблица.Назначение           КАК Назначение,
		|	Таблица.ЗаказНаПоступление   КАК ЗаказНаПоступление,
		|	Таблица.ДатаПоступления      КАК ДатаПоступления,
		|	Таблица.Запас                КАК Запас,
		|	Таблица.Резерв               КАК Резерв,
		|	Таблица.Свободно             КАК Свободно
		|ПОМЕСТИТЬ ТаблицаОстатков
		|ИЗ
		|	&ТаблицаОстатков КАК Таблица";
	Запрос.Выполнить();
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК РезервПревышаетОстатки,
		|	Таблица.Состояние            КАК Состояние,
		|	Таблица.Номенклатура         КАК Номенклатура,
		|	Таблица.Характеристика       КАК Характеристика,
		|	Таблица.Склад                КАК Склад,
		|	Таблица.Назначение           КАК Назначение,
		|	Таблица.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	Таблица.ЗаказНаПоступление   КАК ЗаказНаПоступление,
		|	Таблица.ДатаПоступления      КАК ДатаПоступления,
		|	Таблица.Распределено         КАК Распределено,
		|	Таблица.НеОбеспечено         КАК НеОбеспечено,
		|	0                            КАК Запас,
		|	0                            КАК Свободно,
		|	0                            КАК Резерв
		|ПОМЕСТИТЬ ИмитацияОтражения
		|ИЗ
		|	Набор КАК Таблица
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК РезервПревышаетОстатки,
		|	Таблица.Состояние            КАК Состояние,
		|	Таблица.Номенклатура         КАК Номенклатура,
		|	Таблица.Характеристика       КАК Характеристика,
		|	Таблица.Склад                КАК Склад,
		|	Таблица.Назначение           КАК Назначение,
		|	НЕОПРЕДЕЛЕНО                 КАК ЗаказНаОтгрузку,
		|	ДАТАВРЕМЯ(1, 1, 1)           КАК ЖелаемаяДатаОтгрузки,
		|	Таблица.ЗаказНаПоступление   КАК ЗаказНаПоступление,
		|	Таблица.ДатаПоступления      КАК ДатаПоступления,
		|	0                            КАК Распределено,
		|	0                            КАК НеОбеспечено,
		|	Таблица.Запас                КАК Запас,
		|	Таблица.Свободно             КАК Свободно,
		|	Таблица.Резерв               КАК Резерв
		|
		|ИЗ
		|	ТаблицаОстатков КАК Таблица
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК РезервПревышаетОстатки,
		|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве) КАК Состояние,
		|	Движения.Номенклатура         КАК Номенклатура,
		|	Движения.Характеристика       КАК Характеристика,
		|	Движения.Склад                КАК Склад,
		|	Движения.Назначение           КАК Назначение,
		|	Движения.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	Движения.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	НЕОПРЕДЕЛЕНО                  КАК ЗаказНаПоступление,
		|	ДАТАВРЕМЯ(1, 1, 1)            КАК ДатаПоступления,
		|	Движения.Резервировать        КАК Распределено,
		|	0                             КАК НеОбеспечено,
		|	0                             КАК Запас,
		|	0                             КАК Свободно,
		|	0                             КАК Резерв
		|ИЗ
		|	ИзмененияПоТовару КАК Изменения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияПриЗаписи КАК Движения
		|		ПО Движения.Номенклатура = Изменения.Номенклатура
		|		 И Движения.Характеристика = Изменения.Характеристика
		|		 И Движения.Склад = Изменения.Склад
		|		 И Движения.Назначение = Изменения.Назначение
		|ГДЕ
		|	Движения.Резервировать <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК РезервПревышаетОстатки,
		|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.НеОбеспечивать) КАК Состояние,
		|	Движения.Номенклатура         КАК Номенклатура,
		|	Движения.Характеристика       КАК Характеристика,
		|	Движения.Склад                КАК Склад,
		|	Движения.Назначение           КАК Назначение,
		|	Движения.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	Движения.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	НЕОПРЕДЕЛЕНО                  КАК ЗаказНаПоступление,
		|	ДАТАВРЕМЯ(1, 1, 1)            КАК ДатаПоступления,
		|	0                             КАК Распределено,
		|	Движения.НеОбеспечивать       КАК НеОбеспечено,
		|	0                             КАК Запас,
		|	0                             КАК Свободно,
		|	0                             КАК Резерв
		|ИЗ
		|	ИзмененияПоТовару КАК Изменения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияПриЗаписи КАК Движения
		|		ПО Движения.Номенклатура = Изменения.Номенклатура
		|		 И Движения.Характеристика = Изменения.Характеристика
		|		 И Движения.Склад = Изменения.Склад
		|		 И Движения.Назначение = Изменения.Назначение
		|ГДЕ
		|	Движения.НеОбеспечивать <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК РезервПревышаетОстатки,
		|	Сведения.Состояние            КАК Состояние,
		|	Сведения.Номенклатура         КАК Номенклатура,
		|	Сведения.Характеристика       КАК Характеристика,
		|	Сведения.Склад                КАК Склад,
		|	Сведения.Назначение           КАК Назначение,
		|	Сведения.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	Сведения.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	Сведения.ЗаказНаПоступление   КАК ЗаказНаПоступление,
		|	Сведения.ДатаПоступления      КАК ДатаПоступления,
		|	Сведения.Распределено         КАК Распределено,
		|	Сведения.НеОбеспечено         КАК НеОбеспечено,
		|	0                             КАК Запас,
		|	0                             КАК Свободно,
		|	0                             КАК Резерв
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК Сведения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИзмененияПоТовару КАК Изменения
		|		ПО Изменения.Номенклатура = Сведения.Номенклатура
		|		 И Изменения.Характеристика = Сведения.Характеристика
		|		 И Изменения.Склад = Сведения.Склад
		|		 И Изменения.Назначение = Сведения.Назначение
		|ГДЕ
		|	Сведения.ЗаказНаОтгрузку В(&Заказ)
		|		И Изменения.Номенклатура ЕСТЬ NULL
		|		И Сведения.Состояние В(
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченКДате),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.Обеспечить),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОтложитьОбеспечение),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.НеОбеспечивать),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК РезервПревышаетОстатки,
		|	Сведения.Состояние            КАК Состояние,
		|	Сведения.Номенклатура         КАК Номенклатура,
		|	Сведения.Характеристика       КАК Характеристика,
		|	Сведения.Склад                КАК Склад,
		|	Сведения.Назначение           КАК Назначение,
		|	Сведения.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	Сведения.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	Сведения.ЗаказНаПоступление   КАК ЗаказНаПоступление,
		|	Сведения.ДатаПоступления      КАК ДатаПоступления,
		|	0                             КАК Распределено,
		|	0                             КАК НеОбеспечено,
		|	Сведения.Запас                КАК Запас,
		|	Сведения.Свободно             КАК Свободно,
		|	Сведения.Резерв               КАК Резерв
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК Сведения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИзмененияПоТовару КАК Изменения
		|		ПО Изменения.Номенклатура = Сведения.Номенклатура
		|		 И Изменения.Характеристика = Сведения.Характеристика
		|		 И Изменения.Склад = Сведения.Склад
		|		 И Изменения.Назначение = Сведения.Назначение
		|ГДЕ
		|	Изменения.Номенклатура ЕСТЬ NULL
		|		И Сведения.Состояние В(
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеподтвержденное),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе))
		|		И ИСТИНА В(
		|			ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА КАК ЕстьЗаписи
		|			ИЗ
		|				ТаблицаКОбеспечениюСУчетомИзменений КАК Таблица
		|			ГДЕ
		|				Таблица.Номенклатура = Сведения.Номенклатура
		|					И Таблица.Характеристика = Сведения.Характеристика
		|					И Таблица.Склад = Сведения.Склад
		|					И Таблица.Назначение = Сведения.Назначение)
		|;
		|УНИЧТОЖИТЬ ТаблицаКОбеспечениюСУчетомИзменений";
		
	Запрос.Выполнить();
	
КонецПроцедуры

//++ НЕ УТКА

Процедура РаспределениеЗапасовНаЗаказыВыбраннойОчереди(Заказы, Приоритет, МенеджерВременныхТаблиц) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Заказ", Заказы);
	Запрос.УстановитьПараметр("Приоритет", Приоритет);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таблица.Номенклатура   КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад          КАК Склад,
		|	Таблица.Назначение     КАК Назначение
		|ПОМЕСТИТЬ ТоварыДляРаспределенияЗапасов
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК Таблица
		|ГДЕ
		|	Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
		|		И Таблица.ЗаказНаОтгрузку В(&Заказ)
		|		И ИСТИНА В(
		|			ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА КАК ЭтоПроизводимыйПолуфабрикат
		|			ИЗ
		|				РегистрСведений.РаспределениеЗапасов КАК ГрафикПоступления
		|					
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
		|					ПО Реестр.Ссылка = ГрафикПоступления.ЗаказНаПоступление
		|					 И НЕ Реестр.ДополнительнаяЗапись
		|					 И Реестр.Приоритет.РеквизитДопУпорядочивания > &Приоритет
		|			ГДЕ
		|				ТИПЗНАЧЕНИЯ(ГрафикПоступления.ЗаказНаПоступление) В(
		//++ Устарело_Производство21
		|						ТИП(Документ.ЗаказНаПроизводство),
		//-- Устарело_Производство21
		|						ТИП(Документ.ЭтапПроизводства2_2))
		|					И НЕ ГрафикПоступления.ЗаказНаПоступление В(&Заказ)
		|					И Реестр.Ссылка ЕСТЬ NULL
		|					И ГрафикПоступления.Состояние В(
		|						ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление),
		|						ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеподтвержденное))
		|					И ГрафикПоступления.Номенклатура   = Таблица.Номенклатура
		|					И ГрафикПоступления.Характеристика = Таблица.Характеристика
		|					И ГрафикПоступления.Склад          = Таблица.Склад
		|					И ГрафикПоступления.Назначение     = Таблица.Назначение)";
	Запрос.Выполнить();
	
	// Распределение запасов
	Набор = РегистрыСведений.РаспределениеЗапасов.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.Текст = ТекстЗапросаРаспределенияЗапасов();
	Пакет = Запрос.ВыполнитьПакет();
	Таблица = Пакет[8].Выгрузить();
	График = Пакет[9].Выгрузить();
	РаспределитьЗапасыВТаблицу(Набор, Таблица, График, Ложь);
	Запрос.УстановитьПараметр("Набор", Набор);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.Состояние            КАК Состояние,
		|	Таблица.Номенклатура         КАК Номенклатура,
		|	Таблица.Характеристика       КАК Характеристика,
		|	Таблица.Склад                КАК Склад,
		|	Таблица.Назначение           КАК Назначение,
		|	Таблица.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	Таблица.ЗаказНаПоступление   КАК ЗаказНаПоступление,
		|	Таблица.ДатаПоступления      КАК ДатаПоступления,
		|	Таблица.Распределено         КАК Распределено,
		|	Таблица.НеОбеспечено         КАК НеОбеспечено
		|ПОМЕСТИТЬ Набор
		|ИЗ
		|	&Набор КАК Таблица";
	Запрос.Выполнить();
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.Номенклатура         КАК Номенклатура,
		|	Таблица.Характеристика       КАК Характеристика,
		|	Таблица.Склад                КАК Склад,
		|	Таблица.Назначение           КАК Назначение,
		|	НЕОПРЕДЕЛЕНО                 КАК ЗаказНаПоступление,
		|	Таблица.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	Таблица.Состояние            КАК Состояние,
		|	Таблица.ДатаПоступления      КАК ДатаПоступления,
		|	Таблица.Распределено         КАК Распределено,
		|	Таблица.НеОбеспечено         КАК НеОбеспечено
		|ПОМЕСТИТЬ ВтРаспределение
		|ИЗ
		|	Набор КАК Таблица
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.Номенклатура         КАК Номенклатура,
		|	Таблица.Характеристика       КАК Характеристика,
		|	Таблица.Склад                КАК Склад,
		|	Таблица.Назначение           КАК Назначение,
		|	Таблица.ЗаказНаПоступление   КАК ЗаказНаПоступление,
		|	Таблица.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	Таблица.Состояние            КАК Состояние,
		|	Таблица.ДатаПоступления      КАК ДатаПоступления,
		|	Таблица.Распределено         КАК Распределено,
		|	Таблица.НеОбеспечено         КАК НеОбеспечено
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК Таблица
		|ГДЕ
		|	Таблица.Состояние В(
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченКДате),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.Обеспечить),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОтложитьОбеспечение))
		|		И Таблица.ЗаказНаОтгрузку В(&Заказ)
		|		И НЕ ИСТИНА В(
		|			ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА КАК ЭтоПроизводимыйПолуфабрикат
		|			ИЗ
		|				РегистрСведений.РаспределениеЗапасов КАК ГрафикПоступления
		|					
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
		|					ПО Реестр.Ссылка = ГрафикПоступления.ЗаказНаПоступление
		|					 И НЕ Реестр.ДополнительнаяЗапись
		|					 И Реестр.Приоритет.РеквизитДопУпорядочивания > &Приоритет
		|			ГДЕ
		|				ТИПЗНАЧЕНИЯ(ГрафикПоступления.ЗаказНаПоступление) В(
		//++ Устарело_Производство21
		|						ТИП(Документ.ЗаказНаПроизводство),
		//-- Устарело_Производство21
		|						ТИП(Документ.ЭтапПроизводства2_2))
		|					И НЕ ГрафикПоступления.ЗаказНаПоступление В(&Заказ)
		|					И Реестр.Ссылка ЕСТЬ NULL
		|					И ГрафикПоступления.Состояние В(
		|						ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление),
		|						ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеподтвержденное))
		|					И ГрафикПоступления.Номенклатура   = Таблица.Номенклатура
		|					И ГрафикПоступления.Характеристика = Таблица.Характеристика
		|					И ГрафикПоступления.Склад          = Таблица.Склад
		|					И ГрафикПоступления.Назначение     = Таблица.Назначение)
		|ИНДЕКСИРОВАТЬ ПО
		|	Состояние";
	
	Запрос.Выполнить();
	
КонецПроцедуры

//-- НЕ УТКА

Процедура ОбновитьИнформациюОДоступностиТоваровДляВнешнихПользователей() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОбновлениеДанныхОДоступностиТоваровДляВнешнихПользователей);
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДатаСеанса()));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Склад КАК Склад,
	|	СУММА(ВложенныйЗапрос.Доступно) КАК Доступно
	|ИЗ
	|	(ВЫБРАТЬ
	|		&НачалоДня КАК Период,
	|		РаспределениеЗапасов.Номенклатура КАК Номенклатура,
	|		РаспределениеЗапасов.Характеристика КАК Характеристика,
	|		РаспределениеЗапасов.Склад КАК Склад,
	|		РаспределениеЗапасов.Свободно КАК Доступно
	|	ИЗ
	|		РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|	ГДЕ
	|		РаспределениеЗапасов.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|		И РаспределениеЗапасов.Свободно <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР КОГДА РаспределениеЗапасов.ДатаПоступления > &НачалоДня ТОГДА
	|				РаспределениеЗапасов.ДатаПоступления
	|			ИНАЧЕ
	|				&НачалоДня
	|			КОНЕЦ КАК Период,
	|		РаспределениеЗапасов.Номенклатура КАК Номенклатура,
	|		РаспределениеЗапасов.Характеристика Характеристика,
	|		РаспределениеЗапасов.Склад КАК Склад,
	|		РаспределениеЗапасов.Свободно КАК Доступно
	|	ИЗ
	|		РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|	ГДЕ
	|		РаспределениеЗапасов.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление)
	|		И РаспределениеЗапасов.Свободно <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		&НачалоДня КАК Период,
	|		СтарыеДанные.Номенклатура КАК Номенклатура,
	|		СтарыеДанные.Характеристика КАК Характеристика,
	|		СтарыеДанные.Склад КАК Склад,
	|		0 КАК Доступно
	|	ИЗ
	|		РегистрСведений.ДоступностьТоваровДляВнешнихПользователей КАК СтарыеДанные
	|) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Склад,
	|	Период";
	
	СтрокаОстатка = Запрос.Выполнить().Выбрать();
	
	Ключ = Новый Структура("Номенклатура,Характеристика,Склад");
	Итог = 0;
	НаборЗаписей = РегистрыСведений.ДоступностьТоваровДляВнешнихПользователей.СоздатьНаборЗаписей();
	Пока СтрокаОстатка.Следующий() Цикл
		
		Если СтрокаОстатка.Номенклатура <> Ключ.Номенклатура
			Или СтрокаОстатка.Характеристика <> Ключ.Характеристика
			Или СтрокаОстатка.Склад <> Ключ.Склад Тогда
			
			Если Ключ.Номенклатура <> Неопределено Тогда
				НаборЗаписей.Записать();
				НаборЗаписей.Очистить();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Ключ, СтрокаОстатка);
			Итог = 0;
			НаборЗаписей.Отбор.Номенклатура.Установить(Ключ.Номенклатура, Истина);
			НаборЗаписей.Отбор.Характеристика.Установить(Ключ.Характеристика, Истина);
			НаборЗаписей.Отбор.Склад.Установить(Ключ.Склад, Истина);
			
		КонецЕсли;
		Итог = СтрокаОстатка.Доступно + Итог;
		
		Если Итог > 0 Тогда
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаОстатка);
			Запись.Доступно = Итог;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Ключ.Номенклатура <> Неопределено Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ОбновлениеИБПоТовару(Товар) Экспорт
	
	Набор = РегистрыСведений.РаспределениеЗапасов.СоздатьНаборЗаписей();
	Набор.Отбор.Номенклатура.Установить(Товар.Номенклатура);
	Набор.Отбор.Характеристика.Установить(Товар.Характеристика);
	Набор.Отбор.Склад.Установить(Товар.Склад);
	Набор.Отбор.Назначение.Установить(Товар.Назначение);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Номенклатура",   Товар.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Товар.Характеристика);
	Запрос.УстановитьПараметр("Склад",          Товар.Склад);
	Запрос.УстановитьПараметр("Назначение",     Товар.Назначение);
	
	Текст =
		"ВЫБРАТЬ
		|	&Номенклатура   КАК Номенклатура,
		|	&Характеристика КАК Характеристика,
		|	&Склад          КАК Склад
		|ПОМЕСТИТЬ РазличныеТоварыБезНазначений
		|;
		|/////////////////////////////////
		|
		|ВЫБРАТЬ
		|	РасчетПереопределяемый.ГраницаПериода КАК ГраницаПериода,
		|	РасчетПереопределяемый.ДатаПоставки КАК ДатаПоставки
		|ИЗ
		|	РазличныеТоварыБезНазначений КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетПереопределяемый ПО ИСТИНА";
	Подстановки = ОбеспечениеВДокументахСервер.ПодстановкиГраницыОбеспечиваемогоПериода(
		"Товары.Номенклатура", "Товары.Характеристика", "Товары.Склад", "&НачалоТекущегоДня", "ИСТИНА");
	
	Текст = СтрЗаменить(Текст, "РасчетПереопределяемый.ГраницаПериода",             Подстановки.Поле);
	Текст = СтрЗаменить(Текст, "РасчетПереопределяемый.ДатаПоставки",               Подстановки.ПолеДатаПоставки);
	Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетПереопределяемый ПО ИСТИНА", Подстановки.Соединения);
	Запрос.Текст = Текст;
	
	НачалоДня = НачалоДня(ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ГраницаПериода = Неопределено;
	ДатаПоставки = НачалоДня;
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ГраницаПериода) Тогда
			ГраницаПериода = Выборка.ГраницаПериода;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ДатаПоставки) Тогда
			ДатаПоставки = Выборка.ДатаПоставки;
		КонецЕсли;
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаПоставки", ДатаПоставки);
	Запрос.УстановитьПараметр("ГраницаПериода", ГраницаПериода);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ГруппировкаЗаписей.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	ГруппировкаЗаписей.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	ГруппировкаЗаписей.Резервировать        КАК Резервировать,
		|	ГруппировкаЗаписей.КОбеспечению         КАК КОбеспечению,
		|	ВЫБОР КОГДА ГруппировкаЗаписей.НеОбеспечивать < ГруппировкаЗаписей.ЗакрытьГрафикОтгрузки ТОГДА
		|				0
		|			ИНАЧЕ
		|				ГруппировкаЗаписей.НеОбеспечивать - ГруппировкаЗаписей.ЗакрытьГрафикОтгрузки
		|		КОНЕЦ КАК НеОбеспечивать,
		|	ГруппировкаЗаписей.Приоритет            КАК Приоритет,
		|	ГруппировкаЗаписей.ПорядокОсновной      КАК ПорядокОсновной,
		|	ГруппировкаЗаписей.ПорядокДополнительный КАК ПорядокДополнительный
		|ПОМЕСТИТЬ ДвиженияПоЗаказамНаОтгрузку
		|ИЗ(
		|	ВЫБРАТЬ
		|		Движения.ЗаказНаОтгрузку              КАК ЗаказНаОтгрузку,
		|		Движения.ЖелаемаяДатаОтгрузки         КАК ЖелаемаяДатаОтгрузки,
		|		СУММА(Движения.Резервировать)         КАК Резервировать,
		|		СУММА(Движения.КОбеспечению)          КАК КОбеспечению,
		|		СУММА(Движения.НеОбеспечивать)        КАК НеОбеспечивать,
		|		СУММА(Движения.ЗакрытьГрафикОтгрузки) КАК ЗакрытьГрафикОтгрузки,
		// Порядок обхода заказов.
		|		МАКСИМУМ(ЗаказыРеестра.Приоритет.РеквизитДопУпорядочивания) КАК Приоритет,
		|		
		|		МАКСИМУМ(ВЫБОР КОГДА ЕСТЬNULL(Движения.Склад.ПерераспределятьСкладскиеЗапасы, ИСТИНА) ТОГДА
		|						Движения.ЖелаемаяДатаОтгрузки
		|				КОГДА &ДатаПоставки < Движения.ЖелаемаяДатаОтгрузки ТОГДА
		|					Движения.ЖелаемаяДатаОтгрузки
		|				КОГДА ЗаказыРеестра.ДатаДокументаИБ < ДОБАВИТЬКДАТЕ(&НачалоТекущегоДня, ДЕНЬ, 1) ТОГДА
		|					ДОБАВИТЬКДАТЕ(ЗаказыРеестра.ДатаДокументаИБ, ДЕНЬ, -1)
		|				ИНАЧЕ
		|					&НачалоТекущегоДня
		|			КОНЕЦ) КАК ПорядокОсновной,
		|		МАКСИМУМ(ЕСТЬNULL(ЗаказыРеестра.ДатаДокументаИБ, &НачалоТекущегоДня)) ПорядокДополнительный
		|	ИЗ
		|		РегистрНакопления.РаспределениеЗапасовДвижения КАК Движения
		|			
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК ЗаказыРеестра
		|			ПО ЗаказыРеестра.Ссылка = Движения.ЗаказНаОтгрузку
		|			 И НЕ ЗаказыРеестра.ДополнительнаяЗапись
		|	ГДЕ
		|		Движения.Активность
		|			И Движения.ЗаказНаОтгрузку <> НЕОПРЕДЕЛЕНО
		|			И Движения.Номенклатура    = &Номенклатура
		|			И Движения.Характеристика  = &Характеристика
		|			И Движения.Склад           = &Склад
		|			И Движения.Назначение      = &Назначение
		|	СГРУППИРОВАТЬ ПО
		|		Движения.ЗаказНаОтгрузку,
		|		Движения.ЖелаемаяДатаОтгрузки) КАК ГруппировкаЗаписей
		|;
		|
		|//////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка) КАК Состояние,
		|	1                             КАК ТипЗаписиРаспределенияЗапасов,
		|	Движения.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	Движения.Приоритет            КАК Приоритет,
		|	Движения.ПорядокОсновной      КАК ПорядокОсновной,
		|	Движения.ПорядокДополнительный КАК ПорядокДополнительный,
		|	Движения.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	НЕОПРЕДЕЛЕНО                  КАК ЗаказНаПоступление,
		|	ДАТАВРЕМЯ(1, 1, 1)            КАК ДатаПоступления,
		|	0                             КАК Запас,
		|	0                             КАК Свободно,
		|	Движения.Резервировать        КАК Резервировать,
		|	ВЫБОР КОГДА &ГраницаПериода = НЕОПРЕДЕЛЕНО ИЛИ &ГраницаПериода >= Движения.ЖелаемаяДатаОтгрузки ТОГДА
		|				Движения.КОбеспечению
		|			ИНАЧЕ
		|				0
		|		КОНЕЦ КАК КОбеспечению,
		|	ВЫБОР КОГДА &ГраницаПериода = НЕОПРЕДЕЛЕНО ИЛИ &ГраницаПериода >= Движения.ЖелаемаяДатаОтгрузки ТОГДА
		|				0
		|			ИНАЧЕ
		|				Движения.КОбеспечению
		|		КОНЕЦ КАК ОтложитьОбеспечение,
		|	Движения.НеОбеспечивать       КАК НеОбеспечивать,
		|	0                             КАК Распределено,
		|	0                             КАК НеОбеспечено
		|ИЗ
		|	ДвиженияПоЗаказамНаОтгрузку КАК Движения
		|ГДЕ
		|	Движения.КОбеспечению <> 0
		|		ИЛИ Движения.Резервировать <> 0
		|		ИЛИ Движения.НеОбеспечивать <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве) КАК Состояние,
		|	1                             КАК ТипЗаписиРаспределенияЗапасов,
		|	Движения.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	Движения.Приоритет            КАК Приоритет,
		|	Движения.ПорядокОсновной      КАК ПорядокОсновной,
		|	Движения.ПорядокДополнительный КАК ПорядокДополнительный,
		|	Движения.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	НЕОПРЕДЕЛЕНО                  КАК ЗаказНаПоступление,
		|	ДАТАВРЕМЯ(1, 1, 1)            КАК ДатаПоступления,
		|	0                             КАК Запас,
		|	0                             КАК Свободно,
		|	0                             КАК Резервировать,
		|	0                             КАК КОбеспечению,
		|	0                             КАК ОтложитьОбеспечение,
		|	0                             КАК НеОбеспечивать,
		|	Движения.Резервировать        КАК Распределено,
		|	0                             КАК НеОбеспечено
		|ИЗ
		|	ДвиженияПоЗаказамНаОтгрузку КАК Движения
		|ГДЕ
		|	Движения.Резервировать <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.НеОбеспечивать) КАК Состояние,
		|	1                             КАК ТипЗаписиРаспределенияЗапасов,
		|	Движения.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	Движения.Приоритет            КАК Приоритет,
		|	Движения.ПорядокОсновной      КАК ПорядокОсновной,
		|	Движения.ПорядокДополнительный КАК ПорядокДополнительный,
		|	Движения.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	НЕОПРЕДЕЛЕНО                  КАК ЗаказНаПоступление,
		|	ДАТАВРЕМЯ(1, 1, 1)            КАК ДатаПоступления,
		|	0                             КАК Запас,
		|	0                             КАК Свободно,
		|	0                             КАК Резервировать,
		|	0                             КАК КОбеспечению,
		|	0                             КАК ОтложитьОбеспечение,
		|	0                             КАК НеОбеспечивать,
		|	0                             КАК Распределено,
		|	Движения.НеОбеспечивать       КАК НеОбеспечено
		|ИЗ
		|	ДвиженияПоЗаказамНаОтгрузку КАК Движения
		|ГДЕ
		|	Движения.НеОбеспечивать <> 0
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказНаОтгрузку, ЖелаемаяДатаОтгрузки";
	
	ТаблицаЗаказыНаОтгрузку = Запрос.Выполнить().Выгрузить();
	ВсегоСтрок = ТаблицаЗаказыНаОтгрузку.Количество();
	ТаблицаЗаказыНаОтгрузку.Колонки.Добавить("КОбеспечениюИтогНаДату", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	
	ЗаказНаОтгрузку = Неопределено;
	Итог = 0;
	Для Индекс = 0 По ВсегоСтрок - 1 Цикл
		
		Строка = ТаблицаЗаказыНаОтгрузку[Индекс];
		Если Строка.ЗаказНаОтгрузку <> ЗаказНаОтгрузку Тогда
			ЗаказНаОтгрузку = Строка.ЗаказНаОтгрузку;
			Итог = 0;
		КонецЕсли;
		
		Если Строка.КОбеспечению > 0 Тогда
			Итог = Итог + Строка.КОбеспечению;
			Строка.КОбеспечениюИтогНаДату = Итог;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Движения.ЗаказНаПоступление КАК ЗаказНаПоступление,
		|	
		|	СУММА(ЕСТЬNULL(
		|			Движения.ПоставкаНаСогласовании
		|				+ Движения.ПоступитКДате
		|				- Движения.ЗакрытьГрафикПоступления, 0)) КАК Количество
		|	
		|ПОМЕСТИТЬ ОстаткиПланируемыхПоступлений
		|ИЗ
		|	РегистрНакопления.РаспределениеЗапасовДвижения КАК Движения
		|ГДЕ
		|	Движения.Активность
		|		И Движения.ЗаказНаПоступление <> НЕОПРЕДЕЛЕНО
		|		И Движения.Номенклатура       = &Номенклатура
		|		И Движения.Характеристика     = &Характеристика
		|		И Движения.Склад              = &Склад
		|		И Движения.Назначение         = &Назначение
		|СГРУППИРОВАТЬ ПО
		|	Движения.ЗаказНаПоступление
		|;
		|
		|////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.ЗаказНаПоступление КАК ЗаказНаПоступление,
		|	Движения.ДатаПоступления = ДАТАВРЕМЯ(1, 1, 1) КАК ПорядокПоСостоянию,
		|	ВЫБОР КОГДА Движения.ДатаПоступления <> ДАТАВРЕМЯ(1, 1, 1) ТОГДА
		|				ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление)
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеподтвержденное)
		|		КОНЕЦ КАК Состояние,
		|	
		|	1 КАК ТипЗаписиРаспределенияЗапасов,
		|	Движения.ДатаПоступления КАК ДатаПоступления,
		|	МАКСИМУМ(Остатки.Количество) КАК КоличествоВсего,
		|	СУММА(Движения.ПоставкаНаСогласовании + Движения.ПоступитКДате) КАК Запас
		|ИЗ
		|	ОстаткиПланируемыхПоступлений КАК Остатки
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РаспределениеЗапасовДвижения КАК Движения
		|		ПО Движения.Номенклатура         = &Номенклатура
		|		 И Движения.Характеристика       = &Характеристика
		|		 И Движения.Склад                = &Склад
		|		 И Движения.Назначение           = &Назначение
		|		 И Движения.ЗаказНаПоступление   = Остатки.ЗаказНаПоступление
		|		 И Движения.ЗаказНаОтгрузку      = НЕОПРЕДЕЛЕНО       // для использования индекса
		|		 И Движения.ЖелаемаяДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1) // для использования индекса
		|		 И Движения.Активность
		|ГДЕ
		|	Остатки.Количество > 0
		|СГРУППИРОВАТЬ ПО
		|	Движения.ДатаПоступления,
		|	Остатки.ЗаказНаПоступление
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказНаПоступление, ДатаПоступления УБЫВ";
	
	ТаблицаЗаказыНаПоступление = Запрос.Выполнить().Выгрузить();
	ВсегоСтрок = ТаблицаЗаказыНаПоступление.Количество();
	ТаблицаЗаказыНаПоступление.Колонки.Добавить("ПустаяЗапись", Новый ОписаниеТипов("Булево"));
	
	ЗаказНаПоступление = Неопределено;
	Распределить = 0;
	Для Индекс = 0 По ВсегоСтрок - 1 Цикл
		
		Строка = ТаблицаЗаказыНаПоступление[Индекс];
		Если Строка.ЗаказНаПоступление <> ЗаказНаПоступление Тогда
			ЗаказНаПоступление = Строка.ЗаказНаПоступление;
			Распределить = Строка.КоличествоВсего;
		КонецЕсли;
		
		Запас = Макс(Мин(Распределить, Строка.Запас), 0);
		Распределить = Распределить - Запас;
		Строка.ПустаяЗапись = Запас = 0;
		Строка.Запас = Запас;
		
	КонецЦикла;
	ТаблицаЗаказыНаПоступление = ТаблицаЗаказыНаПоступление.Скопировать(Новый Структура("ПустаяЗапись", Ложь));
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(Движения.Отгрузить)      КАК Отгрузить,
		|	СУММА(Движения.Резервировать)  КАК Резервировать,
		|	СУММА(Движения.Поступило)      КАК Поступило
		|ПОМЕСТИТЬ ТаблицаПоТовару
		|ИЗ
		|	РегистрНакопления.РаспределениеЗапасовДвижения КАК Движения
		|ГДЕ
		|	Движения.Активность
		|		И Движения.Номенклатура       = &Номенклатура
		|		И Движения.Характеристика     = &Характеристика
		|		И Движения.Склад              = &Склад
		|		И Движения.Назначение         = &Назначение
		|;
		|
		|/////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(Движения.Отгрузить)      КАК Отгрузить,
		|	СУММА(Движения.Поступило)      КАК Поступило
		|ПОМЕСТИТЬ ТаблицаВНаличии
		|ИЗ
		|	РегистрНакопления.РаспределениеЗапасовДвижения КАК Движения
		|ГДЕ
		|	Движения.Активность
		|		И &Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|		И Движения.Номенклатура       = &Номенклатура
		|		И Движения.Характеристика     = &Характеристика
		|		И Движения.Склад              = &Склад
		|ИМЕЮЩИЕ
		|	СУММА(Движения.Отгрузить) <> 0
		|		ИЛИ СУММА(Движения.Поступило) <> 0
		|;
		|
		|/////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе) КАК Состояние,
		|	1                                                                    КАК ТипЗаписиРаспределенияЗапасов,
		|	ЕСТЬNULL(ТаблицаВНаличии.Поступило - ТаблицаВНаличии.Отгрузить, 0)   КАК ВНаличии,
		|	ЕСТЬNULL(Таблица.Поступило - Таблица.Отгрузить, 0)                   КАК Запас,
		|	ЕСТЬNULL(Таблица.Резервировать, 0)                                   КАК Резерв
		|ИЗ
		|	ТаблицаПоТовару КАК Таблица
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВНаличии
		|		ПО ИСТИНА
		|ГДЕ
		|	ЕСТЬNULL(Таблица.Поступило - Таблица.Отгрузить, 0) <> 0
		|		ИЛИ ЕСТЬNULL(Таблица.Резервировать, 0) <> 0
		|		ИЛИ ЕСТЬNULL(ТаблицаВНаличии.Поступило - ТаблицаВНаличии.Отгрузить, 0) <> 0";
	
	ТаблицаОстатокНаСкладе = Запрос.Выполнить().Выгрузить();
	
	Потребность = 0;
	Для Каждого Строка Из ТаблицаЗаказыНаОтгрузку Цикл
		Потребность = Потребность + Строка.КОбеспечению;
	КонецЦикла;
	
	ТаблицаЗаказыНаПоступление.Сортировать("ПорядокПоСостоянию,ДатаПоступления,ЗаказНаПоступление", Новый СравнениеЗначений());
	
	ТаблицаОстатокНаСкладе.Колонки.Добавить("Свободно", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	КоличествоРаспределитьСоСклада = 0;
	Если ТаблицаОстатокНаСкладе.Количество() > 0 Тогда
		
		Строка = ТаблицаОстатокНаСкладе[0];
		КоличествоРаспределитьСоСклада = Мин(Потребность, Макс(Строка.Запас - Строка.Резерв, 0));
		Строка.Свободно = Строка.Запас - Строка.Резерв - КоличествоРаспределитьСоСклада;
		Потребность = Потребность - КоличествоРаспределитьСоСклада;
		
	КонецЕсли;
	
	ТаблицаЗаказыНаПоступление.Колонки.Добавить("Свободно", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	ВсегоСтрок = ТаблицаЗаказыНаПоступление.Количество();
	Для Счетчик = 0 По ВсегоСтрок - 1 Цикл
		
		Строка = ТаблицаЗаказыНаПоступление[Счетчик];
		КоличествоРаспределитьИзГрафика = Мин(Потребность, Макс(Строка.Запас, 0));
		Строка.Свободно = Строка.Запас - КоличествоРаспределитьИзГрафика;
		Потребность = Потребность - КоличествоРаспределитьИзГрафика;
		
	КонецЦикла;
	
	ТаблицаЗаказыНаОтгрузку.Сортировать("Приоритет,ПорядокОсновной,ПорядокДополнительный,ЗаказНаОтгрузку", Новый СравнениеЗначений());
	ВсегоСтрок = ТаблицаЗаказыНаОтгрузку.Количество();
	
	ИндексГрафик = -1;
	КоличествоВГрафике =0;
	
	Для Счетчик = 0 По ВсегоСтрок - 1 Цикл
		
		Строка = ТаблицаЗаказыНаОтгрузку[Счетчик];
		Если Строка.КОбеспечению > 0 Тогда
			
			Потребность = Строка.КОбеспечению;
			КРаспределениюСоСклада = Мин(Потребность, КоличествоРаспределитьСоСклада);
			КоличествоРаспределитьСоСклада = КоличествоРаспределитьСоСклада - КРаспределениюСоСклада;
			Потребность = Потребность - КРаспределениюСоСклада;
			
			Если КРаспределениюСоСклада > 0 Тогда
				СтрокаНабора = Набор.Добавить();
				СтрокаНабора.Состояние = Перечисления.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе;
				СтрокаНабора.Распределено = КРаспределениюСоСклада;
				ЗаполнитьЗначенияСвойств(СтрокаНабора, Строка, "ЗаказНаОтгрузку,ЖелаемаяДатаОтгрузки");
			КонецЕсли;
			
			Пока Потребность > 0
				И (КоличествоВГрафике > 0 Или ИндексГрафик < ТаблицаЗаказыНаПоступление.Количество() - 1) Цикл
				
				Пока КоличествоВГрафике = 0 И ИндексГрафик < ТаблицаЗаказыНаПоступление.Количество() - 1 Цикл
					ИндексГрафик = ИндексГрафик + 1;
					КоличествоВГрафике = ТаблицаЗаказыНаПоступление[ИндексГрафик].Запас - ТаблицаЗаказыНаПоступление[ИндексГрафик].Свободно;
				КонецЦикла;
				
				КРаспределениюИзГрафика = Мин(Потребность, КоличествоВГрафике);
				КоличествоВГрафике = КоличествоВГрафике - КРаспределениюИзГрафика;
				Потребность = Потребность - КРаспределениюИзГрафика;
				
				Если КРаспределениюИзГрафика > 0 Тогда
					СтрокаНабора = Набор.Добавить();
					Если ТаблицаЗаказыНаПоступление[ИндексГрафик].Состояние = Перечисления.РаспределениеЗапасовСостояния.ОжидаемоеПоступление Тогда
						СтрокаНабора.Состояние = Перечисления.РаспределениеЗапасовСостояния.ОбеспеченКДате;
					Иначе
						СтрокаНабора.Состояние = Перечисления.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу;
					КонецЕсли;
					СтрокаНабора.Распределено = КРаспределениюИзГрафика;
					ЗаполнитьЗначенияСвойств(СтрокаНабора, Строка, "ЗаказНаОтгрузку,ЖелаемаяДатаОтгрузки");
					ЗаполнитьЗначенияСвойств(СтрокаНабора, ТаблицаЗаказыНаПоступление[ИндексГрафик],
						"ЗаказНаПоступление,ДатаПоступления");
				КонецЕсли;
				
			КонецЦикла;
			
			Если Потребность > 0 Тогда
				СтрокаНабора = Набор.Добавить();
				СтрокаНабора.Состояние = Перечисления.РаспределениеЗапасовСостояния.Обеспечить;
				СтрокаНабора.НеОбеспечено = Потребность;
				ЗаполнитьЗначенияСвойств(СтрокаНабора, Строка, "ЗаказНаОтгрузку,ЖелаемаяДатаОтгрузки");
			КонецЕсли;
		
		ИначеЕсли Строка.ОтложитьОбеспечение > 0 Тогда
			
			СтрокаНабора = Набор.Добавить();
			СтрокаНабора.Состояние = Перечисления.РаспределениеЗапасовСостояния.ОтложитьОбеспечение;
			СтрокаНабора.НеОбеспечено = Строка.ОтложитьОбеспечение;
			ЗаполнитьЗначенияСвойств(СтрокаНабора, Строка, "ЗаказНаОтгрузку,ЖелаемаяДатаОтгрузки");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаЗаказыНаОтгрузку Цикл
		СтрокаНабора = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Строка);
	КонецЦикла;
	Для Каждого Строка Из ТаблицаЗаказыНаПоступление Цикл
		СтрокаНабора = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Строка);
	КонецЦикла;
	Для Каждого Строка Из ТаблицаОстатокНаСкладе Цикл
		СтрокаНабора = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Строка);
	КонецЦикла;
	
	Для Каждого СтрокаНабора Из Набор Цикл
		СтрокаНабора.Номенклатура = Товар.Номенклатура;
		СтрокаНабора.Характеристика = Товар.Характеристика;
		СтрокаНабора.Склад = Товар.Склад;
		СтрокаНабора.Назначение = Товар.Назначение;
	КонецЦикла;
	Возврат Набор;
	
КонецФункции

Функция ТекстЗапросаКонтроль() Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИзмененияДвижений.Номенклатура                  КАК Номенклатура,
		|	ИзмененияДвижений.Характеристика                КАК Характеристика,
		|	ИзмененияДвижений.Склад                         КАК Склад,
		|	ИзмененияДвижений.Назначение                    КАК Назначение,
		|	ИзмененияДвижений.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ИзмененияДвижений.ИгнорироватьРезервыПриКонтролеОстатков КАК ИгнорироватьРезервыПриКонтролеОстатков,
		|	РаспределениеЗапасов.Свободно,
		|	РаспределениеЗапасов.Запас,
		|	РаспределениеЗапасов.Резерв,
		|	ИзмененияДвижений.Отгрузить,
		|	ИзмененияДвижений.Резервировать,
		|	ВЫБОР КОГДА ИзмененияДвижений.Отгрузить + ИзмененияДвижений.Резервировать > -(РаспределениеЗапасов.Запас - РаспределениеЗапасов.Резерв) ТОГДА
		|					-(РаспределениеЗапасов.Запас - РаспределениеЗапасов.Резерв)
		|				ИНАЧЕ
		|					ИзмененияДвижений.Отгрузить + ИзмененияДвижений.Резервировать
		|		КОНЕЦ КАК КоличествоЗапас,
		|	
		|	ВЫБОР КОГДА ИзмененияДвижений.Отгрузить + ИзмененияДвижений.Резервировать > -РаспределениеЗапасов.Свободно ТОГДА
		|					-РаспределениеЗапасов.Свободно
		|				ИНАЧЕ
		|					ИзмененияДвижений.Отгрузить + ИзмененияДвижений.Резервировать
		|		КОНЕЦ КАК КоличествоСвободно
		|ИЗ
		|	
		|	ДвиженияРаспределениеЗапасовДвиженияИзменение КАК ИзмененияДвижений
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаХарактеристика
		|		ПО НастройкаХарактеристика.Склад          = ИзмененияДвижений.Склад
		|		 И НастройкаХарактеристика.Номенклатура   = ИзмененияДвижений.Номенклатура
		|		 И НастройкаХарактеристика.Характеристика = ИзмененияДвижений.Характеристика
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаНоменклатура
		|		ПО НастройкаНоменклатура.Склад        = ИзмененияДвижений.Склад
		|		 И НастройкаНоменклатура.Номенклатура = ИзмененияДвижений.Номенклатура
		|		 И НастройкаНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|		 И НастройкаХарактеристика.Склад ЕСТЬ NULL
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаСклад
		|		ПО НастройкаСклад.Склад          = ИзмененияДвижений.Склад
		|		 И НастройкаСклад.Номенклатура   = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		 И НастройкаСклад.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|		 И НастройкаХарактеристика.Склад ЕСТЬ NULL
		|		 И НастройкаНоменклатура.Склад ЕСТЬ NULL
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
		|		ПО РаспределениеЗапасов.Номенклатура         = ИзмененияДвижений.Номенклатура
		|		 И РаспределениеЗапасов.Характеристика       = ИзмененияДвижений.Характеристика
		|		 И РаспределениеЗапасов.Склад                = ИзмененияДвижений.Склад
		|		 И РаспределениеЗапасов.Назначение           = ИзмененияДвижений.Назначение
		|		 И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
		|ГДЕ
		|	(ИзмененияДвижений.Отгрузить + ИзмененияДвижений.Резервировать) > 0
		|		И ЕСТЬNULL(НастройкаХарактеристика.КонтролироватьСвободныеОстатки,
		|			ЕСТЬNULL(НастройкаНоменклатура.КонтролироватьСвободныеОстатки,
		|				НастройкаСклад.КонтролироватьСвободныеОстатки))
		|		И ИзмененияДвижений.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|		И ВЫБОР КОГДА ИзмененияДвижений.ИгнорироватьРезервыПриКонтролеОстатков ТОГДА
		|					(РаспределениеЗапасов.Запас - РаспределениеЗапасов.Резерв) < 0
		|				ИНАЧЕ
		|					РаспределениеЗапасов.Свободно < 0
		|			КОНЕЦ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура СообщитьОбОшибкахПроведения(Объект, Отказ, РезультатыКонтроля) Экспорт
	
	ЕстьДанныеДляОбработки = Ложь;
	Если РезультатыКонтроля.Количество() > 0 Тогда
		ЕстьДанныеДляОбработки = ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Неопределено, "РегистрСведений.РаспределениеЗапасов");
	КонецЕсли;
	
	ОшибкиКонтроля = РезультатыКонтроля;
	
	Если ЕстьДанныеДляОбработки Тогда
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Таблица", РезультатыКонтроля);
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Таблица.Номенклатура КАК Номенклатура,
			|	Таблица.Характеристика КАК Характеристика,
			|	Таблица.Склад КАК Склад,
			|	Таблица.Назначение КАК Назначение,
			|	Таблица.КоличествоЗапас КАК КоличествоЗапас,
			|	Таблица.КоличествоСвободно КАК КоличествоСвободно,
			|	Таблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	Таблица.ИгнорироватьРезервыПриКонтролеОстатков
			|ПОМЕСТИТЬ Таблица
			|ИЗ
			|	&Таблица КАК Таблица
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Таблица.Номенклатура КАК Номенклатура,
			|	Таблица.Характеристика КАК Характеристика,
			|	Таблица.Склад КАК Склад,
			|	Таблица.Назначение КАК Назначение,
			|	Таблица.КоличествоЗапас КАК КоличествоЗапас,
			|	Таблица.КоличествоСвободно КАК КоличествоСвободно,
			|	Таблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	Таблица.ИгнорироватьРезервыПриКонтролеОстатков,
			|	ТаблицаИзменений.Номенклатура ЕСТЬ NULL КАК ОбновлениеЗавершено
			|ИЗ
			|	Таблица КАК Таблица
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов.Изменения КАК ТаблицаИзменений
			|		ПО ТаблицаИзменений.Номенклатура = Таблица.Номенклатура
			|		 И ТаблицаИзменений.Характеристика = Таблица.Характеристика
			|		 И ТаблицаИзменений.Склад = Таблица.Склад
			|		 И ТаблицаИзменений.Назначение = Таблица.Назначение
			|		 И ТаблицаИзменений.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПустаяСсылка)
			|		 И ТаблицаИзменений.Узел ССЫЛКА ПланОбмена.ОбновлениеИнформационнойБазы";
			
		ОшибкиКонтроля = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Для Каждого ОшибкаКонтроля Из ОшибкиКонтроля Цикл
		
		ТекстНазначениеХарактеристика    = "";
		ТекстНазначение                  = "";
		ТекстБезНазначенияХарактеристика = "";
		ТекстБезНазначения               = "";
		Количество = 0;
		ЕдиницаИзмерения = ОшибкаКонтроля.ЕдиницаИзмерения;
		
		Если ЕстьДанныеДляОбработки И Не ОшибкаКонтроля.ОбновлениеЗавершено Тогда
			
			ТекстНазначениеХарактеристика = НСтр("ru = 'По товару ""%1"",""%2"" на складе ""%3"" по назначению ""%4"" не завершена процедура обновления данных о доступных остатках. Контроль остатков временно отключен.%5%6';
												|en = 'Update of the available balance data for the ""%1"" and ""%2"" goods at the ""%3"" warehouse by the ""%4"" assignment is not completed. Balance control is temporarily disabled.%5%6'");
			ТекстНазначение = НСтр("ru = 'По обособленному товару ""%1"" на складе ""%2"" по назначению ""%3""  не завершена процедура обновления данных о доступных остатках. Контроль остатков временно отключен.%4%5';
									|en = 'Update of the available balance data for the assigned ""%1"" goods at the ""%2"" warehouse by the ""%3"" assignment is not completed. Balance control is temporarily disabled.%4%5'");
			ТекстБезНазначенияХарактеристика = НСтр("ru = 'По необособленному товару ""%1"",""%2"" на складе ""%3"" не завершена процедура обновления данных о доступных остатках. Контроль остатков временно отключен.%4%5';
													|en = 'Update of the available balance data for the non-assigned ""%1"" and ""%2"" goods at the ""%3"" warehouse is not completed. Balance control is temporarily disabled.%4%5'");
			ТекстБезНазначения = НСтр("ru = 'По необособленному товару ""%1"" на складе ""%2""  не завершена процедура обновления данных о доступных остатках. Контроль остатков временно отключен.%3%4';
										|en = 'Update of the available balance data for the non-assigned ""%1"" goods at the ""%2"" warehouse is not completed. Balance control is temporarily disabled.%3%4'");
			Количество = "";
			ЕдиницаИзмерения = "";
			
		ИначеЕсли ОшибкаКонтроля.ИгнорироватьРезервыПриКонтролеОстатков Тогда
			
			ТекстНазначениеХарактеристика = НСтр("ru = 'Для отгрузки/резервирования товара ""%1"",""%2"" на складе ""%3"" по назначению ""%4"" недостаточно свободного остатка в количестве %5 %6.';
												|en = 'Insufficient free balance at warehouse ""%3"" to destination ""%4"" to ship/reserve goods ""%1"",""%2"" in the amount of %5 %6.'");
			ТекстНазначение = НСтр("ru = 'Для отгрузки/резервирования обособленного товара ""%1"" на складе ""%2"" по назначению ""%3"" недостаточно свободного остатка в количестве %4 %5';
									|en = 'Insufficient free balance at warehouse ""%2"" to destination ""%3"" to ship/reserve assigned goods ""%1"", in the amount of %4 %5'");
			ТекстБезНазначенияХарактеристика = НСтр("ru = 'Для отгрузки/резервирования необособленного товара ""%1"",""%2"" на складе ""%3"" недостаточно свободного остатка в количестве %4 %5.';
													|en = 'Insufficient free balance at warehouse ""%3"" to ship/reserve non-assigned goods ""%1"",""%2"" in the amount of %4 %5.'");
			ТекстБезНазначения = НСтр("ru = 'Для отгрузки/резервирования необособленного товара ""%1"" на складе ""%2"" недостаточно свободного остатка в количестве %3 %4';
										|en = 'Insufficient free balance at warehouse ""%2"" to ship/reserve non-assigned goods ""%1"" in the amount of %3 %4'");
			Количество = ОшибкаКонтроля.КоличествоЗапас;
			
		Иначе
			
			ТекстНазначениеХарактеристика = НСтр("ru = 'Для отгрузки/резервирования товара ""%1"",""%2"" на складе ""%3"" по назначению ""%4"" недостаточно свободного остатка в количестве %5 %6.';
												|en = 'Insufficient free balance at warehouse ""%3"" to destination ""%4"" to ship/reserve goods ""%1"",""%2"" in the amount of %5 %6.'");
			ТекстНазначение = НСтр("ru = 'Для отгрузки/резервирования обособленного товара ""%1"" на складе ""%2"" по назначению ""%3"" недостаточно свободного остатка в количестве %4 %5';
									|en = 'Insufficient free balance at warehouse ""%2"" to destination ""%3"" to ship/reserve assigned goods ""%1"", in the amount of %4 %5'");
			ТекстБезНазначенияХарактеристика = НСтр("ru = 'Для отгрузки/резервирования необособленного товара ""%1"",""%2"" на складе ""%3"" недостаточно свободного остатка в количестве %4 %5.';
													|en = 'Insufficient free balance at warehouse ""%3"" to ship/reserve non-assigned goods ""%1"",""%2"" in the amount of %4 %5.'");
			ТекстБезНазначения = НСтр("ru = 'Для отгрузки/резервирования необособленного товара ""%1"" на складе ""%2"" недостаточно свободного остатка в количестве %3 %4';
										|en = 'Insufficient free balance at warehouse ""%2"" to ship/reserve non-assigned goods ""%1"" in the amount of %3 %4'");
			Количество = ОшибкаКонтроля.КоличествоСвободно;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОшибкаКонтроля.Назначение) Тогда
			
			Если ЗначениеЗаполнено(ОшибкаКонтроля.Характеристика) Тогда
				ТекстСообщения = СтрШаблон(ТекстНазначениеХарактеристика,
					ОшибкаКонтроля.Номенклатура,
					ОшибкаКонтроля.Характеристика,
					ОшибкаКонтроля.Склад,
					ОшибкаКонтроля.Назначение,
					Количество,
					ЕдиницаИзмерения);
			Иначе
				ТекстСообщения = СтрШаблон(ТекстНазначение,
					ОшибкаКонтроля.Номенклатура,
					ОшибкаКонтроля.Склад,
					ОшибкаКонтроля.Назначение,
					Количество,
					ЕдиницаИзмерения);
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(ОшибкаКонтроля.Характеристика) Тогда
				ТекстСообщения = СтрШаблон(ТекстБезНазначенияХарактеристика,
					ОшибкаКонтроля.Номенклатура,
					ОшибкаКонтроля.Характеристика,
					ОшибкаКонтроля.Склад,
					Количество,
					ЕдиницаИзмерения);
			Иначе
				ТекстСообщения = СтрШаблон(ТекстБезНазначения,
					ОшибкаКонтроля.Номенклатура,
					ОшибкаКонтроля.Склад,
					Количество,
					ЕдиницаИзмерения);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЕстьДанныеДляОбработки И Не ОшибкаКонтроля.ОбновлениеЗавершено Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект);
		Иначе
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, Неопределено, Неопределено, Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////////
// Обслуживание регистров состояний заказов.

Процедура ДобавитьВременныеТаблицыАктуализацииСостояний(Запрос, ФильтрПереопределяемый, Постфикс) Экспорт
	
	ИменаРегистров = Новый Массив();
	ИменаРегистров.Добавить("РегистрСведений.СостоянияЗаказовКлиентов");
	ИменаРегистров.Добавить("РегистрСведений.СостоянияВнутреннихЗаказов");
	//++ НЕ УТКА
	ИменаРегистров.Добавить("РегистрСведений.СостоянияЭтаповПроизводства");
	//-- НЕ УТКА
	
	Тексты = Новый Массив();
	
	Для Каждого ИмяРегистра Из ИменаРегистров Цикл
		
		ИмяРегистра = СтрЗаменить(ИмяРегистра, "РегистрСведений.", "");
		Параметры = РегистрыСведений[ИмяРегистра].ПараметрыАктуализацииСостоянийЗаказов();
		Текст = Параметры.ПравилоОтбораЗаписей;
		Текст = СтрЗаменить(Текст, "ФильтрПереопределяемый",  ФильтрПереопределяемый);
		Текст = СтрЗаменить(Текст, "ТаблицаПереопределяемый", ИмяРегистра + Постфикс);
		Тексты.Добавить(Текст);
		
	КонецЦикла;
	
	Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ТаблицаИзмененийРаспределениеЗапасовДляРасчетаСостояний(Запрос) Экспорт
	
	ИменаРегистров = Новый Массив();
	ИменаРегистров.Добавить("РегистрСведений.СостоянияЗаказовКлиентов");
	ИменаРегистров.Добавить("РегистрСведений.СостоянияВнутреннихЗаказов");
	//++ НЕ УТКА
	ИменаРегистров.Добавить("РегистрСведений.СостоянияЭтаповПроизводства");
	//-- НЕ УТКА
	
	Тексты = Новый Массив();
	
	Для Каждого ИмяРегистра Из ИменаРегистров Цикл
		
		ИмяРегистра = СтрЗаменить(ИмяРегистра, "РегистрСведений.", "");
		Параметры = РегистрыСведений[ИмяРегистра].ПараметрыАктуализацииСостоянийЗаказов();
		Текст = Параметры.ФункцияСравненияЗаписейВоВременнуюТаблицу;
		Текст = СтрЗаменить(Текст, "ПередЗаписьюПереопределяемый", ИмяРегистра + "ПередЗаписью");
		Текст = СтрЗаменить(Текст, "ПриЗаписиПереопределяемый",    ИмяРегистра + "ПриЗаписи");
		Текст = СтрЗаменить(Текст, "ИзменениеПереопределяемый",    ИмяРегистра + "Изменение");
		Тексты.Добавить(Текст);
		
	КонецЦикла;
	
	Для Каждого ИмяРегистра Из ИменаРегистров Цикл
		
		ИмяРегистра = СтрЗаменить(ИмяРегистра, "РегистрСведений.", "");
		
		Текст = "УНИЧТОЖИТЬ " + ИмяРегистра + "ПередЗаписью";
		Тексты.Добавить(Текст);
		
		Текст = "УНИЧТОЖИТЬ " + ИмяРегистра + "ПриЗаписи";
		Тексты.Добавить(Текст);
		
	КонецЦикла;
	
	Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.ВыполнитьПакет();
	
КонецПроцедуры

Процедура ИсключитьСсылкиТребующиеОтложенногоОбновления(Ссылки) Экспорт
	
	Если ОбновлениеИнформационнойБазы.ОтложенноеОбновлениеЗавершено() Тогда
		Возврат;
	КонецЕсли;
	
	НаборСостоянияЗаказовКлиентов = РегистрыСведений.СостоянияЗаказовКлиентов.СоздатьНаборЗаписей();
	НаборСостоянияВнутреннихЗаказов = РегистрыСведений.СостоянияВнутреннихЗаказов.СоздатьНаборЗаписей();
	//++ НЕ УТКА
	НаборСостоянияЭтаповПроизводства = РегистрыСведений.СостоянияЭтаповПроизводства.СоздатьНаборЗаписей();
	//-- НЕ УТКА
	НаборСостоянияЗаказовКлиентов.Отбор.Заказ.Использование = Истина;
	НаборСостоянияВнутреннихЗаказов.Отбор.Заказ.Использование = Истина;
	//++ НЕ УТКА
	НаборСостоянияЭтаповПроизводства.Отбор.Этап.Использование = Истина;
	//-- НЕ УТКА
	
	ВсегоЭлементов = Ссылки.Количество();
	Для Счетчик = 1 По ВсегоЭлементов Цикл
		Индекс = ВсегоЭлементов - Счетчик;
		Ссылка = Ссылки[Индекс];
		
		Набор = Неопределено;
		Если НаборСостоянияЗаказовКлиентов.Отбор.Заказ.ТипЗначения.СодержитТип(ТипЗнч(Ссылка)) Тогда
			Набор = НаборСостоянияЗаказовКлиентов;
			Набор.Отбор.Заказ.Значение = Ссылка;
		ИначеЕсли НаборСостоянияВнутреннихЗаказов.Отбор.Заказ.ТипЗначения.СодержитТип(ТипЗнч(Ссылка)) Тогда
			Набор = НаборСостоянияВнутреннихЗаказов;
			Набор.Отбор.Заказ.Значение = Ссылка;
		//++ НЕ УТКА
		ИначеЕсли НаборСостоянияЭтаповПроизводства.Отбор.Этап.ТипЗначения.СодержитТип(ТипЗнч(Ссылка)) Тогда
			Набор = НаборСостоянияЭтаповПроизводства;
			Набор.Отбор.Этап.Значение = Ссылка;
		//-- НЕ УТКА
		КонецЕсли;
		
		Если Набор <> Неопределено Тогда
			РезультатПроверки = ОбновлениеИнформационнойБазы.ОбъектОбработан(Набор);
			Если Не РезультатПроверки.Обработан Тогда
				Ссылки.Удалить(Индекс);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДосчитыватьРегистрРегламентнымЗаданием() Экспорт
	Возврат Не ОбщегоНазначения.ИнформационнаяБазаФайловая()
		И Не (РаботаВМоделиСервиса.РазделениеВключено() И РаботаВМоделиСервиса.ДоступноИспользованиеРазделенныхДанных())
		Или БлокироватьРаспределениеЗапасов();
КонецФункции

Функция БлокироватьРаспределениеЗапасов() Экспорт
	ПараметрЗапускаПриложения = ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("ПараметрЗапуска");
	Возврат СтрНайти(ПараметрЗапускаПриложения, "БлокироватьРаспределениеЗапасов") > 0;
КонецФункции

Функция ОшибкиПроверкиКорректностиЗаписейРегистраСведенийРаспределениеЗапасов(ПроверятьПроведение, ПроверятьРаспределение, Товар) Экспорт
	
	Тексты = Новый Массив();
	
	Если Товар = Неопределено Тогда
		
		Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Таблица.Номенклатура КАК Номенклатура,
			|	Таблица.Характеристика КАК Характеристика,
			|	Таблица.Склад КАК Склад,
			|	Таблица.Назначение КАК Назначение
			|ПОМЕСТИТЬ ТаблицаТовары
			|ИЗ
			|	РегистрНакопления.РаспределениеЗапасовДвижения КАК Таблица
			|ГДЕ
			|	Таблица.Активность
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Таблица.Номенклатура КАК Номенклатура,
			|	Таблица.Характеристика КАК Характеристика,
			|	Таблица.Склад КАК Склад,
			|	Таблица.Назначение КАК Назначение
			|ИЗ
			|	РегистрСведений.РаспределениеЗапасов КАК Таблица
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение";
		
	Иначе
		
		Текст =
			"ВЫБРАТЬ
			|	&Номенклатура КАК Номенклатура,
			|	&Характеристика КАК Характеристика,
			|	&Склад КАК Склад,
			|	&Назначение КАК Назначение
			|ПОМЕСТИТЬ
			|	ТаблицаТовары";
		
	КонецЕсли;
	
	Тексты.Добавить(Текст);
	
	Если ПроверятьПроведение Тогда
		
		Текст =
			"ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	НЕОПРЕДЕЛЕНО КАК ЗаказНаПоступление,
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе) КАК Состояние,
			|	СУММА(Набор.ЗапасДвижения) КАК ЗапасДвижения,
			|	СУММА(Набор.ЗапасСведения) КАК ЗапасСведения
			|ИЗ(
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.Поступило - Таблица.Отгрузить КАК ЗапасДвижения,
			|		0 КАК ЗапасСведения
			|	ИЗ
			|		РегистрНакопления.РаспределениеЗапасовДвижения КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Активность
			|			И (Таблица.Поступило <> 0 ИЛИ Таблица.Отгрузить <> 0)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		0 КАК ЗапасДвижения,
			|		Таблица.Запас КАК ЗапасСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)) КАК Набор
			|	СГРУППИРОВАТЬ ПО
			|		Набор.Номенклатура,
			|		Набор.Характеристика,
			|		Набор.Склад,
			|		Набор.Назначение
			|ИМЕЮЩИЕ
			|	СУММА(Набор.ЗапасДвижения) <> СУММА(Набор.ЗапасСведения)
			|;
			|/////////////////////////////////////////////////////////////
			|
			|ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	Набор.ЗаказНаПоступление КАК ЗаказНаПоступление,
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление) КАК Состояние,
			|	ВЫБОР КОГДА СУММА(Набор.ЗапасДвижения) < 0 ТОГДА 0 ИНАЧЕ СУММА(Набор.ЗапасДвижения) КОНЕЦ КАК ЗапасДвижения,
			|	СУММА(Набор.ЗапасСведения) КАК ЗапасСведения
			|ИЗ(
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаПоступление КАК ЗаказНаПоступление,
			|		Таблица.ПоступитКДате - Таблица.ЗакрытьГрафикПоступления КАК ЗапасДвижения,
			|		0 КАК ЗапасСведения
			|	ИЗ
			|		РегистрНакопления.РаспределениеЗапасовДвижения КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Активность
			|			И (Таблица.ПоступитКДате <> 0 ИЛИ Таблица.ЗакрытьГрафикПоступления <> 0)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаПоступление КАК ЗаказНаПоступление,
			|		0 КАК ЗапасДвижения,
			|		Таблица.Запас КАК ЗапасСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление)) КАК Набор
			|	СГРУППИРОВАТЬ ПО
			|		Набор.Номенклатура,
			|		Набор.Характеристика,
			|		Набор.Склад,
			|		Набор.Назначение,
			|		Набор.ЗаказНаПоступление
			|	ИМЕЮЩИЕ
			|		ВЫБОР КОГДА СУММА(Набор.ЗапасДвижения) < 0 ТОГДА 0 ИНАЧЕ СУММА(Набор.ЗапасДвижения) КОНЕЦ <> СУММА(Набор.ЗапасСведения)
			|;
			|/////////////////////////////////////////////////////////////
			|
			|ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	Набор.ЗаказНаПоступление КАК ЗаказНаПоступление,
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеПодтвержденное) КАК Состояние,
			|	ВЫБОР КОГДА СУММА(Набор.ЗапасДвижения) < 0 ТОГДА 0 ИНАЧЕ СУММА(Набор.ЗапасДвижения) КОНЕЦ КАК ЗапасДвижения,
			|	СУММА(Набор.ЗапасСведения) КАК ЗапасСведения
			|ИЗ(
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаПоступление КАК ЗаказНаПоступление,
			|		Таблица.ПоставкаНаСогласовании - Таблица.ЗакрытьГрафикПоступления КАК ЗапасДвижения,
			|		0 КАК ЗапасСведения
			|	ИЗ
			|		РегистрНакопления.РаспределениеЗапасовДвижения КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Активность
			|			И (Таблица.ПоставкаНаСогласовании <> 0 ИЛИ Таблица.ЗакрытьГрафикПоступления <> 0)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаПоступление КАК ЗаказНаПоступление,
			|		0 КАК ЗапасДвижения,
			|		Таблица.Запас КАК ЗапасСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеПодтвержденное)) КАК Набор
			|	СГРУППИРОВАТЬ ПО
			|		Набор.Номенклатура,
			|		Набор.Характеристика,
			|		Набор.Склад,
			|		Набор.Назначение,
			|		Набор.ЗаказНаПоступление
			|	ИМЕЮЩИЕ
			|		ВЫБОР КОГДА СУММА(Набор.ЗапасДвижения) < 0 ТОГДА 0 ИНАЧЕ СУММА(Набор.ЗапасДвижения) КОНЕЦ <> СУММА(Набор.ЗапасСведения)
			|;
			|/////////////////////////////////////////////////////////////
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	Набор.ЗаказНаПоступление КАК ЗаказНаПоступление,
			|	&ТекстНесоответствиеДат КАК Состояние,
			|	0 КАК ЗапасДвижения,
			|	0 КАК ЗапасСведения
			|ИЗ(
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаПоступление КАК ЗаказНаПоступление,
			|		СУММА(ЕСТЬNULL(Движения.ПоступитКДате + Движения.ПоставкаНаСогласовании, 0)) КАК ЗапасДвижения,
			|		МАКСИМУМ(Таблица.Запас) КАК ЗапасСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|			
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РаспределениеЗапасовДвижения КАК Движения
			|			ПО Движения.Активность
			|			 И Движения.Номенклатура = Таблица.Номенклатура
			|			 И Движения.Характеристика = Таблица.Характеристика
			|			 И Движения.Склад = Таблица.Склад
			|			 И Движения.Назначение = Таблица.Назначение
			|			 И Движения.ЗаказНаПоступление = Таблица.ЗаказНаПоступление
			|			 И Движения.ДатаПоступления = Таблица.ДатаПоступления
			|			 И Движения.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние В(
			|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеПодтвержденное),
			|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление))
			|СГРУППИРОВАТЬ ПО
			|	Таблица.Номенклатура,
			|	Таблица.Характеристика,
			|	Таблица.Склад,
			|	Таблица.Назначение,
			|	Таблица.ЗаказНаПоступление,
			|	Таблица.ДатаПоступления
			|ИМЕЮЩИЕ
			|	СУММА(ЕСТЬNULL(Движения.ПоступитКДате + Движения.ПоставкаНаСогласовании, 0)) < МАКСИМУМ(Таблица.Запас)) КАК Набор
			|;
			|/////////////////////////////////////////////////////////////
			|
			|ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	Набор.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|	Набор.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка) КАК Состояние,
			|	СУММА(Набор.РезервироватьДвижения) КАК РезервироватьДвижения,
			|	СУММА(Набор.НеОбеспечиватьДвижения) КАК НеОбеспечиватьДвижения,
			|	СУММА(Набор.ЗакрытьГрафикОтгрузкиДвижения) КАК ЗакрытьГрафикОтгрузкиДвижения,
			|	СУММА(Набор.КОбеспечениюДвижения) КАК КОбеспечениюДвижения,
			|	СУММА(Набор.РезервироватьСведения) КАК РезервироватьСведения,
			|	СУММА(Набор.НеОбеспечиватьСведения) КАК НеОбеспечиватьСведения,
			|	СУММА(Набор.КОбеспечениюСведения) КАК КОбеспечениюСведения
			|ИЗ(
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|		Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|		Таблица.Резервировать КАК РезервироватьДвижения,
			|		Таблица.НеОбеспечивать КАК НеОбеспечиватьДвижения,
			|		Таблица.ЗакрытьГрафикОтгрузки КАК ЗакрытьГрафикОтгрузкиДвижения,
			|		Таблица.КОбеспечению КАК КОбеспечениюДвижения,
			|		0 КАК РезервироватьСведения,
			|		0 КАК НеОбеспечиватьСведения,
			|		0 КАК КОбеспечениюСведения
			|	ИЗ
			|		РегистрНакопления.РаспределениеЗапасовДвижения КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Активность
			|			И (Таблица.Резервировать <> 0 ИЛИ Таблица.КОбеспечению <> 0 ИЛИ Таблица.НеОбеспечивать <> 0 ИЛИ Таблица.ЗакрытьГрафикОтгрузки <> 0)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|		Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|		0 КАК РезервироватьДвижения,
			|		0 КАК НеОбеспечиватьДвижения,
			|		0 КАК ЗакрытьГрафикОтгрузкиДвижения,
			|		0 КАК КОбеспечениюДвижения,
			|		Таблица.Резервировать КАК РезервироватьСведения,
			|		Таблица.НеОбеспечивать КАК НеОбеспечиватьСведения,
			|		Таблица.КОбеспечению + Таблица.ОтложитьОбеспечение КАК КОбеспечениюСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)) КАК Набор
			|СГРУППИРОВАТЬ ПО
			|	Набор.Номенклатура,
			|	Набор.Характеристика,
			|	Набор.Склад,
			|	Набор.Назначение,
			|	Набор.ЗаказНаОтгрузку,
			|	Набор.ЖелаемаяДатаОтгрузки
			|ИМЕЮЩИЕ
			|	СУММА(Набор.РезервироватьДвижения) <> СУММА(Набор.РезервироватьСведения)
			|		ИЛИ ВЫБОР КОГДА СУММА(Набор.НеОбеспечиватьДвижения) < СУММА(Набор.ЗакрытьГрафикОтгрузкиДвижения) ТОГДА
			|					0
			|				ИНАЧЕ
			|					СУММА(Набор.НеОбеспечиватьДвижения) - СУММА(Набор.ЗакрытьГрафикОтгрузкиДвижения)
			|			КОНЕЦ <> СУММА(Набор.НеОбеспечиватьСведения)
			|		ИЛИ СУММА(Набор.КОбеспечениюДвижения) <> СУММА(Набор.КОбеспечениюСведения)
			|;
			|/////////////////////////////////////////////////////////////
			|
			|ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	Набор.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|	Набор.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве) КАК Состояние,
			|	СУММА(Набор.РезервироватьДвижения) КАК РезервироватьДвижения,
			|	СУММА(Набор.РезервироватьСведения) КАК РезервироватьСведения
			|ИЗ(
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|		Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|		Таблица.Резервировать КАК РезервироватьДвижения,
			|		0 КАК РезервироватьСведения
			|	ИЗ
			|		РегистрНакопления.РаспределениеЗапасовДвижения КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Активность
			|			И Таблица.Резервировать <> 0
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|		Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|		0 КАК РезервироватьДвижения,
			|		Таблица.Распределено КАК РезервироватьСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)) КАК Набор
			|СГРУППИРОВАТЬ ПО
			|	Набор.Номенклатура,
			|	Набор.Характеристика,
			|	Набор.Склад,
			|	Набор.Назначение,
			|	Набор.ЗаказНаОтгрузку,
			|	Набор.ЖелаемаяДатаОтгрузки
			|ИМЕЮЩИЕ
			|	СУММА(Набор.РезервироватьДвижения) <> СУММА(Набор.РезервироватьСведения)
			|;
			|/////////////////////////////////////////////////////////////
			|
			|ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве) КАК Состояние,
			|	СУММА(Набор.РезервироватьДвижения) КАК РезервироватьДвижения,
			|	СУММА(Набор.РезервСведения) КАК РезервСведения
			|ИЗ(
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.Резервировать КАК РезервироватьДвижения,
			|		0 КАК РезервСведения
			|	ИЗ
			|		РегистрНакопления.РаспределениеЗапасовДвижения КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Активность
			|			И Таблица.Резервировать <> 0
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		0 КАК РезервироватьДвижения,
			|		Таблица.Резерв КАК РезервСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)) КАК Набор
			|СГРУППИРОВАТЬ ПО
			|	Набор.Номенклатура,
			|	Набор.Характеристика,
			|	Набор.Склад,
			|	Набор.Назначение
			|ИМЕЮЩИЕ
			|	СУММА(Набор.РезервироватьДвижения) <> СУММА(Набор.РезервСведения)
			|;
			|/////////////////////////////////////////////////////////////
			|
			|ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	Набор.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|	Набор.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.НеОбеспечивать) КАК Состояние,
			|	СУММА(Набор.НеОбеспечиватьДвижения) КАК НеОбеспечиватьДвижения,
			|	СУММА(Набор.ЗакрытьГрафикОтгрузкиДвижения) КАК ЗакрытьГрафикОтгрузкиДвижения,
			|	СУММА(Набор.НеОбеспечиватьСведения) КАК НеОбеспечиватьСведения
			|ИЗ(
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|		Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|		Таблица.НеОбеспечивать КАК НеОбеспечиватьДвижения,
			|		Таблица.ЗакрытьГрафикОтгрузки КАК ЗакрытьГрафикОтгрузкиДвижения,
			|		0 КАК НеОбеспечиватьСведения
			|	ИЗ
			|		РегистрНакопления.РаспределениеЗапасовДвижения КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Активность
			|			И (Таблица.НеОбеспечивать <> 0 ИЛИ Таблица.ЗакрытьГрафикОтгрузки <> 0)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|		Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|		0 КАК НеОбеспечиватьДвижения,
			|		0 КАК ЗакрытьГрафикОтгрузкиДвижения,
			|		Таблица.НеОбеспечено КАК НеОбеспечиватьСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.НеОбеспечивать)) КАК Набор
			|СГРУППИРОВАТЬ ПО
			|	Набор.Номенклатура,
			|	Набор.Характеристика,
			|	Набор.Склад,
			|	Набор.Назначение,
			|	Набор.ЗаказНаОтгрузку,
			|	Набор.ЖелаемаяДатаОтгрузки
			|ИМЕЮЩИЕ
			|	ВЫБОР КОГДА СУММА(Набор.НеОбеспечиватьДвижения) < СУММА(Набор.ЗакрытьГрафикОтгрузкиДвижения) ТОГДА
			|					0
			|				ИНАЧЕ
			|					СУММА(Набор.НеОбеспечиватьДвижения) - СУММА(Набор.ЗакрытьГрафикОтгрузкиДвижения)
			|			КОНЕЦ <> СУММА(Набор.НеОбеспечиватьСведения)
			|;
			|/////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	&ТекстВНаличии КАК Состояние,
			|	СУММА(Набор.ВНаличииДвижения) КАК ВНаличииДвижения,
			|	СУММА(Набор.ВНаличииСведения) КАК ВНаличииСведения
			|ИЗ(
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Поступило - Таблица.Отгрузить КАК ВНаличииДвижения,
			|		0 КАК ВНаличииСведения
			|	ИЗ
			|		РегистрНакопления.РаспределениеЗапасовДвижения КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Активность
			|			И Таблица.Поступило <> 0 ИЛИ Таблица.Отгрузить <> 0
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		0 КАК ВНаличииДвижения,
			|		Таблица.ВНаличии КАК ВНаличииСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)) КАК Набор
			|СГРУППИРОВАТЬ ПО
			|	Набор.Номенклатура,
			|	Набор.Характеристика,
			|	Набор.Склад
			|ИМЕЮЩИЕ
			|	СУММА(Набор.ВНаличииДвижения) <> СУММА(Набор.ВНаличииСведения)
			|;
			|
			|/////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	&ТекстСвободно КАК Состояние,
			|	СУММА(Набор.КОбеспечениюСведения) КАК КОбеспечениюСведения,
			|	СУММА(Набор.ЗапасСведения) КАК ЗапасСведения,
			|	СУММА(Набор.ЗапасНаСкладеСведения) КАК ЗапасНаСкладеСведения,
			|	СУММА(Набор.СвободноСведения) КАК СвободноСведения
			|ИЗ(
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.КОбеспечению КАК КОбеспечениюСведения,
			|		0 КАК ЗапасНаСкладеСведения,
			|		0 КАК ЗапасСведения,
			|		0 КАК СвободноСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		0 КАК КОбеспечениюСведения,
			|		ВЫБОР КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе) ТОГДА
			|					Таблица.Запас - Таблица.Резерв
			|				ИНАЧЕ
			|					0
			|			КОНЕЦ КАК ЗапасНаСкладеСведения,
			|		ВЫБОР КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе) ТОГДА
			|					0
			|				ИНАЧЕ
			|					Таблица.Запас
			|			КОНЕЦ КАК ЗапасСведения,
			|		Таблица.Свободно СвободноСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние В(
			|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе),
			|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление),
			|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеПодтвержденное))) КАК Набор
			|СГРУППИРОВАТЬ ПО
			|	Набор.Номенклатура,
			|	Набор.Характеристика,
			|	Набор.Склад,
			|	Набор.Назначение
			|ИМЕЮЩИЕ
			|	ВЫБОР КОГДА СУММА(Набор.ЗапасНаСкладеСведения) < 0 ТОГДА
			|				0
			|			КОГДА СУММА(Набор.КОбеспечениюСведения) > СУММА(Набор.ЗапасНаСкладеСведения) ТОГДА
			|				СУММА(Набор.ЗапасНаСкладеСведения)
			|			ИНАЧЕ
			|				СУММА(Набор.КОбеспечениюСведения)
			|		КОНЕЦ // Распределено на складе
			|		+ ВЫБОР КОГДА СУММА(Набор.КОбеспечениюСведения)
			|					- ВЫБОР КОГДА СУММА(Набор.ЗапасНаСкладеСведения) < 0 ТОГДА
			|								0
			|								КОГДА СУММА(Набор.КОбеспечениюСведения) > СУММА(Набор.ЗапасНаСкладеСведения) ТОГДА
			|									СУММА(Набор.ЗапасНаСкладеСведения)
			|							ИНАЧЕ
			|								СУММА(Набор.КОбеспечениюСведения)
			|						КОНЕЦ > СУММА(Набор.ЗапасСведения) ТОГДА
			|				СУММА(Набор.ЗапасСведения)
			|			ИНАЧЕ
			|				СУММА(Набор.КОбеспечениюСведения)
			|					- ВЫБОР КОГДА СУММА(Набор.ЗапасНаСкладеСведения) < 0 ТОГДА
			|								0
			|								КОГДА СУММА(Набор.КОбеспечениюСведения) > СУММА(Набор.ЗапасНаСкладеСведения) ТОГДА
			|									СУММА(Набор.ЗапасНаСкладеСведения)
			|							ИНАЧЕ
			|								СУММА(Набор.КОбеспечениюСведения)
			|						КОНЕЦ
			|		КОНЕЦ // Распределено в заказах
			|		<> СУММА(Набор.ЗапасСведения) + СУММА(Набор.ЗапасНаСкладеСведения) - СУММА(Набор.СвободноСведения)
			|;
			|
			|/////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Таблица.Номенклатура КАК Номенклатура,
			|	Таблица.Характеристика КАК Характеристика,
			|	Таблица.Склад КАК Склад,
			|	Таблица.Назначение КАК Назначение,
			|	Таблица.Состояние КАК СостояниеБлиже,
			|	Таблица.ЗаказНаПоступление КАК ЗаказНаПоступлениеБлиже,
			|	Таблица.ДатаПоступления КАК ДатаПоступленияБлиже,
			|	ВсеЧтоДальше.Состояние КАК СостояниеДальше,
			|	ВсеЧтоДальше.ЗаказНаПоступление КАК ЗаказНаПоступлениеДальше,
			|	ВсеЧтоДальше.ДатаПоступления КАК ДатаПоступленияДальше,
			|	&ТекстНарушенПорядокРаспределенияЗапаса КАК Состояние
			|ИЗ
			|	РегистрСведений.РаспределениеЗапасов КАК Таблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|		ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|		 И Фильтр.Характеристика = Таблица.Характеристика
			|		 И Фильтр.Склад = Таблица.Склад
			|		 И Фильтр.Назначение = Таблица.Назначение
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ВсеЧтоДальше
			|		ПО ВсеЧтоДальше.Номенклатура = Таблица.Номенклатура
			|		 И ВсеЧтоДальше.Характеристика = Таблица.Характеристика
			|		 И ВсеЧтоДальше.Склад = Таблица.Склад
			|		 И ВсеЧтоДальше.Назначение = Таблица.Назначение
			|		 И ВсеЧтоДальше.Состояние В(
			|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе),
			|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление),
			|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеПодтвержденное))
			|		 И ВЫБОР КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе) ТОГДА
			|				ВсеЧтоДальше.Состояние В(
			|					ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление),
			|					ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеПодтвержденное))
			|			КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление) ТОГДА
			|				ВсеЧтоДальше.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеПодтвержденное)
			|					ИЛИ ВсеЧтоДальше.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление)
			|						И ВсеЧтоДальше.ДатаПоступления > Таблица.ДатаПоступления
			|							ИЛИ ВсеЧтоДальше.ДатаПоступления = Таблица.ДатаПоступления
			|								И ВсеЧтоДальше.ЗаказНаПоступление > Таблица.ЗаказНаПоступление
			|			КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеПодтвержденное) ТОГДА
			|				ВсеЧтоДальше.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеПодтвержденное)
			|					И ВсеЧтоДальше.ЗаказНаПоступление > Таблица.ЗаказНаПоступление
			|			КОНЕЦ
			|
			|ГДЕ
			|	Таблица.Состояние В(
			|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе),
			|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление),
			|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеПодтвержденное))
			|		И Таблица.Свободно > 0 И ВсеЧтоДальше.Запас - ВсеЧтоДальше.Резерв - ВсеЧтоДальше.Свободно > 0
			|;
			|/////////////////////////////////////////////////////////////
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Таблица.Номенклатура КАК Номенклатура,
			|	Таблица.Характеристика КАК Характеристика,
			|	Таблица.Склад КАК Склад,
			|	Таблица.Назначение КАК Назначение,
			|	Таблица.ЗаказНаПоступление КАК ЗаказНаПоступление,
			|	&ТекстНарушенПорядокРасчетаГрафикаПоступленийПоДатам КАК Состояние
			|ИЗ
			|	РегистрСведений.РаспределениеЗапасов КАК Таблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|		ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|		 И Фильтр.Характеристика = Таблица.Характеристика
			|		 И Фильтр.Склад = Таблица.Склад
			|		 И Фильтр.Назначение = Таблица.Назначение
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РаспределениеЗапасовДвижения КАК ВсеЧтоДальше
			|		ПО ВсеЧтоДальше.Номенклатура = Таблица.Номенклатура
			|		 И ВсеЧтоДальше.Характеристика = Таблица.Характеристика
			|		 И ВсеЧтоДальше.Склад = Таблица.Склад
			|		 И ВсеЧтоДальше.Назначение = Таблица.Назначение
			|		 И ВсеЧтоДальше.ЗаказНаПоступление = Таблица.ЗаказНаПоступление
			|		 И ВсеЧтоДальше.ПоступитКДате > 0
			|		 И ВсеЧтоДальше.ДатаПоступления > Таблица.ДатаПоступления
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ВсеЧтоДальшеСведения
			|		ПО ВсеЧтоДальшеСведения.Номенклатура = Таблица.Номенклатура
			|		 И ВсеЧтоДальшеСведения.Характеристика = Таблица.Характеристика
			|		 И ВсеЧтоДальшеСведения.Склад = Таблица.Склад
			|		 И ВсеЧтоДальшеСведения.Назначение = Таблица.Назначение
			|		 И ВсеЧтоДальшеСведения.ЗаказНаПоступление = Таблица.ЗаказНаПоступление
			|		 И ВсеЧтоДальшеСведения.ДатаПоступления = ВсеЧтоДальше.ДатаПоступления
			|		 И ВсеЧтоДальшеСведения.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление)
			|
			|ГДЕ
			|	Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление)
			|		И Таблица.Запас > 0
			|СГРУППИРОВАТЬ ПО
			|	Таблица.Номенклатура,
			|	Таблица.Характеристика,
			|	Таблица.Склад,
			|	Таблица.Назначение,
			|	Таблица.ЗаказНаПоступление,
			|	Таблица.ДатаПоступления,
			|	ВсеЧтоДальше.ДатаПоступления
			|ИМЕЮЩИЕ
			|	СУММА(ВсеЧтоДальше.ПоступитКДате) > МАКСИМУМ(ЕСТЬNULL(ВсеЧтоДальшеСведения.Запас, 0))";
		
		Тексты.Добавить(Текст);
		
	КонецЕсли;
	
	Текст =
		"ВЫБРАТЬ
		|	Таблица.Состояние КАК Состояние,
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад КАК Склад,
		|	Таблица.Назначение КАК Назначение,
		|	Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
		|	Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	Таблица.ЗаказНаПоступление КАК ЗаказНаПоступление,
		|	Таблица.ДатаПоступления КАК ДатаПоступления,
		|	Таблица.ТипЗаписиРаспределенияЗапасов КАК ТипЗаписиРаспределенияЗапасов,
		|	Таблица.КОбеспечению КАК КОбеспечению,
		|	Таблица.Резервировать КАК Резервировать,
		|	Таблица.НеОбеспечивать КАК НеОбеспечивать,
		|	Таблица.Распределено КАК Распределено,
		|	Таблица.РезервПревышаетОстатки КАК РезервПревышаетОстатки,
		|	Таблица.НеОбеспечено КАК НеОбеспечено,
		|	Таблица.Запас КАК Запас,
		|	Таблица.Резерв КАК Резерв,
		|	Таблица.Свободно КАК Свободно,
		|	Таблица.ВНаличии КАК ВНаличии,
		|	Таблица.ОтложитьОбеспечение КАК ОтложитьОбеспечение
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК Таблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
		|		ПО Фильтр.Номенклатура = Таблица.Номенклатура
		|		 И Фильтр.Характеристика = Таблица.Характеристика
		|		 И Фильтр.Склад = Таблица.Склад
		|		 И Фильтр.Назначение = Таблица.Назначение
		|ГДЕ
		|	ВЫБОР КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка) ТОГДА
		|			Таблица.КОбеспечению = 0 И Таблица.Резервировать = 0 И Таблица.НеОбеспечивать = 0 И Таблица.ОтложитьОбеспечение = 0
		|				ИЛИ Таблица.Распределено <> 0 ИЛИ Таблица.НеОбеспечено <> 0 ИЛИ Таблица.Запас <> 0 ИЛИ Таблица.Резерв <> 0 ИЛИ Таблица.Свободно <> 0 ИЛИ Таблица.ВНаличии <> 0
		|				ИЛИ Таблица.ЗаказНаОтгрузку = НЕОПРЕДЕЛЕНО ИЛИ Таблица.ЗаказНаПоступление <> НЕОПРЕДЕЛЕНО ИЛИ Таблица.ДатаПоступления <> ДАТАВРЕМЯ(1,1,1) ИЛИ Таблица.ТипЗаписиРаспределенияЗапасов <> 1
		|		КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе) ТОГДА
		|			Таблица.Запас = 0 И Таблица.Свободно = 0 И Таблица.Резерв = 0 И ВЫБОР КОГДА Таблица.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА Таблица.ВНаличии = 0 ИНАЧЕ ИСТИНА КОНЕЦ
		|				ИЛИ Таблица.Распределено <> 0 ИЛИ Таблица.КОбеспечению <> 0 ИЛИ Таблица.Резервировать <> 0 ИЛИ Таблица.НеОбеспечивать <> 0 ИЛИ Таблица.НеОбеспечено <> 0 ИЛИ Таблица.ОтложитьОбеспечение <> 0
		|				ИЛИ Таблица.ЗаказНаОтгрузку <> НЕОПРЕДЕЛЕНО ИЛИ Таблица.ЖелаемаяДатаОтгрузки <> ДАТАВРЕМЯ(1,1,1) ИЛИ Таблица.ЗаказНаПоступление <> НЕОПРЕДЕЛЕНО ИЛИ Таблица.ДатаПоступления <> ДАТАВРЕМЯ(1,1,1) ИЛИ Таблица.ТипЗаписиРаспределенияЗапасов <> 1
		|		КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление) ТОГДА
		|			Таблица.Запас = 0 И Таблица.Свободно = 0
		|				ИЛИ Таблица.ВНаличии <> 0 ИЛИ Таблица.Резерв <> 0 ИЛИ Таблица.Распределено <> 0 ИЛИ Таблица.КОбеспечению <> 0 ИЛИ Таблица.Резервировать <> 0 ИЛИ Таблица.НеОбеспечивать <> 0 ИЛИ Таблица.НеОбеспечено <> 0 ИЛИ Таблица.ОтложитьОбеспечение <> 0
		|				ИЛИ Таблица.ЗаказНаОтгрузку <> НЕОПРЕДЕЛЕНО ИЛИ Таблица.ЖелаемаяДатаОтгрузки <> ДАТАВРЕМЯ(1,1,1) ИЛИ Таблица.ЗаказНаПоступление = НЕОПРЕДЕЛЕНО ИЛИ Таблица.ДатаПоступления = ДАТАВРЕМЯ(1,1,1) ИЛИ Таблица.ТипЗаписиРаспределенияЗапасов <> 1
		|		КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеПодтвержденное) ТОГДА
		|			Таблица.Запас = 0 И Таблица.Свободно = 0
		|				ИЛИ Таблица.ВНаличии <> 0 ИЛИ Таблица.Резерв <> 0 ИЛИ Таблица.Распределено <> 0 ИЛИ Таблица.КОбеспечению <> 0 ИЛИ Таблица.Резервировать <> 0 ИЛИ Таблица.НеОбеспечивать <> 0 ИЛИ Таблица.НеОбеспечено <> 0 ИЛИ Таблица.ОтложитьОбеспечение <> 0
		|				ИЛИ Таблица.ЗаказНаОтгрузку <> НЕОПРЕДЕЛЕНО ИЛИ Таблица.ЖелаемаяДатаОтгрузки <> ДАТАВРЕМЯ(1,1,1) ИЛИ Таблица.ЗаказНаПоступление = НЕОПРЕДЕЛЕНО ИЛИ Таблица.ДатаПоступления <> ДАТАВРЕМЯ(1,1,1) ИЛИ Таблица.ТипЗаписиРаспределенияЗапасов <> 1
		|		КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве) ТОГДА
		|			Таблица.Распределено = 0
		|				ИЛИ Таблица.Запас <> 0 ИЛИ Таблица.Свободно <> 0 ИЛИ Таблица.ВНаличии <> 0 ИЛИ Таблица.Резерв <> 0 ИЛИ Таблица.КОбеспечению <> 0 ИЛИ Таблица.Резервировать <> 0 ИЛИ Таблица.НеОбеспечивать <> 0 ИЛИ Таблица.НеОбеспечено <> 0 ИЛИ Таблица.ОтложитьОбеспечение <> 0
		|				ИЛИ Таблица.ЗаказНаОтгрузку = НЕОПРЕДЕЛЕНО ИЛИ Таблица.ЗаказНаПоступление <> НЕОПРЕДЕЛЕНО ИЛИ Таблица.ДатаПоступления <> ДАТАВРЕМЯ(1,1,1) ИЛИ Таблица.ТипЗаписиРаспределенияЗапасов <> 1
		|		КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.НеОбеспечивать) ТОГДА
		|			Таблица.НеОбеспечено = 0
		|				ИЛИ Таблица.Запас <> 0 ИЛИ Таблица.Свободно <> 0 ИЛИ Таблица.ВНаличии <> 0 ИЛИ Таблица.Резерв <> 0 ИЛИ Таблица.Распределено <> 0 ИЛИ Таблица.КОбеспечению <> 0 ИЛИ Таблица.Резервировать <> 0 ИЛИ Таблица.НеОбеспечивать <> 0 ИЛИ Таблица.ОтложитьОбеспечение <> 0
		|				ИЛИ Таблица.ЗаказНаОтгрузку = НЕОПРЕДЕЛЕНО ИЛИ Таблица.ЗаказНаПоступление <> НЕОПРЕДЕЛЕНО ИЛИ Таблица.ДатаПоступления <> ДАТАВРЕМЯ(1,1,1) ИЛИ Таблица.ТипЗаписиРаспределенияЗапасов <> 1
		|		КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченКДате) ТОГДА
		|			Таблица.Распределено = 0
		|				ИЛИ Таблица.Запас <> 0 ИЛИ Таблица.Свободно <> 0 ИЛИ Таблица.ВНаличии <> 0 ИЛИ Таблица.Резерв <> 0 ИЛИ Таблица.КОбеспечению <> 0 ИЛИ Таблица.Резервировать <> 0 ИЛИ Таблица.НеОбеспечивать <> 0 ИЛИ Таблица.НеОбеспечено <> 0 ИЛИ Таблица.ОтложитьОбеспечение <> 0
		|				ИЛИ Таблица.ЗаказНаОтгрузку = НЕОПРЕДЕЛЕНО ИЛИ Таблица.ЗаказНаПоступление = НЕОПРЕДЕЛЕНО ИЛИ Таблица.ДатаПоступления = ДАТАВРЕМЯ(1,1,1) ИЛИ Таблица.ТипЗаписиРаспределенияЗапасов <> 0
		|		КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.Обеспечить) ТОГДА
		|			Таблица.НеОбеспечено = 0
		|				ИЛИ Таблица.Запас <> 0 ИЛИ Таблица.Свободно <> 0 ИЛИ Таблица.ВНаличии <> 0 ИЛИ Таблица.Резерв <> 0 ИЛИ Таблица.КОбеспечению <> 0 ИЛИ Таблица.Резервировать <> 0 ИЛИ Таблица.НеОбеспечивать <> 0 ИЛИ Таблица.Распределено <> 0 ИЛИ Таблица.ОтложитьОбеспечение <> 0
		|				ИЛИ Таблица.ЗаказНаОтгрузку = НЕОПРЕДЕЛЕНО ИЛИ Таблица.ЗаказНаПоступление <> НЕОПРЕДЕЛЕНО ИЛИ Таблица.ДатаПоступления <> ДАТАВРЕМЯ(1,1,1) ИЛИ Таблица.ТипЗаписиРаспределенияЗапасов <> 0
		|		КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОтложитьОбеспечение) ТОГДА
		|			Таблица.НеОбеспечено = 0
		|				ИЛИ Таблица.Запас <> 0 ИЛИ Таблица.Свободно <> 0 ИЛИ Таблица.ВНаличии <> 0 ИЛИ Таблица.Резерв <> 0 ИЛИ Таблица.КОбеспечению <> 0 ИЛИ Таблица.Резервировать <> 0 ИЛИ Таблица.НеОбеспечивать <> 0 ИЛИ Таблица.Распределено <> 0 ИЛИ Таблица.ОтложитьОбеспечение <> 0
		|				ИЛИ Таблица.ЗаказНаОтгрузку = НЕОПРЕДЕЛЕНО ИЛИ Таблица.ЖелаемаяДатаОтгрузки = ДАТАВРЕМЯ(1,1,1) ИЛИ Таблица.ЗаказНаПоступление <> НЕОПРЕДЕЛЕНО ИЛИ Таблица.ДатаПоступления <> ДАТАВРЕМЯ(1,1,1) ИЛИ Таблица.ТипЗаписиРаспределенияЗапасов <> 0
		|		КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе) ТОГДА
		|			Таблица.Распределено = 0
		|				ИЛИ Таблица.Запас <> 0 ИЛИ Таблица.Свободно <> 0 ИЛИ Таблица.ВНаличии <> 0 ИЛИ Таблица.Резерв <> 0 ИЛИ Таблица.КОбеспечению <> 0 ИЛИ Таблица.Резервировать <> 0 ИЛИ Таблица.НеОбеспечивать <> 0 ИЛИ Таблица.НеОбеспечено <> 0 ИЛИ Таблица.ОтложитьОбеспечение <> 0
		|				ИЛИ Таблица.ЗаказНаОтгрузку = НЕОПРЕДЕЛЕНО ИЛИ Таблица.ЗаказНаПоступление <> НЕОПРЕДЕЛЕНО ИЛИ Таблица.ДатаПоступления <> ДАТАВРЕМЯ(1,1,1) ИЛИ Таблица.ТипЗаписиРаспределенияЗапасов <> 0
		|		КОГДА Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу) ТОГДА
		|			Таблица.Распределено = 0
		|				ИЛИ Таблица.Запас <> 0 ИЛИ Таблица.Свободно <> 0 ИЛИ Таблица.ВНаличии <> 0 ИЛИ Таблица.Резерв <> 0 ИЛИ Таблица.КОбеспечению <> 0 ИЛИ Таблица.Резервировать <> 0 ИЛИ Таблица.НеОбеспечивать <> 0 ИЛИ Таблица.НеОбеспечено <> 0 ИЛИ Таблица.ОтложитьОбеспечение <> 0
		|				ИЛИ Таблица.ЗаказНаОтгрузку = НЕОПРЕДЕЛЕНО ИЛИ Таблица.ЗаказНаПоступление = НЕОПРЕДЕЛЕНО ИЛИ Таблица.ДатаПоступления <> ДАТАВРЕМЯ(1,1,1) ИЛИ Таблица.ТипЗаписиРаспределенияЗапасов <> 0
		|		ИНАЧЕ
		|			ИСТИНА
		|		КОНЕЦ";
		
	Тексты.Добавить(Текст);
	
	Если ПроверятьРаспределение Тогда
		
		Текст =
			"ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	Набор.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|	Набор.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.Обеспечить) КАК Состояние,
			|	СУММА(Набор.КОбеспечениюДвижения) КАК КОбеспечениюДвижения,
			|	СУММА(Набор.КОбеспечениюСведения) КАК КОбеспечениюСведения
			|ИЗ(
			|ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|		Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|		Таблица.КОбеспечению КАК КОбеспечениюДвижения,
			|		0 КАК КОбеспечениюСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|		Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|		0 КАК КОбеспечениюДвижения,
			|		Таблица.НеОбеспечено + Таблица.Распределено КАК КОбеспечениюСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние В(
			|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.Обеспечить),
			|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченКДате),
			|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу),
			|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе))) КАК Набор
			|СГРУППИРОВАТЬ ПО
			|	Набор.Номенклатура,
			|	Набор.Характеристика,
			|	Набор.Склад,
			|	Набор.Назначение,
			|	Набор.ЗаказНаОтгрузку,
			|	Набор.ЖелаемаяДатаОтгрузки
			|ИМЕЮЩИЕ
			|	СУММА(Набор.КОбеспечениюДвижения) <> СУММА(Набор.КОбеспечениюСведения)
			|;
			|/////////////////////////////////////////////////////////////
			|
			|ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	Набор.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|	Набор.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОтложитьОбеспечение) КАК Состояние,
			|	СУММА(Набор.ОтложитьОбеспечениеДвижения) КАК ОтложитьОбеспечениеДвижения,
			|	СУММА(Набор.ОтложитьОбеспечениеСведения) КАК ОтложитьОбеспечениеСведения
			|ИЗ(
			|ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|		Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|		Таблица.ОтложитьОбеспечение КАК ОтложитьОбеспечениеДвижения,
			|		0 КАК ОтложитьОбеспечениеСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|		Таблица.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|		0 КАК ОтложитьОбеспечениеДвижения,
			|		Таблица.НеОбеспечено КАК ОтложитьОбеспечениеСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОтложитьОбеспечение)) КАК Набор
			|СГРУППИРОВАТЬ ПО
			|	Набор.Номенклатура,
			|	Набор.Характеристика,
			|	Набор.Склад,
			|	Набор.Назначение,
			|	Набор.ЗаказНаОтгрузку,
			|	Набор.ЖелаемаяДатаОтгрузки
			|ИМЕЮЩИЕ
			|	СУММА(Набор.ОтложитьОбеспечениеДвижения) <> СУММА(Набор.ОтложитьОбеспечениеСведения)
			|;
			|/////////////////////////////////////////////////////////////
			|
			|ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе) КАК Состояние,
			|	СУММА(Набор.РаспределеноДвижения) КАК РаспределеноДвижения,
			|	СУММА(Набор.РаспределеноСведения) КАК РаспределеноСведения
			|ИЗ(
			|ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.Запас - Таблица.Свободно - Таблица.Резерв КАК РаспределеноДвижения,
			|		0 КАК РаспределеноСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		0 КАК РаспределеноДвижения,
			|		Таблица.Распределено КАК РаспределеноСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе)) КАК Набор
			|СГРУППИРОВАТЬ ПО
			|	Набор.Номенклатура,
			|	Набор.Характеристика,
			|	Набор.Склад,
			|	Набор.Назначение
			|ИМЕЮЩИЕ
			|	СУММА(Набор.РаспределеноДвижения) <> СУММА(Набор.РаспределеноСведения)
			|;
			|/////////////////////////////////////////////////////////////
			|
			|ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	Набор.ЗаказНаПоступление КАК ЗаказНаПоступление,
			|	Набор.ДатаПоступления КАК ДатаПоступления,
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченКДате) КАК Состояние,
			|	СУММА(Набор.РаспределеноДвижения) КАК РаспределеноДвижения,
			|	СУММА(Набор.РаспределеноСведения) КАК РаспределеноСведения
			|ИЗ(
			|ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаПоступление КАК ЗаказНаПоступление,
			|		Таблица.ДатаПоступления КАК ДатаПоступления,
			|		Таблица.Запас - Таблица.Свободно КАК РаспределеноДвижения,
			|		0 КАК РаспределеноСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаПоступление КАК ЗаказНаПоступление,
			|		Таблица.ДатаПоступления КАК ДатаПоступления,
			|		0 КАК РаспределеноДвижения,
			|		Таблица.Распределено КАК РаспределеноСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченКДате)) КАК Набор
			|СГРУППИРОВАТЬ ПО
			|	Набор.Номенклатура,
			|	Набор.Характеристика,
			|	Набор.Склад,
			|	Набор.Назначение,
			|	Набор.ЗаказНаПоступление,
			|	Набор.ДатаПоступления
			|ИМЕЮЩИЕ
			|	СУММА(Набор.РаспределеноДвижения) <> СУММА(Набор.РаспределеноСведения)
			|;
			|/////////////////////////////////////////////////////////////
			|
			|ВЫБРАТЬ
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	Набор.ЗаказНаПоступление КАК ЗаказНаПоступление,
			|	Набор.ДатаПоступления КАК ДатаПоступления,
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу) КАК Состояние,
			|	СУММА(Набор.РаспределеноДвижения) КАК РаспределеноДвижения,
			|	СУММА(Набор.РаспределеноСведения) КАК РаспределеноСведения
			|ИЗ(
			|ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаПоступление КАК ЗаказНаПоступление,
			|		Таблица.ДатаПоступления КАК ДатаПоступления,
			|		Таблица.Запас - Таблица.Свободно КАК РаспределеноДвижения,
			|		0 КАК РаспределеноСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ПоступлениеНеПодтвержденное)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|	ВЫБРАТЬ
			|		Таблица.Номенклатура КАК Номенклатура,
			|		Таблица.Характеристика КАК Характеристика,
			|		Таблица.Склад КАК Склад,
			|		Таблица.Назначение КАК Назначение,
			|		Таблица.ЗаказНаПоступление КАК ЗаказНаПоступление,
			|		Таблица.ДатаПоступления КАК ДатаПоступления,
			|		0 КАК РаспределеноДвижения,
			|		Таблица.Распределено КАК РаспределеноСведения
			|	ИЗ
			|		РегистрСведений.РаспределениеЗапасов КАК Таблица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК Фильтр
			|			ПО Фильтр.Номенклатура = Таблица.Номенклатура
			|			 И Фильтр.Характеристика = Таблица.Характеристика
			|			 И Фильтр.Склад = Таблица.Склад
			|			 И Фильтр.Назначение = Таблица.Назначение
			|	ГДЕ
			|		Таблица.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу)) КАК Набор
			|СГРУППИРОВАТЬ ПО
			|	Набор.Номенклатура,
			|	Набор.Характеристика,
			|	Набор.Склад,
			|	Набор.Назначение,
			|	Набор.ЗаказНаПоступление,
			|	Набор.ДатаПоступления
			|ИМЕЮЩИЕ
			|	СУММА(Набор.РаспределеноДвижения) <> СУММА(Набор.РаспределеноСведения)";
		
		Тексты.Добавить(Текст);
		
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	Если Товар <> Неопределено Тогда
		Запрос.УстановитьПараметр("Номенклатура", Товар.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Товар.Характеристика);
		Запрос.УстановитьПараметр("Склад", Товар.Склад);
		Запрос.УстановитьПараметр("Назначение", Товар.Назначение);
	КонецЕсли;
	Запрос.УстановитьПараметр("ТекстНесоответствиеДат", НСтр("ru = 'Даты поступления отсутствуют в движениях';
															|en = 'Dates of receipt are missing in register records'"));
	Запрос.УстановитьПараметр("ТекстСвободно", НСтр("ru = 'Свободный остаток';
													|en = 'Available inventory'"));
	Запрос.УстановитьПараметр("ТекстНарушенПорядокРаспределенияЗапаса", НСтр("ru = 'Нарушен порядок распределения запаса';
																			|en = 'Inventory allocation procedure is violated'"));
	Запрос.УстановитьПараметр("ТекстВНаличии", НСтр("ru = 'В наличии';
													|en = 'In stock'"));
	Запрос.УстановитьПараметр("ТекстНарушенПорядокРасчетаГрафикаПоступленийПоДатам", НСтр("ru = 'Нарушен порядок расчета графика поступления по датам';
																							|en = 'The procedure for calculating the receipt schedule by dates is violated'"));
	Пакет = Запрос.ВыполнитьПакет();
	Возврат Пакет;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СообщитьОНеудачнойОбработкеНоменклатуры()
	
	ТекстСообщения = НСтр("ru = 'Задание распределения запасов завершилось неудачно по причине: %Причина%';
							|en = 'Inventory allocation job failed. Reason: %Причина%'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	СобытиеЖурнала = НСтр("ru = 'Распределение запасов';
							|en = 'Inventory allocation'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(СобытиеЖурнала,
	УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.РаспределениеЗапасов,, ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти
