#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Формирует пустую структуру данных строки отчета.
Функция СформироватьСтруктуруДанныхСтрокиОтчета() Экспорт
	
	СправочникБДР="СтатьиДоходовИРасходов";
	СправочникРесурсы="СтатьиДвиженияРесурсов";
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ГруппаРаскрытия",				 Справочники.ГруппыРаскрытия.ПустаяСсылка());
	РезультатФункции.Вставить("ПриходРасход",					 Перечисления.ВидыДвиженийПриходРасход.ПустаяСсылка());
	РезультатФункции.Вставить("СтатьяДвиженияДенежныхСредств",	 Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
	РезультатФункции.Вставить("СтатьяДоходовИРасходов",			 Справочники[СправочникБДР].ПустаяСсылка());
	РезультатФункции.Вставить("СтатьяДвиженияРесурсов",			 Справочники[СправочникРесурсы].ПустаяСсылка());
	Возврат РезультатФункции;
КонецФункции		// СформироватьСтруктуруДанныхСтрокиОтчета()

// Возвращает структура данных строки отчета СтрокаВход.
Функция ПолучитьСтруктуруДанныхСтрокиОтчета(СтрокаВход) Экспорт
	РезультатФункции = СформироватьСтруктуруДанныхСтрокиОтчета();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтрокиОтчетов.ГруппаРаскрытия КАК ГруппаРаскрытия,
		|	СтрокиОтчетов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	СтрокиОтчетов.СтатьяДоходовИРасходов КАК СтатьяДоходовИРасходов,
		|	СтрокиОтчетов.ПриходРасход КАК ПриходРасход,
		|	СтрокиОтчетов.СтатьяДвиженияРесурсов КАК СтатьяДвиженияРесурсов
		|ИЗ
		|	Справочник.СтрокиОтчетов КАК СтрокиОтчетов
		|ГДЕ
		|	СтрокиОтчетов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СтрокаВход);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезультатФункции.Вставить("ГруппаРаскрытия",				 ВыборкаДетальныеЗаписи.ГруппаРаскрытия);
		РезультатФункции.Вставить("ПриходРасход",					 ВыборкаДетальныеЗаписи.ПриходРасход);
		РезультатФункции.Вставить("СтатьяДвиженияДенежныхСредств",	 ВыборкаДетальныеЗаписи.СтатьяДвиженияДенежныхСредств);
		РезультатФункции.Вставить("СтатьяДоходовИРасходов",			 ВыборкаДетальныеЗаписи.СтатьяДоходовИРасходов);
		РезультатФункции.Вставить("СтатьяДвиженияРесурсов",			 ВыборкаДетальныеЗаписи.СтатьяДвиженияРесурсов);
	КонецЦикла;
	Возврат РезультатФункции;
КонецФункции		// ПолучитьСтруктуруДанныхСтрокиОтчета()

#КонецЕсли