#Область ПрограммныйИнтерфейс

Процедура НастроитьФормуОбъектаУчета(Форма, Отказ, СтандартнаяОбработка) Экспорт

	Элементы	= Форма.Элементы;
	Объект		= Форма.Объект;
	Команды		= Форма.Команды;
	
	// Добавим группу МСФО.
	ГруппаМСФО = Элементы.Добавить("ГруппаРеквизитыМСФОУХ", Тип("ГруппаФормы"));
	ГруппаМСФО.Заголовок = Нстр("ru = 'МСФО'");
	ГруппаМСФО.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаМСФО.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаМСФО.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаМСФО.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	ГруппаМСФО.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	
	Элементы.Переместить(ГруппаМСФО, Форма, Элементы.ГруппаДополнительныеРеквизиты);
		
	// Сумма
	НовыйЭлемент = Элементы.Добавить("Сумма", Тип("ПолеФормы"),ГруппаМСФО);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Сумма";
	
	// КурсПлатежа
	НовыйЭлемент = Элементы.Добавить("КурсПлатежа", Тип("ПолеФормы"),ГруппаМСФО);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.КурсПлатежа";

	// КратностьПлатежа
	НовыйЭлемент = Элементы.Добавить("КратностьПлатежа", Тип("ПолеФормы"),ГруппаМСФО);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.КратностьПлатежа";
	
	// Параметры учета по умолчанию.
	НовыйЭлемент = Элементы.Добавить("ПараметрыУчетаФИ", Тип("ПолеФормы"),ГруппаМСФО);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ПараметрыУчетаФИ";
	НовыйЭлемент.ВысотаЗаголовка = 2;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НастройкаМСФОПриИзменении");
	
	// Кнопка "Хеджируемые договоры;
	НоваяКоманда = Команды.Добавить("ХеджируемыеДоговоры");
	НоваяКоманда.Заголовок = НСтр("ru = 'Хеджируемые договоры'");
	НоваяКоманда.Действие = "Подключаемый_НастройкаМСФОПриИзменении";
	НовыйЭлемент = Элементы.Добавить("ХеджируемыеДоговоры", Тип("КнопкаФормы"), ГруппаМСФО);
	НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
	НовыйЭлемент.ИмяКоманды = "ХеджируемыеДоговоры";
	
	// Котировка.
	НовыйЭлемент = Элементы.Добавить("Котировка", Тип("ПолеФормы"),ГруппаМСФО);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Котировка";
	
	// Уровень иерархии справедливой стоимости.
	НовыйЭлемент = Элементы.Добавить("УровеньИерархииСправедливойСтоимости", Тип("ПолеФормы"),ГруппаМСФО);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.УровеньИерархииСправедливойСтоимости";
	
	// Ручной расчет резерва по задолженности.
	НовыйЭлемент = Элементы.Добавить("РучнойРасчетРезерваПоЗадолженности", Тип("ПолеФормы"),ГруппаМСФО);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.РучнойРасчетРезерваПоЗадолженности";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;

	// Настройки срока оплаты.
	РеквизитРасчетОплатыУХ = Новый РеквизитФормы("РасчетОплатыУХ", ОбщегоНазначения.ОписаниеТипаЧисло(1),,НСтр("ru = 'Способ задания срока оплаты'"));
	Форма.ИзменитьРеквизиты(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РеквизитРасчетОплатыУХ));
	
	Элементы.ГруппаСрокОплаты.Видимость = Ложь; // отключим элементы БП.
	
	ГруппаСрокОплаты = Элементы.Добавить("ГруппаСрокОплатыУХ", Тип("ГруппаФормы"), ГруппаМСФО);
	ГруппаСрокОплаты.Заголовок = НСтр("ru = 'Срок оплаты'");
	ГруппаСрокОплаты.Вид = ВидГруппыФормы.ОбычнаяГруппа;	
	ГруппаСрокОплаты.ОтображатьЗаголовок = Ложь;
	ГруппаСрокОплаты.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСрокОплаты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	НовыйЭлемент = Элементы.Добавить("РасчетОплатыУХ", Тип("ПолеФормы"),ГруппаСрокОплаты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеПереключателя;
	НовыйЭлемент.ВидПереключателя = ВидПереключателя.Тумблер;
	НовыйЭлемент.СписокВыбора.Добавить(0, НСтр("ru = 'Не установлен'"));
	НовыйЭлемент.СписокВыбора.Добавить(1, НСтр("ru = 'Срок оплаты'"));
	НовыйЭлемент.СписокВыбора.Добавить(2, НСтр("ru = 'Дата оплаты'"));
	НовыйЭлемент.ПутьКДанным = "РасчетОплатыУХ";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НастройкаМСФОПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("ДатаОплаты", Тип("ПолеФормы"),ГруппаСрокОплаты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ДатаОплаты";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	НовыйЭлемент = Элементы.Добавить("СрокОплатыУХ", Тип("ПолеФормы"),ГруппаСрокОплаты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.СрокОплаты";
	НовыйЭлемент.Заголовок = Нстр("ru = 'дней'");
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	// Команда "Объекты, финансируемые по ФИ"
	НоваяКоманда = Команды.Добавить("ОбъектыПоФИ");
	НоваяКоманда.Заголовок = НСтр("ru = 'Объекты, финансируемые по финансовому инструменту'");
	НоваяКоманда.Действие = "Подключаемый_НастройкаМСФОПриИзменении";
	НовыйЭлемент = Элементы.Добавить("ОбъектыПоФИ", Тип("КнопкаФормы"), ГруппаМСФО);
	НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
	НовыйЭлемент.ИмяКоманды = "ОбъектыПоФИ";
	
	// Группа "Классификация"
	ГруппаКлассификация = Элементы.Добавить("ГруппаКлассификация", Тип("ГруппаФормы"), ГруппаМСФО);
	ГруппаКлассификация.Заголовок = НСтр("ru = 'Классификация'");
	ГруппаКлассификация.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКлассификация.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаКлассификация.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	// Предмет договора.
	НовыйЭлемент = Элементы.Добавить("КлассДоговора", Тип("ПолеФормы"),ГруппаКлассификация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.КлассДоговора";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НастройкаМСФОПриИзменении");
	
	// Обеспечение.
	НовыйЭлемент = Элементы.Добавить("Обеспеченность", Тип("ПолеФормы"),ГруппаКлассификация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Обеспеченность";

	// Срочность задолженности.
	НовыйЭлемент = Элементы.Добавить("СрочностьЗадолженности", Тип("ПолеФормы"),ГруппаКлассификация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.СрочностьЗадолженности";
	
	// Инициализируем реквизит по данным объекта
	Если Объект.УстановленСрокОплаты Тогда
		Если Объект.ИспользоватьДатуОплаты Тогда
			Форма.РасчетОплатыУХ = 2;
		Иначе
			Форма.РасчетОплатыУХ = 1;
		КонецЕсли;
	Иначе
		Форма.РасчетОплатыУХ = 0;
	КонецЕсли;
	
	// Инициализируем видимость элементов.
	ДоговорыКонтрагентовФормыБМКлиентСервер.УправлениеФормой_МСФО(Форма);
КонецПроцедуры

#КонецОбласти