
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФайлИмпорта.Видимость=ЗначениеЗаполнено(Объект.ФайлИмпорта);
	
	Элементы.ДекорацияЕстьОшибки.Видимость=Объект.ЕстьОшибки;
	
	Элементы.Обработано.Видимость=(Объект.ЕстьОшибки ИЛИ Объект.Реструктуризация);
	Элементы.ЗаписиОтработано.Видимость=Элементы.Обработано.Видимость;
	Элементы.ЗаписиПоказательОтчета.Видимость=Объект.Реструктуризация;
	
	Если Объект.Реструктуризация Тогда
		
		Элементы.ЗаписиОбъектДанных.Заголовок="Правило обработки";
		
	КонецЕсли;
	
	ДанныеРеструктуризации=РеквизитФормыВЗначение("Объект").ДанныеРеструктуризации.Получить();
	
	Если ТипЗнч(ДанныеРеструктуризации)=Тип("Структура") Тогда
		
		ОбщегоНазначенияКлиентСерверУХ.ПоместитьТаблицуЗначенийВКоллекциюФормы(ДанныеРеструктуризации.ТаблицаАналитикСтар,ТаблицаАналитикСтар);
		ОбщегоНазначенияКлиентСерверУХ.ПоместитьТаблицуЗначенийВКоллекциюФормы(ДанныеРеструктуризации.ТаблицаАналитикНов,ТаблицаАналитикНов);
		
		Элементы.ГруппаРеструктуризация.Видимость=Истина;
		
	Иначе
		
		Элементы.ГруппаРеструктуризация.Видимость=Ложь;
		
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаписиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	РасширениеБизнесЛогикиУХКлиент.ПротоколируемыеСобытия_ЗаписиВыбор(
		ЭтаФорма,
		Объект,
		Элементы.Записи.ТекущиеДанные);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработаноПриИзменении(Элемент)
	
	Если Объект.Обработано Тогда
		
		Для Каждого Строка ИЗ Объект.Записи Цикл
			
			Строка.Обработано=Истина;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписиОтработаноПриИзменении(Элемент)
	
	Объект.Обработано=Объект.Записи.НайтиСтроки(Новый Структура("Обработано",Ложь)).Количество()=0;
	
КонецПроцедуры
