
Процедура ЗаполнитьСтрокиПредварительногоЗаказаВендору(ПредварительныйЗаказВендору = Неопределено, НоваяСтрока) Экспорт
	
	Запрос = Новый Запрос;
	Заказы = Новый Массив;
	Заказы.Добавить(ПредварительныйЗаказВендору);
	Запрос.УстановитьПараметр("Заказы", Заказы);

	Запрос.Текст = "ВЫБРАТЬ
					|	ПЗВ.Ссылка КАК ПредварительныйЗаказВендору,
					|	ПЗВ.СуммаДокумента КАК СуммаПредварительногоЗаказа,
					|	З.Ссылка КАК ЗаказПоставщику,
					|	З.СуммаДокумента КАК СуммаЗаказа,
					|	П.Ссылка КАК ПриобретениеТоваровУслуг,
					|	П.СуммаДокумента КАК СуммаПриобретения
					|ИЗ
					|	Документ.ллл_ПредварительныйЗаказЗаводуИзготовителю КАК ПЗВ
					|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК З
					|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК П
					|				ПО (П.ЗаказПоставщику = З.Ссылка
					|					И П.Ссылка.Проведен)		
					|			ПО (З.ДокументОснование = ПЗВ.Ссылка
					|					И З.Ссылка.Проведен)		
					|ГДЕ
					|	ПЗВ.Ссылка В (&Заказы)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры