#Область ПрограммныйИнтерфейс


// Открывает форму настройки шаблонов проводок по данным оперативного учета.
// 
// Параметры:
// 	ПараметрыФормы - См. МеждународныйУчетКлиент.ПараметрыОткрытияФормНастройкиПроводок
// 	ФормаВладелец - ФормаКлиентскогоПриложения - Владелец формы настройки.
// 	ХозяйственнаяОперация - СправочникСсылка.НастройкиХозяйственныхОпераций - Операция, для которой необходимо выполнить настройку.
// 	                                                                          Если Неопределено, тогда форма открывается без отбора по операции.
//
Процедура ОткрытьНастройкуШаблоновПроводок(ПараметрыФормы, ФормаВладелец, ХозяйственнаяОперация = Неопределено) Экспорт
	
	Если ХозяйственнаяОперация <> Неопределено Тогда
		ПараметрыФормы.Вставить("ХозяйственнаяОперация", ХозяйственнаяОперация);
	КонецЕсли;
	ОткрытьФорму("Обработка.НастройкаШаблоновПроводокДляМеждународногоУчета.Форма.НастройкаШаблоновПроводок", 
		ПараметрыФормы, ФормаВладелец);
	
КонецПроцедуры

// Открывает форму настройки счетов по объектам учета.
// 
// Параметры:
// 	ПараметрыФормы - См. МеждународныйУчетКлиент.ПараметрыОткрытияФормНастройкиПроводок
// 	ФормаВладелец - ФормаКлиентскогоПриложения - Владелец формы настройки.
// 	ОбъектУчета - ПеречислениеСсылка.ОбъектыБухгалтерскогоУчета - Объект учета, на которого необходимо выполнить настройку
// 	ОбъектНастройки - Произвольный - Объект настройки
//
Процедура ОткрытьНастройкуСчетовПоОбъектамУчета(ПараметрыФормы, ФормаВладелец, ОбъектУчета = Неопределено, ОбъектНастройки = Неопределено) Экспорт
	
	Если ОбъектУчета <> Неопределено Тогда
		ПараметрыФормы.Вставить("ОбъектУчета", ОбъектУчета);
	КонецЕсли;
	Если ОбъектНастройки <> Неопределено Тогда
		ПараметрыФормы.Вставить("ОбъектНастройки", ОбъектНастройки);
	КонецЕсли;
	ОткрытьФорму("Обработка.НастройкаСчетовМеждународногоУчета.Форма.Форма", 
		ПараметрыФормы, ФормаВладелец);
	
КонецПроцедуры

#КонецОбласти