Функция ллл_ДобавитьКомандуОтчетаВДокумент(КомандыОтчетов) Экспорт

	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.ллл_ОтчетОСтруктуреОплатыПТУ) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Отчеты.ллл_ОтчетОСтруктуреОплатыПТУ.ПолноеИмя();
		КомандаОтчет.Представление = "Отчет о структуре оплаты ПТУ (3l)";
		КомандаОтчет.МножественныйВыбор = Истина;
		КомандаОтчет.Важность = "Важное";
		КомандаОтчет.ТипПараметра=тип("ДокументСсылка.ПриобретениеТоваровУслуг");
		КомандаОтчет.ИмяПараметраФормы="Отбор.ПТУ";
		
		Возврат КомандаОтчет;
		
	КонецЕсли;

	Возврат Неопределено;

КонецФункции