////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПРЕОБРАЗОВАНИЯ ТАБЛИЧНОЙ ЧАСТИ В ДЕРЕВО ЗНАЧЕНИЙ.
//

Функция ВернутьДеревоСтруктуры(СсылкаНаОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.КодПоля,
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.НаименованиеПоля,
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.ВладелецПоля КАК ВладелецПоля,
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.ПоказательОтчета,
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.ЯвляетсяАтрибутом КАК ЯвляетсяАтрибутом,
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.Кратность = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.Окр1)
	|		ИНАЧЕ НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.Кратность
	|	КОНЕЦ КАК Кратность
	|ИЗ
	|	Справочник.НастройкиИмпортаФайлаИзФНС.СоответствиеПоказателейИПолей КАК НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей
	|ГДЕ
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВладелецПоля,
	|	ЯвляетсяАтрибутом УБЫВ
	|ИТОГИ ПО
	|	ВладелецПоля";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	ДеревоЗначений = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДеревоСтруктуры = Новый ДеревоЗначений;
	ДеревоСтруктуры.Колонки.Добавить("КодПоля");
	ДеревоСтруктуры.Колонки.Добавить("НаименованиеПоля");
	ДеревоСтруктуры.Колонки.Добавить("ПоказательОтчета");
	ДеревоСтруктуры.Колонки.Добавить("ЯвляетсяАтрибутом");
	ДеревоСтруктуры.Колонки.Добавить("Кратность");
	
	ЗаполнитьВетвьДерева(ДеревоСтруктуры, 0, ДеревоЗначений);
	
	Возврат ДеревоСтруктуры;
	
КонецФункции

Процедура ПолучитьНастроенныеАтрибуты(СсылкаНаОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.Номер,
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.ВладелецПоля,
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.КодПоля
	|ИЗ
	|	Справочник.НастройкиИмпортаФайлаИзФНС.СоответствиеПоказателейИПолей КАК НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|		ПО НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.ПоказательОтчета = ПоказателиОтчетов.Ссылка
	|ГДЕ
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.Ссылка = &Ссылка
	|	И НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.ЯвляетсяАтрибутом = ИСТИНА"
	
КонецПроцедуры

Процедура ЗаполнитьВетвьДерева(ВетвьДереваСтруктуры, Знач ИндексВладельца, ДеревоЗначений);
	
	ТекущееПоле = ДеревоЗначений.Строки.Найти(ИндексВладельца, "ВладелецПоля");
	Если ТекущееПоле <> Неопределено Тогда
		Для Каждого Элемент Из ТекущееПоле.Строки Цикл
			
			НоваяСтрока = ВетвьДереваСтруктуры.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
			ЗаполнитьВетвьДерева(НоваяСтрока, Элемент.Номер, ДеревоЗначений);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры