
#Область СлужебныеПроцедурыИФункции

Процедура ОбъектПриЗаписи(Источник) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользуетсяСервисКабинетСотрудника") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	КабинетСотрудника.ОбъектПриЗаписи(Источник);
	
КонецПроцедуры

Процедура ОбъектПередЗаписью(Источник, Отказ) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользуетсяСервисКабинетСотрудника") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	КабинетСотрудника.ОбъектПередЗаписью(Источник);
	
КонецПроцедуры

Процедура ВыполнитьРегистрациюКПередачеПечатныхФорм() Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользуетсяСервисКабинетСотрудника") Или Не ПолучитьФункциональнуюОпцию("ИспользуетсяКадровыйЭДОКабинетСотрудника") Тогда
		Возврат;
	КонецЕсли;
	
	КабинетСотрудника.ЗарегистрироватьДокументыНаПодпись();
	
КонецПроцедуры

#КонецОбласти


