
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ДанныеЗаполнения <> Неопределено Тогда
	
		Если ТипДанныхЗаполнения = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьДокумент") Тогда			
			ЗаполнитьДокумент(ДанныеЗаполнения);
		Иначе 
			ИнициализироватьДокумент(ДанныеЗаполнения);			
		КонецЕсли;
		
	Иначе 
		
		ИнициализироватьДокумент(ДанныеЗаполнения);
	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент(ОбъектКопирования);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСерверУХ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.РезервыПоПретензиям.ПодготовитьПараметрыПроведения(ДополнительныеСвойства, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСерверУХ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);	
	Документы.РезервыПоПретензиям.СформироватьДвижения(Движения, ДополнительныеСвойства, Отказ);	
	ПроведениеСерверУХ.ОбработкаПроведения_ЗаписьИКонтроль(ЭтотОбъект, Отказ);
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ПроведениеСерверУХ.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_Стандартные

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	МСФОУХ.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

Процедура ЗаполнитьПоДокументуОснованию(Основание)
	
	//УправлениеВнеоборотнымиАктивамиПереопределяемый.ЗаполнитьПоОснованию(ЭтотОбъект, Основание);
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции_Документа

Процедура ЗаполнитьДокумент(ДанныеЗаполнения)

	НомераТаблиц = Новый Структура;
	Запрос = Новый Запрос(Документы.РезервыПоПретензиям.ПолучитьТекстЗапросаЗаполнение(НомераТаблиц));

	ФункциональнаяВалюта = МСФОВызовСервераУХ.ЗначениеУП("ФункциональнаяВалюта", Организация, ПериодОтчета.ДатаОкончания, Сценарий);
	
	Запрос.УстановитьПараметр("Организация", 				Организация);
	Запрос.УстановитьПараметр("ФункциональнаяВалюта", 		ФункциональнаяВалюта);
	Запрос.УстановитьПараметр("Сценарий", 					Сценарий);
	Запрос.УстановитьПараметр("КонецПредыдущегоПериода",	КонецДня(ОбщегоНазначенияУХ.ДобавитьДень(ПериодОтчета.ДатаНачала, -1)));
	Запрос.УстановитьПараметр("КонецПериода", 				КонецДня(ПериодОтчета.ДатаОкончания));
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();	
		
	ЭтотОбъект.Резервы.Загрузить(ПакетЗапросов.Получить(НомераТаблиц.Резервы).Выгрузить());
	ЭтотОбъект.СторноРезервов.Загрузить(ПакетЗапросов.Получить(НомераТаблиц.СторноРезервов).Выгрузить());
		
КонецПроцедуры

#КонецОбласти  

#КонецЕсли