
&НаКлиенте
Процедура ОткрытьСледующийПериод(Команда)
	
	ОткрытьСледующийПериодСервер(Элементы.Список.ТекущаяСтрока);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОткрытьСледующийПериодСервер(ИсходныйПериодСценарий)
	
	ДокументОбъект=ИсходныйПериодСценарий.ПолучитьОбъект();
	ДокументОбъект.ОткрытьСледующийПериод();
	
КонецПроцедуры // ОткрытьСледующийПериодСервер() 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
		
				
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеПроцессом(Команда)
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;		
	
	ПараметрыФормы = Новый Структура("ДокументУправленияПериодомСценария, ОтображатьВВидеДиаграммы", Элементы.Список.ТекущаяСтрока, Ложь);
	РасширениеБизнесЛогикиУХКлиент.Открыть_УправлениеПроцессом_Матрица(ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеПериодами(Команда)
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;	
		
	ПараметрыФормы = Новый Структура("ДокументУправленияПериодомСценария,Режим", Элементы.Список.ТекущаяСтрока,"Периоды");
    РасширениеБизнесЛогикиУХКлиент.Открыть_УправлениеПериодами(ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СценарииИПериоды(Команда)
	ОткрытьФорму("Документ.УправлениеПериодомСценария.Форма.МатрицаОтчетныхПериодов");
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	#Область УХ_Согласование
	ДействияСогласованиеУХКлиент.ОбработкаОповещенияФормыСписка(ИмяСобытия, Элементы.Список);
	#КонецОбласти
КонецПроцедуры

