&Вместо("ОтменитьСогласование")
Процедура _3L_ОтменитьСогласование(Форма = Неопределено, Ссылка = Неопределено, ОтменятьПроведениеВход = Истина, ТекстОповещенияСогласующимВход = "", Отказ = Ложь) Экспорт 
	// Инициализация.
	ОбъектСсылка = ?(Форма = Неопределено, Ссылка, Форма.Объект.Ссылка);
	ОрганизацияОбъекта = МодульОбработкиЭтаповПроцессовСерверУХ.ПолучитьОрганизациюОбъекта(ОбъектСсылка);
	// Проверим полномочия пользователя для отмены согласования.
	ЕстьСуперПользователь = МодульСогласованияДокументовУХ.ЕстьСуперПользователь(ОрганизацияОбъекта);
	Попытка
		Если ЕстьСуперПользователь Тогда
			ОтменитьСогласованиеОбъекта(ОбъектСсылка, ОтменятьПроведениеВход);
		Иначе
			// Проверим возможность отменить процесс инициатором.
			ЭтоИнициатор = ЭтоИнициаторСогласования(Ссылка);
			Если ЭтоИнициатор Тогда
				РазрешеноОтменитьПроцессИнициатором = РазрешеноОтменитьПроцессИнициатором(ОбъектСсылка);
				Если РазрешеноОтменитьПроцессИнициатором  Тогда
					// Прав достаточно. Сбросим процесс и, при необходимости, оповестим согласующих.
					МассивПолучателейОповещения = ПолучитьПолучателейОповещенияОтменыСогласованияИнициатором(ОбъектСсылка);
					// Сбросим процесс.
					ОтменитьСогласованиеОбъекта(ОбъектСсылка, ОтменятьПроведениеВход);
					// Оповестим согласующих об отмене процесса инициатором.
					ВидСобытия = Справочники.ВидыСобытийОповещений.СогласованиеОтмененоИнициатором;
					СтруктураДополнительныхПараметров = Новый Структура;
					СтруктураДополнительныхПараметров.Вставить("Инициатор", Пользователи.ТекущийПользователь());
					СтруктураДополнительныхПараметров.Вставить("КомментарийИнициатора", ТекстОповещенияСогласующимВход);
					РезультатФункции = МодульУправленияОповещениямиУХ.ОповеститьПользователей(ВидСобытия, , ОбъектСсылка, МассивПолучателейОповещения, СтруктураДополнительныхПараметров);
				Иначе
					ТекстСообщения = НСтр("ru = 'По объекту %Объект% согласующие уже установили визу. Операция отменена.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Объект%", Строка(ОбъектСсылка));
					ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
				КонецЕсли;
			Иначе                      
				
				// +++ 3L, Конилов Д.А. [25.05.2022] Задача ERP1C-84
					// Было  
					
						//// Недостаточно полномочий.
						//ТекстСообщения = НСтр("ru = 'У пользователя недостаточно прав для отмены согласования. Отменить согласование может только пользователь с ролью Суперпользователь, либо инициатор согласования. Роли могут быть назначены в функционале ""Ответственные по организациям"".'");
						//ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
						//Отказ = Истина;	
							
					// Стало
						// (Пустой код)
				// --- 3L, Конилов Д.А. [25.05.2022] Задача ERP1C-84 

				
				
				
			КонецЕсли;
		КонецЕсли;
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось отменить согласование объекта %ОбъектСогласования%: %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОбъектСогласования%", Строка(ОбъектСсылка));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецПопытки;
КонецПроцедуры
