
#Область ОписаниеПеременных

&НаСервере
Перем СписокРолей;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодписыватьЗаявкиСотрудника = Константы.ПодписыватьЗаявкиСотрудника.Получить();
	
	ВидНастройки = ВидНастройки();
	СтруктурыПредприятияРезультатПроверки = ПроверитьСтруктуруПредприятия();
	СтруктураПредприятияДоступна = СтруктурыПредприятияРезультатПроверки.Доступна;
	Если ВидНастройки <> 0 И Не СтруктураПредприятияДоступна Тогда
		// Используется настройка с точностью до структуры предприятия,
		// но пользователю недоступна структура предприятия.
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"НастройкиПравилСтруктураПредприятия", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ФормаЗаписатьИЗакрыть", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ФормаЗаписать", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ФормаОтчетПоЗадачам", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ВидНастройки", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ДекорацияОграничениеДоступности", "Видимость", Ложь);
	Иначе
		СтруктураПредприятияПустая = СтруктурыПредприятияРезультатПроверки.Пустая;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ДекорацияПустаяСтруктураПредприятия", "Видимость", СтруктураПредприятияПустая);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ГруппаНастройки", "Доступность", Не СтруктураПредприятияПустая);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ФормаЗаписатьИЗакрыть", "Доступность", Не СтруктураПредприятияПустая);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ФормаЗаписать", "Доступность", Не СтруктураПредприятияПустая);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ГруппаНастройкаНедоступна", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ДекорацияОграничениеДоступности", "Видимость", Не СтруктураПредприятияДоступна);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ВидНастройки", "Доступность", СтруктураПредприятияДоступна И Не СтруктураПредприятияПустая);
		Если Не СтруктураПредприятияПустая Тогда
			ЗаполнитьНастройкиМаршрутов();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьНаКлиенте", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИспользуетсяКадровыйЭДОЗаписанаКонстанта" Тогда
		Элементы.ПодписыватьЗаявкиСотрудника.Видимость = Параметр;
		ПодписыватьЗаявкиСотрудника = ?(Не Параметр, Ложь, ПодписыватьЗаявкиСотрудника);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНастройкиПриИзменении(Элемент)
	Если ВидНастройки = 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ВидНастройкиПриИзмененииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Настройки в разрезе структурных единиц будут очищены. Продолжить?';
										|en = 'Settings broken down by business units will be cleared. Continue?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ВидНастройкиПриИзмененииЗавершение(КодВозвратаДиалога.Да, Неопределено);	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиПравил

&НаКлиенте
Процедура НастройкиПравилСтруктураПредприятияСрокЗадачиПриИзменении(Элемент)
	ЗаполнитьПодчиненныеЭлементы("СрокЗадачи");
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравилСтруктураПредприятияСписокПользователейПриИзменении(Элемент)
	ЗаполнитьПодчиненныеЭлементы("СписокПользователей");	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравилСтруктураПредприятияПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравилПриАктивизацииСтроки(Элемент)
	Если ВидНастройки = 0 И Элементы.ГруппаНастройки.Доступность Тогда
		ЗаполнитьНастройкиБезСтруктуры(Элементы.НастройкиПравил.ТекущиеДанные.РольИсполнителя);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравилСтруктураПредприятияСписокПользователейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.НастройкиПравилСтруктураПредприятия.ТекущиеДанные;
	СписокПользователейСтроки 	= ТекущиеДанные.СписокПользователей;
	ПодразделениеСтроки 		= ТекущиеДанные.Подразделение;
	РольИсполнителяСтроки 		= Элементы.НастройкиПравил.ТекущиеДанные.РольИсполнителя;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СписокПользователей", 	СписокПользователейСтроки.ВыгрузитьЗначения());
	ПараметрыОткрытия.Вставить("Подразделение", 		ПодразделениеСтроки);
	ПараметрыОткрытия.Вставить("РольИсполнителя", 		РольИсполнителяСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СписокПользователейВыборЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.НастройкаПравилОбработкиЗаявокСотрудников.Форма.ИсполнителиЗаявок", ПараметрыОткрытия, ЭтотОбъект, , , ,
				 ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравилСписокПользователейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.НастройкиПравил.ТекущиеДанные;
	СписокПользователейСтроки 	= ТекущиеДанные.СписокПользователей;
	РольИсполнителяСтроки 		= Элементы.НастройкиПравил.ТекущиеДанные.РольИсполнителя;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СписокПользователей", 	СписокПользователейСтроки.ВыгрузитьЗначения());
	ПараметрыОткрытия.Вставить("РольИсполнителя", 		РольИсполнителяСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СписокПользователейВыборЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.НастройкаПравилОбработкиЗаявокСотрудников.Форма.ИсполнителиЗаявок", ПараметрыОткрытия, ЭтотОбъект, , , ,
				 ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				 
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравилСрокЗадачиПриИзменении(Элемент)
	ЗаполнитьИзНастроекБезСтруктуры("СрокЗадачи");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНастройкиПравилОбработки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНастройкиПравилОбработки();	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоЗаявкам(Команда)
	ОткрытьФорму("Отчет.Задачи.ФормаОбъекта", ПараметрыОткрытияОтчета());
КонецПроцедуры

&НаКлиенте
Процедура ПодписыватьЗаявкиСотрудникаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЧтениеПравилОбработки
&НаСервере
Процедура ЗаполнитьНастройкиМаршрутов()
	
	НастройкиПравилВыгрузка = РеквизитФормыВЗначение("НастройкиПравил");
	ИспользуемаяФункциональностьСервиса = РегистрыСведений.ИспользуемаяФункциональностьСервисаКабинетСотрудника.НастройкиИспользуемаяФункциональность();
	СписокРолей = БизнесПроцессыЗаявокСотрудников.РолиИсполнителейЗадач();
	Если Не ИспользуемаяФункциональностьСервиса.ЗаявленияНаДСВ Тогда
		РольНаУдаление = СписокРолей.Найти(БизнесПроцессыЗаявокСотрудниковВнутренний.РольИсполнителяОтветственныйЗаУдержаниеДСВ());
		Если РольНаУдаление <> Неопределено Тогда
			СписокРолей.Удалить(РольНаУдаление);
		КонецЕсли;
	КонецЕсли;
	ТаблицаПравилНастроек = ТаблицаПравилНастроек();
	ТаблицаПользователей = ТаблицаПользователей();
	
	Подразделения = Неопределено;
	Для каждого Роль Из СписокРолей Цикл
		НастройкаПравил = НастройкиПравилВыгрузка.Добавить();
		НастройкаПравил.РольИсполнителя = Роль;
		НастройкаПравил.СписокПользователей.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
		
		Колонки = НастройкаПравил.СтруктураПредприятия.Колонки; 
		Колонки.Добавить("Подразделение");
		Колонки.Добавить("СрокЗадачи");
		Колонки.Добавить("СписокПользователей", Новый ОписаниеТипов("СписокЗначений"));
		
		Подразделения = ТаблицаПравилНастроек.Строки.НайтиСтроки(Новый Структура("РольИсполнителя", Роль));
		Для каждого Подразделение Из Подразделения Цикл
			НовоеПодразделение = НастройкаПравил.СтруктураПредприятия.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеПодразделение, Подразделение);
			ЗаполнитьДерево(НовоеПодразделение, Подразделение);
		КонецЦикла;
				
		ОтборПользователей = Новый Структура("РольИсполнителя, Подразделение");
				
		Для каждого ЭлементСтруктурыПредприятия Из ПолучитьЭлементы(НастройкаПравил.СтруктураПредприятия) Цикл
			ОтборПользователей.РольИсполнителя = Роль;
			ОтборПользователей.Подразделение = ЭлементСтруктурыПредприятия.Подразделение;
			
			ЭлементСтруктурыПредприятия.СписокПользователей.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
			ЭлементСтруктурыПредприятия.СписокПользователей.ЗагрузитьЗначения(
				ТаблицаПользователей.Скопировать(ОтборПользователей).ВыгрузитьКолонку("Исполнитель"));
		КонецЦикла;
			
		Если Подразделения.Количество() > 0 Тогда
			Подразделение = НастройкаПравил.СтруктураПредприятия.Строки[0];
			
			НастройкаПравил.СписокПользователей.ЗагрузитьЗначения(Подразделение.СписокПользователей.ВыгрузитьЗначения());
			НастройкаПравил.СрокЗадачи = Подразделение.СрокЗадачи
		КонецЕсли;
	КонецЦикла;
	ЗначениеВРеквизитФормы(НастройкиПравилВыгрузка, "НастройкиПравил");
	
КонецПроцедуры

&НаСервере
Функция ТаблицаПравилНастроек()
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтруктураПредприятия.Ссылка КАК СтруктураПредприятия,
	|	РолиИсполнителей.Ссылка КАК РолиИсполнителей
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	#Таблица КАК СтруктураПредприятия,
	|	Справочник.РолиИсполнителей КАК РолиИсполнителей
	|ГДЕ
	|	РолиИсполнителей.Ссылка В(&РолиИсполнителей)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВременнаяТаблица.РолиИсполнителей.Ссылка КАК РольИсполнителя,
	|	ВременнаяТаблица.СтруктураПредприятия.Ссылка КАК Подразделение,
	|	ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПравилаОбработкиЗаявокСотрудников1.СрокЗадачи, ПравилаОбработкиЗаявокСотрудников.СрокЗадачи), ПравилаОбработкиЗаявокСотрудников2.СрокЗадачи), 7) КАК СрокЗадачи,
	|	НЕ ПравилаОбработкиЗаявокСотрудников1.Подразделение ЕСТЬ NULL КАК ЗаполненоПодразделениеПравилОбработки
	|ИЗ
	|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаОбработкиЗаявокСотрудников КАК ПравилаОбработкиЗаявокСотрудников
	|		ПО ИсполнителиЗадач.РольИсполнителя = ПравилаОбработкиЗаявокСотрудников.РольИсполнителя
	|			И (ПравилаОбработкиЗаявокСотрудников.Подразделение = ЗНАЧЕНИЕ(#Таблица.ПустаяСсылка)
	|				ИЛИ ИсполнителиЗадач.ОсновнойОбъектАдресации = ПравилаОбработкиЗаявокСотрудников.Подразделение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаОбработкиЗаявокСотрудников КАК ПравилаОбработкиЗаявокСотрудников1
	|		ПО ИсполнителиЗадач.РольИсполнителя = ПравилаОбработкиЗаявокСотрудников1.РольИсполнителя
	|			И ИсполнителиЗадач.ОсновнойОбъектАдресации = ПравилаОбработкиЗаявокСотрудников1.Подразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаОбработкиЗаявокСотрудников КАК ПравилаОбработкиЗаявокСотрудников2
	|		ПО (ПравилаОбработкиЗаявокСотрудников2.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.ПустаяСсылка)
	|				ИЛИ ИсполнителиЗадач.РольИсполнителя = ПравилаОбработкиЗаявокСотрудников2.РольИсполнителя)
	|			И (ПравилаОбработкиЗаявокСотрудников2.Подразделение = ЗНАЧЕНИЕ(#Таблица.ПустаяСсылка)
	|				ИЛИ ИсполнителиЗадач.ОсновнойОбъектАдресации = ПравилаОбработкиЗаявокСотрудников2.Подразделение)
	|		ПРАВОЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
	|		ПО ИсполнителиЗадач.ОсновнойОбъектАдресации = ВременнаяТаблица.СтруктураПредприятия
	|			И ИсполнителиЗадач.РольИсполнителя = ВременнаяТаблица.РолиИсполнителей
	|
	|УПОРЯДОЧИТЬ ПО
	|	РольИсполнителя,
	|	ВременнаяТаблица.СтруктураПредприятия.Ссылка ИЕРАРХИЯ";
	
	СтруктураПредприятия = Новый(БизнесПроцессыЗаявокСотрудниковВнутренний.ТипСтруктураПредприятия());
	ИмяТаблицы = СтруктураПредприятия.Метаданные().ПолноеИмя();
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Таблица", ИмяТаблицы);
	
	Запрос.УстановитьПараметр("РолиИсполнителей", СписокРолей);
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
КонецФункции

&НаСервере
Функция ТаблицаПользователей()
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя,
	               |	ИсполнителиЗадач.Исполнитель КАК Исполнитель,
	               |	ИсполнителиЗадач.ОсновнойОбъектАдресации КАК Подразделение
	               |ИЗ
	               |	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	               |ГДЕ
	               |	ИсполнителиЗадач.РольИсполнителя В (&РолиИсполнителей)";
	
	Запрос.УстановитьПараметр("РолиИсполнителей", СписокРолей);
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДерево(Приемник, Источник)
	
	Для каждого ЭлементИсточника Из Источник.Строки Цикл
		ЭлементПриемника = Приемник.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
		Если ЭлементИсточника.Строки.Количество() > 0 Тогда
			ЗаполнитьДерево(ЭлементПриемника, ЭлементИсточника);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьПравилОбработки

&НаКлиенте
Процедура ЗаписатьНастройкиПравилОбработки(Закрыть = Ложь)
	ДлительнаяОперация = ЗаписатьНастройкиПравилОбработкиНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаписатьНастройкиПравилОбработкиЗавершение",
													 ЭтотОбъект,
													 Новый Структура("Закрыть", Закрыть));
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройкиПравилОбработкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат.Статус = "Выполнено" Тогда
		Модифицированность = Ложь;
		Если ДополнительныеПараметры.Закрыть Тогда
			Закрыть();
		КонецЕсли;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'При сохранении настроек правил обработки заявок сотрудников произошла ошибка:';
								|en = 'An error occurred when saving the settings for processing employee requests:'") 
						 + Символы.ПС + Результат.КраткоеПредставлениеОшибки;
		ИнформированиеПользователяКлиент.Предупредить(ТекстСообщения, Результат.ПодробноеПредставлениеОшибки,);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаписатьНастройкиПравилОбработкиНаСервере()
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
												  "БизнесПроцессыЗаявокСотрудников.ЗаписатьНастройкиПравилОбработки",
												  РеквизитФормыВЗначение("НастройкиПравил"),
												  ВидНастройки,
												  ПодписыватьЗаявкиСотрудника);	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЭлементы(Дерево, ДеревоФормы = Ложь)
	Возврат БизнесПроцессыЗаявокСотрудниковКлиентСервер.ПолучитьЭлементы(Дерево, ДеревоФормы);	
КонецФункции

#КонецОбласти

#Область ИзменениеВариантовНастроек

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	НастройкиПоВидамЗаявки = (ВидНастройки = 0);
	
	Элементы.НастройкиПравилСрокЗадачи.Видимость = НастройкиПоВидамЗаявки;
	Элементы.НастройкиПравилСписокПользователей.Видимость = НастройкиПоВидамЗаявки;
	Элементы.НастройкиПравилСтруктураПредприятия.Видимость = (ВидНастройки = 1);
	Элементы.ПодписыватьЗаявкиСотрудника.Видимость = ПолучитьФункциональнуюОпцию("ИспользуетсяКадровыйЭДОКабинетСотрудника");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиБезСтруктуры(ТекущаяРоль = Неопределено)
	
	Если ТекущаяРоль <> Неопределено Тогда
		ЗаполнитьНастройкиБезСтруктурыДляРоли(ТекущаяРоль);	
	Иначе
		Для Каждого Настройка Из НастройкиПравил Цикл
			ЗаполнитьНастройкиБезСтруктурыДляРоли(Настройка.РольИсполнителя);	
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиБезСтруктурыДляРоли(Роль)
	
	НастройкаПравилОбработки = НастройкиПравил.НайтиСтроки(Новый Структура("РольИсполнителя", Роль))[0];
	
	НастройкаПравилОбработкиСтруктураПредприятия = НастройкаПравилОбработки.СтруктураПредприятия.ПолучитьЭлементы()[0];
	
	НастройкаПравилОбработки.СписокПользователей.ЗагрузитьЗначения(НастройкаПравилОбработкиСтруктураПредприятия.СписокПользователей.ВыгрузитьЗначения());
	НастройкаПравилОбработки.СрокЗадачи = НастройкаПравилОбработкиСтруктураПредприятия.СрокЗадачи;

КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ЗаписатьИЗакрытьНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	ЗаписатьНастройкиПравилОбработки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзНастроекБезСтруктуры(ИмяРеквизита)
	Модифицированность = Истина;
	Роль = Элементы.НастройкиПравил.ТекущиеДанные.РольИсполнителя;
	ЗаполнитьИзНастроекБезСтруктурыНаСервере(ИмяРеквизита, Роль);		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзНастроекБезСтруктурыНаСервере(ИмяРеквизита, ТекущаяРоль = Неопределено)
	Если ТекущаяРоль <> Неопределено Тогда
		ЗаполнитьИзНастроекБезСтруктурыНаСервереДляРоли(ИмяРеквизита, ТекущаяРоль);	
	Иначе
		Для каждого Настройка Из НастройкиПравил Цикл
			ЗаполнитьИзНастроекБезСтруктурыНаСервереДляРоли(ИмяРеквизита, Настройка.РольИсполнителя); 	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьИзНастроекБезСтруктурыНаСервереДляРоли(ИмяРеквизита, Роль)
	
	НастройкиПравилДляРоли = НастройкиПравил.НайтиСтроки(Новый Структура("РольИсполнителя", Роль));
	
	ЭлементыНастроекПравил = ПолучитьЭлементы(НастройкиПравилДляРоли[0].СтруктураПредприятия, Истина);
	Для каждого ЭлементНастройкиПравил Из ЭлементыНастроекПравил Цикл
		Если ТипЗнч(ЭлементНастройкиПравил[ИмяРеквизита]) = Тип("СписокЗначений") Тогда
			ЭлементНастройкиПравил[ИмяРеквизита].ЗагрузитьЗначения(НастройкиПравилДляРоли[0][ИмяРеквизита].ВыгрузитьЗначения());
		Иначе
			ЭлементНастройкиПравил[ИмяРеквизита] = НастройкиПравилДляРоли[0][ИмяРеквизита];
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодчиненныеЭлементы(ИмяКолонки)
	
	ТекущиеДанные = Элементы.НастройкиПравилСтруктураПредприятия.ТекущиеДанные;
		
	НастройкиПодчиненныхПодразделений = ПолучитьЭлементы(ТекущиеДанные, Истина);
	Для каждого НастройкаПодразделения Из НастройкиПодчиненныхПодразделений Цикл
		Если ТипЗнч(НастройкаПодразделения[ИмяКолонки]) = Тип("СписокЗначений") Тогда
			НастройкаПодразделения[ИмяКолонки].ЗагрузитьЗначения(ТекущиеДанные[ИмяКолонки].ВыгрузитьЗначения());
		Иначе
			НастройкаПодразделения[ИмяКолонки] = ТекущиеДанные[ИмяКолонки];
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Если ВидНастройки = 0 Тогда
		СписокПользователейСтроки = Элементы.НастройкиПравил.ТекущиеДанные.СписокПользователей;
		СписокПользователейСтроки.ЗагрузитьЗначения(Результат);
		
		ЗаполнитьИзНастроекБезСтруктуры("СписокПользователей");
	ИначеЕсли ВидНастройки = 1 Тогда
		СписокПользователейСтроки = Элементы.НастройкиПравилСтруктураПредприятия.ТекущиеДанные.СписокПользователей;
		СписокПользователейСтроки.ЗагрузитьЗначения(Результат);
		
		ЗаполнитьПодчиненныеЭлементы("СписокПользователей");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНастройкиПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ВидНастройки = 1;
		Возврат;
	КонецЕсли;
	
	ВидНастройкиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидНастройкиПриИзмененииНаСервере()
	
	УстановитьВидимостьЭлементов();
	
	Если ВидНастройки = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНастройкиБезСтруктуры();
	
	Модифицированность = Истина;
	ЗаполнитьИзНастроекБезСтруктурыНаСервере("СписокПользователей");
	ЗаполнитьИзНастроекБезСтруктурыНаСервере("СрокЗадачи");

КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияОтчета()
	
	ОтчетОбъект = Отчеты.Задачи.Создать();
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	
	ЭлементОтбора =  КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор();
	ЭлементОтбора.Представление = НСтр("ru = 'Заявки сотрудников';
										|en = 'Employee applications'");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БизнесПроцесс.ТипЗаявкиКабинетСотрудника");
	ЭлементОтбора.ПравоеЗначение = Перечисления.ТипыЗаявокКабинетСотрудника.ПустаяСсылка();
	ЭлементОтбора.Использование = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("Вариант", КомпоновщикНастроек.Настройки);
	ПараметрыФормы.Вставить("КлючВарианта", "ЗаявкиСотрудника");
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервере
Функция ВидНастройки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПравилаОбработкиЗаявокСотрудников.СрокЗадачи КАК СрокЗадачи
	|ИЗ
	|	РегистрСведений.ПравилаОбработкиЗаявокСотрудников КАК ПравилаОбработкиЗаявокСотрудников
	|ГДЕ
	|	ПравилаОбработкиЗаявокСотрудников.Подразделение <> ЗНАЧЕНИЕ(#Таблица.ПустаяСсылка)";
	СтруктураПредприятия = Новый(БизнесПроцессыЗаявокСотрудниковВнутренний.ТипСтруктураПредприятия());
	ИмяТаблицы = СтруктураПредприятия.Метаданные().ПолноеИмя();
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Таблица", ИмяТаблицы);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ?(РезультатЗапроса.Пустой(), 0, 1);

КонецФункции

&НаСервере
Функция ПроверитьСтруктуруПредприятия()

	СтруктураПредприятия = Новый(БизнесПроцессыЗаявокСотрудниковВнутренний.ТипСтруктураПредприятия());
	ИмяТаблицы = СтруктураПредприятия.Метаданные().ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	#Таблица КАК Таблица";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Таблица", ИмяТаблицы);
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		РезультатПроверки = Новый Структура;
		РезультатПроверки.Вставить("Доступна", Истина);
		РезультатПроверки.Вставить("Пустая", РезультатЗапроса.Выбрать().Количество() = 0);
		Возврат РезультатПроверки;
	Исключение
		// Отсутствует полный доступ к структуре предприятия.
		РезультатПроверки = Новый Структура;
		РезультатПроверки.Вставить("Доступна", Ложь);
		РезультатПроверки.Вставить("Пустая", Истина);
		Возврат РезультатПроверки;
	КонецПопытки;

КонецФункции

#КонецОбласти