////////////////////////////////////////////////////////////////////////////////
// Модуль Реализует логику работы подсистемы УправлениеРисками в контексте 
// клиентского кода.
////////////////////////////////////////////////////////////////////////////////

// Возвращает структуру полей расшифровки по отчету Диаграмма рисков.
Функция ПолучитьПоляРасшифровкиДиаграммаРисков(АдресРасшифровки, Расшифровка, СтандартнаяОбработка) Экспорт
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияУправлениеРисками") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("УправлениеРисками");
		РезультатФункции = Модуль.ПолучитьПоляРасшифровкиДиаграммаРисков(АдресРасшифровки, Расшифровка, СтандартнаяОбработка);
		Возврат РезультатФункции;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции		// ПолучитьПоляРасшифровкиДиаграммаРисков()