#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	Перем мКодыСчетов;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПрефиксДт = ?(ЗначениеЗаполнено(Владелец.ПрефиксДт), Владелец.ПрефиксДт, "Дт");
	ПрефиксКт = ?(ЗначениеЗаполнено(Владелец.ПрефиксКт), Владелец.ПрефиксКт, "Кт");
	
	Если ЭтоНовый() Тогда
		// Приоритеты заполнения:
		// 1. Если заполнены счета, то по ним определяем код корреспонденции
		// 2. Если счета не заполнены, но заполнен код корреспонденции, то по нему определеяем счета
		
		Если ЗначениеЗаполнено(СчетДт) Тогда
			КодКорреспонденции = ПрефиксДт + СтрЗаменить(СчетДт,".","_");
		Иначе
			КодКорреспонденции = "";
		КонецЕсли;
		Если ЗначениеЗаполнено(СчетКт) Тогда
			КодКорреспонденции = КодКорреспонденции + ПрефиксКт + СтрЗаменить(СчетКт,".","_");
		КонецЕсли;
		
		Если КодКорреспонденции <> "" Тогда
			// код пишем по счетам, а счета заполнены. приоритет счета.
			Код = КодКорреспонденции;
		Иначе
			Если НЕ ЗначениеЗаполнено(Владелец) Тогда
				Владелец = Константы.ПланСчетовПоУмолчанию.Получить();
			КонецЕсли;
			
			// счета не заполнены, поэтому пытаемся подобрать счета по коду
			мКодыСчетов = СверкаВГОУХ.НайтиСчетаНаСервере(Код, Владелец);
			Если мКодыСчетов.СчетДт <> Неопределено Тогда
				ОсновнаяКорреспонденцияСчетДт = мКодыСчетов.СчетДт;
				ИспользуемСубконтоСчетДт = "";
				Код = мКодыСчетов.ИмяДт + мКодыСчетов.СчетДт;
			Иначе
				Код = "";
			КонецЕсли;
			Если мКодыСчетов.СчетКт <> Неопределено Тогда
				ОсновнаяКорреспонденцияСчетКт = мКодыСчетов.СчетКт;
				ИспользуемСубконтоСчетКт = "";
				Код = Код + мКодыСчетов.ИмяКт + мКодыСчетов.СчетКт;
			КонецЕсли;
			
			// перезапишем код, чтобы он точно соответстовал нашему шаблону "Дт/a*Кт/a*"
			Код = КодКорреспонденции;
		КонецЕсли;
		
	Иначе
		// проверим, изменился ли объект
		// приоритет обработки:
		// 1. Если изменились счета, то по ним записываем код
		// 2. Если счета не изменились, но изменился код, то по нему пытаемся записать счета
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КорреспонденцииВГО.Код,
			|	КорреспонденцииВГО.СчетДт,
			|	КорреспонденцииВГО.СчетКт
			|ИЗ
			|	Справочник.КорреспонденцииВГО КАК КорреспонденцииВГО
			|ГДЕ
			|	КорреспонденцииВГО.Ссылка = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Результат = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Если СчетДт <> ВыборкаДетальныеЗаписи.СчетДт
				ИЛИ СчетКт <> ВыборкаДетальныеЗаписи.СчетКт
				Тогда
				// приоритет счета. Счет изменился, изменяем коды
				Код = ПрефиксДт + СтрЗаменить(СчетДт,".","_");
				Код = Код + ПрефиксКт + СтрЗаменить(СчетКт,".","_");
				
			ИначеЕсли ЗначениеЗаполнено(Владелец) Тогда
				Если Код <> ВыборкаДетальныеЗаписи.Код Тогда
					// счета не изменились, поэтому пытаемся подобрать счета по коду
					мКодыСчетов = СверкаВГОУХ.НайтиСчетаНаСервере(Код, Владелец);
					Если мКодыСчетов.СчетДт <> Неопределено Тогда
						СчетДт = мКодыСчетов.СчетДт;		
						ИспользуемСубконтоСчетДт = "";
					КонецЕсли;
					Если мКодыСчетов.СчетДт <> Неопределено Тогда
						СчетКт = мКодыСчетов.СчетКт;		
						ИспользуемСубконтоСчетКт = "";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
