
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает валюту, установленную в качестве валюты управленческого учета
Функция ВалютаУправленческогоУчета() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ВалютаУправленческогоУчета.Получить();
КонецФункции

// Возвращает структуру, содержащую значения реквизитов периода
//
// Параметры:
//  Период - <СправочникСсылка.Периоды> - Период, параметры которого необходимо получить
//
// Возвращаемое значение:
//   <Структура> - Параметры периода
//			ДатаНачала		- Дата								- Дата начала периода
//			ДатаОкончания	- Дата								- Дата окончания периода
//			Периодичность	- ПеречислениеСсылка.Периодичность	- Периодичность
//			Произвольный	- Булево							- признак произвольности периода
//
Функция ПараметрыПериода(Период) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Период)
		ИЛИ ТипЗнч(Период) <> Тип("СправочникСсылка.Периоды") Тогда
		Возврат неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Реквизиты = "ДатаНачала, ДатаОкончания, Периодичность, Произвольный";
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Период, Реквизиты);
	
КонецФункции

#КонецОбласти

