
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураАналитикРасшифровок_ = ПолучитьИзВременногоХранилища(Параметры.СтруктураАналитикРасшифровок);
	
	Для Каждого Стр Из СтруктураАналитикРасшифровок_ Цикл
		 Нстр = СписокАналитик.Добавить();
		 Нстр.ИмяАналитики =Стр.Наименование; 	
		 Нстр.КодАналитики =Стр.Код; 
	КонецЦикла;	
	
	АдресТаблицИнтерфейса = Параметры.АдресТаблицИнтерфейса;
	ПроектОтбор =           Параметры.ПроектОтбор;
	СтруктураАналитикРасшифровок = Параметры.СтруктураАналитикРасшифровок;
	СтруктураАналитик = ЗначениеВСтрокуВнутр(Параметры.СтруктураАналитик);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	СтруктураПарамтеров = Новый Структура;
	СтруктураПарамтеров.Вставить("АдресТаблицИнтерфейса",АдресТаблицИнтерфейса);
    СтруктураПарамтеров.Вставить("ПроектОтбор",ПроектОтбор);
	СтруктураПарамтеров.Вставить("СтруктураАналитикРасшифровок",СтруктураАналитикРасшифровок);
	СтруктураПарамтеров.Вставить("ТекущаяАналитикаКод",ТекущаяАналитикаКод);
	СтруктураПарамтеров.Вставить("СтруктураАналитик",СтруктураАналитик);
	
	Закрыть(СтруктураПарамтеров);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикПриИзменении(Элемент)
	
	Для Каждого стр Из СписокАналитик Цикл
		стр.Признак = Ложь;
	КонецЦикла;	
	Элемент.ТекущиеДанные.Признак = Истина;
	ТекущаяАналитикаКод = Элемент.ТекущиеДанные.КодАналитики;
		
КонецПроцедуры
