#Область СлужебныеПроцедурыИФункции

Функция УдержанияПоРабочимМестам(РеквизитыДляПроведения) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", РеквизитыДляПроведения.Ссылка);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(РеквизитыДляПроведения.Месяц));
	
	Если ЗарплатаКадрыРасширенный.ИспользоватьРаспределениеПоТерриториямУсловиямТруда(РеквизитыДляПроведения.Организация) Тогда 
	
		КадровыйУчет.СоздатьВТОсновныеСотрудникиФизическихЛиц(Запрос.МенеджерВременныхТаблиц, Ложь, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РеквизитыДляПроведения.ФизическоеЛицо), РеквизитыДляПроведения.Организация, КонецМесяца(РеквизитыДляПроведения.Месяц));
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	Сотрудники.Сотрудник КАК Сотрудник,
		               |	&КонецМесяца КАК Период
		               |ПОМЕСТИТЬ ВТПериодыСотрудников
		               |ИЗ
		               |	ВТОсновныеСотрудникиФизическихЛиц КАК Сотрудники";
		
		Запрос.Выполнить();
		
		ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТПериодыСотрудников");
		КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Ложь, "Территория");
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДанныеОСотруднике.Территория КАК Территория
		               |ИЗ
		               |	ВТКадровыеДанныеСотрудников КАК ДанныеОСотруднике";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			РеквизитыДляПроведения.ТерриторияВыполненияРаботВОрганизации = Выборка.Территория;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплата") Тогда
		УдержанияПоРабочимМестам = ВозвратНДФЛБазовый.УдержанияПоРабочимМестам(РеквизитыДляПроведения);
		УдержанияПоРабочимМестам.ЗаполнитьЗначения(РеквизитыДляПроведения.ТерриторияВыполненияРаботВОрганизации, "ТерриторияВыполненияРаботВОрганизации");
		Возврат УдержанияПоРабочимМестам;
	КонецЕсли;
	
	УдержанияПоРабочимМестам = УчетНачисленнойЗарплаты.ТаблицаРаспределенияПоРабочимМестам();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВозвратНДФЛСуммыВозврата.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	               |	ВозвратНДФЛРаспределениеРезультатовУдержаний.Сотрудник КАК Сотрудник,
	               |	ВозвратНДФЛРаспределениеРезультатовУдержаний.Подразделение КАК Подразделение,
	               |	ВозвратНДФЛРаспределениеРезультатовУдержаний.СтатьяФинансирования КАК СтатьяФинансирования,
	               |	ВозвратНДФЛРаспределениеРезультатовУдержаний.СтатьяРасходов КАК СтатьяРасходов,
	               |	ВозвратНДФЛРаспределениеРезультатовУдержаний.ВидУдержания КАК НачислениеУдержание,
	               |	СУММА(ВозвратНДФЛРаспределениеРезультатовУдержаний.Результат) КАК Сумма
	               |ИЗ
	               |	Документ.ВозвратНДФЛ.СуммыВозврата КАК ВозвратНДФЛСуммыВозврата
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратНДФЛ.РаспределениеРезультатовУдержаний КАК ВозвратНДФЛРаспределениеРезультатовУдержаний
	               |		ПО ВозвратНДФЛСуммыВозврата.Ссылка = ВозвратНДФЛРаспределениеРезультатовУдержаний.Ссылка
	               |			И ВозвратНДФЛСуммыВозврата.ИдентификаторСтрокиНДФЛ = ВозвратНДФЛРаспределениеРезультатовУдержаний.ИдентификаторСтроки
	               |			И (ВозвратНДФЛСуммыВозврата.Ссылка = &Ссылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВозвратНДФЛСуммыВозврата.РегистрацияВНалоговомОргане,
	               |	ВозвратНДФЛРаспределениеРезультатовУдержаний.Сотрудник,
	               |	ВозвратНДФЛРаспределениеРезультатовУдержаний.Подразделение,
	               |	ВозвратНДФЛРаспределениеРезультатовУдержаний.СтатьяФинансирования,
	               |	ВозвратНДФЛРаспределениеРезультатовУдержаний.СтатьяРасходов,
	               |	ВозвратНДФЛРаспределениеРезультатовУдержаний.ВидУдержания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НоваяСтрока = УдержанияПоРабочимМестам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РеквизитыДляПроведения);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Возврат УдержанияПоРабочимМестам;
	
КонецФункции 

Процедура ОбработкаПроверкиЗаполнения(Документ, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	ОтражениеЗарплатыВБухучетеРасширенный.ПроверитьРезультатыРаспределенияНачисленийУдержанийОбъекта(Документ, "СуммыВозврата", Отказ);
	
КонецПроцедуры

#КонецОбласти

