
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ИсточникиДанныхДляРасчетов.Ссылка КАК ИсточникДанных,
	|	ИсточникиДанныхДляРасчетов.ПотребительРасчета,
	|	ИсточникиДанныхДляРасчетов.ПоказательОтбор,
	|	ИсточникиДанныхДляРасчетов.СпособПолучения,
	|	ИсточникиДанныхДляРасчетов.ВидИтогаОСВ
	|ИЗ
	|	Справочник.ИсточникиДанныхДляРасчетов КАК ИсточникиДанныхДляРасчетов
	|ГДЕ
	|	ИсточникиДанныхДляРасчетов.НазначениеРасчетов.Владелец = &ШаблонТрансляции
	|	И ИсточникиДанныхДляРасчетов.НазначениеРасчетов.НаправлениеТрансляции = &НаправлениеТрансляции
	|	И (ИсточникиДанныхДляРасчетов.Счет = &СчетИсточник
	|			ИЛИ ИсточникиДанныхДляРасчетов.ПоказательОтбор.СчетБД = &СчетИсточник)
	|	И (ИсточникиДанныхДляРасчетов.ПотребительРасчета.СчетБД = &СчетПриемник
	|			ИЛИ ИсточникиДанныхДляРасчетов.ПотребительРасчета.СчетПриемник = &СчетПриемник)";
				 
	Запрос.УстановитьПараметр("СчетИсточник",			Параметры.СоответствиеСчетов.СчетИсточник);
	Запрос.УстановитьПараметр("СчетПриемник",			Параметры.СоответствиеСчетов.СчетПриемник);
	Запрос.УстановитьПараметр("ШаблонТрансляции",		Параметры.ШаблонТрансляции);
	Запрос.УстановитьПараметр("НаправлениеТрансляции",	Параметры.НаправлениеТрансляции);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		НоваяСтрока=ТаблицаИсточников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Результат);
		
	КонецЦикла;
	
	Заголовок=Параметры.СоответствиеСчетов.Наименование+", "+Параметры.НаправлениеТрансляции;
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИсточниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФорму("Справочник.ИсточникиДанныхДляРасчетов.ФормаОбъекта",Новый Структура("Ключ",ТаблицаИсточников.НайтиПоИдентификатору(Элементы.ТаблицаИсточников.ТекущаяСтрока).ИсточникДанных));
	
КонецПроцедуры
