#Область СлужебныеПроцедурыИФункции

// Возвращает представление документа ввода остатков.
// 
// Параметры:
// 	Документ - ДокументСсылка.ВводОстатков - Ссылка на документ ввода остатков.
// 	НомерДокумента - Строка - Номер документа ввода остатков.
// 	ДатаДокумента - Дата - Дата документа ввода остатков.
// 	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа ввода остатков.
// Возвращаемое значение:
// 	Строка - Строковое представление документа ввода остатков.
//
Функция ЗаголовокДокументаВводОстатковПоХозяйственнойОперации(Документ, НомерДокумента, ДатаДокумента, ХозяйственнаяОперация) Экспорт
	
	Если Не ЗначениеЗаполнено(ХозяйственнаяОперация) Тогда
		Возврат "";
	КонецЕсли;
	
	ШаблонЗаголовка = "";

	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковВАвтономныхКассахККМКОформлениюОтчетовОРозничныхПродажах
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковВАвтономныхКассахККМПоРозничнойВыручке
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковВКассах Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков в кассах %1';
								|en = 'Enter opening balance of cash accounts %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковЗадолженностиКлиентов Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков задолженности клиентов %1';
								|en = 'Enter opening balance of customer receivables %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковЗадолженностиПоставщикам Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков задолженности перед поставщиками %1';
								|en = 'Enter opening balance of accounts payable %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковЗадолженностиПодотчетников Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков задолженности подотчетных лиц %1';
								|en = 'Enter opening balance of debts by advance holders %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковПерерасходовПодотчетныхСредств Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков перерасходов подотчетных средств %1';
								|en = 'Enter opening balance of imprest cash over limits%1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковНаБанковскихСчетах Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков на банковских счетах %1';
								|en = 'Enter opening balance of accounts %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковАвансовКлиентов Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков авансов, полученных от клиентов %1';
								|en = 'Enter opening balance of advance payments received from customers %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковАвансовПоставщикам Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков авансов, выданных поставщикам %1';
								|en = 'Enter opening balance of advances paid to vendors %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковРасчетовМеждуОрганизациямиПоАвансам Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков расчетов между организациями по авансам %1';
								|en = 'OB entry: intercompany AR/AP by advances %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковРасчетовМеждуОрганизациямиПоРеализациям Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков расчетов между организациями по реализациям %1';
								|en = 'OB entry: intercompany AR/AP by sales %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковСобственныхТоваров Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков собственных товаров %1';
								|en = 'Enter opening balance of own goods %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковТоваровПолученныхНаКомиссию Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков полученных на комиссию товаров %1';
								|en = 'Enter opening balance of goods received by commission agents %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковТоваровПереданныхНаКомиссию Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков переданных на комиссию товаров %1';
								|en = 'Enter opening balance of goods transferred to commission agents %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковВозвратнойТарыПереданнойКлиентам Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков переданной клиентам возвратной тары %1';
								|en = 'Enter opening balance of returnable packaging transferred to customers %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковВозвратнойТарыПринятойОтПоставщиков Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков принятой от поставщиков возвратной тары %1';
								|en = 'Enter opening balance of returnable packaging received from vendors %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковПриПереходеНаИспользованиеАдресногоХраненияОстатков Тогда
		ШаблонЗаголовка = НСтр("ru = 'Переход на использование адресного хранения остатков %1';
								|en = 'Transition to the bin system of remaining goods %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковПриПереходеНаИспользованиеСкладскихПомещений Тогда
		ШаблонЗаголовка = НСтр("ru = 'Переход на использование складских помещений %1';
								|en = 'Transition to using warerooms %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковМатериаловПереданныхПереработчикам Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков переданных переработчику материалов %1';
								|en = 'Enter opening balance of materials transferred to subcontractor %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковМатериаловПереданныхВПроизводство Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков переданных в производство материалов %1';
								|en = 'Enter opening balance of materials transferred to production %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковДенежныхСредствКПоступлениюОтЭквайера Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод остатков денежных средств к поступлению от эквайера %1';
								|en = 'Enter cash balance to receive from acquirer %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковПрочихАктивовПассивов Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков прочих активов и пассивов %1';
								|en = 'Enter opening balance of other assets and liabilities %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковПодарочныхСертификатов Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков подарочных сертификатов %1';
								|en = 'Enter opening balance of gift cards %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковПоДоговорамКредитовИДепозитов Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков расчетов по кредитам, депозитам и выданным займам %1';
								|en = 'Enter opening balance of settlements on credits, deposits, and issued loans %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковТМЦВЭксплуатации Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков ТМЦ в эксплуатации %1';
								|en = 'OB entry: inventory in operation %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковПрочихРасходов Тогда
		ШаблонЗаголовка = НСтр("ru = 'Ввод начальных остатков прочих расходов %1';
								|en = 'Enter opening balance of other expenses %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковФинансовогоРезультатаЗаПрошлыеПериоды Тогда
		ШаблонЗаголовка = НСтр("ru = 'Финансовый результат за прошлые периоды %1';
								|en = 'Financial result for the past periods %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковОптовыхПродажЗаПрошлыеПериоды Тогда
		ШаблонЗаголовка = НСтр("ru = 'Оптовые продажи за прошлые периоды %1';
								|en = 'Wholesale sales in the past periods %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковРозничныхПродажЗаПрошлыеПериоды Тогда
		ШаблонЗаголовка = НСтр("ru = 'Розничные продажи за прошлые периоды %1';
								|en = 'Retail sales in the past periods %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковНДСПоПриобретеннымЦенностям Тогда
		ШаблонЗаголовка = НСтр("ru = 'Входящий НДС по товарам, работам и услугам %1';
								|en = 'Input VAT by goods, works and services %1'");
	//++ НЕ УТ
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковПрочихРасходовУСН Тогда
		ШаблонЗаголовка = НСтр("ru = 'Расходы по УСН (прочие) %1';
								|en = 'STS expenses (other) %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковРасходовУСНПоТоварам Тогда
		ШаблонЗаголовка = НСтр("ru = 'Расходы по УСН (товары) %1';
								|en = 'STS expenses (goods) %1'");
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковРасходовУСНПоМатериалам Тогда
		ШаблонЗаголовка = НСтр("ru = 'Расходы по УСН (материалы) %1';
								|en = 'STS expenses (materials) %1'");
	//-- НЕ УТ
	КонецЕсли;

	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда
		ОкончаниеЗаголовка = НСтр("ru = '%1 от %2';
									|en = '%1 from %2'");
		ОкончаниеЗаголовка = СтрШаблон(ОкончаниеЗаголовка, НомерДокумента, ДатаДокумента);
	Иначе
		ОкончаниеЗаголовка = НСтр("ru = '(создание)';
									|en = '(create)'");
	КонецЕсли;
	
	Возврат СтрШаблон(ШаблонЗаголовка, ОкончаниеЗаголовка);
	
КонецФункции

Функция ПолучитьПараметрыКопированияДокумента(ХозяйственнаяОперация) Экспорт
	Возврат ВводОстатковСервер.ПолучитьПараметрыКопированияДокумента(ХозяйственнаяОперация);
КонецФункции
	
Функция ПолучениеФормыВводаОстатковОПродажахЗаПрошлыеПериоды(ХозяйственнаяОперация) Экспорт
	Возврат ВводОстатковСервер.ПолучениеФормыВводаОстатковОПродажахЗаПрошлыеПериоды(ХозяйственнаяОперация);
КонецФункции
#КонецОбласти
