#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает пространство имен пакета XDTO для обмена ЭЛН с ФСС.
//
// Возвращаемое значение:
//   Строка - Пространство имен пакета XDTO для обмена ЭЛН с ФСС.
//
Функция ПространствоИмен() Экспорт
	Возврат "http://www.fss.ru/integration/types/eln/ins/v01";
КонецФункции

// Возвращает версию формата обмена ЭЛН с ФСС.
//
// Возвращаемое значение:
//   Строка - Версия формата обмена ЭЛН с ФСС.
//
Функция Версия() Экспорт
	Возврат "2.0";
КонецФункции

// Проверяет что причина нетрудоспособности - карантин и что есть сведения об электронном листке нетрудоспособности.
//
// Возвращаемое значение:
//    Булево - Истина если причина нетрудоспособности - карантин и есть сведения об ЭЛН.
//
Функция ЭтоКарантинныйЭЛН(ПричинаНетрудоспособности, НомерЛН) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.Карантин
		И РегистрыСведений.СведенияОбЭЛН.ЭтоЭЛН(НомерЛН);
КонецФункции

// Проверяет по номеру ЛН что это ЭЛН и в регистре есть его исходный XML.
Функция ДоступенИсходныйXML(НомерЛН, ГоловнаяОрганизация) Экспорт
	Возврат РегистрыСведений.СведенияОбЭЛН.ДоступенИсходныйXML(НомерЛН, ГоловнаяОрганизация);
КонецФункции

#Область Больничные

Функция ДанныеРеестраВЧастиБольничногоОтправляемыеВФСС(СсылкаРеестра, НомерЛН) Экспорт
	ДанныеРеестраЭЛН = СтруктураДанныхРеестровВЧастиБольничного();
	ЗаполнитьДанныеРеестраЗаполняемыеИзБольничного(ДанныеРеестраЭЛН, СсылкаРеестра, НомерЛН);
	Возврат ДанныеРеестраЭЛН;
КонецФункции

Функция ДанныеБольничногоОтправляемыеВФСС(БольничныйОбъект) Экспорт
	ДанныеБольничногоДляЭЛН = СтруктураДанныхРеестровВЧастиБольничного();
	ЗаполнитьДанныеБольничногоОтправляемыеВФСС(ДанныеБольничногоДляЭЛН, БольничныйОбъект);
	Возврат ДанныеБольничногоДляЭЛН;
КонецФункции

Функция СтруктураДанныхРеестровВЧастиБольничного() Экспорт
	ИменаПолей =
	"ОсновноеМестоРаботы,
	|БазаДляРасчетаСреднегоЗаработка,
	|СреднийДневнойЗаработок,
	|УсловияИсчисленияКод1,
	|УсловияИсчисленияКод2,
	|УсловияИсчисленияКод3,
	|ДатаАктаН1,
	|ДатаНачалаРаботы,
	|ДатаНачалаОплаты,
	|ДатаОкончанияОплаты,
	|СтажЛет,
	|СтажМесяцев,
	|СтажРасширенныйЛет,
	|СтажРасширенныйМесяцев,
	|СуммаОплатыЗаСчетРаботодателя,
	|СуммаОплатыЗаСчетФСС";
	Возврат Новый Структура(ИменаПолей);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодготовкаНешифрованногоЗапроса

// Формирует параметры получения электронного листка нетрудоспособности.
//
// Параметры:
//   БольничныйЛист - ДокументОбъект.БольничныйЛист, ДанныеФормыСтруктура - Больничный.
//
// Возвращаемое значение:
//   Структура - Результат выгрузки в XML.
//       * Организация - СправочникСсылка.Организации - Организация, для которой получается ЭЛН.
//       * РегистрационныйНомерФСС - Строка - Рег. номер организации, для которой получается ЭЛН.
//       * ТекстXML - Строка - Сведения, необходимые для получения ЭЛН в формате XML.
//
Функция ВыгрузитьЗапросДляПолученияЭЛН(БольничныйЛист) Экспорт
	Отказ = Ложь;
	ДанныеБольничного = ДанныеБольничногоДляПолученияЭЛН(БольничныйЛист, Отказ);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПакетXDTO = ФабрикаXDTO.Пакеты.Получить(ПространствоИмен());
	getPrivateLNDataRequest = ФабрикаXDTO.Создать(ПакетXDTO.КорневыеСвойства.Получить("getPrivateLNDataRequest").Тип);
	
	getPrivateLNDataRequest.lnCode = ДанныеБольничного.НомерЛисткаНетрудоспособности;
	getPrivateLNDataRequest.regNum = ДанныеБольничного.РегистрационныйНомерДляОбменаФСС;
	getPrivateLNDataRequest.snils  = ДанныеБольничного.СНИЛС;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, getPrivateLNDataRequest, "getPrivateLNDataRequest");
	
	Результат = Новый Структура("Организация, РегистрационныйНомерФСС, ТекстXML");
	Результат.Организация             = БольничныйЛист.Организация;
	Результат.РегистрационныйНомерФСС = ДанныеБольничного.РегистрационныйНомерДляОбменаФСС;
	Результат.ТекстXML                = ЗаписьXML.Закрыть();
	
	Возврат Результат;
КонецФункции

// Формирует параметры отправки реестра электронных листков нетрудоспособности.
//
// Параметры:
//   Документ - ДокументОбъект.РеестрДанныхЭЛНЗаполняемыхРаботодателем, ДанныеФормыСтруктура - Реестр.
//   ПомещатьВФайл - Булево - Истина, если результат надо поместить в файл и вернуть адрес во временном хранилище.
//   ИдентификаторФормы - УникальныйИдентификатор - Идентификатор формы. Обязательный, если ПомещатьВФайл = Истина.
//   ВнутреннийФормат - Булево - Истина, если реестр требуется выгрузить в сокращенном формате для БРО.
//   ИсключатьПринятые - Булево - Истина, если реестр отправляется в сервис и необходимо учитывать состояние строк.
//       Ложь, если выгрузка в файл и требуются все строки, без учета их состояния.
//
// Возвращаемое значение:
//   Структура - Результат выгрузки в XML.
//       * Организация - СправочникСсылка.Организации - Организация, для которой отправляется реестр ЭЛН.
//       * РегистрационныйНомерФСС - Строка - Рег. номер организации, для которой отправляется реестр ЭЛН.
//       * ТекстXML - Строка - Данные реестра в формате XML (электронное представление),
//                             либо пустая строка если ПомещатьВФайл = Истина.
//       * Адрес - Строка - Адрес временного хранилища, по которому размещены двоичные данные файла реестра в формате XML,
//                          либо пустая строка если ПомещатьВФайл = Ложь.
//
Функция ВыгрузитьЗапросДляОтправкиРеестраЭЛН(Документ, ПомещатьВФайл, ИдентификаторФормы, ВнутреннийФормат, ИсключатьПринятые) Экспорт
	РегистрационныйНомерДляОбменаФСС = УчетПособийСоциальногоСтрахованияКлиентСервер.РегистрационныйНомерДляОбменаФСС(Документ);
	
	ПакетXDTO = ФабрикаXDTO.Пакеты.Получить(ПространствоИмен());
	
	ParseReestrFileRequest = ФабрикаXDTO.Создать(ПакетXDTO.КорневыеСвойства.Получить("prParseReestrFileRequest").Тип);
	
	Request = ФабрикаXDTO.Создать(ParseReestrFileRequest.Свойства().Получить("request").Тип);
	Request.regNum = РегистрационныйНомерДляОбменаФСС;
	
	XMLFile = ФабрикаXDTO.Создать(Request.Свойства().Получить("pXmlFile").Тип);
	Rowset = ФабрикаXDTO.Создать(XMLFile.Свойства().Получить("rowset").Тип);
	
	Rowset.version          = Версия();
	Rowset.software         = Лев("1С:" + Метаданные.Синоним, 80);
	Rowset.version_software = Лев(Метаданные.Версия, 15);
	
	Rowset.author = Строка(Документ.РеестрСоставил);
	Rowset.phone  = Строка(Документ.ТелефонСоставителя);
	Rowset.email  = Строка(Документ.АдресЭлектроннойПочтыСоставителя);
	
	ФИО = Новый Структура("Руководитель, ГлавныйБухгалтер", Документ.Руководитель, Документ.ГлавныйБухгалтер);
	ЗаполнитьПолныеФИО(ФИО);
	
	ТипСтроки = Rowset.Свойства().Получить("row").Тип;
	
	Для Каждого ДанныеЛН Из Документ.ДанныеЭЛН Цикл
		
		Если ИсключатьПринятые И ДанныеЛН.Состояние = Перечисления.СостоянияЭЛНВРеестрахЭЛН.ПринятФСС Тогда
			Продолжить;
		КонецЕсли;
		
		Row = Rowset.row.Добавить(ФабрикаXDTO.Создать(ТипСтроки));
		
		Row.lnCode   = ДанныеЛН.НомерЛисткаНетрудоспособности;
		Row.snils    = УчетПособийСоциальногоСтрахованияКлиентСервер.СНИЛСВФорматеФСС(ДанныеЛН.СНИЛС);
		Row.employer = Строка(Документ.Организация);
		Row.emplFlag = ?(ДанныеЛН.ВидЗанятости = Перечисления.ВидыЗанятости.ОсновноеМестоРаботы, 1, 0);
		
		УстановитьЗначениеЕслиЗаполнено(Row.innPerson,       ДанныеЛН.ИНН);
		УстановитьЗначениеЕслиЗаполнено(Row.emplRegNo,       Документ.РегистрационныйНомерФСС);
		УстановитьЗначениеЕслиЗаполнено(Row.emplRegNo2,      Документ.ДополнительныйКодФСС);
		УстановитьЗначениеЕслиЗаполнено(Row.approve2,        ФИО.ГлавныйБухгалтер);
		УстановитьЗначениеЕслиЗаполнено(Row.baseAvgSal,      ДанныеЛН.БазаДляРасчетаСреднегоЗаработка);
		УстановитьЗначениеЕслиЗаполнено(Row.baseAvgDailySal, ДанныеЛН.СреднийДневнойЗаработок);
		УстановитьЗначениеЕслиЗаполнено(Row.calcCondition1,  ДанныеЛН.УсловияИсчисленияКод1);
		УстановитьЗначениеЕслиЗаполнено(Row.calcCondition2,  ДанныеЛН.УсловияИсчисленияКод2);
		УстановитьЗначениеЕслиЗаполнено(Row.calcCondition3,  ДанныеЛН.УсловияИсчисленияКод3);
		
		УстановитьЗначение(Row.emplParentNo,   Документ.КодПодчиненностиФСС);
		УстановитьЗначение(Row.approve1,       ФИО.Руководитель);
		УстановитьЗначение(Row.form1Dt,        ДанныеЛН.ДатаАктаН1);
		УстановитьЗначение(Row.returnDateEmpl, ДанныеЛН.ДатаНачалаРаботы);
		УстановитьЗначение(Row.dt1Ln,          ДанныеЛН.ДатаНачалаОплаты);
		УстановитьЗначение(Row.dt2Ln,          ДанныеЛН.ДатаОкончанияОплаты);
		
		РазностьСтажей = УчетПособийСоциальногоСтрахования.ПодсчитатьРазностьСтажейВГодахИМесяцах(
			ДанныеЛН.СтажРасширенныйЛет,
			ДанныеЛН.СтажРасширенныйМесяцев,
			ДанныеЛН.СтажЛет,
			ДанныеЛН.СтажМесяцев);
		Если РазностьСтажей.РазностьЛет <> 0 Или РазностьСтажей.РазностьМесяцев <> 0 Тогда
			Row.insurYy = ДанныеЛН.СтажРасширенныйЛет;
			Row.insurMm = ДанныеЛН.СтажРасширенныйМесяцев;
			Row.notInsurYy = РазностьСтажей.РазностьЛет;
			Row.notInsurMm = РазностьСтажей.РазностьМесяцев;
		Иначе
			Row.insurYy = ДанныеЛН.СтажЛет;
			Row.insurMm = ДанныеЛН.СтажМесяцев;
			Row.notInsurYy = Неопределено;
			Row.notInsurMm = Неопределено;
		КонецЕсли;
		
		Row.emplPayment = ДанныеЛН.СуммаОплатыЗаСчетРаботодателя;
		Row.fssPayment  = ДанныеЛН.СуммаОплатыЗаСчетФСС;
		Row.payment     = ДанныеЛН.СуммаОплатыЗаСчетРаботодателя + ДанныеЛН.СуммаОплатыЗаСчетФСС;
		
		Если ДанныеЛН.Исправление Тогда
			УстановитьЗначениеЕслиЗаполнено(Row.correctionReason, ДанныеЛН.КодПричиныИсправления);
			УстановитьЗначениеЕслиЗаполнено(Row.correctionNote,   СокрЛП(ДанныеЛН.ОписаниеПричиныИсправления));
		КонецЕсли;
		
	КонецЦикла;
	
	XMLFile.rowset = Rowset;
	Request.pXmlFile = XMLFile;
	ParseReestrFileRequest.request = Request;
	
	Если ВнутреннийФормат Тогда
		ТекстXML = СериализацияБЗК.ОбъектXDTOВСтрокуXML(Rowset, "rowset", Ложь);
	Иначе
		ПакетXDTO = ФабрикаXDTO.Пакеты.Получить("http://schemas.xmlsoap.org/soap/envelope/");
		Envelope = ФабрикаXDTO.Создать(ПакетXDTO.КорневыеСвойства.Получить("Envelope").Тип);
		Envelope.Body = ФабрикаXDTO.Создать(Envelope.Свойства().Получить("Body").Тип);
		Envelope.Body.Добавить(ФормаXML.Элемент, ПространствоИмен(), "prParseReestrFileRequest", ParseReestrFileRequest);
		ТекстXML = СериализацияБЗК.ОбъектXDTOВСтрокуXML(Envelope, "Envelope", Истина);
	КонецЕсли;
	
	Результат = Новый Структура("Организация, РегистрационныйНомерФСС, ТекстXML, Адрес");
	Результат.Организация             = Документ.Организация;
	Результат.РегистрационныйНомерФСС = РегистрационныйНомерДляОбменаФСС;
	Результат.ТекстXML                = ТекстXML;
	
	Если ПомещатьВФайл Тогда
		ДвоичныеДанные = ЗарплатаКадры.СтрокаВДвоичныеДанные(ТекстXML, "UTF-8", Истина);
		Результат.Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ИдентификаторФормы);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ДанныеБольничногоДляПолученияЭЛН(БольничныйЛист, Отказ)
	Результат = Новый Структура("НомерЛисткаНетрудоспособности, РегистрационныйНомерДляОбменаФСС, СНИЛС");
	
	// Номер больничного листа.
	Результат.НомерЛисткаНетрудоспособности = БольничныйЛист.НомерЛисткаНетрудоспособности;
	
	// Регистрационный номер ФСС организации (страхователя).
	СведенияОбОрганизации = СЭДОФСС.СведенияОСтрахователе(БольничныйЛист.Организация, "НомерСтрахователяФСС");
	Результат.РегистрационныйНомерДляОбменаФСС = СведенияОбОрганизации.НомерСтрахователяФСС;
	
	// СНИЛС сотрудника на которого оформлен листок нетрудоспособности.
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, БольничныйЛист.Сотрудник, "СтраховойНомерПФР");
	Если КадровыеДанные.Количество() > 0 Тогда
		Результат.СНИЛС = УчетПособийСоциальногоСтрахованияКлиентСервер.СНИЛСВФорматеФСС(
			КадровыеДанные[0].СтраховойНомерПФР);
	КонецЕсли;
	
	// Проверка результатов.
	ТекстОшибки = УчетПособийСоциальногоСтрахования.ПроверитьНомерЛН(Результат.НомерЛисткаНетрудоспособности);
	Если ТекстОшибки <> "" Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "НомерЛисткаНетрудоспособности", "Объект", Отказ);
	КонецЕсли;
	ТекстОшибки = УчетПособийСоциальногоСтрахования.ПроверитьРегистрационныйНомерФСС(
		Результат.РегистрационныйНомерДляОбменаФСС);
	Если ТекстОшибки <> "" Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Организация", "Объект", Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Результат.СНИЛС) Тогда
		Текст = НСтр("ru = 'У сотрудника не указан СНИЛС';
					|en = 'IIAN is not specified for the employee'");
		ОбщегоНазначения.СообщитьПользователю(Текст, , "Сотрудник", "Объект", Отказ);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Получает полные ФИО физических лиц.
//
// Параметры:
//   СтруктураФИО - Структура - По указанным ключам структуры будут размещены полные ФИО.
//       * Ключ - Строка - Имя ключа, по которому будет размещено полное ФИО.
//       * Значение - СправочникСсылка.ФизическиеЛица - Ссылка физ. лица, для которого требуется получить ФИО.
//           После выполнения процедуры превращается в тип "Строка".
//
Процедура ЗаполнитьПолныеФИО(СтруктураФИО)
	МассивФизическихЛиц = Новый Массив;
	Для Каждого КлючИЗначение Из СтруктураФИО Цикл
		МассивФизическихЛиц.Добавить(КлючИЗначение.Значение);
	КонецЦикла;
	
	ТаблицаКадровыхДанных = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, МассивФизическихЛиц, "ФИОПолные");
	
	Для Каждого КлючИЗначение Из СтруктураФИО Цикл
		КадровыеДанныеФизическогоЛица = ТаблицаКадровыхДанных.Найти(КлючИЗначение.Значение, "ФизическоеЛицо");
		Если КадровыеДанныеФизическогоЛица <> Неопределено Тогда
			ФИО = КадровыеДанныеФизическогоЛица.ФИОПолные;
		ИначеЕсли ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			ФИО = Строка(КлючИЗначение.Значение);
		Иначе
			ФИО = "";
		КонецЕсли;
		СтруктураФИО.Вставить(КлючИЗначение.Ключ, ФИО);
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьЗначениеЕслиЗаполнено(ИзменяемоеЗначение, Значение)
	Если ЗначениеЗаполнено(Значение) Тогда
		ИзменяемоеЗначение = Значение;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьЗначение(ИзменяемоеЗначение, Значение)
	Если ЗначениеЗаполнено(Значение) Тогда
		ИзменяемоеЗначение = Значение;
	Иначе
		ИзменяемоеЗначение = Неопределено;
	КонецЕсли;
КонецПроцедуры

Функция КодыПричинИсправления(Список = Неопределено) Экспорт
	Если ТипЗнч(Список) <> Тип("СписокЗначений") Тогда
		Список = Новый СписокЗначений;
	КонецЕсли;
	
	Список.Добавить("01", НСтр("ru = 'Работником представлены дополнительные сведения для расчета';
								|en = 'Employee has provided additional information for calculation'"));
	Список.Добавить("02", НСтр("ru = 'Работником представлено свидетельство ИНН';
								|en = 'Employee gave the TIN certificate'"));
	Список.Добавить("03", НСтр("ru = 'Изменены регистрационные данные работодателя/сведения о должностных лицах работодателя';
								|en = 'Employer''s registration data/information on employer''s officials was changed'"));
	Список.Добавить("04", НСтр("ru = 'Уточнены условия труда работника/условия исчисления пособия (включая Акт ф. Н-1)';
								|en = 'Employee working conditions/allowance calculation conditions are specified (including certificate N-1 from)'"));
	Список.Добавить("05", НСтр("ru = 'Выявлены ошибки в расчете пособия/подсчете страхового стажа';
								|en = 'Allowance/pensionable service calculation errors are detected'"));
	Список.Добавить("06", НСтр("ru = 'Ошибка оператора';
								|en = 'Provider error'"));
	
	Для Каждого Элемент Из Список Цикл
		Элемент.Представление = Элемент.Значение + ". " + Элемент.Представление;
	КонецЦикла;
	
	Возврат Список;
КонецФункции

#КонецОбласти

#Область ЧтениеРасшифрованногоОтвета

Функция ЗагрузитьОтветСервисаФСС(Документ, Операция, АдресРасшифрованногоОтвета, ЗагрузкаИзФайла = Ложь) Экспорт
	Результат = Новый Структура("Отказ, ТекстСообщенияФСС");
	Результат.Отказ = Ложь;
	Результат.ТекстСообщенияФСС = "";
	
	ИсходныйXML = Неопределено;
	СтруктураDOM = Неопределено;
	Попытка
		ИсходныйXML = СериализацияБЗК.СтрокаXMLИзВременногоХранилища(АдресРасшифрованногоОтвета);
		СтруктураDOM = СериализацияБЗК.СтруктураDOM(ИсходныйXML);
	Исключение
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка при получении содержимого XML: %1';
				|en = 'Error getting XML content: %1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		СообщенияБЗК.СообщитьОПроблеме(ТекстОшибки);
	КонецПопытки;
	Если СтруктураDOM = Неопределено Тогда
		РасшифрованныйОтвет = ПолучитьИзВременногоХранилища(АдресРасшифрованногоОтвета);
		СтруктураDOM = СериализацияБЗК.СтруктураDOM(РасшифрованныйОтвет);
	КонецЕсли;
	
	УдалитьИзВременногоХранилища(АдресРасшифрованногоОтвета);
	
	Попытка
		Если Операция = "getPrivateLNData" Тогда
			
			ДанныеИзСервиса = ДанныеЭЛН(СтруктураDOM, Результат.Отказ, Результат.ТекстСообщенияФСС);
			
			Если Результат.Отказ Тогда
				Возврат Результат;
			КонецЕсли;
			
			Если ТипЗнч(Документ) = Тип("Структура") Тогда
				// Метод вызван только для актуализации хеша ЭЛН.
				РегистрыСведений.СведенияОбЭЛН.ЗаписатьПервичныеСведения(
					ДанныеИзСервиса.НомерЛН,
					ДанныеИзСервиса.ХешЭЛН,
					ДанныеИзСервиса.СостояниеЭЛНВФСС,
					Документ.Организация,
					Неопределено,
					ИсходныйXML);
			Иначе
				// Метод вызван для заполнения больничного.
				ЗагрузитьРезультатПолученияЭЛН(Документ, ДанныеИзСервиса, ИсходныйXML, Результат.Отказ);
			КонецЕсли;
			
		ИначеЕсли Операция = "prParseReestrFile" Тогда
			
			Результат.ТекстСообщенияФСС = ТекстСообщенияФСС(СтруктураDOM);
			
			УзелRowset = СериализацияБЗК.НайтиУзелDOM(СтруктураDOM, "//*[local-name() = 'infoRowset']");
			Если УзелRowset = Неопределено Тогда
				УзелRow = СериализацияБЗК.НайтиУзелDOM(СтруктураDOM, "//*[local-name() = 'infoRow']");
				Если УзелRow = Неопределено Тогда
					ВызватьИсключение СокрП(НСтр("ru = 'Узел ""infoRowset"" не найден';
												|en = '""infoRowset"" node not found'") + Символы.ПС + Символы.ПС + Результат.ТекстСообщенияФСС);
				КонецЕсли;
				УзелRowset = УзелRow.РодительскийУзел;
			КонецЕсли;
			
			СтрокаXML = СериализацияБЗК.ОбъектDOMВСтрокуXML(УзелRowset);
			ОбъектRowset = СериализацияБЗК.ОбъектXDTOИзСтрокиXML(СтрокаXML);
			ЭлементыRow = СериализацияБЗК.СписокXDTO(ОбъектRowset, "infoRow");
			
			ЗагрузитьРезультатОтправкиРеестраЭЛН(Документ, ЭлементыRow, Результат);
			
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка при загрузке ответа ФСС по операции ""%1"":
				|%2
				|
				|XML ответа:
				|%3';
				|en = 'Error importing SSF response to operation ""%1"":
				|%2
				|
				|Response XML:
				|%3'"),
			Операция,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке),
			ИсходныйXML);
		СообщенияБЗК.СообщитьОПроблеме(ТекстОшибки);
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

Функция ТекстСообщенияФСС(СтруктураDOM)
	УзелСообщения = СериализацияБЗК.НайтиУзелDOM(СтруктураDOM, "//*[local-name() = 'mess']");
	Если УзелСообщения = Неопределено Тогда
		УзелСообщения = СериализацияБЗК.НайтиУзелDOM(СтруктураDOM, "//*[local-name() = 'MESS']");
	КонецЕсли;
	Если УзелСообщения <> Неопределено Тогда
		ТекстовоеСодержимое = СокрЛП(Строка(УзелСообщения.ТекстовоеСодержимое));
		Если ТекстовоеСодержимое <> "" Тогда
			Возврат НСтр("ru = 'При обмене с ФСС возникли ошибки. Ответ ФСС:';
						|en = 'Errors occurred when exchanging with SSF. SSF response:'") + Символы.ПС + ТекстовоеСодержимое;
		КонецЕсли;
	КонецЕсли;
	Возврат "";
КонецФункции

#КонецОбласти

#Область ЗагрузкаЭЛН

Функция ДанныеЭЛН(СтруктураDOM, Отказ = Ложь, ТекстСообщенияФСС = Неопределено) Экспорт
	ТекстСообщенияФСС = ТекстСообщенияФСС(СтруктураDOM);
	
	УзелЭЛН = СериализацияБЗК.НайтиУзелDOM(СтруктураDOM, "//*[local-name() = 'responseRow']");
	Если УзелЭЛН = Неопределено Тогда
		УзелЭЛН = СериализацияБЗК.НайтиУзелDOM(СтруктураDOM, "//*[local-name() = 'ROW']");
		Если УзелЭЛН = Неопределено Тогда
			ВызватьИсключение ?(ПустаяСтрока(ТекстСообщенияФСС), НСтр("ru = 'Узел ""responseRow"" не найден';
																		|en = '""responseRow"" node not found'"), ТекстСообщенияФСС);
		КонецЕсли;
	КонецЕсли;
	
	СтрокаXML = СериализацияБЗК.ОбъектDOMВСтрокуXML(УзелЭЛН);
	ОбъектЭЛН = СериализацияБЗК.ОбъектXDTOИзСтрокиXML(СтрокаXML);
	
	УзелОтвета = СериализацияБЗК.НайтиУзелDOM(СтруктураDOM, "//*[local-name() = 'fileOperationsLnUserGetPrivateLNDataOut']");
	Если УзелОтвета = Неопределено Тогда
		УзелОтвета = СериализацияБЗК.НайтиУзелDOM(СтруктураDOM, "//*[local-name() = 'FileOperationsLnUserGetPrivateLNDataOut']");
	КонецЕсли;
	УзелКодаОтвета = СериализацияБЗК.НайтиУзелDOM(СтруктураDOM, "*[local-name() = 'status']", УзелОтвета);
	Если УзелКодаОтвета = Неопределено Тогда
		УзелКодаОтвета = СериализацияБЗК.НайтиУзелDOM(СтруктураDOM, "*[local-name() = 'STATUS']", УзелОтвета);
	КонецЕсли;
	КодОтвета = ?(УзелКодаОтвета = Неопределено, "", СокрЛП(УзелКодаОтвета.ТекстовоеСодержимое));
	Если КодОтвета <> "1" И ЗначениеЗаполнено(ТекстСообщенияФСС) Тогда
		СообщенияБЗККлиентСервер.СообщитьОбОшибкеВФорме(Отказ, ТекстСообщенияФСС);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ОбъектЭЛН.Свойства().Получить("lnCode") = Неопределено
		И ОбъектЭЛН.Свойства().Получить("LN_CODE") <> Неопределено Тогда
		ДанныеИзСервиса = ОтветСервисаПолученияЭЛНСтаройВерсии(ОбъектЭЛН, Отказ);
	Иначе
		ДанныеИзСервиса = ОтветСервисаПолученияЭЛН(ОбъектЭЛН, Отказ);
	КонецЕсли;
	
	Возврат ДанныеИзСервиса;
КонецФункции

Функция ОтветСервисаПолученияЭЛН(ОбъектЭЛН, Отказ)
	ИменаПолейИзСервиса = 
	"approve1,
	|approve2,
	|baseAvgDailySal,
	|baseAvgSal,
	|birthday,
	|calcCondition1,
	|calcCondition2,
	|calcCondition3,
	|calcCondition4,
	|date1,
	|date2,
	|dt1Ln,
	|dt2Ln,
	|duplicateFlag,
	|emplFlag,
	|emplParentNo,
	|emplPayment,
	|emplRegNo,
	|emplRegNo2,
	|employer,
	|form1Dt,
	|fssPayment,
	|gender,
	|hospitalBreach,
	|hospitalDt1,
	|hospitalDt2,
	|innPerson,
	|insurMm,
	|insurYy,
	|lnCode,
	|lnDate,
	|lnHash,
	|lnResult,
	|lnState,
	|lpuAddress,
	|lpuName,
	|lpuOgrn,
	|mseDt1,
	|mseDt2,
	|mseDt3,
	|mseInvalidGroup,
	|name,
	|notInsurMm,
	|notInsurYy,
	|patronymic,
	|payment,
	|pregn12wFlag,
	|prevLnCode,
	|primaryFlag,
	|reason1,
	|reason2,
	|reason3,
	|returnDateEmpl,
	|returnrDateEmpl,
	|snils,
	|surname,
	|voucherNo,
	|voucherOgrn,
	|previouslyIssuedCode,
	|intermittentMethodFlag";
	
	ДанныеИзСервиса = Новый Структура(ИменаПолейИзСервиса);
	ЗаполнитьЗначенияСвойств(ДанныеИзСервиса, ОбъектЭЛН);
	ДанныеИзСервиса.Вставить("АктуальныйФормат", Истина); // Проверять заполнение обязательных полей.
	
	// Базовые проверки спецификации.
	БазовыеПоля = СтрРазделить("snils, lnCode", ", ", Ложь);
	Для Каждого ИмяПоля Из БазовыеПоля Цикл
		Если Не ЗначениеЗаполнено(ДанныеИзСервиса[ИмяПоля]) Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Файл не соответствует спецификации: Не заполнено поле ""%1"".';
										|en = 'File does not match the specification: Field ""%1"" is blank.'"), ИмяПоля);
			СообщенияБЗККлиентСервер.СообщитьОбОшибкеВФорме(Отказ, ТекстОшибки, ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеИзСервиса.Вставить("НомерЛН", ЗначениеXMLТипаСтрока(ДанныеИзСервиса.lnCode));
	ДанныеИзСервиса.Вставить("ДатаЛН", СериализацияБЗК.ЗначениеXML(ДанныеИзСервиса.lnDate, Тип("Дата")));
	ДанныеИзСервиса.Вставить("ХешЭЛН", ЗначениеXMLТипаСтрока(ДанныеИзСервиса.lnHash));
	
	ДанныеИзСервиса.Вставить("СНИЛС", УчетПособийСоциальногоСтрахованияКлиентСервер.СНИЛСВФорматеИБ(ДанныеИзСервиса.snils));
	ДанныеИзСервиса.Вставить("Фамилия",  ЗначениеXMLТипаСтрока(ДанныеИзСервиса.surname));
	ДанныеИзСервиса.Вставить("Имя",      ЗначениеXMLТипаСтрока(ДанныеИзСервиса.name));
	ДанныеИзСервиса.Вставить("Отчество", ЗначениеXMLТипаСтрока(ДанныеИзСервиса.patronymic));
	
	ДанныеИзСервиса.Вставить("ЯвляетсяПродолжениемБолезни", Не СериализацияБЗК.ЗначениеXML(ДанныеИзСервиса.primaryFlag, Тип("Булево")));
	ДанныеИзСервиса.Вставить("НомерПервичногоЛисткаНетрудоспособности", Строка(ДанныеИзСервиса.prevLnCode));
	
	ДанныеИзСервиса.Вставить("ПериодыНетрудоспособности", СериализацияБЗК.СписокXDTO(ОбъектЭЛН, "treatPeriods.treatFullPeriod"));
	ДанныеИзСервиса.Вставить("ПериодыЛеченияРодственниковXML", СериализацияБЗК.СписокXDTO(ОбъектЭЛН, "servData.servFullData"));
	
	СостояниеЭЛНВФСС = Перечисления.СостоянияЭЛНВФСС.НайтиПоКодуФСС(ДанныеИзСервиса.lnState);
	ДанныеИзСервиса.Вставить("СостояниеЭЛНВФСС", СостояниеЭЛНВФСС);
	
	Возврат ДанныеИзСервиса;
КонецФункции

Функция ОтветСервисаПолученияЭЛНСтаройВерсии(ОбъектЭЛН, Отказ)
	ИменаПолейСтарогоФормата = 
	"APPROVE1,
	|APPROVE2,
	|BASE_AVG_DAILY_SAL,
	|BASE_AVG_SAL,
	|BIRTHDAY,
	|BOZ_FLAG,
	|CALC_CONDITION1,
	|CALC_CONDITION2,
	|CALC_CONDITION3,
	|CALC_CONDITION4,
	|DATE1,
	|DATE2,
	|DT1_LN,
	|DT2_LN,
	|DUPLICATE_FLAG,
	|EMPL_FLAG,
	|EMPL_PARENT_NO,
	|EMPL_PAYMENT,
	|EMPL_REG_NO,
	|EMPL_REG_NO2,
	|EMPLOYER,
	|FORM1_DT,
	|FSS_PAYMENT,
	|GENDER,
	|HOSPITAL_BREACH,
	|HOSPITAL_DT1,
	|HOSPITAL_DT2,
	|INN_PERSON,
	|INSUR_MM,
	|INSUR_YY,
	|LN_CODE,
	|LN_DATE,
	|LN_HASH,
	|LN_RESULT,
	|LN_STATE,
	|LPU_ADDRESS,
	|LPU_EMPL_FLAG,
	|LPU_EMPLOYER,
	|LPU_NAME,
	|LPU_OGRN,
	|MSE_DT1,
	|MSE_DT2,
	|MSE_DT3,
	|MSE_INVALID_GROUP,
	|NAME,
	|NOT_INSUR_MM,
	|NOT_INSUR_YY,
	|PARENT_CODE,
	|PATRONIMIC,
	|PAYMENT,
	|PREGN12W_FLAG,
	|PREV_LN_CODE,
	|PRIMARY_FLAG,
	|REASON1,
	|REASON2,
	|REASON3,
	|RETURN_DATE_EMPL,
	|SERV1_AGE,
	|SERV1_FIO,
	|SERV1_MM,
	|SERV1_RELATION_CODE,
	|SERV2_AGE,
	|SERV2_FIO,
	|SERV2_MM,
	|SERV2_RELATION_CODE,
	|SNILS,
	|SURNAME,
	|VOUCHER_NO,
	|VOUCHER_OGRN";
	
	ДанныеВСтаромФормате = Новый Структура(ИменаПолейСтарогоФормата);
	ЗаполнитьЗначенияСвойств(ДанныеВСтаромФормате, ОбъектЭЛН);
	
	ДанныеИзСервиса = Новый Структура;
	ДанныеИзСервиса.Вставить("АктуальныйФормат", Ложь); // Отключается проверка заполнения даты рождения родственника.
	ДанныеИзСервиса.Вставить("approve1", ДанныеВСтаромФормате.APPROVE1);
	ДанныеИзСервиса.Вставить("approve2", ДанныеВСтаромФормате.APPROVE2);
	ДанныеИзСервиса.Вставить("baseAvgDailySal", ДанныеВСтаромФормате.BASE_AVG_DAILY_SAL);
	ДанныеИзСервиса.Вставить("baseAvgSal", ДанныеВСтаромФормате.BASE_AVG_SAL);
	ДанныеИзСервиса.Вставить("birthday", ДанныеВСтаромФормате.BIRTHDAY);
	ДанныеИзСервиса.Вставить("calcCondition1", ДанныеВСтаромФормате.CALC_CONDITION1);
	ДанныеИзСервиса.Вставить("calcCondition2", ДанныеВСтаромФормате.CALC_CONDITION2);
	ДанныеИзСервиса.Вставить("calcCondition3", ДанныеВСтаромФормате.CALC_CONDITION3);
	ДанныеИзСервиса.Вставить("calcCondition4", ДанныеВСтаромФормате.CALC_CONDITION4);
	ДанныеИзСервиса.Вставить("date1", ДанныеВСтаромФормате.DATE1);
	ДанныеИзСервиса.Вставить("date2", ДанныеВСтаромФормате.DATE2);
	ДанныеИзСервиса.Вставить("dt1Ln", ДанныеВСтаромФормате.DT1_LN);
	ДанныеИзСервиса.Вставить("dt2Ln", ДанныеВСтаромФормате.DT2_LN);
	ДанныеИзСервиса.Вставить("duplicateFlag", ДанныеВСтаромФормате.DUPLICATE_FLAG);
	ДанныеИзСервиса.Вставить("emplFlag", ДанныеВСтаромФормате.EMPL_FLAG);
	ДанныеИзСервиса.Вставить("emplParentNo", ДанныеВСтаромФормате.EMPL_PARENT_NO);
	ДанныеИзСервиса.Вставить("emplPayment", ДанныеВСтаромФормате.EMPL_PAYMENT);
	ДанныеИзСервиса.Вставить("emplRegNo", ДанныеВСтаромФормате.EMPL_REG_NO);
	ДанныеИзСервиса.Вставить("emplRegNo2", ДанныеВСтаромФормате.EMPL_REG_NO2);
	ДанныеИзСервиса.Вставить("employer", ДанныеВСтаромФормате.EMPLOYER);
	ДанныеИзСервиса.Вставить("form1Dt", ДанныеВСтаромФормате.FORM1_DT);
	ДанныеИзСервиса.Вставить("fssPayment", ДанныеВСтаромФормате.FSS_PAYMENT);
	ДанныеИзСервиса.Вставить("gender", ДанныеВСтаромФормате.GENDER);
	ДанныеИзСервиса.Вставить("hospitalBreach", Неопределено);
	ДанныеИзСервиса.Вставить("hospitalDt1", ДанныеВСтаромФормате.HOSPITAL_DT1);
	ДанныеИзСервиса.Вставить("hospitalDt2", ДанныеВСтаромФормате.HOSPITAL_DT2);
	ДанныеИзСервиса.Вставить("innPerson", ДанныеВСтаромФормате.INN_PERSON);
	ДанныеИзСервиса.Вставить("insurMm", ДанныеВСтаромФормате.INSUR_MM);
	ДанныеИзСервиса.Вставить("insurYy", ДанныеВСтаромФормате.INSUR_YY);
	ДанныеИзСервиса.Вставить("lnCode", ДанныеВСтаромФормате.LN_CODE);
	ДанныеИзСервиса.Вставить("lnDate", ДанныеВСтаромФормате.LN_DATE);
	ДанныеИзСервиса.Вставить("lnHash", ДанныеВСтаромФормате.LN_HASH);
	ДанныеИзСервиса.Вставить("lnResult", Неопределено);
	ДанныеИзСервиса.Вставить("lnState", ДанныеВСтаромФормате.LN_STATE);
	ДанныеИзСервиса.Вставить("lpuAddress", ДанныеВСтаромФормате.LPU_ADDRESS);
	ДанныеИзСервиса.Вставить("lpuName", ДанныеВСтаромФормате.LPU_NAME);
	ДанныеИзСервиса.Вставить("lpuOgrn", ДанныеВСтаромФормате.LPU_OGRN);
	ДанныеИзСервиса.Вставить("mseDt1", ДанныеВСтаромФормате.MSE_DT1);
	ДанныеИзСервиса.Вставить("mseDt2", ДанныеВСтаромФормате.MSE_DT2);
	ДанныеИзСервиса.Вставить("mseDt3", ДанныеВСтаромФормате.MSE_DT3);
	ДанныеИзСервиса.Вставить("mseInvalidGroup", ДанныеВСтаромФормате.MSE_INVALID_GROUP);
	ДанныеИзСервиса.Вставить("name", ДанныеВСтаромФормате.NAME);
	ДанныеИзСервиса.Вставить("notInsurMm", ДанныеВСтаромФормате.NOT_INSUR_MM);
	ДанныеИзСервиса.Вставить("notInsurYy", ДанныеВСтаромФормате.NOT_INSUR_YY);
	ДанныеИзСервиса.Вставить("patronymic", ДанныеВСтаромФормате.PATRONIMIC);
	ДанныеИзСервиса.Вставить("payment", ДанныеВСтаромФормате.PAYMENT);
	ДанныеИзСервиса.Вставить("pregn12wFlag", Неопределено);
	ДанныеИзСервиса.Вставить("prevLnCode", ДанныеВСтаромФормате.PREV_LN_CODE);
	ДанныеИзСервиса.Вставить("primaryFlag", ДанныеВСтаромФормате.PRIMARY_FLAG);
	ДанныеИзСервиса.Вставить("reason1", ДанныеВСтаромФормате.REASON1);
	ДанныеИзСервиса.Вставить("reason2", ДанныеВСтаромФормате.REASON2);
	ДанныеИзСервиса.Вставить("reason3", ДанныеВСтаромФормате.REASON3);
	ДанныеИзСервиса.Вставить("returnDateEmpl", ДанныеВСтаромФормате.RETURN_DATE_EMPL);
	ДанныеИзСервиса.Вставить("returnrDateEmpl", "");
	ДанныеИзСервиса.Вставить("snils", ДанныеВСтаромФормате.SNILS);
	ДанныеИзСервиса.Вставить("surname", ДанныеВСтаромФормате.SURNAME);
	ДанныеИзСервиса.Вставить("voucherNo", ДанныеВСтаромФормате.VOUCHER_NO);
	ДанныеИзСервиса.Вставить("voucherOgrn", ДанныеВСтаромФормате.VOUCHER_OGRN);
	ДанныеИзСервиса.Вставить("previouslyIssuedCode", "");
	ДанныеИзСервиса.Вставить("intermittentMethodFlag", Неопределено);
	
	// Адаптация поля pregn12wFlag.
	Если ДанныеВСтаромФормате.PREGN12W_FLAG = "1" Тогда
		ДанныеИзСервиса.Вставить("pregn12wFlag", "true");
	ИначеЕсли ДанныеВСтаромФормате.PREGN12W_FLAG = "0" Тогда
		ДанныеИзСервиса.Вставить("pregn12wFlag", "false");
	КонецЕсли;
	
	// Адаптация вложенных полей lnResult.
	Если ДанныеВСтаромФормате.LN_RESULT <> Неопределено Тогда
		ЗначенияВСтаромФормате = Новый Структура("MSE_RESULT, OTHER_STATE_DT, RETURN_DATE_LPU, NEXT_LN_CODE");
		ЗаполнитьЗначенияСвойств(ЗначенияВСтаромФормате, ДанныеВСтаромФормате.LN_RESULT);
		
		Значения = Новый Структура;
		Значения.Вставить("mseResult", ЗначенияВСтаромФормате.MSE_RESULT);
		Значения.Вставить("otherStateDt", ЗначенияВСтаромФормате.OTHER_STATE_DT);
		Значения.Вставить("returnDateLpu", ЗначенияВСтаромФормате.RETURN_DATE_LPU);
		Значения.Вставить("nextLnCode", ЗначенияВСтаромФормате.NEXT_LN_CODE);
		
		ДанныеИзСервиса.Вставить("lnResult", Значения);
	КонецЕсли;
	
	// Адаптация вложенных полей hospitalBreach.
	Если ДанныеВСтаромФормате.HOSPITAL_BREACH <> Неопределено Тогда
		ЗначенияВСтаромФормате = Новый Структура("HOSPITAL_BREACH_CODE, HOSPITAL_BREACH_DT");
		ЗаполнитьЗначенияСвойств(ЗначенияВСтаромФормате, ДанныеВСтаромФормате.HOSPITAL_BREACH);
		
		Значения = Новый Структура;
		Значения.Вставить("hospitalBreachCode", ЗначенияВСтаромФормате.HOSPITAL_BREACH_CODE);
		Значения.Вставить("hospitalBreachDt", ЗначенияВСтаромФормате.HOSPITAL_BREACH_DT);
		
		ДанныеИзСервиса.Вставить("hospitalBreach", Значения);
	КонецЕсли;
	
	// Адаптация вложенных полей treatPeriods.treatFullPeriod.
	ДатаНачала    = '39991231235959';
	ДатаОкончания = '00010101';
	ДатаНачалаXML    = "";
	ДатаОкончанияXML = "";
	ПериодыНетрудоспособности = Новый Массив;
	ПериодыНетрудоспособностиВСтаромФормате = СериализацияБЗК.СписокXDTO(ОбъектЭЛН, "TREAT_PERIODS.TREAT_FULL_PERIOD");
	Для Каждого СтрокаТаблицыПолныхПериодов Из ПериодыНетрудоспособностиВСтаромФормате Цикл
		
		СвойстваПериодаВСтаромФормате = Новый Структура("TREAT_CHAIRMAN, TREAT_CHAIRMAN_ROLE, TREAT_PERIOD");
		ЗаполнитьЗначенияСвойств(СвойстваПериодаВСтаромФормате, СтрокаТаблицыПолныхПериодов);
		
		ПодробностиПериода = Неопределено;
		Если СвойстваПериодаВСтаромФормате.TREAT_PERIOD <> Неопределено Тогда
			
			ПодробностиПериодаВСтаромФормате = Новый Структура("TREAT_DT1, TREAT_DT2, TREAT_DOCTOR_ROLE, TREAT_DOCTOR");
			ЗаполнитьЗначенияСвойств(ПодробностиПериодаВСтаромФормате, СвойстваПериодаВСтаромФормате.TREAT_PERIOD);
			
			ПодробностиПериода = Новый Структура;
			ПодробностиПериода.Вставить("treatDt1",        ПодробностиПериодаВСтаромФормате.TREAT_DT1);
			ПодробностиПериода.Вставить("treatDt2",        ПодробностиПериодаВСтаромФормате.TREAT_DT2);
			ПодробностиПериода.Вставить("treatDoctorRole", ПодробностиПериодаВСтаромФормате.TREAT_DOCTOR_ROLE);
			ПодробностиПериода.Вставить("treatDoctor",     ПодробностиПериодаВСтаромФормате.TREAT_DOCTOR);
			
			// Для заполнения обязательных полей servDt1 и servDt2 требуется вычислить начало и окончание нетрудоспособности.
			Дата1 = СериализацияБЗК.ЗначениеXML(ПодробностиПериода.treatDt1, Тип("Дата"));
			Дата2 = СериализацияБЗК.ЗначениеXML(ПодробностиПериода.treatDt2, Тип("Дата"));
			Если ЗначениеЗаполнено(Дата1) И Дата1 < ДатаНачала Тогда
				ДатаНачала    = Дата1;
				ДатаНачалаXML = ПодробностиПериода.treatDt1;
				Если ДатаОкончания < ДатаНачала Тогда
					ДатаОкончания    = ДатаНачала;
					ДатаОкончанияXML = ДатаНачалаXML;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(Дата2) И Дата2 > ДатаОкончания Тогда
				ДатаОкончания    = Дата2;
				ДатаОкончанияXML = ПодробностиПериода.treatDt2;
			КонецЕсли;
			
		КонецЕсли;
		
		СвойстваПериода = Новый Структура;
		СвойстваПериода.Вставить("treatChairman",     СвойстваПериодаВСтаромФормате.TREAT_CHAIRMAN);
		СвойстваПериода.Вставить("treatChairmanRole", СвойстваПериодаВСтаромФормате.TREAT_CHAIRMAN_ROLE);
		СвойстваПериода.Вставить("treatPeriod",       ПодробностиПериода);
		
		ПериодыНетрудоспособности.Добавить(СвойстваПериода);
	КонецЦикла;
	
	// Адаптация вложенных полей servData.servFullData.
	ПериодыЛеченияРодственниковXML = Новый Массив;
	Для НомерРодственника = 1 По 2 Цикл
		Префикс = "SERV" + НомерРодственника + "_";
		
		ФИО            = ЗначениеXMLТипаСтрока(ДанныеВСтаромФормате[Префикс + "FIO"]);
		ВозрастЛет     = СериализацияБЗК.ЗначениеXML(ДанныеВСтаромФормате[Префикс + "AGE"], Тип("Число"));
		ВозрастМесяцев = СериализацияБЗК.ЗначениеXML(ДанныеВСтаромФормате[Префикс + "MM"],  Тип("Число"));
		Если ЗначениеЗаполнено(ФИО)
			Или (ТипЗнч(ВозрастЛет) = Тип("Число")     И ВозрастЛет > 0)
			Или (ТипЗнч(ВозрастМесяцев) = Тип("Число") И ВозрастМесяцев > 0) Тогда
			
			Если ЗначениеЗаполнено(ФИО) Тогда
				ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИО);
			Иначе
				ЧастиИмени = Новый Структура("Фамилия, Имя, Отчество", "", "", "");
			КонецЕсли;
			
			ЗначенияПолей = Новый Структура;
			ЗначенияПолей.Вставить("servAge",          ДанныеВСтаромФормате[Префикс + "AGE"]);
			ЗначенияПолей.Вставить("servMm",           ДанныеВСтаромФормате[Префикс + "MM"]);
			ЗначенияПолей.Вставить("servRelationCode", ДанныеВСтаромФормате[Префикс + "RELATION_CODE"]);
			ЗначенияПолей.Вставить("servDt1",          ДатаНачалаXML);
			ЗначенияПолей.Вставить("servDt2",          ДатаОкончанияXML);
			ЗначенияПолей.Вставить("treatmentType",    Неопределено);
			ЗначенияПолей.Вставить("surname",          ЧастиИмени.Фамилия);
			ЗначенияПолей.Вставить("name",             ЧастиИмени.Имя);
			ЗначенияПолей.Вставить("patronymic",       ЧастиИмени.Отчество);
			ЗначенияПолей.Вставить("birthday",         Неопределено);
			ЗначенияПолей.Вставить("reason1",          Неопределено);
			ЗначенияПолей.Вставить("snils",            Неопределено);
			
			ПериодыЛеченияРодственниковXML.Добавить(ЗначенияПолей);
		КонецЕсли;
	КонецЦикла;
	
	// Базовые проверки спецификации.
	БазовыеПоля = СтрРазделить("snils, lnCode", ", ", Ложь);
	Для Каждого ИмяПоля Из БазовыеПоля Цикл
		Если Не ЗначениеЗаполнено(ДанныеИзСервиса[ИмяПоля]) Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Файл не соответствует спецификации: Не заполнено поле ""%1"".';
										|en = 'File does not match the specification: Field ""%1"" is blank.'"), ИмяПоля);
			СообщенияБЗККлиентСервер.СообщитьОбОшибкеВФорме(Отказ, ТекстОшибки, ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеИзСервиса.Вставить("НомерЛН", ЗначениеXMLТипаСтрока(ДанныеИзСервиса.lnCode));
	ДанныеИзСервиса.Вставить("ДатаЛН", СериализацияБЗК.ЗначениеXML(ДанныеИзСервиса.lnDate, Тип("Дата")));
	ДанныеИзСервиса.Вставить("ХешЭЛН", ЗначениеXMLТипаСтрока(ДанныеИзСервиса.lnHash));
	
	ДанныеИзСервиса.Вставить("СНИЛС", УчетПособийСоциальногоСтрахованияКлиентСервер.СНИЛСВФорматеИБ(ДанныеИзСервиса.snils));
	ДанныеИзСервиса.Вставить("Фамилия",  ЗначениеXMLТипаСтрока(ДанныеИзСервиса.surname));
	ДанныеИзСервиса.Вставить("Имя",      ЗначениеXMLТипаСтрока(ДанныеИзСервиса.name));
	ДанныеИзСервиса.Вставить("Отчество", ЗначениеXMLТипаСтрока(ДанныеИзСервиса.patronymic));
	
	ДанныеИзСервиса.Вставить("ЯвляетсяПродолжениемБолезни", Не СериализацияБЗК.ЗначениеXML(ДанныеИзСервиса.primaryFlag, Тип("Булево")));
	ДанныеИзСервиса.Вставить("НомерПервичногоЛисткаНетрудоспособности", Строка(ДанныеИзСервиса.prevLnCode));
	
	ДанныеИзСервиса.Вставить("ПериодыНетрудоспособности", ПериодыНетрудоспособности);
	ДанныеИзСервиса.Вставить("ПериодыЛеченияРодственниковXML", ПериодыЛеченияРодственниковXML);
	
	СостояниеЭЛНВФСС = Перечисления.СостоянияЭЛНВФСС.НайтиПоКодуФСС(ДанныеИзСервиса.lnState);
	ДанныеИзСервиса.Вставить("СостояниеЭЛНВФСС", СостояниеЭЛНВФСС);
	
	Возврат ДанныеИзСервиса;
КонецФункции

Функция РазрешенаЗагрузкаЭЛН(СостояниеВФСС, КодПричиныНетрудоспособности, НомерЛН)
	// Не оформленные и аннулированные ЭЛН опасно загружать.
	Если Не ЗначениеЗаполнено(СостояниеВФСС)
		Или СостояниеВФСС = Перечисления.СостоянияЭЛНВФСС.Аннулирован Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Карантинные ЭЛН 65+ разрешено загружать почти в любых состояниях (для авансовых выплат за счет ФСС).
	Если КодПричиныНетрудоспособности = "03" И СтрНачинаетсяС(НомерЛН, "9990") Тогда
		Возврат Истина;
	КонецЕсли;
	
	// ЭЛН разрешено загружать только когда они закрыты медицинской организацией.
	Если СостояниеВФСС = Перечисления.СостоянияЭЛНВФСС.Закрыт
		Или СостояниеВФСС = Перечисления.СостоянияЭЛНВФСС.НаправленНаМСЭ
		Или СостояниеВФСС = Перечисления.СостоянияЭЛНВФСС.ДополненДаннымиМСЭ Тогда
		Возврат Истина;
	КонецЕсли;
	
	// ЭЛН 2.0 действует сразу для всех мест работы - и по основному месту работы и по совместительству.
	Если СостояниеВФСС = Перечисления.СостоянияЭЛНВФСС.ПринятРеестрЭЛН
		Или СостояниеВФСС = Перечисления.СостоянияЭЛНВФСС.ПринятРеестрПВСО
		Или СостояниеВФСС = Перечисления.СостоянияЭЛНВФСС.ВыплаченФСС Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Открытые ЭЛН загружать не следует.
	Возврат Ложь;
КонецФункции

Процедура ЗагрузитьРезультатПолученияЭЛН(Документ, ДанныеИзСервиса, ИсходныйXML, Отказ)
	ПроверитьВозможностьЗагрузкиЭЛН(Документ, ДанныеИзСервиса, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// Перед записью хеша необходимо определить организацию и физлицо.
	ЗаполнитьСотрудникаПоСНИЛС(Документ, ДанныеИзСервиса, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	РегистрыСведений.СведенияОбЭЛН.ЗаписатьПервичныеСведения(
		ДанныеИзСервиса.НомерЛН,
		ДанныеИзСервиса.ХешЭЛН,
		ДанныеИзСервиса.СостояниеЭЛНВФСС,
		Документ.Организация,
		Документ.ФизическоеЛицо,
		ИсходныйXML);
	ЗаполнитьПоПервичномуБольничномуЛисту(Документ, ДанныеИзСервиса);
	ЗаполнитьДанныеЭЛН(Документ, ДанныеИзСервиса);
	ПроверитьФИОСотрудника(Документ, ДанныеИзСервиса);
КонецПроцедуры

Процедура ПроверитьВозможностьЗагрузкиЭЛН(Документ, ДанныеИзСервиса, Отказ) Экспорт
	// Проверка состояния.
	Если Не ЗначениеЗаполнено(ДанныеИзСервиса.СостояниеЭЛНВФСС) Тогда
		ТекстОшибки = НСтр("ru = 'Файл не соответствует спецификации: В поле ""%1"" недокументированное значение: ""%2"".';
							|en = 'File does not match the specification: Field ""%1"" contains undocumented value : ""%2"".'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, "lnState", ДанныеИзСервиса.lnState);
		СообщенияБЗККлиентСервер.СообщитьОбОшибкеВФорме(Отказ, ТекстОшибки);
	ИначеЕсли Не РазрешенаЗагрузкаЭЛН(ДанныеИзСервиса.СостояниеЭЛНВФСС, ДанныеИзСервиса.reason1, ДанныеИзСервиса.НомерЛН) Тогда
		ТекстОшибки = НСтр("ru = 'Листок нетрудоспособности не может быть загружен, его состояние: ""%1"".';
							|en = 'Sick leave record cannot be imported, its state: ""%1"".'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ДанныеИзСервиса.СостояниеЭЛНВФСС);
		СообщенияБЗККлиентСервер.СообщитьОбОшибкеВФорме(Отказ, ТекстОшибки);
	КонецЕсли;
	
	// Проверка соответствия номера ЛН в больничном с номером ЭЛН.
	Если ЗначениеЗаполнено(Документ.НомерЛисткаНетрудоспособности) Тогда
		Если СтрСравнить(Документ.НомерЛисткаНетрудоспособности, ДанныеИзСервиса.НомерЛН) <> 0 Тогда
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Номер листка нетрудоспособности в больничном (%1) не совпадает с номером ЭЛН (%2).';
					|en = 'Sick leave record number in the sick leave (%1) does not match the ESLR number (%2).'"),
				Документ.НомерЛисткаНетрудоспособности,
				ДанныеИзСервиса.НомерЛН);
			СообщенияБЗККлиентСервер.СообщитьОбОшибкеВФорме(Отказ, ТекстОшибки, "НомерЛисткаНетрудоспособности");
		КонецЕсли;
	КонецЕсли;
	
	// Если в документе заполнен сотрудник, то необходимо только проверить соответствие СНИЛСов.
	Если ЗначениеЗаполнено(Документ.Сотрудник) Тогда
		Документ.ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Сотрудник, "ФизическоеЛицо");
		СНИЛСВДокументе = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.ФизическоеЛицо, "СтраховойНомерПФР");
		Если ЗначениеЗаполнено(СНИЛСВДокументе) Тогда
			Если СтрСравнить(ДанныеИзСервиса.СНИЛС, СНИЛСВДокументе) <> 0 Тогда
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'СНИЛС сотрудника ""%1"" в больничном (%2) не соответствует СНИЛСу в ЭЛН (%3).';
						|en = 'Employee ""%1"" IIAN in the sick leave (%2) does not match the IIAN in ESLR (%3).'"),
					Строка(Документ.Сотрудник),
					СНИЛСВДокументе,
					ДанныеИзСервиса.СНИЛС);
				СообщенияБЗККлиентСервер.СообщитьОбОшибкеВФорме(Отказ, ТекстОшибки, "Сотрудник");
			КонецЕсли;
		Иначе
			РезультатПоиска = ФизическиеЛицаЗарплатаКадры.ФизическоеЛицоПоСНИЛСИлиФИО(ДанныеИзСервиса.СНИЛС, "", "", "");
			ФизическоеЛицо  = РезультатПоиска.ФизическоеЛицо;
			Если ЗначениеЗаполнено(ФизическоеЛицо) И Документ.ФизическоеЛицо <> ФизическоеЛицо Тогда
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'В документе выбран сотрудник ""%1"" с пустым СНИЛС, а по СНИЛСу в ЭЛН (%2) найден сотрудник ""%3"".';
						|en = 'The document contains the employee ""%1"" with a blank IIAN, and the employee ""%3"" is found by IIAN in ESLR (%2).'"),
					Документ.ФизическоеЛицо,
					ДанныеИзСервиса.СНИЛС,
					ФизическоеЛицо);
				СообщенияБЗККлиентСервер.СообщитьОбОшибкеВФорме(Отказ, ТекстОшибки, "Сотрудник");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоПервичномуБольничномуЛисту(Документ, ДанныеИзСервиса) Экспорт
	
	Документ.НомерПервичногоЛисткаНетрудоспособности = ДанныеИзСервиса.НомерПервичногоЛисткаНетрудоспособности;
	Документ.ЯвляетсяПродолжениемБолезни             = ДанныеИзСервиса.ЯвляетсяПродолжениемБолезни;
	Документ.ЗаполнитьПоПервичномуБольничномуЛисту(Неопределено);
	
КонецПроцедуры

Процедура ЗаполнитьСотрудникаПоСНИЛС(Документ, ДанныеИзСервиса, Отказ)
	// В документе не заполнен сотрудник и это первичный больничный лист.
	Если ЗначениеЗаполнено(Документ.Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	// В качестве даты начала события (нетрудоспособности) можно взять дату ЭЛН.
	Если ЗначениеЗаполнено(ДанныеИзСервиса.ДатаЛН) Тогда
		ДатаНачала = ДанныеИзСервиса.ДатаЛН;
	Иначе
		ДатаНачала = Документ.Дата;
	КонецЕсли;
	
	РезультатПоиска = НайтиСотрудникаПоСНИЛС(
		Документ.Организация,
		ДатаНачала,
		ДанныеИзСервиса.СНИЛС,
		ДанныеИзСервиса.Фамилия,
		ДанныеИзСервиса.Имя,
		ДанныеИзСервиса.Отчество);
	
	Если РезультатПоиска.Успех Тогда
		ЗаполнитьЗначенияСвойств(Документ, РезультатПоиска, "Сотрудник, ФизическоеЛицо, Организация, ГоловнаяОрганизация");
	Иначе
		Отказ = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(РезультатПоиска.ТекстОшибки) Тогда
		ОбщегоНазначения.СообщитьПользователю(РезультатПоиска.ТекстОшибки);
	КонецЕсли;
КонецПроцедуры

Функция НайтиСотрудникаПоСНИЛС(Организация, ДатаНачалаСобытия, СНИЛС, Фамилия = "", Имя = "", Отчество = "")
	Результат = Новый Структура("Успех, ТекстОшибки, ФизическоеЛицо, Сотрудник, Организация, ГоловнаяОрганизация");
	Результат.Успех = Ложь;
	Результат.ТекстОшибки = "";
	
	// 1. Поиск физического лица по СНИЛСу.
	РезультатПоиска = ФизическиеЛицаЗарплатаКадры.ФизическоеЛицоПоСНИЛСИлиФИО(СНИЛС, Фамилия, Имя, Отчество);
	ЗаполнитьЗначенияСвойств(Результат, РезультатПоиска, "ФизическоеЛицо, ТекстОшибки");
	Если Не ЗначениеЗаполнено(Результат.ФизическоеЛицо) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// 2. Поиск сотрудников организаций по физическому лицу.
	ПриПоискеСотрудникаОрганизации(Результат, Организация, ДатаНачалаСобытия);
	
	Возврат Результат;
КонецФункции

Процедура ПриПоискеСотрудникаОрганизации(Результат, ПредполагаемаяОрганизация, ДатаНачалаСобытия)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// 255-ФЗ, Глава 2, Статья 5, абзац 2.
	// Работодатель обязан оплатить больничный лист бывшему работнику, если соблюдены 2 условия:
	// - Период временной нетрудоспособности наступил в течение 30 дней после увольнения;
	// - Бывший работник предоставил больничный лист работодателю в течение полугода после увольнения.
	НачалоПериода = ДобавитьМесяц(ДатаНачалаСобытия, -6);
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.СписокФизическихЛиц = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Результат.ФизическоеЛицо);
	ПараметрыПолученияСотрудников.НачалоПериода       = НачалоПериода;
	ПараметрыПолученияСотрудников.ОкончаниеПериода    = ДатаНачалаСобытия;
	ПараметрыПолученияСотрудников.КадровыеДанные      = "ГоловнаяОрганизация, Организация, ДатаУвольнения, ВидЗанятости";
	УстановитьПривилегированныйРежим(Истина);
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Ложь, ПараметрыПолученияСотрудников);
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СотрудникиОрганизации.ДатаУвольнения = &ПустаяДата
	|				ТОГДА &МаксимальнаяДата
	|			ИНАЧЕ СотрудникиОрганизации.ДатаУвольнения
	|		КОНЕЦ) КАК ДатаУвольнения,
	|	СотрудникиОрганизации.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СотрудникиОрганизации.Организация КАК Организация,
	|	СотрудникиОрганизации.ВидЗанятости КАК ВидЗанятости
	|ПОМЕСТИТЬ ВТДатыУвольненияИзОрганизаций
	|ИЗ
	|	ВТСотрудникиОрганизации КАК СотрудникиОрганизации
	|ГДЕ
	|	(СотрудникиОрганизации.ДатаУвольнения = &ПустаяДата
	|			ИЛИ СотрудникиОрганизации.ДатаУвольнения >= &НачалоПериода)
	|	И (СотрудникиОрганизации.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы)
	|			ИЛИ СотрудникиОрганизации.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство))
	|
	|СГРУППИРОВАТЬ ПО
	|	СотрудникиОрганизации.ГоловнаяОрганизация,
	|	СотрудникиОрганизации.Организация,
	|	СотрудникиОрганизации.ВидЗанятости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыУвольненияИзОрганизаций.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДатыУвольненияИзОрганизаций.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ДатыУвольненияИзОрганизаций.Организация В (&ДоступныеФилиалы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьПравоПросмотраОрганизации,
	|	ВЫБОР
	|		КОГДА ДатыУвольненияИзОрганизаций.ДатаУвольнения >= &ДатаНачалаСобытия
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Работает,
	|	ДатыУвольненияИзОрганизаций.ДатаУвольнения КАК ДатаУвольнения,
	|	СотрудникиОрганизации.Сотрудник КАК Сотрудник
	|ИЗ
	|	ВТДатыУвольненияИзОрганизаций КАК ДатыУвольненияИзОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизации КАК СотрудникиОрганизации
	|		ПО ДатыУвольненияИзОрганизаций.Организация = СотрудникиОрганизации.Организация
	|			И ДатыУвольненияИзОрганизаций.ВидЗанятости = СотрудникиОрганизации.ВидЗанятости
	|			И (ВЫБОР
	|				КОГДА СотрудникиОрганизации.ДатаУвольнения = &ПустаяДата
	|					ТОГДА &МаксимальнаяДата
	|				ИНАЧЕ СотрудникиОрганизации.ДатаУвольнения
	|			КОНЕЦ = ДатыУвольненияИзОрганизаций.ДатаУвольнения)";
	
	Запрос.УстановитьПараметр("НачалоПериода",     НачалоПериода);
	Запрос.УстановитьПараметр("ДатаНачалаСобытия", ДатаНачалаСобытия);
	Запрос.УстановитьПараметр("ПустаяДата",        '00010101');
	Запрос.УстановитьПараметр("МаксимальнаяДата",  '39991231235959');
	
	ДоступныеФилиалы = ЗарплатаКадры.ДоступныеОрганизации().Филиалы;
	Если ДоступныеФилиалы = Неопределено Тогда
		// Полные права.
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДатыУвольненияИзОрганизаций.Организация В (&ДоступныеФилиалы)", "ИСТИНА");
	Иначе
		// Не полные права.
		Запрос.УстановитьПараметр("ДоступныеФилиалы", ДоступныеФилиалы);
	КонецЕсли;
	
	ВсеОрганизации = Запрос.Выполнить().Выгрузить();
	Если ВсеОрганизации.Найти(Истина, "Работает") <> Неопределено
		И ВсеОрганизации.Найти(Ложь, "Работает") <> Неопределено Тогда
		ПодходящиеОрганизации = ВсеОрганизации.Скопировать(Новый Структура("Работает", Истина));
	Иначе
		ПодходящиеОрганизации = ВсеОрганизации;
	КонецЕсли;
	
	КоличествоПодходящих = ПодходящиеОрганизации.Количество();
	Если КоличествоПодходящих = 0 Тогда
		Результат.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сотрудник ""%1"" на %2 не принят на работу.';
				|en = 'Employee ""%1"" is not hired as of ""%2"".'"),
			Результат.ФизическоеЛицо,
			Формат(ДатаНачалаСобытия, "ДЛФ=D"));
		Возврат;
	КонецЕсли;
	
	Если КоличествоПодходящих = 1 Тогда
		НайденнаяСтрока = ПодходящиеОрганизации[0];
	Иначе
		Если ЗначениеЗаполнено(ПредполагаемаяОрганизация) Тогда
			НайденнаяСтрока = ПодходящиеОрганизации.Найти(ПредполагаемаяОрганизация, "Организация");
		Иначе
			НайденнаяСтрока = Неопределено;
		КонецЕсли;
		Если НайденнаяСтрока = Неопределено Тогда
			ПредставлениеОрганизаций = ПодходящиеОрганизации.ВыгрузитьКолонку("Организация");
			Если ДоступныеФилиалы <> Неопределено Тогда
				// Не полные права.
				ВГраница = ПредставлениеОрганизаций.ВГраница();
				Для Индекс = 0 По ВГраница Цикл
					Если ДоступныеФилиалы.Найти(ПредставлениеОрганизаций[Индекс]) = Неопределено Тогда
						ПредставлениеОрганизаций[Индекс] = НСтр("ru = '<Недостаточно прав>';
																|en = '<Insufficient rights>'");
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Результат.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Требуется выбрать организацию, т.к. сотрудник ""%1"" на %2 работает в нескольких организациях: %3.';
					|en = 'Select a company as employee ""%1"" works for several companies (%3) as of ""%2"".'"),
				Результат.ФизическоеЛицо,
				Формат(ДатаНачалаСобытия, "ДЛФ=D"),
				СтрСоединить(ПредставлениеОрганизаций, ", "));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Не НайденнаяСтрока.ЕстьПравоПросмотраОрганизации Тогда
		Результат.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недостаточно прав для загрузки ЭЛН сотрудника ""%1"" организации ""%2"".';
				|en = 'Insufficient rights to import ESLR of employee ""%1"" in company ""%2"".'"),
			Результат.ФизическоеЛицо,
			НайденнаяСтрока.Организация);
		Возврат;
	КонецЕсли;
	
	Результат.Успех               = Истина;
	Результат.ГоловнаяОрганизация = НайденнаяСтрока.ГоловнаяОрганизация;
	Результат.Организация         = НайденнаяСтрока.Организация;
	Результат.Сотрудник           = НайденнаяСтрока.Сотрудник;
КонецПроцедуры

Процедура ЗаполнитьДанныеЭЛН(Документ, ДанныеИзСервиса)
	
	Документ.НомерЛисткаНетрудоспособности = ДанныеИзСервиса.НомерЛН;
	
	СоответствиеПолей = СоответствиеПолейЭЛН();
	Для Каждого СвойствоДокумента Из СоответствиеПолей Цикл
		Документ[СвойствоДокумента.Ключ] = СериализацияБЗК.ЗначениеXML(ДанныеИзСервиса[СвойствоДокумента.Значение], ТипЗнч(Документ[СвойствоДокумента.Ключ]));
	КонецЦикла;
	
	Если ДанныеИзСервиса.lnResult <> Неопределено Тогда
		Значения = Новый Структура("mseResult, otherStateDt, returnDateLpu, nextLnCode");
		ЗаполнитьЗначенияСвойств(Значения, ДанныеИзСервиса.lnResult);
		ЗаполнитьЗначениеИзСтрокиXML(Документ.НовыйСтатусНетрудоспособного,     Значения.mseResult,     Тип("Строка"));
		ЗаполнитьЗначениеИзСтрокиXML(Документ.ДатаНовыйСтатусНетрудоспособного, Значения.otherStateDt,  Тип("Дата"));
		ЗаполнитьЗначениеИзСтрокиXML(Документ.ПриступитьКРаботеС,               Значения.returnDateLpu, Тип("Дата"));
		ЗаполнитьЗначениеИзСтрокиXML(Документ.НомерЛисткаПродолжения,           Значения.nextLnCode,    Тип("Строка"));
	КонецЕсли;
	
	Если ДанныеИзСервиса.hospitalBreach <> Неопределено Тогда
		Значения = Новый Структура("hospitalBreachCode, hospitalBreachDt");
		ЗаполнитьЗначенияСвойств(Значения, ДанныеИзСервиса.hospitalBreach);
		ЗаполнитьЗначениеИзСтрокиXML(Документ.КодНарушенияРежима,  Значения.hospitalBreachCode, Тип("Строка"));
		ЗаполнитьЗначениеИзСтрокиXML(Документ.ДатаНарушенияРежима, Значения.hospitalBreachDt,   Тип("Дата"));
	КонецЕсли;
	
	// Анализ периодов ухода за родственниками.
	ЗаполнитьРеквизитыШапкиПоУходу(Документ, ДанныеИзСервиса);
	Документы.БольничныйЛист.ЗаполнитьТаблицуУходаЗаРодственниками(Документ, ДанныеИзСервиса);
	
	// Заполнение периодов нетрудоспособности.
	Номер = 0;
	Для Каждого ЭлементПериода Из ДанныеИзСервиса.ПериодыНетрудоспособности Цикл
		СвойстваПериода = Новый Структура("treatChairman, treatChairmanRole, treatPeriod");
		ЗаполнитьЗначенияСвойств(СвойстваПериода, ЭлементПериода);
		Если СвойстваПериода.treatPeriod = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Номер = Номер + 1;
		
		ПодробностиПериода = Новый Структура("treatDt1, treatDt2, treatDoctorRole, treatDoctor");
		ЗаполнитьЗначенияСвойств(ПодробностиПериода, СвойстваПериода.treatPeriod);
		
		Документ["ОсвобождениеДатаНачала" + Номер]     = СериализацияБЗК.ЗначениеXML(ПодробностиПериода.treatDt1, Тип("Дата"));
		Документ["ОсвобождениеДатаОкончания" + Номер]  = СериализацияБЗК.ЗначениеXML(ПодробностиПериода.treatDt2, Тип("Дата"));
		Документ["ОсвобождениеФИОВрача" + Номер]       = ПодробностиПериода.treatDoctor;
		Документ["ОсвобождениеДолжностьВрача" + Номер] = ПодробностиПериода.treatDoctorRole;
		Документ["ОсвобождениеФИОВрачаПредседателяВК" + Номер]       = СвойстваПериода.treatChairman;
		Документ["ОсвобождениеДолжностьВрачаПредседателяВК" + Номер] = СвойстваПериода.treatChairmanRole;
		
		Если Номер = 3 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Очистка отсутствующих периодов нетрудоспособности.
	Пока Номер < 2 Цикл
		Номер = Номер + 1;
		Документ["ОсвобождениеДатаНачала" + Номер]                   = '00010101';
		Документ["ОсвобождениеДатаОкончания" + Номер]                = '00010101';
		Документ["ОсвобождениеФИОВрача" + Номер]                     = "";
		Документ["ОсвобождениеДолжностьВрача" + Номер]               = "";
		Документ["ОсвобождениеФИОВрачаПредседателяВК" + Номер]       = "";
		Документ["ОсвобождениеДолжностьВрачаПредседателяВК" + Номер] = "";
	КонецЦикла;
	
	ЗаполнитьФлагПостановкиНаУчетВРанниеСрокиБеременности(Документ, ДанныеИзСервиса);
	
	ЗаполнитьМедицинскуюОрганизацию(Документ);
	
	ЗаполнитьПериодНетрудоспособности(Документ);
	
	ЗаполнитьПричинуНетрудоспособностиИСлучайУходаЗаРебенком(Документ);
	
	Документы.БольничныйЛист.ПослеЗагрузкиЭЛН(Документ, ДанныеИзСервиса);
	
КонецПроцедуры

// Заполнение реквизитов шапки больничного по уходу за родственниками.
Процедура ЗаполнитьРеквизитыШапкиПоУходу(Больничный, ДанныеЭЛН) Экспорт
	ЗаполнитьДатыУходаЗаРодственниками(Больничный, ДанныеЭЛН);
	ДатыУхода = ДанныеЭЛН.ДатыУхода;
	
	// Очистка периодов ухода за родственниками в документе.
	РеквизитыШапки = Новый Структура;
	Для Номер = 1 По 2 Цикл
		РеквизитыШапки.Вставить("ПоУходуВозрастЛет"        + Номер, 0);
		РеквизитыШапки.Вставить("ПоУходуВозрастМесяцев"    + Номер, 0);
		РеквизитыШапки.Вставить("ПоУходуРодственнаяСвязь"  + Номер, "");
		РеквизитыШапки.Вставить("ПоУходуФИО"               + Номер, "");
		// Следующие поля есть только в расширенной реализации.
		РеквизитыШапки.Вставить("ДатаНачалаРодственник"    + Номер, '00010101');
		РеквизитыШапки.Вставить("ДатаОкончанияРодственник" + Номер, '00010101');
		РеквизитыШапки.Вставить("РодственникЗаКоторымОсуществляетсяУход" + Номер, Неопределено);
	КонецЦикла;
	
	Если ДатыУхода.Количество() > 0 Тогда
		
		// Заполнение периода нахождения в стационаре.
		Если Не ЗначениеЗаполнено(Больничный.ПериодНахожденияВСтационареСРебенкомС)
			И Не ЗначениеЗаполнено(Больничный.ПериодНахожденияВСтационареСРебенкомПо) Тогда
			ДатыСтационара = ДатыУхода.Скопировать(Новый Структура("ЭтоСтационар", Истина));
			Если ДатыСтационара.Количество() > 0 Тогда
				ДатыСтационара.Сортировать("Дата");
				Больничный.ПериодНахожденияВСтационареСРебенкомС  = ДатыСтационара[0].Дата;
				Больничный.ПериодНахожденияВСтационареСРебенкомПо = ДатыСтационара[ДатыСтационара.Количество() - 1].Дата;
			КонецЕсли;
		КонецЕсли;
		
		// Заполнение полей шапки по уходу за родственниками.
		Измерения = "Родственник";
		Ресурсы   = "";
		Реквизиты = "";
		ПериодыУхода = ОбщегоНазначенияБЗК.ТаблицаПериодовИзТаблицыДат(ДатыУхода, Измерения, Ресурсы, Реквизиты, Истина);
		Для Номер = 1 По Мин(ПериодыУхода.Количество(), 2) Цикл
			ПериодУхода = ПериодыУхода[Номер-1];
			Родственник = ПериодУхода.Родственник;
			РеквизитыШапки["ПоУходуВозрастЛет"        + Номер] = Родственник.ВозрастЛет;
			РеквизитыШапки["ПоУходуВозрастМесяцев"    + Номер] = Родственник.ВозрастМесяцев;
			РеквизитыШапки["ПоУходуРодственнаяСвязь"  + Номер] = Родственник.КодСвязи;
			РеквизитыШапки["ПоУходуФИО"               + Номер] = Родственник.ФИО;
			РеквизитыШапки["ДатаНачалаРодственник"    + Номер] = ПериодУхода.ДатаНачала;
			РеквизитыШапки["ДатаОкончанияРодственник" + Номер] = ПериодУхода.ДатаОкончания;
			РеквизитыШапки["РодственникЗаКоторымОсуществляетсяУход" + Номер] = Родственник.Ссылка;
		КонецЦикла;
		
	КонецЕсли;
	
	// Заполнение реквизитов ухода в шапке документа.
	// Имена полей не указываются, т.к. часть полей есть только в расширенной реализации.
	ЗаполнитьЗначенияСвойств(Больничный, РеквизитыШапки);
	
	// Дозаполнение кода причины нетрудоспособности в шапке из таблицы периодов ухода.
	КодыПричин = КоллекцииБЗК.УникальныеЗначенияКолонки(ДатыУхода, "КодПричины");
	КоллекцииБЗК.УдалитьПустыеЗначенияМассива(КодыПричин);
	Если Не ЗначениеЗаполнено(Больничный.КодПричиныНетрудоспособности) Тогда
		Если КодыПричин.Количество() > 0 Тогда
			Больничный.КодПричиныНетрудоспособности = КодыПричин[0];
		Иначе
			ТекстОшибки = НСтр("ru = 'В ЭЛН не указана причина нетрудоспособности. Требуется выбрать вручную.';
								|en = 'ESLR does not contain the reason for incapacity for work. Please, select it manually.'");
			СообщенияБЗК.СообщитьОПроблеме(ТекстОшибки, , "ПричинаНетрудоспособности");
		КонецЕсли;
	Иначе
		ОбщегоНазначенияБЗК.ДобавитьЗначениеВМассив(КодыПричин, Больничный.КодПричиныНетрудоспособности);
	КонецЕсли;
	
	// Проверка количества различных кодов причин нетрудоспособности.
	Если КодыПричин.Количество() > 1 Тогда
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'В ЭЛН несколько причин нетрудоспособности: %1.';
				|en = 'ESLR contains several reasons for incapacity for work: %1.'"),
			СтрСоединить(КодыПричин, ", "));
		СообщенияБЗК.СообщитьОПроблеме(ТекстОшибки, , "ПричинаНетрудоспособности");
	КонецЕсли;
	
КонецПроцедуры

Функция ПериодыЛеченияРодственников(ДанныеЭЛН) Экспорт
	Если ДанныеЭЛН.Свойство("ПериодыЛеченияРодственников") Тогда
		Возврат ДанныеЭЛН.ПериодыЛеченияРодственников;
	КонецЕсли;
	
	Результат = СоздатьТаблицуПериодовЛеченияРодственников(ДанныеЭЛН);
	
	ИменаПолей = "servAge, servMm, servRelationCode, servDt1, servDt2, treatmentType, surname, name, patronymic, birthday, reason1, snils";
	ПоискРодственников = Новый Соответствие;
	Для Каждого УходЗаРодственником Из ДанныеЭЛН.ПериодыЛеченияРодственниковXML Цикл
		// Чтение первичных значений из XML.
		ЗначенияПолей = Новый Структура(ИменаПолей);
		ЗаполнитьЗначенияСвойств(ЗначенияПолей, УходЗаРодственником);
		
		СтрокаТаблицы = Результат.Добавить();
		СтрокаТаблицы.ДатаНачала     = СериализацияБЗК.ЗначениеXML(ЗначенияПолей.servDt1,  Тип("Дата"));
		СтрокаТаблицы.ДатаОкончания  = СериализацияБЗК.ЗначениеXML(ЗначенияПолей.servDt2,  Тип("Дата"));
		СтрокаТаблицы.ДатаРождения   = СериализацияБЗК.ЗначениеXML(ЗначенияПолей.birthday, Тип("Дата"));
		СтрокаТаблицы.ВозрастЛет     = СериализацияБЗК.ЗначениеXML(ЗначенияПолей.servAge,  Тип("Число"));
		СтрокаТаблицы.ВозрастМесяцев = СериализацияБЗК.ЗначениеXML(ЗначенияПолей.servMm,   Тип("Число"));
		СтрокаТаблицы.КодПричины     = ЗначениеXMLТипаСтрока(ЗначенияПолей.reason1);
		СтрокаТаблицы.ТипЛечения     = ЗначениеXMLТипаСтрока(ЗначенияПолей.treatmentType);
		СтрокаТаблицы.КодСвязи       = ЗначениеXMLТипаСтрока(ЗначенияПолей.servRelationCode);
		СтрокаТаблицы.СНИЛС          = УчетПособийСоциальногоСтрахованияКлиентСервер.СНИЛСВФорматеИБ(ЗначениеXMLТипаСтрока(ЗначенияПолей.snils));
		СтрокаТаблицы.Фамилия        = ТРег(ЗначениеXMLТипаСтрока(ЗначенияПолей.surname));
		СтрокаТаблицы.Имя            = ТРег(ЗначениеXMLТипаСтрока(ЗначенияПолей.name));
		СтрокаТаблицы.Отчество       = ТРег(ЗначениеXMLТипаСтрока(ЗначенияПолей.patronymic));
		СтрокаТаблицы.ФИО            = СокрП(СтрокаТаблицы.Фамилия + " " + СтрокаТаблицы.Имя + " " + СтрокаТаблицы.Отчество);
		СтрокаТаблицы.РежимЛечения   = Перечисления.РежимыЛечения.НайтиПоКоду(СтрокаТаблицы.ТипЛечения);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция СоздатьТаблицуПериодовЛеченияРодственников(ДанныеЭЛН) Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ФИО",            Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Фамилия",        Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Имя",            Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Отчество",       Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодСвязи",       Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДатаРождения",   ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Результат.Колонки.Добавить("ВозрастЛет",     ОбщегоНазначения.ОписаниеТипаЧисло(3, 0, ДопустимыйЗнак.Неотрицательный));
	Результат.Колонки.Добавить("ВозрастМесяцев", ОбщегоНазначения.ОписаниеТипаЧисло(2, 0, ДопустимыйЗнак.Неотрицательный));
	Результат.Колонки.Добавить("СНИЛС",          Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодПричины",     Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ТипЛечения",     Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("РежимЛечения",   Новый ОписаниеТипов("ПеречислениеСсылка.РежимыЛечения"));
	Результат.Колонки.Добавить("СлучайУхода",    Новый ОписаниеТипов("ПеречислениеСсылка.СлучаиУходаЗаБольнымиДетьми"));
	Результат.Колонки.Добавить("ДатаНачала",     ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Результат.Колонки.Добавить("ДатаОкончания",  ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Результат.Колонки.Добавить("РодственникСсылка");
	
	ДанныеЭЛН.Вставить("ПериодыЛеченияРодственников", Результат);
	
	Возврат Результат;
КонецФункции

// Получение таблицы ухода за родственниками и дней стационара.
Процедура ЗаполнитьДатыУходаЗаРодственниками(Больничный, ДанныеЭЛН) Экспорт
	Если ДанныеЭЛН.Свойство("ДатыУхода") Тогда
		Возврат;
	КонецЕсли;
	
	НомерРодственника = 0;
	
	Родственники = Новый ТаблицаЗначений;
	Родственники.Колонки.Добавить("Номер",          Новый ОписаниеТипов("Число"));
	Родственники.Колонки.Добавить("Фамилия",        Новый ОписаниеТипов("Строка"));
	Родственники.Колонки.Добавить("Имя",            Новый ОписаниеТипов("Строка"));
	Родственники.Колонки.Добавить("Отчество",       Новый ОписаниеТипов("Строка"));
	Родственники.Колонки.Добавить("ФИО",            Новый ОписаниеТипов("Строка"));
	Родственники.Колонки.Добавить("ДатаРождения",   ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Родственники.Колонки.Добавить("ВозрастЛет",     ОбщегоНазначения.ОписаниеТипаЧисло(3, 0, ДопустимыйЗнак.Неотрицательный));
	Родственники.Колонки.Добавить("ВозрастМесяцев", ОбщегоНазначения.ОписаниеТипаЧисло(2, 0, ДопустимыйЗнак.Неотрицательный));
	Родственники.Колонки.Добавить("СНИЛС",          Новый ОписаниеТипов("Строка"));
	Родственники.Колонки.Добавить("КодСвязи",       Новый ОписаниеТипов("Строка"));
	Родственники.Колонки.Добавить("Ключи");
	Родственники.Колонки.Добавить("Ссылка");
	
	ДатыУхода = Новый ТаблицаЗначений;
	ДатыУхода.Колонки.Добавить("Родственник");
	ДатыУхода.Колонки.Добавить("НомерРодственника", Новый ОписаниеТипов("Число"));
	ДатыУхода.Колонки.Добавить("КодПричины",        Новый ОписаниеТипов("Строка"));
	ДатыУхода.Колонки.Добавить("РежимЛечения",      Новый ОписаниеТипов("ПеречислениеСсылка.РежимыЛечения"));
	ДатыУхода.Колонки.Добавить("СлучайУхода",       Новый ОписаниеТипов("ПеречислениеСсылка.СлучаиУходаЗаБольнымиДетьми"));
	ДатыУхода.Колонки.Добавить("ЭтоСтационар",      Новый ОписаниеТипов("Булево"));
	ДатыУхода.Колонки.Добавить("Дата",              ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ДатыУхода.Колонки.Добавить("Год",               Новый ОписаниеТипов("Число"));
	
	ПоискРодственников = Новый Соответствие;
	
	ПроверятьДатуРождения = ДанныеЭЛН.АктуальныйФормат;
	
	ПериодыЛеченияРодственников = ПериодыЛеченияРодственников(ДанныеЭЛН);
	Для Каждого ПериодЛечения Из ПериодыЛеченияРодственников Цикл
		
		// Проверка спецификации.
		Если Не ПроверитьПериодЛеченияРодственника(ПериодЛечения, ПроверятьДатуРождения) Тогда
			Продолжить;
		КонецЕсли;
		
		// Подготовка ключей для быстрого поиска родственника.
		Ключи = КлючиПоискаРодственника(ПериодЛечения);
		Если ЗначениеЗаполнено(ПериодЛечения.РодственникСсылка) Тогда
			Ключи.Вставить(0, ПериодЛечения.РодственникСсылка);
		КонецЕсли;
		
		// Поиск родственника по ключам.
		Родственник = НайтиРодственника(ПериодЛечения, ПоискРодственников, Ключи);
		
		// Регистрация нового родственника или заполнение найденного.
		Если Родственник = Неопределено Тогда
			НомерРодственника = НомерРодственника + 1;
			Родственник = Родственники.Добавить();
			Родственник.Номер          = НомерРодственника;
			Родственник.Фамилия        = ПериодЛечения.Фамилия;
			Родственник.Имя            = ПериодЛечения.Имя;
			Родственник.Отчество       = ПериодЛечения.Отчество;
			Родственник.ФИО            = ПериодЛечения.ФИО;
			Родственник.ДатаРождения   = ПериодЛечения.ДатаРождения;
			Родственник.ВозрастЛет     = ПериодЛечения.ВозрастЛет;
			Родственник.ВозрастМесяцев = ПериодЛечения.ВозрастМесяцев;
			Родственник.СНИЛС          = ПериодЛечения.СНИЛС;
			Родственник.КодСвязи       = ПериодЛечения.КодСвязи;
			Родственник.Ключи          = Ключи;
			Родственник.Ссылка         = ПериодЛечения.РодственникСсылка;
			Если ЗначениеЗаполнено(Родственник.ДатаРождения)
				И ЗначениеЗаполнено(Больничный.ДатаНачалаСобытия)
				И Не ЗначениеЗаполнено(Родственник.ВозрастЛет)
				И Не ЗначениеЗаполнено(Родственник.ВозрастМесяцев) Тогда
				РазмерПериода = ОбщегоНазначенияБЗК.РазмерПериода(Родственник.ДатаРождения, Больничный.ДатаНачалаСобытия);
				Родственник.ВозрастЛет     = РазмерПериода.Лет;
				Родственник.ВозрастМесяцев = РазмерПериода.Месяцев;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ПериодЛечения.ДатаРождения)
				И ЗначениеЗаполнено(Родственник.ДатаРождения)
				И ПериодЛечения.ДатаРождения <> Родственник.ДатаРождения Тогда
				ТекстОшибки = НСтр("ru = 'В периодах ухода за родственниками указаны две разные даты рождения %1: %2 и %3.';
									|en = 'Two different dates of birth are specified for %1 in relative care periods: %2 and %3.'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, ПериодЛечения.ФИО, Родственник.ДатаРождения, ПериодЛечения.ДатаРождения);
				СообщенияБЗК.СообщитьОПроблеме(ТекстОшибки);
				Если Родственник.ДатаРождения > ПериодЛечения.ДатаРождения Тогда
					Родственник.ДатаРождения   = ПериодЛечения.ДатаРождения;
					Родственник.ВозрастЛет     = ПериодЛечения.ВозрастЛет;
					Родственник.ВозрастМесяцев = ПериодЛечения.ВозрастМесяцев;
				КонецЕсли;
			Иначе
				Если Не ЗначениеЗаполнено(Родственник.ВозрастЛет) И Не ЗначениеЗаполнено(Родственник.ВозрастМесяцев) Тогда
					Родственник.ВозрастЛет     = ПериодЛечения.ВозрастЛет;
					Родственник.ВозрастМесяцев = ПериодЛечения.ВозрастМесяцев;
				КонецЕсли;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Родственник.КодСвязи) Тогда
				Родственник.КодСвязи = ПериодЛечения.КодСвязи;
			ИначеЕсли ЗначениеЗаполнено(ПериодЛечения.КодСвязи) И Родственник.КодСвязи <> ПериодЛечения.КодСвязи Тогда
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'В ЭЛН %1 по уходу за %2 указаны разные родственные связи: %3 и %4.';
						|en = 'Different relationships are specified in ESLR %1 where %2 needs to be cared for: %3 and %4.'"),
					Больничный.НомерЛисткаНетрудоспособности,
					ПериодЛечения.ФИО,
					Родственник.КодСвязи,
					ПериодЛечения.КодСвязи);
				СообщенияБЗК.СообщитьОПроблеме(ТекстОшибки);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Родственник.СНИЛС) Тогда
				Родственник.СНИЛС = ПериодЛечения.СНИЛС;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Родственник.Отчество) Тогда
				Родственник.Фамилия  = ПериодЛечения.Фамилия;
				Родственник.Имя      = ПериодЛечения.Имя;
				Родственник.Отчество = ПериодЛечения.Отчество;
				Родственник.ФИО      = ПериодЛечения.ФИО;
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Родственник.Ключи, Ключи, Истина);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Родственник.Ссылка) Тогда
				Родственник.Ссылка = ПериодЛечения.РодственникСсылка;
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Родственник.Ключи, Ключи, Истина);
			КонецЕсли;
		КонецЕсли;
		
		// Когда родственник определен, то он попадает в соответствие для быстрого поиска.
		Для Каждого Ключ Из Ключи Цикл
			ПоискРодственников.Вставить(Ключ, Родственник);
		КонецЦикла;
		
		// Определение случая ухода.
		СлучайУхода = ПериодЛечения.СлучайУхода;
		Если Не ЗначениеЗаполнено(СлучайУхода) Тогда
			СлучайУхода = УчетПособийСоциальногоСтрахования.СлучайУхода(
				Больничный.ДатаНачалаСобытия,
				ПериодЛечения.КодПричины,
				Родственник.ВозрастЛет,
				ПериодЛечения.РежимЛечения);
		КонецЕсли;
		
		// Регистрация дней ухода.
		ДниУхода = ОбщегоНазначенияБЗК.МассивДатИзПериода(ПериодЛечения.ДатаНачала, ПериодЛечения.ДатаОкончания);
		Стационар = (ПериодЛечения.РежимЛечения = Перечисления.РежимыЛечения.Стационар
			Или ПериодЛечения.РежимЛечения = Перечисления.РежимыЛечения.ДневнойСтационар);
		Для Каждого Дата Из ДниУхода Цикл
			СтрокаТаблицы = ДатыУхода.Добавить();
			СтрокаТаблицы.Родственник       = Родственник;
			СтрокаТаблицы.НомерРодственника = НомерРодственника;
			СтрокаТаблицы.КодПричины        = ПериодЛечения.КодПричины;
			СтрокаТаблицы.РежимЛечения      = ПериодЛечения.РежимЛечения;
			СтрокаТаблицы.ЭтоСтационар      = Стационар;
			СтрокаТаблицы.Дата              = Дата;
			СтрокаТаблицы.Год               = Год(Дата);
			СтрокаТаблицы.СлучайУхода       = СлучайУхода;
		КонецЦикла;
	КонецЦикла;
	
	Документы.БольничныйЛист.ПриЗаполненииСсылокРодственников(Больничный, Родственники);
	
	ДанныеЭЛН.Вставить("ДатыУхода", ДатыУхода);
	ДанныеЭЛН.Вставить("Родственники", Родственники);
	ДанныеЭЛН.Вставить("ПоискРодственников", ПоискРодственников);
КонецПроцедуры

// Проверяет период лечения на соответствие спецификации ФСС.
Функция ПроверитьПериодЛеченияРодственника(ПериодЛечения, ПроверятьДатуРождения)
	Если Не ЗначениеЗаполнено(ПериодЛечения.ФИО) Тогда
		ТекстОшибки = НСтр("ru = 'В периодах ухода за родственниками не заполнено ФИО родственника.';
							|en = 'In relative care periods, the relative''s full name is not filled in.'");
		СообщенияБЗК.СообщитьОПроблеме(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	ТекстОшибки = ПроверкиБЗККлиентСервер.ТекстОшибкиЗаполненияПериода(ПериодЛечения.ДатаНачала, ПериодЛечения.ДатаОкончания);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ЗаголовокПериодаВРодительномПадеже = СтрШаблон(НСтр("ru = 'ухода за %1';
															|en = 'care for %1'"), ПериодЛечения.ФИО);
		ТекстОшибки = СтрШаблон(ТекстОшибки, ЗаголовокПериодаВРодительномПадеже);
		СообщенияБЗК.СообщитьОПроблеме(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	Если ПроверятьДатуРождения И Не ЗначениеЗаполнено(ПериодЛечения.ДатаРождения) Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'В периодах ухода за родственниками не заполнена дата рождения %1.';
									|en = 'Date of birth is not filled in for %1 in relative care periods.'"), ПериодЛечения.ФИО);
		СообщенияБЗК.СообщитьОПроблеме(ТекстОшибки);
		Возврат Истина;
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция КлючиПоискаРодственника(Родственник) Экспорт
	Ключи = Новый Массив;
	
	// Подготовка локальных переменных.
	ФИОДляПоиска = ФизическиеЛицаЗарплатаКадры.НаименованиеСлужебное(Родственник.ФИО);
	Если ЗначениеЗаполнено(Родственник.ДатаРождения) Тогда
		ДатаРожденияСтрокой = Формат(Родственник.ДатаРождения, "ДЛФ=D");
	Иначе
		ДатаРожденияСтрокой = "";
	КонецЕсли;
	ФамилияИмя = СокрП(Родственник.Фамилия + " " + Родственник.Имя);
	ФамилияИмяДляПоиска = ФизическиеЛицаЗарплатаКадры.НаименованиеСлужебное(ФамилияИмя);
	
	// СНИЛС - самый приоритетный ключ поиска.
	Если ЗначениеЗаполнено(Родственник.СНИЛС) Тогда
		Ключи.Добавить(Родственник.СНИЛС);
	КонецЕсли;
	
	// Добавление ключей поиска по ФИО в сочетании с кодом связи и датой рождения.
	Если ЗначениеЗаполнено(ФИОДляПоиска) Тогда
		Если ЗначениеЗаполнено(ДатаРожденияСтрокой) Тогда
			Если ЗначениеЗаполнено(Родственник.КодСвязи) Тогда
				Ключи.Добавить(ФИОДляПоиска + Родственник.КодСвязи + ДатаРожденияСтрокой);
			КонецЕсли;
			Ключи.Добавить(ФИОДляПоиска + ДатаРожденияСтрокой);
		КонецЕсли;
		Если ЗначениеЗаполнено(Родственник.КодСвязи) Тогда
			Ключи.Добавить(ФИОДляПоиска + Родственник.КодСвязи);
		КонецЕсли;
		Ключи.Добавить(ФИОДляПоиска);
	КонецЕсли;
	
	// Аналогичным образом добавляюстя ключи поиска по Фамилия + Имя без отчества.
	Если ЗначениеЗаполнено(ФамилияИмяДляПоиска) И ФамилияИмяДляПоиска <> ФИОДляПоиска Тогда
		Если ЗначениеЗаполнено(ДатаРожденияСтрокой) Тогда
			Если ЗначениеЗаполнено(Родственник.КодСвязи) Тогда
				Ключи.Добавить(ФамилияИмяДляПоиска + Родственник.КодСвязи + ДатаРожденияСтрокой);
			КонецЕсли;
			Ключи.Добавить(ФамилияИмяДляПоиска + ДатаРожденияСтрокой);
		КонецЕсли;
		Если ЗначениеЗаполнено(Родственник.КодСвязи) Тогда
			Ключи.Добавить(ФамилияИмяДляПоиска + Родственник.КодСвязи);
		КонецЕсли;
		Ключи.Добавить(ФамилияИмяДляПоиска);
	КонецЕсли;
	
	Возврат Ключи;
КонецФункции

Функция НайтиРодственника(РеквизитыРодственника, ПоискРодственников, Ключи)
	Для Каждого Ключ Из Ключи Цикл
		Родственник = ПоискРодственников[Ключ];
		Если Родственник = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Родственник.СНИЛС)
			И ЗначениеЗаполнено(РеквизитыРодственника.СНИЛС)
			И Родственник.СНИЛС <> РеквизитыРодственника.СНИЛС Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Родственник.КодСвязи)
			И ЗначениеЗаполнено(РеквизитыРодственника.КодСвязи)
			И Родственник.КодСвязи <> РеквизитыРодственника.КодСвязи Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Родственник.ДатаРождения)
			И ЗначениеЗаполнено(РеквизитыРодственника.ДатаРождения)
			И Родственник.ДатаРождения <> РеквизитыРодственника.ДатаРождения Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Родственник.Ссылка)
			И ЗначениеЗаполнено(РеквизитыРодственника.РодственникСсылка)
			И Родственник.Ссылка <> РеквизитыРодственника.РодственникСсылка Тогда
			Продолжить;
		КонецЕсли;
		Возврат Родственник;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

Процедура ЗаполнитьЗначениеИзСтрокиXML(Приемник, ЗначениеВФорматеXML, ТипЗначения)
	Значение = СериализацияБЗК.ЗначениеXML(ЗначениеВФорматеXML, ТипЗначения);
	Если ЗначениеЗаполнено(Значение) Тогда
		Приемник = Значение;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьФИОСотрудника(Документ, ДанныеЭЛН)
	
	// Проверка кадровых данных сотрудника.
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(
		Истина,
		Документ.Сотрудник,
		"Фамилия, Имя, Отчество, ДатаРождения",
		ДанныеЭЛН.ДатаЛН);
	Найденные = КадровыеДанныеСотрудников.НайтиСтроки(Новый Структура("Сотрудник", Документ.Сотрудник));
	Если Найденные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КадровыеДанныеСотрудника = Найденные[0];
	
	Если СтрСравнить(ДанныеЭЛН.Фамилия, СокрЛП(КадровыеДанныеСотрудника.Фамилия)) <> 0 Тогда
		ТекстОшибки = НСтр("ru = 'Фамилия ""%1"" (указана в ЭЛН %2) не совпадают с фамилией сотрудника (%3).';
							|en = 'The last name ""%1"" (specified in ESLR %2) does not match the employee''s last name (%3).'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ДанныеЭЛН.Фамилия, ДанныеЭЛН.НомерЛН, КадровыеДанныеСотрудника.Фамилия);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	Если СтрСравнить(ДанныеЭЛН.Имя, СокрЛП(КадровыеДанныеСотрудника.Имя)) <> 0 Тогда
		ТекстОшибки = НСтр("ru = 'Имя ""%1"" (указана в ЭЛН %2) не совпадают с именем сотрудника (%3).';
							|en = 'The name ""%1"" (specified in ESLR %2) does not match the employee''s name (%3).'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ДанныеЭЛН.Имя, ДанныеЭЛН.НомерЛН, КадровыеДанныеСотрудника.Имя);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	Если СтрСравнить(ДанныеЭЛН.Отчество, СокрЛП(КадровыеДанныеСотрудника.Отчество)) <> 0 Тогда
		ТекстОшибки = НСтр("ru = 'Отчество ""%1"" (указано в ЭЛН %2) не совпадают с отчеством сотрудника (%3).';
							|en = 'The patronymic ""%1"" (specified in ESLR %2) does not match the employee''s patronymic (%3).'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ДанныеЭЛН.Отчество, ДанныеЭЛН.НомерЛН, КадровыеДанныеСотрудника.Отчество);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	ДанныеЭЛНДатаРождения = СериализацияБЗК.ЗначениеXML(ДанныеЭЛН.birthday, Тип("Дата"));
	Если ДанныеЭЛНДатаРождения <> КадровыеДанныеСотрудника.ДатаРождения Тогда
		ТекстОшибки = НСтр("ru = 'Дата рождения указанная в листке нетрудоспособности (%1) не совпадает с датой рождения сотрудника (%2).';
							|en = 'Date of birth specified in the sick leave record (%1) does not match the employee date of birth (%2).'");
		ТекстОшибки = СтрШаблон(
			ТекстОшибки,
			Формат(ДанныеЭЛНДатаРождения, "ДЛФ=D"),
			Формат(КадровыеДанныеСотрудника.ДатаРождения, "ДЛФ=D"));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает соответствие, в котором ключ - имя поля больничного, а значение - имя поля ЭЛН.
Функция СоответствиеПолейЭЛН()
	
	СоответствиеПолей = Новый Соответствие;
	СоответствиеПолей.Вставить("НомерПервичногоЛисткаНетрудоспособности",      "prevLnCode");
	СоответствиеПолей.Вставить("ПредоставленДубликатЛисткаНетрудоспособности", "duplicateFlag");
	СоответствиеПолей.Вставить("ДатаВыдачиЛисткаНетрудоспособности",           "lnDate");
	
	СоответствиеПолей.Вставить("НаименованиеМедицинскойОрганизации", "lpuName");
	СоответствиеПолей.Вставить("АдресМедицинскойОрганизации",        "lpuAddress");
	СоответствиеПолей.Вставить("ОГРНМедицинскойОрганизации",         "lpuOgrn");
	
	СоответствиеПолей.Вставить("КодПричиныНетрудоспособности",               "reason1");
	СоответствиеПолей.Вставить("ДополнительныйКодПричиныНетрудоспособности", "reason2");
	СоответствиеПолей.Вставить("ВторойКодПричиныНетрудоспособности",         "reason3");
	
	СоответствиеПолей.Вставить("ДатаИзмененияКодаПричиныНетрудоспособности", "date1");
	СоответствиеПолей.Вставить("ДатаОкончанияПутевки",                       "date2");
	
	СоответствиеПолей.Вставить("НомерПутевки",   "voucherNo");
	СоответствиеПолей.Вставить("ОГРН_Санатория", "voucherOgrn");
	
	СоответствиеПолей.Вставить("ПериодНахожденияВСтационареСРебенкомС",  "hospitalDt1");
	СоответствиеПолей.Вставить("ПериодНахожденияВСтационареСРебенкомПо", "hospitalDt2");
	
	СоответствиеПолей.Вставить("ДатаНаправленияВБюроМСЭ",      "mseDt1");
	СоответствиеПолей.Вставить("ДатаРегистрацииДокументовМСЭ", "mseDt2");
	СоответствиеПолей.Вставить("ДатаОсвидетельствованияМСЭ",   "mseDt3");
	СоответствиеПолей.Вставить("ГруппаИнвалидности",           "mseInvalidGroup");
	
	СоответствиеПолей.Вставить("НомерЗаменяемогоЛН", "previouslyIssuedCode");
	СоответствиеПолей.Вставить("ПрерывистыйМетод",   "intermittentMethodFlag");
	
	Возврат СоответствиеПолей;
	
КонецФункции

// Заполнение поля ПоставленаНаУчетВРанниеСрокиБеременности.
Процедура ЗаполнитьФлагПостановкиНаУчетВРанниеСрокиБеременности(ДокументОбъект, ДанныеИзСервиса) Экспорт
	ФлагПостановки = СериализацияБЗК.ЗначениеXML(ДанныеИзСервиса.pregn12wFlag, Тип("Булево"));
	Если ФлагПостановки = Истина Тогда
		ДокументОбъект.ПоставленаНаУчетВРанниеСрокиБеременности = Перечисления.ПостановкаНаУчетВРанниеСрокиБеременности.Поставлена;
	ИначеЕсли ФлагПостановки = Ложь Тогда
		ДокументОбъект.ПоставленаНаУчетВРанниеСрокиБеременности = Перечисления.ПостановкаНаУчетВРанниеСрокиБеременности.НеПоставлена;
	Иначе
		ДокументОбъект.ПоставленаНаУчетВРанниеСрокиБеременности = Перечисления.ПостановкаНаУчетВРанниеСрокиБеременности.НеИзвестно;
	КонецЕсли;
КонецПроцедуры

// Заполнение медицинской организации.
Процедура ЗаполнитьМедицинскуюОрганизацию(Документ)
	Если Не ЗначениеЗаполнено(Документ.ОГРНМедицинскойОрганизации) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МедицинскиеОрганизации.Ссылка
	|ИЗ
	|	Справочник.МедицинскиеОрганизации КАК МедицинскиеОрганизации
	|ГДЕ
	|	МедицинскиеОрганизации.ОГРН = &ОГРН";
	Запрос.УстановитьПараметр("ОГРН", Документ.ОГРНМедицинскойОрганизации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Документ.МедицинскаяОрганизация = Выборка.Ссылка;
	Иначе
		МедОрганизация = Справочники.МедицинскиеОрганизации.СоздатьЭлемент();
		МедОрганизация.Наименование = Документ.НаименованиеМедицинскойОрганизации;
		МедОрганизация.ОГРН         = Документ.ОГРНМедицинскойОрганизации;
		МедОрганизация.Адрес        = Документ.АдресМедицинскойОрганизации;
		МедОрганизация.Записать();
		Документ.МедицинскаяОрганизация = МедОрганизация.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

// Заполнение дат оплаты и освобождения от работы.
Процедура ЗаполнитьПериодНетрудоспособности(Больничный) Экспорт
	
	Если ЗначениеЗаполнено(Больничный.ОсвобождениеДатаНачала1) Тогда
		Больничный.ДатаНачала    = Больничный.ОсвобождениеДатаНачала1;
		Больничный.ДатаОкончания = Больничный.ОсвобождениеДатаОкончания1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Больничный.ОсвобождениеДатаНачала2)
		И ЗначениеЗаполнено(Больничный.ОсвобождениеДатаОкончания2) Тогда
		Если ЗначениеЗаполнено(Больничный.ДатаНачала) Тогда
			Больничный.ДатаНачала = Мин(Больничный.ДатаНачала, Больничный.ОсвобождениеДатаНачала2);
		Иначе
			Больничный.ДатаНачала = Больничный.ОсвобождениеДатаНачала2;
		КонецЕсли;
		Больничный.ДатаОкончания = Макс(Больничный.ДатаОкончания, Больничный.ОсвобождениеДатаОкончания2);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Больничный.ОсвобождениеДатаНачала3)
		И ЗначениеЗаполнено(Больничный.ОсвобождениеДатаОкончания3) Тогда
		Если ЗначениеЗаполнено(Больничный.ДатаНачала) Тогда
			Больничный.ДатаНачала = Мин(Больничный.ДатаНачала, Больничный.ОсвобождениеДатаНачала3);
		Иначе
			Больничный.ДатаНачала = Больничный.ОсвобождениеДатаНачала3;
		КонецЕсли;
		Больничный.ДатаОкончания = Макс(Больничный.ДатаОкончания, Больничный.ОсвобождениеДатаОкончания3);
	КонецЕсли;
	
	Больничный.ДатаНачалаОплаты    = Больничный.ДатаНачала;
	Больничный.ДатаОкончанияОплаты = Больничный.ДатаОкончания;
	
	Если Не Больничный.ЯвляетсяПродолжениемБолезни Тогда
		Больничный.ДатаНачалаСобытия = Больничный.ДатаНачала;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет причину нетрудоспособности и случай ухода за ребенком.
Процедура ЗаполнитьПричинуНетрудоспособностиИСлучайУходаЗаРебенком(Больничный) Экспорт
	
	Если Не ЗначениеЗаполнено(Больничный.КодПричиныНетрудоспособности) Тогда
		Возврат;
	КонецЕсли;
	
	НаименьшийВозрастПоУходу = НаименьшийВозрастПоУходу(Больничный);
	
	Если ЗначениеЗаполнено(Больничный.ПериодНахожденияВСтационареСРебенкомС) Тогда
		РежимЛечения = Перечисления.РежимыЛечения.Стационар;
	Иначе
		РежимЛечения = Перечисления.РежимыЛечения.Амбулаторно;
	КонецЕсли;
	
	Больничный.ПричинаНетрудоспособности = УчетПособийСоциальногоСтрахования.ПричинаНетрудоспособности(
		Больничный.КодПричиныНетрудоспособности,
		НаименьшийВозрастПоУходу);
	
	Больничный.СлучайУходаЗаБольнымРебенком = УчетПособийСоциальногоСтрахования.СлучайУхода(
		Больничный.ДатаНачалаСобытия,
		Больничный.КодПричиныНетрудоспособности,
		НаименьшийВозрастПоУходу,
		РежимЛечения);
	
КонецПроцедуры

Функция НаименьшийВозрастПоУходу(Больничный) Экспорт
	НаименьшийВозраст = Неопределено;
	Если Больничный.ПериодыУходаЗаРодственниками.Количество() > 0 Тогда
		// Определение наименьшего возраста по таблице ПериодыУходаЗаРодственниками.
		Для Каждого СтрокаТаблицы Из Больничный.ПериодыУходаЗаРодственниками Цикл
			Возраст = СтрокаТаблицы.ВозрастЛет + Окр(СтрокаТаблицы.ВозрастМесяцев / 12, 1);
			Если НаименьшийВозраст = Неопределено Или НаименьшийВозраст > Возраст Тогда
				НаименьшийВозраст = Возраст;
			КонецЕсли;
		КонецЦикла;
	Иначе
		// Определение наименьшего возраста по реквизитам шапки.
		Если ЗначениеЗаполнено(Больничный.ПоУходуФИО1) Тогда
			НаименьшийВозраст = Больничный.ПоУходуВозрастЛет1 + Окр(Больничный.ПоУходуВозрастМесяцев1 / 12, 1);
		КонецЕсли;
		Если ЗначениеЗаполнено(Больничный.ПоУходуФИО2) Тогда
			ПоУходуВозраст2 = Больничный.ПоУходуВозрастЛет2 + Окр(Больничный.ПоУходуВозрастМесяцев2 / 12, 1);
			Если НаименьшийВозраст = Неопределено Или НаименьшийВозраст > ПоУходуВозраст2 Тогда
				НаименьшийВозраст = ПоУходуВозраст2;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат НаименьшийВозраст;
КонецФункции

#КонецОбласти

#Область ЗагрузкаРеестровЭЛН

Процедура ЗагрузитьРезультатОтправкиРеестраЭЛН(Документ, ЭлементыRow, Результат)
	ТребуетсяВывестиТекстСообщенияФСС = ЗначениеЗаполнено(Результат.ТекстСообщенияФСС);
	Для Каждого Row Из ЭлементыRow Цикл
		ТребуетсяАктуализацияХеша = Ложь;
		ТекстыОшибок = Новый Массив;
		
		НомерЛН = Row.lnCode;
		ЭЛНПринят = (Строка(Row.status) = "1");
		
		Хеш = Неопределено;
		Если Row.Свойства().Получить("lnHash") <> Неопределено Тогда
			Хеш = СериализацияБЗК.ЗначениеXML(Row.lnHash, Тип("Строка"));
		КонецЕсли;
		
		Если Не ЭЛНПринят Тогда
			Errors = СериализацияБЗК.СписокXDTO(Row, "errors.error");
			Для Каждого Error Из Errors Цикл
				ТекстыОшибок.Добавить(СтрШаблон("[%1] %2", СокрЛП(Error.errCode), СокрЛП(Error.errMess)));
				Если СтрСравнить(Error.errCode, "ERR_013") = 0 Тогда
					// Отказ не включается, т.к. будет предпринята попытка зачитать актуальные хеши и повторная попытка отправки.
					ТребуетсяАктуализацияХеша = Истина;
					ТекстыОшибок.Добавить(НСтр("ru = 'Будет предпринята попытка актуализации Хэша ЭЛН';
												|en = 'ESLR hash update will be attempted'")); // АПК:1036 "Хэш ЭЛН" - термин ФСС.
				КонецЕсли;
				Если ТребуетсяВывестиТекстСообщенияФСС Тогда
					СообщенияБЗККлиентСервер.СообщитьОбОшибкеВФорме(Результат.Отказ, Результат.ТекстСообщенияФСС);
					ТребуетсяВывестиТекстСообщенияФСС = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		СтрокаДанныхЭЛН = Документ.ДанныеЭЛН.Найти(НомерЛН, "НомерЛисткаНетрудоспособности");
		Если СтрокаДанныхЭЛН = Неопределено Тогда
			СообщенияБЗККлиентСервер.СообщитьОбОшибкеВФорме(Результат.Отказ, СтрСоединить(ТекстыОшибок, Символы.ПС));
			СообщенияБЗККлиентСервер.СообщитьОбОшибкеВФорме(
				Результат.Отказ,
				СтрШаблон(НСтр("ru = 'ЭЛН № %1 не найден в документе.';
								|en = 'ESLR № %1 not found in document.'"), НомерЛН),
				"ДанныеЭЛН[0].НомерЛисткаНетрудоспособности",
				"Объект");
		Иначе
			СтрокаДанныхЭЛН.ТребуетсяАктуализацияХеша = ТребуетсяАктуализацияХеша;
			СтрокаДанныхЭЛН.КомментарийКСостоянию = СтрСоединить(ТекстыОшибок, Символы.ПС);
			Если ЭЛНПринят Тогда
				СтрокаДанныхЭЛН.Состояние = Перечисления.СостоянияЭЛНВРеестрахЭЛН.ПринятФСС;
			Иначе
				СтрокаДанныхЭЛН.Состояние = Перечисления.СостоянияЭЛНВРеестрахЭЛН.НеПринятФСС;
			КонецЕсли;
		КонецЕсли;
		
		РегистрыСведений.СведенияОбЭЛН.ПриЗагрузкеОтветаФССПоРеестру(НомерЛН, Документ, СтрокаДанныхЭЛН, Хеш);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаЭЛН

Функция ОписаниеФайлаЭЛН(НомерЛН, ГоловнаяОрганизация, ИдентификаторФормы) Экспорт
	Результат = Новый Структура("Адрес, ИмяБезРасширения");
	
	ТекстXML = РегистрыСведений.СведенияОбЭЛН.ИсходныйXML(НомерЛН, ГоловнаяОрганизация);
	Если Не ЗначениеЗаполнено(ТекстXML) Тогда
		Возврат Неопределено
	КонецЕсли;
	Если СтрСравнить(Лев(СокрЛ(ТекстXML), 5), "<?xml") = 0 Тогда
		Кодировка = СериализацияБЗК.КодировкаXML(ТекстXML);
	Иначе
		ТекстXML = "<?xml version='1.0' encoding='UTF-8'?>" + Символы.ПС + ТекстXML;
		Кодировка = "UTF-8";
	КонецЕсли;
	
	ДвоичныеДанные = ЗарплатаКадры.СтрокаВДвоичныеДанные(ТекстXML, Кодировка, Истина);
	Результат.Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ИдентификаторФормы);
	
	Попытка
		СтруктураDOM = СериализацияБЗК.СтруктураDOM(ТекстXML);
		УзелЗапроса = СериализацияБЗК.НайтиУзелDOM(СтруктураDOM, "//*[local-name() = 'requestId']");
		Если УзелЗапроса = Неопределено Тогда
			УзелЗапроса = СериализацияБЗК.НайтиУзелDOM(СтруктураDOM, "//*[local-name() = 'REQUEST_ID']");
		КонецЕсли;
		Если УзелЗапроса <> Неопределено Тогда
			Результат.ИмяБезРасширения = УзелЗапроса.ТекстовоеСодержимое;
		КонецЕсли;
	Исключение
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка при получении содержимого XML: %1';
				|en = 'Error getting XML content: %1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		СообщенияБЗК.СообщитьОПроблеме(ТекстОшибки);
	КонецПопытки;
	Если Не ЗначениеЗаполнено(Результат.ИмяБезРасширения) Тогда
		Результат.ИмяБезРасширения = "getPrivateLNData_" + НомерЛН;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область XML

// Преобразует строку XML (полученную из текста элемента или значения атрибута XML) в значение типа Строка.
//
// Параметры:
//   * ЗначениеXML - Строка, Неопределено, ОбъектXDTO - Значение свойства объекта, полученное из XML.
//
// Возвращаемое значение:
//   Строка
//
Функция ЗначениеXMLТипаСтрока(ЗначениеXML)
	Возврат СериализацияБЗК.ЗначениеXMLТипаСтрока(ЗначениеXML);
КонецФункции

#КонецОбласти

#Область Больничные

// Заполняет структуру ДанныеРеестраЭЛН по данным реестра ЭЛН в соответствии с форматом обмена с ФСС.
Процедура ЗаполнитьДанныеРеестраЗаполняемыеИзБольничного(ДанныеРеестраЭЛН, СсылкаРеестра, НомерЛН)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДанныеЭЛН.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОсновноеМестоРаботы,
	|	ДанныеЭЛН.БазаДляРасчетаСреднегоЗаработка КАК БазаДляРасчетаСреднегоЗаработка,
	|	ДанныеЭЛН.СреднийДневнойЗаработок КАК СреднийДневнойЗаработок,
	|	ДанныеЭЛН.УсловияИсчисленияКод1 КАК УсловияИсчисленияКод1,
	|	ДанныеЭЛН.УсловияИсчисленияКод2 КАК УсловияИсчисленияКод2,
	|	ДанныеЭЛН.УсловияИсчисленияКод3 КАК УсловияИсчисленияКод3,
	|	ДанныеЭЛН.ДатаАктаН1 КАК ДатаАктаН1,
	|	ДанныеЭЛН.ДатаНачалаРаботы КАК ДатаНачалаРаботы,
	|	ДанныеЭЛН.ДатаНачалаОплаты КАК ДатаНачалаОплаты,
	|	ДанныеЭЛН.ДатаОкончанияОплаты КАК ДатаОкончанияОплаты,
	|	ДанныеЭЛН.СтажЛет КАК СтажЛет,
	|	ДанныеЭЛН.СтажМесяцев КАК СтажМесяцев,
	|	ДанныеЭЛН.СтажРасширенныйЛет КАК СтажРасширенныйЛет,
	|	ДанныеЭЛН.СтажРасширенныйМесяцев КАК СтажРасширенныйМесяцев,
	|	ДанныеЭЛН.СуммаОплатыЗаСчетРаботодателя КАК СуммаОплатыЗаСчетРаботодателя,
	|	ДанныеЭЛН.СуммаОплатыЗаСчетФСС КАК СуммаОплатыЗаСчетФСС
	|ИЗ
	|	Документ.РеестрДанныхЭЛНЗаполняемыхРаботодателем.ДанныеЭЛН КАК ДанныеЭЛН
	|ГДЕ
	|	ДанныеЭЛН.Ссылка = &СсылкаРеестра
	|	И ДанныеЭЛН.НомерЛисткаНетрудоспособности = &НомерЛН";
	Запрос.УстановитьПараметр("СсылкаРеестра", СсылкаРеестра);
	Запрос.УстановитьПараметр("НомерЛН",       НомерЛН);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 0 Тогда
		Возврат; // Нештатная ситуация - строка ЭЛН исчезла из принятого реестра.
	КонецЕсли;
	
	ЭлементТаблицыЭЛН = Таблица[0];
	ЗаполнитьЗначенияСвойств(ДанныеРеестраЭЛН, ЭлементТаблицыЭЛН);
	
КонецПроцедуры

// Заполняет структуру ДанныеБольничногоДляЭЛН по данным больничного в соответствии с форматом обмена с ФСС.
Процедура ЗаполнитьДанныеБольничногоОтправляемыеВФСС(ДанныеБольничногоДляЭЛН, БольничныйОбъект)
	
	ЗаполнитьЗначенияСвойств(ДанныеБольничногоДляЭЛН, БольничныйОбъект);
	
	ДатаВключенияРКПриРасчетеБольничного = УчетПособийСоциальногоСтрахования.ДатаВключенияРКПриРасчетеБольничного();
	Если БольничныйОбъект.ДатаНачалаСобытия >= ДатаВключенияРКПриРасчетеБольничного Тогда
		МинимальныйСреднедневной = БольничныйОбъект.МинимальныйСреднедневнойЗаработок * БольничныйОбъект.РайонныйКоэффициентРФНаНачалоСобытия;
	Иначе
		МинимальныйСреднедневной = БольничныйОбъект.МинимальныйСреднедневнойЗаработок;
	КонецЕсли;
	
	БазаДляРасчетСреднего = УчетПособийСоциальногоСтрахования.БазаДляРасчетаСреднегоЗаработка(БольничныйОбъект);
	
	Если БольничныйОбъект.СреднийДневнойЗаработок <= МинимальныйСреднедневной
		И ЗначениеЗаполнено(БазаДляРасчетСреднего.УчитываемыхДнейВКалендарныхГодах)
		И ЗначениеЗаполнено(БольничныйОбъект.СреднийДневнойЗаработок) Тогда
		БазаДляРасчетаСреднегоЗаработка = БольничныйОбъект.МинимальныйСреднедневнойЗаработок * БазаДляРасчетСреднего.УчитываемыхДнейВКалендарныхГодах;
	ИначеЕсли ЗначениеЗаполнено(БазаДляРасчетСреднего.БазаДляРасчетаСреднегоЗаработка) Тогда
		БазаДляРасчетаСреднегоЗаработка = БазаДляРасчетСреднего.БазаДляРасчетаСреднегоЗаработка;
	Иначе
		БазаДляРасчетаСреднегоЗаработка = 0;
	КонецЕсли;
	ДанныеБольничногоДляЭЛН.БазаДляРасчетаСреднегоЗаработка = БазаДляРасчетаСреднегоЗаработка;
	ДанныеБольничногоДляЭЛН.СреднийДневнойЗаработок = Макс(БольничныйОбъект.СреднийДневнойЗаработок, МинимальныйСреднедневной);
	
	КатегорииЗаСчетФСС          = УчетПособийСоциальногоСтрахования.КатегорииНачисленийПособийЗаСчетФСС();
	КатегорияЗаСчетРаботодателя = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛистаЗаСчетРаботодателя;
	СуммаОплатыЗаСчетФСС          = 0;
	СуммаОплатыЗаСчетРаботодателя = 0;
	Если БольничныйОбъект.Начисления.Количество() > 0 Тогда
		ТаблицаЗначений = БольничныйОбъект.Начисления.Выгрузить();
		СсылкиНачислений = КоллекцииБЗК.УникальныеЗначенияКолонки(ТаблицаЗначений, "Начисление");
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(СсылкиНачислений, ПланыВидовРасчета.Начисления.ПустаяСсылка());
		Если СсылкиНачислений.Количество() > 0 Тогда
			КатегорииНачислений = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СсылкиНачислений, "КатегорияНачисленияИлиНеоплаченногоВремени");
		Иначе
			КатегорииНачислений = Новый Соответствие;
		КонецЕсли;
		Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
			Категория = КатегорииНачислений[СтрокаТаблицы.Начисление];
			Если КатегорииЗаСчетФСС.Найти(Категория) <> Неопределено Тогда
				СуммаОплатыЗаСчетФСС = СуммаОплатыЗаСчетФСС + СтрокаТаблицы.Результат;
			КонецЕсли;
			Если Категория = КатегорияЗаСчетРаботодателя Тогда
				СуммаОплатыЗаСчетРаботодателя = СуммаОплатыЗаСчетРаботодателя + СтрокаТаблицы.Результат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ДанныеБольничногоДляЭЛН.СуммаОплатыЗаСчетФСС          = СуммаОплатыЗаСчетФСС;
	ДанныеБольничногоДляЭЛН.СуммаОплатыЗаСчетРаботодателя = СуммаОплатыЗаСчетРаботодателя;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
