
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда		
		
		ТипВНА = "ДокументСсылка.РегламентнаяОперацияПериодаВНАМСФО";
		ТипПовтор = "ДокументСсылка.ПовторениеКорректировокПрошлыхПериодов";
		
	Иначе 
		
		ТипВНА = "Неопределено";
		ТипПовтор = "Неопределено";
		
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("РегламентнаяОперацияПериодаВНАМСФО", Тип(ТипВНА));
	Список.Параметры.УстановитьЗначениеПараметра("ПовторениеКорректировокПрошлыхПериодов", Тип(ТипПовтор));
		
КонецПроцедуры
