
#Область ПрограммныйИнтерфейс
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПустаяОрганизация() Экспорт
	Возврат ОбщегоНазначенияОПК.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.Организации);
КонецФункции

Функция ПустойЦФО() Экспорт
	Возврат ОбщегоНазначенияОПК.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.ЦФО);
КонецФункции

Функция ПустойПроект() Экспорт
	Возврат ОбщегоНазначенияОПК.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.Проекты);
КонецФункции

Функция ПустойКонтрагент() Экспорт
	Возврат ОбщегоНазначенияОПК.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.Контрагенты);
КонецФункции

Функция ПустойБанковскийСчетОрганизации() Экспорт
	Возврат ОбщегоНазначенияОПК.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.БанковскиеСчетаОрганизаций);
КонецФункции

Функция ПустойБанковскийСчетКонтрагента() Экспорт
	Возврат ОбщегоНазначенияОПК.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.БанковскиеСчетаКонтрагентов);
КонецФункции

Функция ПустаяКассаОрганизации() Экспорт
	Возврат ОбщегоНазначенияОПК.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.Кассы);
КонецФункции

Функция ПустойДоговор() Экспорт
	Возврат ОбщегоНазначенияОПК.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.Договоры);
КонецФункции

Функция ПустаяСтатьяДвиженияДенежныхСредств() Экспорт
	Возврат ОбщегоНазначенияОПК.ПустоеЗначениеОписанияТипа(
		ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств.ТипЗначения);
КонецФункции

Функция ПустаяСтатьяДоходовИРасходов() Экспорт
	Возврат ОбщегоНазначенияОПК.ПустоеЗначениеОписанияТипа(
		ПланыВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов.ТипЗначения);
КонецФункции

Функция ПустаяЗаявкаНаОплату() Экспорт
	Возврат ОбщегоНазначенияОПК.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.ЗаявкаНаОплату);
КонецФункции

Функция ПустаяЗаявкаНаРасход() Экспорт
	Возврат ОбщегоНазначенияОПК.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.ЗаявкаНаРасход);
КонецФункции

Функция ПустоеПланируемоеПоступление() Экспорт
	Возврат ОбщегоНазначенияОПК.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.ПланируемоеПоступление);
КонецФункции

Функция ПустойПланируемыйДоход() Экспорт
	Возврат ОбщегоНазначенияОПК.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.ПланируемыйДоход);
КонецФункции

Функция ПустаяВалюта() Экспорт
	Возврат ОбщегоНазначенияОПК.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.Валюты);
КонецФункции

Функция ТипКонтрагенты() Экспорт
	Возврат ОбщегоНазначенияОПК.ТипОпределяемогоТипа(Метаданные.ОпределяемыеТипы.Контрагенты);
КонецФункции

Функция ТипЗаявкаНаОплату() Экспорт
	Возврат ОбщегоНазначенияОПК.ТипОпределяемогоТипа(Метаданные.ОпределяемыеТипы.ЗаявкаНаОплату);
КонецФункции

Функция ТипЗаявкаНаРасход() Экспорт
	Возврат ОбщегоНазначенияОПК.ТипОпределяемогоТипа(Метаданные.ОпределяемыеТипы.ЗаявкаНаРасход);
КонецФункции

Функция ТипПланируемоеПоступление() Экспорт
	Возврат ОбщегоНазначенияОПК.ТипОпределяемогоТипа(Метаданные.ОпределяемыеТипы.ПланируемоеПоступление);
КонецФункции

Функция ТипПланируемыйДоход() Экспорт
	Возврат ОбщегоНазначенияОПК.ТипОпределяемогоТипа(Метаданные.ОпределяемыеТипы.ПланируемыйДоход);
КонецФункции

Функция ТипЗаказПоставщику() Экспорт
	Возврат ОбщегоНазначенияОПК.ТипОпределяемогоТипа(Метаданные.ОпределяемыеТипы.ЗаказПоставщику);
КонецФункции

Функция ТипБанковскиеСчетаОрганизаций() Экспорт
	Возврат ОбщегоНазначенияОПК.ТипОпределяемогоТипа(Метаданные.ОпределяемыеТипы.БанковскиеСчетаОрганизаций);
КонецФункции

Функция ТипПоступлениеБезналичныхДенежныхСредств() Экспорт
	Возврат ОбщегоНазначенияОПК.ТипОпределяемогоТипа(Метаданные.ОпределяемыеТипы.ПоступлениеБезналичныхДенежныхСредств);
КонецФункции

Функция ТипСписаниеБезналичныхДенежныхСредств() Экспорт
	Возврат ОбщегоНазначенияОПК.ТипОпределяемогоТипа(Метаданные.ОпределяемыеТипы.СписаниеБезналичныхДенежныхСредств);
КонецФункции

Функция ТипПлатежноеПоручение() Экспорт
	Возврат ОбщегоНазначенияОПК.ТипОпределяемогоТипа(Метаданные.ОпределяемыеТипы.ПлатежноеПоручение);
КонецФункции

Функция ТипРКО() Экспорт
	Возврат ОбщегоНазначенияОПК.ТипОпределяемогоТипа(Метаданные.ОпределяемыеТипы.РКО);
КонецФункции

Функция ТипПКО() Экспорт
	Возврат ОбщегоНазначенияОПК.ТипОпределяемогоТипа(Метаданные.ОпределяемыеТипы.ПКО);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
#КонецОбласти
 

