
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Функция ПолучитьОписаниеЗначенияКотировки(ОбъектКотировки) Экспорт
	
	ТипКотировки = ТипЗнч(ОбъектКотировки);
		
	Если ТипКотировки = Тип("СправочникСсылка.ЦенныеБумаги") Тогда		
		
		Если ОбъектКотировки.Пустая() Тогда
			Возврат "";	
		ИначеЕсли ОбъектКотировки.Котировка.Пустая() Тогда
			Возврат СтрШаблон(НСтр("ru = '%1 за 1 ценную бумагу'"), ОбъектКотировки.ВалютаНоминала);		
		Иначе 
			Котировка = ОбъектКотировки.Котировка;			
		КонецЕсли;
		
	ИначеЕсли ТипКотировки = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		Если ОбъектКотировки.Пустая() Тогда
			Возврат "";	
		ИначеЕсли ОбъектКотировки.Котировка.Пустая() Тогда
			Возврат СтрШаблон(НСтр("ru = '%1 за 1 %2'"), ОбъектКотировки.ВалютаВзаиморасчетов, ОбъектКотировки.Организация.ФункциональнаяВалюта);
		Иначе 
			Котировка = ОбъектКотировки.Котировка;			
		КонецЕсли;
		
	Иначе 
		
		Котировка = ОбъектКотировки;
		
	КонецЕсли;	
	
	Если ТипКотировки = Тип("СправочникСсылка.ВидыКотировокФинансовыхИнструментов") Тогда
				
		ТипКотировки = Котировка.ТипКотировки;
		БазоваяВалюта = Котировка.Валюта;
		КотируемаяВалюта = Котировка.ФункциональнаяВалюта;
		
		Если (ТипКотировки = ПредопределенноеЗначение("Перечисление.ТипыКотировокФинансовыхИнструментов.РыночнаяСтавкаПроцента"))
			Или (ТипКотировки = ПредопределенноеЗначение("Перечисление.ТипыКотировокФинансовыхИнструментов.БанковскаяСтавкаПроцента")) Тогда
			
			Возврат "%";
			
		Иначе 
			
			Валюта1 = ?(ЗначениеЗаполнено(КотируемаяВалюта), КотируемаяВалюта, НСтр("ru = 'котируемой валюты'"));
			Валюта2 = ?(ЗначениеЗаполнено(БазоваяВалюта), БазоваяВалюта, НСтр("ru = 'базовой валюты'"));
			
			Возврат СтрШаблон(НСтр("ru = '%1 за 1 %2'"), Валюта1, Валюта2);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ""; 
	
КонецФункции

Функция ПолучитьЗначенияКотировок(Котировки, Дата) Экспорт

	

КонецФункции

Функция ТекстЗапросаКотировок(НомераТаблиц = Неопределено) Экспорт

	Если НомераТаблиц <> Неопределено Тогда
		НомераТаблиц.Вставить("ЗначенияКотировок", НомераТаблиц.Количество());
	КонецЕсли;
	
	Возврат
	"ВЫБРАТЬ
	|	втКотировки.ВидКотировки КАК ВидКотировки,
	|	втКотировки.Значение
	|
	|ИЗ
	|	РегистрСведений.ЗначенияКотировокФИ.СрезПоследних(
	|			&Дата,
	|			ВидКотировки В
	|				(ВЫБРАТЬ
	|					т.ВидКотировки
	|				ИЗ
	|					втВидыКотировок КАК т)) КАК втКотировки";
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИБ
Процедура ЗаполнитьПредопределенныеДанные(Параметры = Неопределено) Экспорт
	
	ОбъектМетаданных = Метаданные.Справочники.ВидыКотировокФинансовыхИнструментов;
	ТабДок = ПолучитьМакет("ПредопределенныеДанные_ru");
	
	ОбновлениеИнформационнойБазыУХСлужебный.ЗаполнитьРеквизитыПредопределенныхЭлементовИзМакета(ОбъектМетаданных, ТабДок);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
 