
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура КонстантыАвтоматическаяРегистрацияЗапросаНалоговогоМониторингаВОповещенияУХПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	Элементы.ГруппаОповещенияБП.Видимость = ОбщегоНазначения.ПодсистемаСуществует("БухгалтерияПредприятияПодсистемы");
	Элементы.ГруппаОповещенияУХ.Видимость = ОбщегоНазначения.ПодсистемаСуществует("ПодсистемыУХ.ПроцессыИСогласование");
	Элементы.Получатели.Доступность = Константы.АвтоматическаяРегистрацияЗапросаНалоговогоМониторингаВОповещенияУХ;
КонецПроцедуры