
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ПараметрыВыполненияКоманды.Источник.Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ПараметрКоманды, ПараметрыВыполненияКоманды", ПараметрКоманды, ПараметрыВыполненияКоманды)), НСтр("ru = 'Данные регламента изменены. Для продолжения необходимо записать регламент. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбработкаКомандыФрагмент(ПараметрКоманды, ПараметрыВыполненияКоманды);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;
	ПараметрыВыполненияКоманды = ДополнительныеПараметры.ПараметрыВыполненияКоманды;
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Оповестить("ЗаписатьВФорме");
		ОбработкаКомандыФрагмент(ПараметрКоманды, ПараметрыВыполненияКоманды);
	Иначе
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ПараметрыВыполненияКоманды.Источник));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыФрагмент(Знач ПараметрКоманды, Знач ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("ВерсияОрганизационнойСтруктуры, ВидОтчетаОтбор", ПараметрКоманды, ПолучитьВидОтчета(ПараметрКоманды));
	ОткрытьФорму("Обработка.НастройкаПараметровОтчетовПоУмолчанию.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры

&НаСервере
Функция ПолучитьВидОтчета(Ссылка)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ВидОтчета");
КонецФункции
