
#Область СлужебныйПрограммныйИнтерфейс

// Структура с параметрами видимости статей в договоре
Функция ДоступностьСтатейБюджетовВДоговоре() Экспорт
	
	Параметры = ОперативноеПланированиеУХВызовСервера.ПолучитьПараметрыБюджетов();
	
	ТипыИсполнения = Новый Массив;
	
	Результат = Новый Структура;
	Результат.Вставить("ВидимостьБДДС", Ложь);
	Результат.Вставить("ВидимостьБДР", Ложь);
	Результат.Вставить("ВидимостьБЗ", Ложь);
	
	Для Каждого Строка Из Параметры Цикл
		Если Строка.ВидБюджета = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств") Тогда
			Результат.ВидимостьБДДС = Строка.Использовать;
		ИначеЕсли Строка.ВидБюджета = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов") Тогда
			Результат.ВидимостьБДР = Строка.Использовать;
			Если Результат.ВидимостьБДР Тогда
				Для Каждого Тип Из Строка.ТипЗначения.Типы() Цикл
					ТипыИсполнения.Добавить(Тип);
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли Строка.ВидБюджета = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияРесурсов") Тогда
			Результат.ВидимостьБЗ = Строка.Использовать;
			Если Результат.ВидимостьБЗ Тогда
				Для Каждого Тип Из Строка.ТипЗначения.Типы() Цикл
					ТипыИсполнения.Добавить(Тип);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Вставить("ВидимостьИсполнения", Результат.ВидимостьБДР ИЛИ Результат.ВидимостьБЗ);
	Результат.Вставить("ВидимостьЦФОПроект", Результат.ВидимостьБДДС ИЛИ Результат.ВидимостьИсполнения);
	
	Результат.Вставить("ОписаниеТиповИсполнения", Новый ОписаниеТипов(ТипыИсполнения));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

