
#Область СлужебныйПрограммныйИнтерфейс

#Область Действия

// Возвращает параметры необходимые для выполнения действия "ПроверитьЗаполнитьНазначениеОбеспеченияВЭтапеПроизводства".
//
// Параметры:
//  Объект	 - Структура, ДанныеФормыСтруктура, ДокументОбъект.ЭтапПроизводства2_2 - данные документа
// 
// Возвращаемое значение:
//  Структура - список параметров.
//
Функция ПараметрыДействияПроверитьЗаполнитьНазначениеОбеспеченияВЭтапеПроизводства(Объект) Экспорт
	
	ПараметрыДействия = Новый Структура();
	
	ПараметрыДействия.Вставить("НазначениеМатериалы", Объект.НазначениеМатериалы);
	ПараметрыДействия.Вставить("НазначениеПолуфабрикаты", Объект.НазначениеПолуфабрикаты);
	
	Возврат ПараметрыДействия;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Действия

Процедура ЗаполнитьНазначениеОбеспеченияВСтрокеЭтапаПроизводства(ТекущаяСтрока, ПараметрыДействия) Экспорт

	Если ТекущаяСтрока.Обособленно Тогда
		
		Если ТекущаяСтрока.Производится Тогда
			ПараметрыДействия.Свойство("НазначениеПолуфабрикаты", ТекущаяСтрока.Назначение);
		Иначе
			ПараметрыДействия.Свойство("НазначениеМатериалы", ТекущаяСтрока.Назначение);
		КонецЕсли;
		
	Иначе
		ТекущаяСтрока.Назначение = ПредопределенноеЗначение("Справочник.Назначения.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНазначениеПобочногоВыходаВСтрокеЭтапаПроизводства(ТекущаяСтрока, ПараметрыДействия) Экспорт

	Если ПустаяСтрока(ТекущаяСтрока.Назначение) И ЗначениеЗаполнено(ПараметрыДействия.НазначениеПобочногоВыхода) Тогда
		ТекущаяСтрока.Назначение = ПараметрыДействия.НазначениеПобочногоВыхода;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Прочее

#КонецОбласти

#КонецОбласти
