&После("ДобавитьКомандыОтчетов")


// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ллл_ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
 
	
	КомандаОтчет = Отчеты.ллл_ОтчетОСтруктуреОплатыПТУ.ллл_ДобавитьКомандуОтчетаВДокумент(КомандыОтчетов);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.Порядок = 10;
		КомандаОтчет.ВидимостьВФормах = "ФормаДокумента,ФормаСписка,СписокДокументов";
		
	КонецЕсли;

КонецПроцедуры

