#Область СлужебныйПрограммныйИнтерфейс

Функция МенеджерДокументаПоВидуМестаВыплаты(ВидМестаВыплаты) Экспорт
	
	МенеджерДокументаПоМестуВыплаты = Неопределено;
	
	Если ВидМестаВыплаты = Перечисления.ВидыМестВыплатыЗарплаты.Раздатчик Тогда
		МенеджерДокументаПоМестуВыплаты = Документы.ВедомостьНаВыплатуЗарплатыРаздатчиком
	ИначеЕсли ВидМестаВыплаты = Перечисления.ВидыМестВыплатыЗарплаты.БанковскийСчет Тогда
		МенеджерДокументаПоМестуВыплаты = Документы.ВедомостьНаВыплатуЗарплатыПеречислением
	Иначе
		МенеджерДокументаПоМестуВыплаты = 
			ВедомостьНаВыплатуЗарплатыБазовый.МенеджерДокументаПоВидуМестаВыплаты(ВидМестаВыплаты)
	КонецЕсли;	
		
	Возврат МенеджерДокументаПоМестуВыплаты
	
КонецФункции

Функция СтатьяФинансированияИспользуется() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении")
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплата")
КонецФункции

Функция СтатьяФинансированияОбязательна() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("ПроверятьЗаполнениеФинансированияВВедомостях")
		И ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплатаРасширенный")
КонецФункции

Функция СтатьяРасходовОбязательна() Экспорт
	Если ПолучитьФункциональнуюОпцию("РаботаВХозрасчетнойОрганизации") Тогда
		Возврат ПолучитьФункциональнуюОпцию("ПроверятьЗаполнениеСпособаРасчетовВВедомостях")
	ИначеЕсли ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении") Тогда	
		Возврат ПолучитьФункциональнуюОпцию("ПроверятьЗаполнениеФинансированияВВедомостях")
	Иначе
		Возврат Ложь
	КонецЕсли;	
КонецФункции

Функция ПредставлениеРеквизитаСтатьяРасходов() Экспорт
	Возврат	
		?(ПолучитьФункциональнуюОпцию("РаботаВХозрасчетнойОрганизации"),
		НСтр("ru = 'Способ расчетов с персоналом';
			|en = 'Payroll statement method'"),
		Метаданные.Справочники.СтатьиРасходовЗарплата.ПредставлениеОбъекта)
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

/// Печать

Процедура ДобавитьКомандыПечатиПриВыплатеНаКарточки(КомандыПечати) Экспорт
	
	ВедомостьНаВыплатуЗарплатыБазовый.ДобавитьКомандыПечатиПриВыплатеНаКарточки(КомандыПечати);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.УчетБюджетныхУчреждений") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ВедомостьНаВыплатуЗарплатыБюджетныхУчреждений");
		Модуль.ДобавитьКомандыПечатиПриВыплатеНаКарточки(КомандыПечати);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры") Тогда
		УчетНДФЛРасширенный.ДобавитьКомандуПечатиРеестраПеречисленногоНалога(КомандыПечати)
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПечатьПриВыплатеНаКарточки(
		МассивОбъектов, 
		ПараметрыПечати, 
		КоллекцияПечатныхФорм, 
		ОбъектыПечати, 
		ПараметрыВывода) Экспорт
	
	ВедомостьНаВыплатуЗарплатыБазовый.ПечатьПриВыплатеНаКарточки(
		МассивОбъектов, 
		ПараметрыПечати, 
		КоллекцияПечатныхФорм, 
		ОбъектыПечати, 
		ПараметрыВывода);	
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.УчетБюджетныхУчреждений") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ВедомостьНаВыплатуЗарплатыБюджетныхУчреждений");
		Модуль.ПечатьПриВыплатеНаКарточки(
			МассивОбъектов, 
			ПараметрыПечати, 
			КоллекцияПечатныхФорм, 
			ОбъектыПечати, 
			ПараметрыВывода);
	КонецЕсли;
	
	Если УчетНДФЛРасширенный.НужноПечататьРеестрПеречисленногоНалога(КоллекцияПечатныхФорм) Тогда
		УчетНДФЛРасширенный.ВывестиРеестрПеречисленногоНалогаПоПлатежномуДокументу(
			КоллекцияПечатныхФорм, 
			МассивОбъектов, 
			ОбъектыПечати);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКомандыПечатиПриВыплатеНаличными(КомандыПечати) Экспорт
	
	// Расчетно-платежная ведомость (Т-49).
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "Т49";
	КомандаПечати.Представление = НСтр("ru = 'Расчетно-платежная ведомость (Т-49)';
										|en = 'Pay statement (T-49) '");
	КомандаПечати.Порядок = 30;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.ФункциональныеОпции = "РаботаВХозрасчетнойОрганизации";
	
	// Платежная ведомость (Т-53)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "Т53";
	КомандаПечати.Представление = НСтр("ru = 'Платежная ведомость (Т-53)';
										|en = 'Paysheet (T-53)'");
	КомандаПечати.Порядок = 20;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.УчетБюджетныхУчреждений") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ВедомостьНаВыплатуЗарплатыБюджетныхУчреждений");
		Модуль.ДобавитьКомандыПечатиПриВыплатеНаличными(КомандыПечати);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры") Тогда
		УчетНДФЛРасширенный.ДобавитьКомандуПечатиРеестраПеречисленногоНалога(КомандыПечати)
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПечатьПриВыплатеНаличными(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Т49") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Т49",
			НСтр("ru = 'Расчетно-платежная ведомость (Т-49)';
				|en = 'Pay statement (T-49) '"), ПечатьТ49(МассивОбъектов, ОбъектыПечати));
		
	Иначе
		ВедомостьНаВыплатуЗарплатыБазовый.ПечатьПриВыплатеНаличными(
			МассивОбъектов, 
			ПараметрыПечати, 
			КоллекцияПечатныхФорм, 
			ОбъектыПечати, 
			ПараметрыВывода);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.УчетБюджетныхУчреждений") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ВедомостьНаВыплатуЗарплатыБюджетныхУчреждений");
		Модуль.ПечатьПриВыплатеНаличными(
			МассивОбъектов, 
			ПараметрыПечати, 
			КоллекцияПечатныхФорм, 
			ОбъектыПечати, 
			ПараметрыВывода);
	КонецЕсли;
	
	Если УчетНДФЛРасширенный.НужноПечататьРеестрПеречисленногоНалога(КоллекцияПечатныхФорм) Тогда
		УчетНДФЛРасширенный.ВывестиРеестрПеречисленногоНалогаПоПлатежномуДокументу(
			КоллекцияПечатныхФорм, 
			МассивОбъектов, 
			ОбъектыПечати);	
	КонецЕсли;

КонецПроцедуры

Функция ПечатьТ49(МассивОбъектов, ОбъектыПечати)
	
	СпособыВыплатыВедомостей = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивОбъектов, "СпособВыплаты");
	ПорядокВыплаты = 
		ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
			ОбщегоНазначения.ВыгрузитьКолонку(СпособыВыплатыВедомостей, "Значение", Истина), 
			"ХарактерВыплаты");
	ФинансированиеВедомостей = 
		ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
			МассивОбъектов, 
			"СтатьяФинансирования, СтатьяРасходов"); 
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ПервыйДокумент = Истина;
	Для Каждого ДокументСсылка Из МассивОбъектов Цикл
		
		Если ПорядокВыплаты[СпособыВыплатыВедомостей[ДокументСсылка]] = Перечисления.ХарактерВыплатыЗарплаты.Аванс Тогда
			ПечатнаяФормаДокумента = 
				Отчеты.АнализНачисленийИУдержанийАвансом.ПечатьТ49(ДокументСсылка, ФинансированиеВедомостей[ДокументСсылка]);
		Иначе
			ПечатнаяФормаДокумента = 
				Отчеты.АнализНачисленийИУдержаний.ПечатьТ49(ДокументСсылка, ФинансированиеВедомостей[ДокументСсылка]);
		КонецЕсли;
		
		Если ПервыйДокумент Тогда
			ДокументРезультат = ПечатнаяФормаДокумента;
			НомерСтрокиНачало = 1;
			ПервыйДокумент = Ложь;
		Иначе
			// Все документы нужно выводить на разных страницах.
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ДокументРезультат.ВысотаТаблицы + 1;
			// Добавим очередную ведомость к результирующему табличному документу
			ДокументРезультат.Вывести(ПечатнаяФормаДокумента);
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, НомерСтрокиНачало, ОбъектыПечати, ДокументСсылка);
		
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции

/// Места выплаты

Функция МестоВыплатыКасса(Ведомость) Экспорт
	
	МестоВыплаты = ВедомостьНаВыплатуЗарплаты.МестоВыплаты();
	
	СтандартнаяОбработка = Истина;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ВзаиморасчетыССотрудникамиУправленческий");
		Модуль.ПриПолученииМестаВыплатыВедомостиВКассу(Ведомость, МестоВыплаты, СтандартнаяОбработка);
	КонецЕсли;
	Если Не СтандартнаяОбработка Тогда
		Возврат МестоВыплаты
	КонецЕсли;
	
	МестоВыплаты.Вид      = Перечисления.ВидыМестВыплатыЗарплаты.Касса;
	МестоВыплаты.Значение = Ведомость.Касса;
	
	Возврат МестоВыплаты
	
КонецФункции

Процедура УстановитьМестоВыплатыКасса(Ведомость, Значение) Экспорт
	Ведомость.Касса = Значение;
КонецПроцедуры

//// Заполнение и расчет документа.

Функция МожноЗаполнитьЗарплату(Ведомость) Экспорт
	
	МожноЗаполнитьЗарплату = ВедомостьНаВыплатуЗарплатыБазовый.МожноЗаполнитьЗарплату(Ведомость);

	ПравилаПроверки = Новый Структура;
	ПравилаПроверки.Вставить("ПроцентВыплаты", НСтр("ru = 'Не задан размер выплаты в параметрах расчета';
													|en = 'Payment amount is not specified in the settlement parameters'"));
	
	Если СтатьяФинансированияОбязательна() Тогда
		ПравилаПроверки.Вставить(
			"СтатьяФинансирования", 
			НСтр("ru = 'Не указана статья финансирования';
				|en = 'Financing item is not specified'"));
	КонецЕсли;
	Если СтатьяРасходовОбязательна() Тогда	
		ПравилаПроверки.Вставить("СтатьяРасходов",
			?(ПолучитьФункциональнуюОпцию("РаботаВХозрасчетнойОрганизации"),
			НСтр("ru = 'Не указан способ расчетов с персоналом';
				|en = 'Payroll statement method is not specified'"),
			НСтр("ru = 'Не указана статья расходов';
				|en = 'Expense item is not specified'")));
	КонецЕсли;
		
	МожноЗаполнитьЗарплату = 
		ЗарплатаКадры.СвойстваЗаполнены(Ведомость, ПравилаПроверки)
		И МожноЗаполнитьЗарплату;

	ВидДокументаОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ведомость.СпособВыплаты, "ВидДокументаОснования");
	Если ЗначениеЗаполнено(ВидДокументаОснования) И Ведомость.Основания.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не выбраны документы-основания';
				|en = 'Base documents are not selected'"), 
			Ведомость, 
			"Основания");
		МожноЗаполнитьЗарплату = Ложь;	
	КонецЕсли;	
	
	Возврат МожноЗаполнитьЗарплату;

КонецФункции

Функция ПараметрыЗаполненияПоОбъекту(Объект) Экспорт
	ПараметрыЗаполнения = ВедомостьНаВыплатуЗарплатыБазовый.ПараметрыЗаполненияПоОбъекту(Объект);
	
	ПараметрыЗаполнения.ОписаниеОперации.ДокументыОснования = 
		Объект.Основания.Выгрузить(, "Документ").ВыгрузитьКолонку("Документ");	
		
	ПараметрыЗаполнения.ОтборСотрудников.ВидыДоговоров = Объект.СпособВыплаты.ГруппаВидовДоговоров;
	
	ПараметрыЗаполнения.ПараметрыРасчетаЗарплаты.ПроцентВыплаты = Объект.ПроцентВыплаты;
	
	ПараметрыЗаполнения.Финансирование.СтатьяФинансирования = Объект.СтатьяФинансирования;	
	ПараметрыЗаполнения.Финансирование.СтатьяРасходов       = Объект.СтатьяРасходов;	
	
	Возврат ПараметрыЗаполнения
КонецФункции

Процедура СоздатьВТСотрудникиДляВедомостиПоШапке(МенеджерВременныхТаблиц, ОписаниеОперации, ОтборСотрудников) Экспорт
	
	ИменаПромежуточныхВТ = Новый Массив;
	ИмяВТСотрудники = "";
	
	// Отбор сотрудников по документам-основаниям.
	СоздатьВТСотрудникиДляВедомостиПоОснованиям(МенеджерВременныхТаблиц, ОписаниеОперации, ИмяВТСотрудники);
	ИменаПромежуточныхВТ.Добавить(ИмяВТСотрудники);
	
	// Отбор сотрудников по организации и подразделению.
	СоздатьВТСотрудникиДляВедомостиПоМестуРаботы(МенеджерВременныхТаблиц, ОписаниеОперации, ОтборСотрудников, ИмяВТСотрудники);
	ИменаПромежуточныхВТ.Добавить(ИмяВТСотрудники);
	
	// Отбор по месту выплаты зарплаты.
	СоздатьВТСотрудникиДляВедомостиПоМестуВыплаты(МенеджерВременныхТаблиц, ОписаниеОперации, ОтборСотрудников, ИмяВТСотрудники);
	ИменаПромежуточныхВТ.Добавить(ИмяВТСотрудники);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаДляКадровыхДанных", ОписаниеОперации.Дата);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	&ДатаДляКадровыхДанных КАК Период
	|ПОМЕСТИТЬ ВТСотрудникиДляВедомости
	|ИЗ
	|	#ВТСотрудники КАК Сотрудники";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудники", ИмяВТСотрудники);
	
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, ИменаПромежуточныхВТ, Истина);
	
КонецПроцедуры	

Процедура СоздатьВТСотрудникиДляВедомостиПоОснованиям(МенеджерВременныхТаблиц, ОписаниеОперации, ИмяВТСотрудники = "") Экспорт
	
	Если ОписаниеОперации.ДокументыОснования.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("Основания", ОписаниеОперации.ДокументыОснования);	

		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗарплатаКВыплате.Сотрудник КАК Сотрудник,
		|	ЗарплатаКВыплате.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудникиПоОснованию
		|ИЗ
		|	РегистрНакопления.ЗарплатаКВыплате КАК ЗарплатаКВыплате
		|ГДЕ
		|	ЗарплатаКВыплате.Регистратор В(&Основания)";
		
		Запрос.Выполнить();
		
		ИмяВТСотрудники	= "ВТСотрудникиПоОснованию"
		
	Иначе
		
		ИмяВТСотрудники	= ""
		
	КонецЕсли
	
КонецПроцедуры

Процедура СоздатьВТСотрудникиДляВедомостиПоМестуРаботы(МенеджерВременныхТаблиц, ОписаниеОперации, ОтборСотрудников, ИмяВТСотрудники) Экспорт
	
	ПараметрыПолученияСотрудников = ПараметрыПолученияСотрудниковПоШапкеВедомости(ОписаниеОперации, ОтборСотрудников);

	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		МенеджерВременныхТаблиц, Истина, 
		ПараметрыПолученияСотрудников, 
		"ВТСотрудникиПоМестуРаботыПоШапкеВедомости");
		
	ИмяВТСотрудникиПоМестуРаботы = "ВТСотрудникиПоМестуРаботыПоШапкеВедомости";
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	// КадровыйУчет.СоздатьВТСотрудникиОрганизации возвращает всех сотрудников, работавших когда-либо
	// по переданному в параметрах подразделению. Сотрудники, работающие по договорам ГПХ
	// возвращаются без указания подразделения.
	// Поэтому необходимо дополнить сотрудников ГПХ подразделением и отобрать тех сотрудников,
	// которые работают в нужном подразделении на конец периода.
	Если ЗначениеЗаполнено(ПараметрыПолученияСотрудников.Подразделение) Тогда
	
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТСотрудникиОрганизацииПоДоговорамГПХ.Сотрудник КАК Сотрудник,
		|	&НачалоПериода КАК НачалоПериода,
		|	&ОкончаниеПериода КАК ОкончаниеПериода
		|ПОМЕСТИТЬ ВТСотрудникиПериоды
		|ИЗ
		|	ВТСотрудникиПоМестуРаботыПоШапкеВедомости КАК ВТСотрудникиОрганизацииПоДоговорамГПХ
		|ГДЕ
		|	ВТСотрудникиОрганизацииПоДоговорамГПХ.Подразделение ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("НачалоПериода", ОписаниеОперации.ПериодРегистрации);
		Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ОписаниеОперации.ПериодРегистрации));
		Запрос.Выполнить();
		
		ПараметрыПоВременнойТаблице = КадровыйУчет.ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоВременнойТаблице(
			"ВТСотрудникиПериоды", "Сотрудник", "НачалоПериода", "ОкончаниеПериода");
		ПараметрыПоВременнойТаблице.РаботникиПоДоговорамГПХ = Истина;
		ПараметрыПоВременнойТаблице.РаботникиПоТрудовымДоговорам = Неопределено;
		
		КадровыйУчет.СоздатьВТРабочиеМестаСотрудниковПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц, Ложь, 
			ПараметрыПоВременнойТаблице, "ВТРабочиеМестаСотрудниковГПХ");
			
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиПоМестуРаботыПоШапкеВедомости.Сотрудник КАК Сотрудник,
		|	СотрудникиПоМестуРаботыПоШапкеВедомости.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА СотрудникиПоМестуРаботыПоШапкеВедомости.Подразделение ЕСТЬ NULL
		|			ТОГДА РабочиеМестаСотрудниковГПХ.Подразделение
		|		ИНАЧЕ СотрудникиПоМестуРаботыПоШапкеВедомости.Подразделение
		|	КОНЕЦ КАК Подразделение
		|ПОМЕСТИТЬ ВТСотрудникиПоМестуРаботыСГПХ
		|ИЗ
		|	ВТСотрудникиПоМестуРаботыПоШапкеВедомости КАК СотрудникиПоМестуРаботыПоШапкеВедомости
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочиеМестаСотрудниковГПХ КАК РабочиеМестаСотрудниковГПХ
		|		ПО СотрудникиПоМестуРаботыПоШапкеВедомости.Сотрудник = РабочиеМестаСотрудниковГПХ.Сотрудник
		|			И СотрудникиПоМестуРаботыПоШапкеВедомости.ФизическоеЛицо = РабочиеМестаСотрудниковГПХ.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСотрудникиПериоды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСотрудникиПоМестуРаботыПоШапкеВедомости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТРабочиеМестаСотрудниковГПХ";
		
		Запрос.Выполнить();
		
		ИмяВТСотрудникиПоМестуРаботы = "ВТСотрудникиПоМестуРаботыСГПХ";

		Запрос.УстановитьПараметр("Подразделение", ПараметрыПолученияСотрудников.Подразделение);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТСотрудникиОтносящиесяКПодразделению
		|ИЗ
		|	#ВТСотрудникиПоМестуРаботы КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Подразделение В ИЕРАРХИИ(&Подразделение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ #ВТСотрудникиПоМестуРаботы";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудникиПоМестуРаботы", ИмяВТСотрудникиПоМестуРаботы);
		
		Запрос.Выполнить();

		ИмяВТСотрудникиПоМестуРаботы = "ВТСотрудникиОтносящиесяКПодразделению";
		
	КонецЕсли;	
	
	// если передан список сотрудников, берем только присутствующих в нем
	Если ЗначениеЗаполнено(ИмяВТСотрудники) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТВходящиеСотрудникиПоМестуРаботы
		|ИЗ
		|	#ВТСотрудникиПоМестуРаботы КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВТСотрудники КАК ВходящиеСотрудники
		|		ПО Сотрудники.Сотрудник = ВходящиеСотрудники.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ #ВТСотрудникиПоМестуРаботы";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудникиПоМестуРаботы", ИмяВТСотрудникиПоМестуРаботы);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудники", ИмяВТСотрудники);
		
		Запрос.Выполнить();

		ИмяВТСотрудникиПоМестуРаботы = "ВТВходящиеСотрудникиПоМестуРаботы";
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.Подразделение
	|ПОМЕСТИТЬ ВТСотрудникиПоМестуРаботы
	|ИЗ
	|	#ВТСотрудникиПоМестуРаботы КАК Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ #ВТСотрудникиПоМестуРаботы";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудникиПоМестуРаботы", ИмяВТСотрудникиПоМестуРаботы);
	
	Запрос.Выполнить();
	
	ИмяВТСотрудники = "ВТСотрудникиПоМестуРаботы"
	
КонецПроцедуры

Процедура СоздатьВТСотрудникиДляВедомостиПоМестуВыплаты(МенеджерВременныхТаблиц, ОписаниеОперации, ОтборСотрудников, ИмяВТСотрудники)
	
	МестоВыплаты = ОтборСотрудников.МестоВыплаты;
	
	Если НЕ ЗначениеЗаполнено(МестоВыплаты.Вид) Тогда
		Возврат
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",	ОписаниеОперации.Организация);
	Запрос.УстановитьПараметр("ВидМестаВыплаты",МестоВыплаты.Вид);
	Запрос.УстановитьПараметр("ВсеМестаВыплаты",НЕ ЗначениеЗаполнено(МестоВыплаты.Значение));
	Запрос.УстановитьПараметр("МестоВыплаты",	МестоВыплаты.Значение);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.Подразделение
	|ПОМЕСТИТЬ ВТСотрудникиПоМестуВыплаты
	|ИЗ
	|	#ВТСотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестаВыплатыЗарплатыОрганизаций КАК МестаВыплатыЗарплатыОрганизаций
	|		ПО (МестаВыплатыЗарплатыОрганизаций.Организация = &Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестаВыплатыЗарплатыПодразделений КАК МестаВыплатыЗарплатыПодразделений
	|		ПО (МестаВыплатыЗарплатыПодразделений.Подразделение = Сотрудники.Подразделение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестаВыплатыЗарплатыСотрудников КАК МестаВыплатыЗарплатыСотрудников
	|		ПО (МестаВыплатыЗарплатыСотрудников.Сотрудник = Сотрудники.Сотрудник)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА МестаВыплатыЗарплатыСотрудников.Вид ЕСТЬ НЕ NULL 
	|				ТОГДА МестаВыплатыЗарплатыСотрудников.Вид
	|			КОГДА МестаВыплатыЗарплатыПодразделений.Вид ЕСТЬ НЕ NULL 
	|				ТОГДА МестаВыплатыЗарплатыПодразделений.Вид
	|			КОГДА МестаВыплатыЗарплатыОрганизаций.Вид ЕСТЬ НЕ NULL 
	|				ТОГДА МестаВыплатыЗарплатыОрганизаций.Вид
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыМестВыплатыЗарплаты.Касса)
	|		КОНЕЦ = &ВидМестаВыплаты
	|	И (&ВсеМестаВыплаты
	|			ИЛИ ВЫБОР
	|				КОГДА МестаВыплатыЗарплатыСотрудников.МестоВыплаты ЕСТЬ НЕ NULL 
	|						И МестаВыплатыЗарплатыСотрудников.МестоВыплаты <> НЕОПРЕДЕЛЕНО
	|					ТОГДА ВЫБОР
	|							КОГДА МестаВыплатыЗарплатыСотрудников.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыМестВыплатыЗарплаты.БанковскийСчет)
	|								ТОГДА МестаВыплатыЗарплатыСотрудников.МестоВыплаты.Банк
	|							ИНАЧЕ МестаВыплатыЗарплатыСотрудников.МестоВыплаты
	|						КОНЕЦ
	|				КОГДА МестаВыплатыЗарплатыПодразделений.МестоВыплаты ЕСТЬ НЕ NULL 
	|						И МестаВыплатыЗарплатыПодразделений.МестоВыплаты <> НЕОПРЕДЕЛЕНО
	|					ТОГДА МестаВыплатыЗарплатыПодразделений.МестоВыплаты
	|				КОГДА МестаВыплатыЗарплатыОрганизаций.МестоВыплаты ЕСТЬ НЕ NULL 
	|						И МестаВыплатыЗарплатыОрганизаций.МестоВыплаты <> НЕОПРЕДЕЛЕНО
	|					ТОГДА МестаВыплатыЗарплатыОрганизаций.МестоВыплаты
	|			КОНЕЦ = &МестоВыплаты)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудники", ИмяВТСотрудники);
	
	Запрос.Выполнить();
	
	ИмяВТСотрудники = "ВТСотрудникиПоМестуВыплаты"
		
КонецПроцедуры	

Процедура СоздатьВТСотрудникиДляВедомостиПоФизическимЛицам(МенеджерВременныхТаблиц, ФизическиеЛица, ОписаниеОперации, ОтборСотрудников) Экспорт
	
	ПараметрыПолученияСотрудников = ПараметрыПолученияСотрудниковПоШапкеВедомости(ОписаниеОперации, ОтборСотрудников);
	
	ПараметрыПолученияСотрудников.СписокФизическихЛиц = ФизическиеЛица;
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		МенеджерВременныхТаблиц, Истина, 
		ПараметрыПолученияСотрудников, 
		"ВТСотрудникиДляВедомости");
		
КонецПроцедуры	

Функция ПараметрыПолученияСотрудниковПоШапкеВедомости(ОписаниеОперации, ОтборСотрудников)
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	
	// сотрудники, операции по которым завершены - не нужны
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыПолученияСотрудников.Отборы, 
		"ВАрхиве", "=", Ложь);
	
	Перечисления.ГруппыВидовДоговоровССотрудникамиДляВыплатыЗарплаты.ЗаполнитьПараметрыПолученияСотрудниковОрганизаций(
		ПараметрыПолученияСотрудников,
		ОтборСотрудников.ВидыДоговоров);
	
	Если ОписаниеОперации.ПорядокВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Аванс Тогда
		// аванс - только работающим на дату ведомости
		НачалоПериода 		= НачалоДня(ОписаниеОперации.Дата);
		ОкончаниеПериода	= КонецДня(ОписаниеОперации.Дата);
		ПараметрыПолученияСотрудников.РаботникиПоДоговорамГПХ = Неопределено;
	ИначеЕсли ОписаниеОперации.ПорядокВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Межрасчет Тогда 
		НачалоПериода 		=  '00010101';
		ОкончаниеПериода	=  МИН(КонецМесяца(ОписаниеОперации.ПериодРегистрации), ОписаниеОперации.Дата);
	Иначе
		НачалоПериода 		=  '00010101';
		ОкончаниеПериода	=  КонецМесяца(ОписаниеОперации.ПериодРегистрации);
	КонецЕсли;	
	
	ПараметрыПолученияСотрудников.Организация   = ОписаниеОперации.Организация;
	ПараметрыПолученияСотрудников.Подразделение = ОтборСотрудников.Подразделение;
	ПараметрыПолученияСотрудников.НачалоПериода    = НачалоПериода;
	ПараметрыПолученияСотрудников.ОкончаниеПериода = ОкончаниеПериода;
	
	ПараметрыПолученияСотрудников.КадровыеДанные = "Подразделение";	
	
	КадровыйУчетРасширенный.ПрименитьОтборПоФункциональнойОпцииВыполнятьРасчетЗарплатыПоПодразделениям(ПараметрыПолученияСотрудников);
	
	Возврат ПараметрыПолученияСотрудников
	
КонецФункции

///// Обработчики событий модуля объекта документов Ведомости.

Процедура ОбработкаПроверкиЗаполнения(ДокументОбъект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	ПроверяемыеКолонки   = Новый Соответствие;
	
	// Когда в документе заполнена статья, дополнительно контролируем, 
	// что в таблице зарплаты используются только указанные статьи из шапки.
	
	Если ЗначениеЗаполнено(ДокументОбъект.СтатьяФинансирования) Тогда 
		ПроверяемыеКолонки.Вставить(
			"СтатьяФинансирования", 
			НРег(Метаданные.Справочники.СтатьиФинансированияЗарплата.ПредставлениеОбъекта));
	КонецЕсли;	
	Если ЗначениеЗаполнено(ДокументОбъект.СтатьяРасходов) Тогда 
		ПроверяемыеКолонки.Вставить(
			"СтатьяРасходов",
			НРег(ПредставлениеРеквизитаСтатьяРасходов()));
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ПроверяемыеКолонки) Тогда
		
		Колонки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ИдентификаторСтроки");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			Колонки, 
			ОбщегоНазначения.ВыгрузитьКолонку(ПроверяемыеКолонки, "Ключ"));
		Колонки = СтрСоединить(Колонки, ",");
		Зарплата = ДокументОбъект.Зарплата.Выгрузить(, Колонки);
		Зарплата.Свернуть(Колонки);
		Зарплата.Индексы.Добавить("ИдентификаторСтроки");
		
		Для Каждого СтрокаСостава Из ДокументОбъект.Состав Цикл
			ЗарплатаСтроки = 
				Зарплата.Скопировать(
					Новый Структура("ИдентификаторСтроки", СтрокаСостава.ИдентификаторСтроки));
			ОшибкаФинансированияСтроки = Ложь;
			Для Каждого ПроверяемаяКолонка Из ПроверяемыеКолонки Цикл
				СтатьиСтроки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ЗарплатаСтроки.ВыгрузитьКолонку(ПроверяемаяКолонка.Ключ));
				Если СтатьиСтроки.Количество() > 1 Или СтатьиСтроки[0] <> ДокументОбъект[ПроверяемаяКолонка.Ключ] Тогда
					ОбщегоНазначения.СообщитьПользователю(
						СтрШаблон(
							НСтр("ru = 'У сотрудника %1 %2 не совпадает с ведомостью.';
								|en = 'Employee %1 %2 does not correspond to one in the paysheet.'"), 
							СтрокаСостава.ФизическоеЛицо,
							ПроверяемаяКолонка.Значение), 
						ДокументОбъект, 
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Состав", СтрокаСостава.НомерСтроки, "ФизическоеЛицо"),,
						Отказ);
				КонецЕсли	
			КонецЦикла;	
		КонецЦикла;
		
	КонецЕсли;	
	
	// Заполнение статей контролируем, только когда включена проверка обязательности.
	ИсключаемыеРеквизиты = Новый Массив;
	Если Не СтатьяФинансированияОбязательна() Тогда
		ИсключаемыеРеквизиты.Добавить("СтатьяФинансирования");
	КонецЕсли;
	Если Не СтатьяРасходовОбязательна() Тогда	
		ИсключаемыеРеквизиты.Добавить("СтатьяРасходов");
	КонецЕсли;	
	Если ЗначениеЗаполнено(ИсключаемыеРеквизиты) Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ИсключаемыеРеквизиты);
	КонецЕсли;	
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры") Тогда
		Если НачалоДня(ДокументОбъект.Дата) > ВедомостьНаВыплатуЗарплатыКлиентСервер.ДатаВыплаты(ДокументОбъект) Тогда
			ТекстОшибки = НСтр("ru = 'Дата выплаты не может быть меньше даты документа';
								|en = 'Payment date cannot be less than the document date'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОбъект, "ДатаВыплаты",, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	ВедомостьНаВыплатуЗарплатыБазовый.ОбработкаПроверкиЗаполнения(ДокументОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ЗарегистрироватьВыплатуВУчетеНДФЛ(Ведомость, Отказ) Экспорт
	
	// Регистрация выдачи зарплаты.
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры") Тогда
		
		ЗарегистрироватьВыданнуюЗарплату(Ведомость, Отказ);
		
		ЗарегистрироватьУдержанныеНалоги(Ведомость, Отказ);
		
		Если Ведомость.ПеречислениеНДФЛВыполнено Тогда
			ЗарегистрироватьПеречислениеНДФЛ(Ведомость, Отказ);
		КонецЕсли;
		
	Иначе
		
		ВедомостьНаВыплатуЗарплаты.ЗарегистрироватьНДФЛКПеречислению(
			Ведомость, Отказ, 
			ЗарплатаКадры.НаборыЗаписейРегистратора(Ведомость.Метаданные()));
		
	КонецЕсли
	
КонецПроцедуры

Процедура ЗарегистрироватьВыданнуюЗарплату(Ведомость, Отказ = Ложь)
	
	// Выданную зарплату берем по движениям в р.н. ВзаиморасчетыССотрудниками
	Зарплата = ВзаиморасчетыССотрудниками.НоваяТаблицаВыданнойЗарплаты();
	Для Каждого Запись Из Ведомость.Движения.ВзаиморасчетыССотрудниками Цикл
		СтрокаЗарплаты = Зарплата.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗарплаты, Запись);
		СтрокаЗарплаты.Сумма = Запись.СуммаВзаиморасчетов
	КонецЦикла;	
	
	ПорядокВыплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ведомость.СпособВыплаты, "ХарактерВыплаты");
	
	ВзаиморасчетыССотрудниками.ЗарегистрироватьВыданнуюЗарплату(
		Ведомость.Движения, 
		Отказ, 
		Ведомость.Организация, 
		ВедомостьНаВыплатуЗарплатыКлиентСервер.ДатаВыплаты(Ведомость), Зарплата, ПорядокВыплаты); 
	
КонецПроцедуры
	
Процедура ЗарегистрироватьУдержанныеНалоги(Ведомость, Отказ = Ложь)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	УчетФактическиПолученныхДоходов.СоздатьВТНалогУдержанный(
		МенеджерВременныхТаблиц, 
		Ведомость.НДФЛ, 
		ВедомостьНаВыплатуЗарплатыКлиентСервер.ДатаВыплаты(Ведомость)); 
	
	ВедомостьНаВыплатуЗарплаты.СоздатьВТСписокСотрудниковПоТаблицеЗарплат(
		МенеджерВременныхТаблиц, 
		Ведомость.Зарплата, 
		Ведомость.Организация, 
		Ведомость.ПериодРегистрации, 
		Ведомость.Ссылка,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ведомость.СпособВыплаты, "ОкончательныйРасчетНДФЛ"));
		
	МежрасчетныеВыплаты = ВедомостьНаВыплатуЗарплаты.МежрасчетныеВыплатыДляНФДЛПоДокументу(Ведомость);
	
	УчетНДФЛ.ЗарегистрироватьУдержанныйНалогПриВыплате(
		Ведомость.Движения, Отказ, 
		Ведомость.Организация, Ведомость.Дата, 
		ВедомостьНаВыплатуЗарплатыКлиентСервер.ДатаВыплаты(Ведомость), 
		МенеджерВременныхТаблиц, 
		Ведомость.Ссылка, 
		МежрасчетныеВыплаты);
		
КонецПроцедуры

Процедура ЗарегистрироватьПеречислениеНДФЛ(Ведомость, Отказ = Ложь)
	
	УчетНДФЛРасширенный.ЗарегистрироватьНДФЛПеречисленныйПоПлатежномуДокументу(
		Ведомость.Движения, 
		Отказ, 
		Ведомость.Организация, 
		ВедомостьНаВыплатуЗарплатыКлиентСервер.ДатаВыплаты(Ведомость), 
		Ведомость.ПеречислениеНДФЛРеквизиты);
	УчетНДФЛ.СформироватьНДФЛПеречисленный(Ведомость.Движения, Отказ);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.РасчетыСБюджетомПоНДФЛ") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("РасчетыСБюджетомПоНДФЛ");
		Модуль.РасчетыСБюджетомПоНДФЛЗарегистрироватьНДФЛПеречисленный(Ведомость.Движения, Отказ);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обслуживание обработки ПлатежиПоРезультатамРасчетаЗарплаты.

// Возвращает список проведенных ведомостей, у которых сумма к выплате не равна нулю.
//
// Параметры:
//		Организации - Массив - содержит ссылки на организации (СправочникСсылка.Организации)
//								по которым получается список ведомостей.
//		МесяцНачисления - Дата 
//		ШаблонСпискаВедомостей - ТаблицаЗначений, пустая таблица, используется как шаблон для выходных данных.
//
// Возвращаемое значение:
//		Структура
//			*Касса - таблица значений, колонки таблицы соответствуют таблице ШаблонСпискаВедомостей
//				** Организация 		- СправочникСсылка.Организации
//				** МестоВыплаты 	- Строка или СправочникСсылка.Кассы
//				** СпособВыплаты 	- СправочникСсылка.СпособыВыплатыЗарплаты
//				** Сумма 			- Число
//				** Ведомость 		- Строка
//				** СтатьяФинансирования - СправочникСсылка.СтатьиФинансированияЗарплата
//				** СтатьяРасходов 		- СправочникСсылка.СтатьиРасходовЗарплата
//			*Банк - таблица значений
//				** Организация 		- СправочникСсылка.Организации
//				** МестоВыплаты 	- Строка или СправочникСсылка.ЗарплатныеПроекты или СправочникСсылка.КлассификаторБанков
//				** СпособВыплаты 	- СправочникСсылка.СпособыВыплатыЗарплаты
//				** Сумма 			- Число
//				** Ведомость 		- Строка
//				** СтатьяФинансирования - СправочникСсылка.СтатьиФинансированияЗарплата
//				** СтатьяРасходов 		- СправочникСсылка.СтатьиРасходовЗарплата
//
Функция ВедомостиОрганизацийЗаМесяцДляПлатежейПоРезультатамРасчета(Организации, МесяцНачисления, ШаблонСпискаВедомостей) Экспорт
	
	ВедомостиЗаМесяц = Новый Структура("Касса,Банк");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(МесяцНачисления));
	Запрос.УстановитьПараметр("КассаНеУказана", "<" + НСтр("ru = 'Касса не указана';
															|en = 'Cash account is not specified'") + ">");
	Запрос.УстановитьПараметр("ЗарплатныйПроектНеУказан", "<" + НСтр("ru = 'Зарплатный проект не указан';
																	|en = 'Payroll card program is not specified'") + ">");
	Запрос.УстановитьПараметр("БанкНеУказан", "<" + НСтр("ru = 'Банк не указан';
														|en = 'Bank is not specified'") + ">");
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ведомость.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Ведомость.Касса = ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА &КассаНеУказана
	|		ИНАЧЕ Ведомость.Касса
	|	КОНЕЦ КАК МестоВыплаты,
	|	Ведомость.СпособВыплаты КАК СпособВыплаты,
	|	Ведомость.СуммаПоДокументу КАК Сумма,
	|	ПРЕДСТАВЛЕНИЕ(Ведомость.Ссылка) КАК Ведомость,
	|	Ведомость.Дата КАК Дата,
	|	Ведомость.Ссылка КАК Ссылка,
	|	Ведомость.СтатьяФинансирования КАК СтатьяФинансирования,
	|	Ведомость.СтатьяРасходов КАК СтатьяРасходов
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВКассу КАК Ведомость
	|ГДЕ
	|	Ведомость.ПериодРегистрации = &ПериодРегистрации
	|	И Ведомость.Организация В(&Организации)
	|	И Ведомость.Проведен
	|	И Ведомость.СуммаПоДокументу <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Ведомость.Организация,
	|	Ведомость.Раздатчик,
	|	Ведомость.СпособВыплаты,
	|	Ведомость.СуммаПоДокументу,
	|	ПРЕДСТАВЛЕНИЕ(Ведомость.Ссылка),
	|	Ведомость.Дата,
	|	Ведомость.Ссылка,
	|	Ведомость.СтатьяФинансирования,
	|	Ведомость.СтатьяРасходов
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком КАК Ведомость
	|ГДЕ
	|	Ведомость.ПериодРегистрации = &ПериодРегистрации
	|	И Ведомость.Организация В(&Организации)
	|	И Ведомость.Проведен
	|	И Ведомость.СуммаПоДокументу <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	СтатьяФинансирования,
	|	СтатьяРасходов,
	|	Дата,
	|	МестоВыплаты,
	|	СпособВыплаты,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ведомость.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Ведомость.ЗарплатныйПроект = ЗНАЧЕНИЕ(Справочник.ЗарплатныеПроекты.ПустаяСсылка)
	|			ТОГДА &ЗарплатныйПроектНеУказан
	|		ИНАЧЕ Ведомость.ЗарплатныйПроект
	|	КОНЕЦ КАК МестоВыплаты,
	|	Ведомость.СпособВыплаты КАК СпособВыплаты,
	|	Ведомость.СуммаПоДокументу КАК Сумма,
	|	ПРЕДСТАВЛЕНИЕ(Ведомость.Ссылка) КАК Ведомость,
	|	Ведомость.Дата КАК Дата,
	|	Ведомость.Ссылка КАК Ссылка,
	|	Ведомость.СтатьяФинансирования КАК СтатьяФинансирования,
	|	Ведомость.СтатьяРасходов КАК СтатьяРасходов
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВБанк КАК Ведомость
	|ГДЕ
	|	Ведомость.ПериодРегистрации = &ПериодРегистрации
	|	И Ведомость.Организация В(&Организации)
	|	И Ведомость.Проведен
	|	И Ведомость.СуммаПоДокументу <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Ведомость.Организация,
	|	ВЫБОР
	|		КОГДА Ведомость.Банк = ЗНАЧЕНИЕ(Справочник.КлассификаторБанков.ПустаяСсылка)
	|			ТОГДА &БанкНеУказан
	|		ИНАЧЕ Ведомость.Банк
	|	КОНЕЦ,
	|	Ведомость.Ссылка.СпособВыплаты,
	|	Ведомость.СуммаПоДокументу,
	|	ПРЕДСТАВЛЕНИЕ(Ведомость.Ссылка),
	|	Ведомость.Дата,
	|	Ведомость.Ссылка,
	|	Ведомость.СтатьяФинансирования,
	|	Ведомость.СтатьяРасходов
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыПеречислением КАК Ведомость
	|ГДЕ
	|	Ведомость.ПериодРегистрации = &ПериодРегистрации
	|	И Ведомость.Организация В(&Организации)
	|	И Ведомость.Проведен
	|	И Ведомость.СуммаПоДокументу <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	СтатьяФинансирования,
	|	СтатьяРасходов,
	|	Дата,
	|	МестоВыплаты,
	|	СпособВыплаты,
	|	Ссылка";
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВедомостиКасса = ШаблонСпискаВедомостей.СкопироватьКолонки();
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ВедомостиКасса.Добавить(), Выборка);
	КонецЦикла;
	ВедомостиЗаМесяц.Касса = ВедомостиКасса;
	
	ВедомостиБанк = ШаблонСпискаВедомостей.СкопироватьКолонки();
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ВедомостиБанк.Добавить(), Выборка);
	КонецЦикла;
	ВедомостиЗаМесяц.Банк = ВедомостиБанк;
	
	Возврат ВедомостиЗаМесяц;
	
КонецФункции

#КонецОбласти
