
//&НаСервереБезКонтекста
//&ИзменениеИКонтроль("ТекстЗапросаОбороты")
//Функция ллл_ТекстЗапросаОбороты()

//	Возврат 
//	#Вставка
//	"ВЫБРАТЬ
//	|	ПредставлениеПлатежногоКалендаря.Дата КАК Дата,
//	|	ПредставлениеПлатежногоКалендаря.Организация КАК Организация,
//	|	ПредставлениеПлатежногоКалендаря.БанковскийСчет КАК БанковскийСчет,
//	|	ПредставлениеПлатежногоКалендаря.Банк КАК Банк,
//	|	ПредставлениеПлатежногоКалендаря.ПулЛиквидности КАК ПулЛиквидности,
//	|	ПредставлениеПлатежногоКалендаря.Валюта КАК Валюта,
//	|	ВЫБОР
//	|		КОГДА &СворачиватьНеуправляемыеСписания
//	|				И ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря = ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.НеуправляемоеСписаниеСредств)
//	|			ТОГДА ""К списанию""
//	|		ИНАЧЕ ПредставлениеПлатежногоКалендаря.Инструмент
//	|	КОНЕЦ КАК Инструмент,
//	|	ПредставлениеПлатежногоКалендаря.Приоритет КАК Приоритет,
//	|	СУММА(ВЫБОР
//	|			КОГДА ПредставлениеПлатежногоКалендаря.Сумма > 0
//	|				ТОГДА ПредставлениеПлатежногоКалендаря.Сумма * ЕСТЬNULL(МатрицаВесовЛиквидности.Вес, 1)
//	|			ИНАЧЕ 0
//	|		КОНЕЦ) КАК СуммаПриход,
//	|	СУММА(ВЫБОР
//	|			КОГДА ПредставлениеПлатежногоКалендаря.Сумма < 0
//	|				ТОГДА -ПредставлениеПлатежногоКалендаря.Сумма * ЕСТЬNULL(МатрицаВесовЛиквидности.Вес, 1)
//	|			ИНАЧЕ 0
//	|		КОНЕЦ) КАК СуммаРасход,
//	|	ВЫБОР
//	|		КОГДА &СворачиватьНеуправляемыеСписания
//	|				И ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря = ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.НеуправляемоеСписаниеСредств)
//	|			ТОГДА НЕОПРЕДЕЛЕНО
//	|		ИНАЧЕ ПредставлениеПлатежногоКалендаря.ИдентификаторЗаписи
//	|	КОНЕЦ КАК ИдентификаторЗаписи,
//	|	ПредставлениеПлатежногоКалендаря.Дата < &НачалоПериодаОтбора
//	|		ИЛИ ПредставлениеПлатежногоКалендаря.КрайняяДата <> ДАТАВРЕМЯ(1, 1, 1)
//	|			И ПредставлениеПлатежногоКалендаря.Дата > ПредставлениеПлатежногоКалендаря.КрайняяДата КАК ПросроченнаяОперация,
//	|	ВЫБОР
//	|		КОГДА ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря = ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.НеуправляемоеСписаниеСредств)
//	|				ИЛИ ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря = ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.НеуправляемоеПоступлениеСредств)
//	|			ТОГДА 0
//	|		КОГДА ПредставлениеПлатежногоКалендаря.ФиксированныйБанковскийСчет
//	|			ТОГДА 1
//	|		ИНАЧЕ 2
//	|	КОНЕЦ КАК ИндексКартинки,
//	|	ВЫБОР
//	|		КОГДА ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря = ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.НеуправляемоеСписаниеСредств)
//	|			ТОГДА 10000
//	|		ИНАЧЕ 0
//	|	КОНЕЦ + ВЫБОР
//	|		КОГДА &ОтображатьПоступленияПередСписаниями
//	|				И ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря В (ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.ПоступлениеСредств), ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.НеуправляемоеПоступлениеСредств))
//	|			ТОГДА 1000
//	|		ИНАЧЕ 0
//	|	КОНЕЦ + ВЫБОР
//	|		КОГДА НЕ &ОтображатьПоступленияПередСписаниями
//	|				И ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря = ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.СписаниеСредств)
//	|			ТОГДА 1000
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК ПолеУпорядочиванияРаздел,
//	|	ПредставлениеПлатежногоКалендаря.Приоритет.РеквизитДопУпорядочивания КАК ПолеУпорядочиванияПриоритет,
//	|	ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря КАК РазделПлатежногоКалендаря
//	|ИЗ
//	|	РегистрСведений.ПредставлениеПлатежногоКалендаря КАК ПредставлениеПлатежногоКалендаря
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МатрицаВесовЛиквидности КАК МатрицаВесовЛиквидности
//	|		ПО (ПредставлениеПлатежногоКалендаря.ИсточникДанных = МатрицаВесовЛиквидности.Источник)
//	|			И (ВЫБОР
//	|				КОГДА ПредставлениеПлатежногоКалендаря.Сумма > 0
//	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
//	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
//	|			КОНЕЦ = МатрицаВесовЛиквидности.ПриходРасход)
//	|			И (ВЫБОР
//	|				КОГДА ПредставлениеПлатежногоКалендаря.Дата > &ГоризонтТактическогоПланирования
//	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ГоризонтыПланированияЛиквидности.ПерспективноеПланирование)
//	|				КОГДА ПредставлениеПлатежногоКалендаря.Дата > &ГоризонтОперативногоПланирования
//	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ГоризонтыПланированияЛиквидности.ТактическоеПланирование)
//	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ГоризонтыПланированияЛиквидности.ОперативноеПланирование)
//	|			КОНЕЦ = МатрицаВесовЛиквидности.ГоризонтПланированияЛиквидности)
//	|ГДЕ
//	|	ПредставлениеПлатежногоКалендаря.Пользователь = &Пользователь
//	|	И ПредставлениеПлатежногоКалендаря.Активна
//	|	И ПредставлениеПлатежногоКалендаря.ВерсияПлатежногоКалендаря = &ВерсияПлатежногоКалендаря
//	|	И ЕСТЬNULL(МатрицаВесовЛиквидности.Вес, 1) <> 0
//	|	И ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря В (ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.ПоступлениеСредств), ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.СписаниеСредств), ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.НеуправляемоеСписаниеСредств), ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.НеуправляемоеПоступлениеСредств))
//	|	И &ДополнительныеОтборы
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ПредставлениеПлатежногоКалендаря.Дата,
//	|	ПредставлениеПлатежногоКалендаря.Организация,
//	|	ПредставлениеПлатежногоКалендаря.БанковскийСчет,
//	|	ПредставлениеПлатежногоКалендаря.Банк,
//	|	ПредставлениеПлатежногоКалендаря.ПулЛиквидности,
//	|	ПредставлениеПлатежногоКалендаря.Валюта,
//	|	ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря,
//	|	ПредставлениеПлатежногоКалендаря.Приоритет,
//	|	ПредставлениеПлатежногоКалендаря.Дата < &НачалоПериодаОтбора
//	|		ИЛИ ПредставлениеПлатежногоКалендаря.КрайняяДата <> ДАТАВРЕМЯ(1, 1, 1)
//	|			И ПредставлениеПлатежногоКалендаря.Дата > ПредставлениеПлатежногоКалендаря.КрайняяДата,
//	|	ВЫБОР
//	|		КОГДА ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря = ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.НеуправляемоеСписаниеСредств)
//	|				ИЛИ ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря = ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.НеуправляемоеПоступлениеСредств)
//	|			ТОГДА 0
//	|		КОГДА ПредставлениеПлатежногоКалендаря.ФиксированныйБанковскийСчет
//	|			ТОГДА 1
//	|		ИНАЧЕ 2
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА &СворачиватьНеуправляемыеСписания
//	|				И ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря = ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.НеуправляемоеСписаниеСредств)
//	|			ТОГДА ""К списанию""
//	|		ИНАЧЕ ПредставлениеПлатежногоКалендаря.Инструмент
//	|	КОНЕЦ,
//	|	ПредставлениеПлатежногоКалендаря.Приоритет.РеквизитДопУпорядочивания,
//	|	ВЫБОР
//	|		КОГДА &СворачиватьНеуправляемыеСписания
//	|				И ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря = ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.НеуправляемоеСписаниеСредств)
//	|			ТОГДА НЕОПРЕДЕЛЕНО
//	|		ИНАЧЕ ПредставлениеПлатежногоКалендаря.ИдентификаторЗаписи
//	|	КОНЕЦ
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ПредставлениеПлатежногоКалендаря.Дата,
//	|	ПредставлениеПлатежногоКалендаря.Организация,
//	|	ПредставлениеПлатежногоКалендаря.БанковскийСчет,
//	|	ПредставлениеПлатежногоКалендаря.Банк,
//	|	ПредставлениеПлатежногоКалендаря.ПулЛиквидности,
//	|	ПредставлениеПлатежногоКалендаря.Валюта,
//	|	ПредставлениеПлатежногоКалендаря.Инструмент,
//	|	ПредставлениеПлатежногоКалендаря.Приоритет,
//	|	ПредставлениеПлатежногоКалендаря.СуммаПриход,
//	|	ПредставлениеПлатежногоКалендаря.СуммаРасход,
//	|	ПредставлениеПлатежногоКалендаря.ИдентификаторЗаписи,
//	|	ПредставлениеПлатежногоКалендаря.ПросроченнаяОперация,
//	|	ПредставлениеПлатежногоКалендаря.ИндексКартинки,
//	|	ПредставлениеПлатежногоКалендаря.ПолеУпорядочиванияРаздел,
//	|	ПредставлениеПлатежногоКалендаря.ПолеУпорядочиванияПриоритет,
//	|	ПредставлениеПлатежногоКалендаря.РазделПлатежногоКалендаря
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		ЗаявкаДок.Ссылка.ЖелательнаяДатаПлатежа КАК Дата,
//	|		ЗаявкаДок.Ссылка.Организация КАК Организация,
//	|		ЗаявкаДок.Ссылка.БанковскийСчет КАК БанковскийСчет,
//	|		ЗаявкаДок.Ссылка.БанковскийСчет.Банк КАК Банк,
//	|		Значение(Справочник.ПулыЛиквидности.ПустаяСсылка) КАК ПулЛиквидности,
//	|		ЗаявкаДок.Ссылка.Валюта КАК Валюта,
//	|		ЗаявкаДок.Ссылка КАК Инструмент,//  ""Черновик №"" + ЗаявкаДок.Ссылка.Номер
//	|		ЗаявкаДок.Ссылка.Приоритет КАК Приоритет,
//	|		СУММА(ВЫБОР
//	|				КОГДА ЗаявкаДок.Сумма < 0
//	|					ТОГДА -ЗаявкаДок.Сумма * ЕСТЬNULL(МатрицаВесовЛиквидности.Вес, 1)
//	|				ИНАЧЕ 0
//	|			КОНЕЦ) КАК СуммаПриход,
//	|		СУММА(ВЫБОР
//	|				КОГДА ЗаявкаДок.Сумма > 0
//	|					ТОГДА ЗаявкаДок.Сумма * ЕСТЬNULL(МатрицаВесовЛиквидности.Вес, 1)
//	|				ИНАЧЕ 0
//	|			КОНЕЦ) КАК СуммаРасход,
//	|		НЕОПРЕДЕЛЕНО КАК ИдентификаторЗаписи,
//	|		ЛОЖЬ КАК ПросроченнаяОперация,
//	|		0 КАК ИндексКартинки,
//	|		0 КАК ПолеУпорядочиванияРаздел,
//	|		ЗаявкаДок.Ссылка.Приоритет.РеквизитДопУпорядочивания КАК ПолеУпорядочиванияПриоритет,
//	|		ЗНАЧЕНИЕ(Перечисление.РазделыПлатежногоКалендаря.ПустаяСсылка) КАК РазделПлатежногоКалендаря
//	|	ИЗ
//	|		Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ЗаявкаДок
//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МатрицаВесовЛиквидности КАК МатрицаВесовЛиквидности
//	|			ПО (МатрицаВесовЛиквидности.Источник = ЗНАЧЕНИЕ(Перечисление.ИсточникиДанныхПлатежногоКалендаря.ллл_ЗаявкиЧерновики))
//	|				И (ВЫБОР
//	|					КОГДА ЗаявкаДок.Сумма > 0
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
//	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
//	|				КОНЕЦ = МатрицаВесовЛиквидности.ПриходРасход)
//	|				И (ВЫБОР
//	|					КОГДА ЗаявкаДок.Ссылка.Дата > &ГоризонтТактическогоПланирования
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ГоризонтыПланированияЛиквидности.ПерспективноеПланирование)
//	|					КОГДА ЗаявкаДок.Ссылка.Дата > &ГоризонтОперативногоПланирования
//	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ГоризонтыПланированияЛиквидности.ТактическоеПланирование)
//	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ГоризонтыПланированияЛиквидности.ОперативноеПланирование)
//	|				КОНЕЦ = МатрицаВесовЛиквидности.ГоризонтПланированияЛиквидности)
//	|	ГДЕ
//	|		НЕ ЗаявкаДок.Ссылка.Проведен
//	|		И НЕ ЗаявкаДок.Ссылка.ПометкаУдаления
//	|		И ЕСТЬNULL(МатрицаВесовЛиквидности.Вес, 1) <> 0
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		ЗаявкаДок.Ссылка.ЖелательнаяДатаПлатежа,
//	|		ЗаявкаДок.Ссылка.Организация,
//	|		ЗаявкаДок.Ссылка,
//	|		ЗаявкаДок.Ссылка.БанковскийСчет,
//	|		ЗаявкаДок.Ссылка.БанковскийСчет.Банк,
//	|		Значение(Справочник.ПулыЛиквидности.ПустаяСсылка),
//	|		ЗаявкаДок.Ссылка.Валюта,
//	|		ЗаявкаДок.Ссылка.Приоритет,
//	|		ЗаявкаДок.Ссылка.Приоритет.РеквизитДопУпорядочивания) КАК ПредставлениеПлатежногоКалендаря
//	|	ГДЕ
//	|		&ДополнительныеОтборы
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	ПолеУпорядочиванияРаздел УБЫВ";
//	#КонецВставки
//КонецФункции
