#Область ПрограммныйИнтерфейс

Процедура ПриИзмененииПоляФормы(Форма, Элемент) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	Команды = Форма.Команды;
	
	Если Элемент = Элементы.ПараметрыУчетаФИ Тогда
		ДоговорыКонтрагентовФормыБМКлиентСервер.УправлениеФормой_МСФО(Форма);
	ИначеЕсли Элемент = Элементы.РасчетОплатыУХ Тогда
		ПриИзмененииРасчетаОплаты(Форма);
	ИначеЕсли Элемент = Форма.Команды.ХеджируемыеДоговоры Тогда
		ОткрытьХеджируемыеДоговоры(Форма, Объект.Ссылка);
	ИначеЕсли Элемент = Форма.Команды.ОбъектыПоФИ Тогда
		ОткрытьОбъектыПоФИ(Форма, Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьХеджируемыеДоговоры(Форма, Ссылка)
	
	Если Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для ввода информации о хеджируемых договорах необходимо записать текущий договор'"));
		Возврат; 
	КонецЕсли;
	
	Отбор = Новый Структура("СвязанныйДоговор,ВидСвязи", Ссылка, ПредопределенноеЗначение("Справочник.ВидыСвязейОбъектов.ДоговорНаПокупкуВалюты"));
	ОткрытьФорму("РегистрСведений.СвязанныеДоговоры.ФормаСписка", Новый Структура("Отбор", Отбор), Форма, Истина);
	
КонецПроцедуры

Процедура ОткрытьОбъектыПоФИ(Форма, Ссылка)
	
	Если Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для ввода информации о финансируемых объектах необходимо записать текущий договор'"));
		Возврат; 
	КонецЕсли;
	
	Отбор = Новый Структура("ОбъектыПоФИ", Ссылка);
	ОткрытьФорму("РегистрСведений.ОбъектыПоФИ.ФормаСписка", Новый Структура("Отбор", Отбор), Форма, Истина);
	
КонецПроцедуры


Процедура ПриИзмененииРасчетаОплаты(Форма)
	
	РасчетОплатыУХ = Форма.РасчетОплатыУХ;
	Объект = Форма.Объект;
	
	Объект.УстановленСрокОплаты = РасчетОплатыУХ > 0;
	Объект.ИспользоватьДатуОплаты = (РасчетОплатыУХ = 2);
	
	ДоговорыКонтрагентовФормыБМКлиентСервер.УправлениеФормой_МСФО(Форма);
	
КонецПроцедуры
	
#КонецОбласти