

&НаКлиенте
Процедура БюджетДДС(Команда)
	Если Элементы.Список.ТекущиеДанные=Неопределено  Тогда
		Возврат;
	КонецЕсли;
    Проект = Элементы.Список.ТекущиеДанные.Ссылка;	
	СтруктураПараметров=Новый Структура("Проект",Проект);
	СтруктураПараметров.Вставить("ВидБюджета","БДДС");
	ОткрытьФорму("Обработка.СводнаяТаблица.Форма.ФормаМакетаСводнаяТаблица",СтруктураПараметров);

КонецПроцедуры

&НаКлиенте
Процедура БюджетДР(Команда)
	Если Элементы.Список.ТекущиеДанные=Неопределено  Тогда
		Возврат;
	КонецЕсли;
    Проект = Элементы.Список.ТекущиеДанные.Ссылка;
	СтруктураПараметров=Новый Структура("Проект",Проект);
	СтруктураПараметров.Вставить("ВидБюджета","БюджетРесурсов");
	ОткрытьФорму("Обработка.СводнаяТаблица.Форма.ФормаМакетаСводнаяТаблица",СтруктураПараметров);

КонецПроцедуры

&НаКлиенте
Процедура БюджетДиР(Команда)
	Если Элементы.Список.ТекущиеДанные=Неопределено  Тогда
		Возврат;
	КонецЕсли;
    Проект = Элементы.Список.ТекущиеДанные.Ссылка;
	СтруктураПараметров=Новый Структура("Проект",Проект);
	СтруктураПараметров.Вставить("ВидБюджета","БДР");
	ОткрытьФорму("Обработка.СводнаяТаблица.Форма.ФормаМакетаСводнаяТаблица",СтруктураПараметров);

КонецПроцедуры
