///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Механизм расчета себестоимости
//
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОсновнойИнтерфейсМеханизма

// Выполняется формирование движений по регистрам.
// Перечень исходящих регистров см. РасчетСебестоимости.ИсходящиеДанныеМеханизма()
//
// Параметры:
//	ПараметрыЗапуска - Структура - параметры запуска процедуры 
//	ПараметрыРасчета - Структура - параметры расчета, сформированные в вызывающем механизме.
//	ПараметрыОтладки - Структура - предназначена для переопределения одноименных свойств структуры ПараметрыРасчета.
//		Подробнее см. пояснения в коде РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыРасчетаПартий() к параметру ПараметрыОтладки. 
//
Процедура СформироватьДвиженияПоРегистрам(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки) Экспорт
	
	Если НЕ ПараметрыРасчета.ИспользоватьУчетСебестоимости Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОтладки = Неопределено Тогда
		ПараметрыОтладки = Новый Структура; // для упрощения дальнейших обращений к этому свойству
	КонецЕсли;
	
	ПараметрыЗапуска.Вставить("ТолькоРасчетСебестоимости", Ложь);
	ПараметрыЗапуска.Вставить("РегламентноеЗадание", Ложь);
	ПараметрыЗапуска.Вставить("ПредварительныйРасчет", Ложь);
	
	// Инициализируем параметры расчета
	ИнициализироватьОбщиеПараметрыРасчетаСебестоимости(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки);
	
	СохранитьДвиженияРасчетаСебестоимостиРассчитанныхДокументов(ПараметрыРасчета);
	
	СформироватьДвиженияПоОтклонениямВСтоимостиТоваров(ПараметрыРасчета);
	// Формирует движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	// - ПрочиеДоходы
	// - ДвиженияНоменклатураДоходыРасходы
	// - ДвиженияНоменклатураНоменклатура
	// - ПрочиеАктивыПассивы
	СкорректироватьСтоимостьСписанияЗапасов(ПараметрыРасчета);
		
	//++ НЕ УТ
	// Формирует движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	// - ПрочиеРасходыНезавершенногоПроизводства
	СкорректироватьСтоимостьСписанияНезавершенногоПроизводства22(ПараметрыРасчета);
		
	// Формирует движения по регистрам:
	// - ПрочиеРасходы
	// - РезервыПредстоящихРасходов
	СкорректироватьСтоимостьСписанияРезервовПредстоящихРасходов(ПараметрыРасчета);
		
	// Формирует движения по регистрам:
	// - ПрочиеРасходы
	// - СебестоимостьТоваров
	СкорректироватьСтоимостьДополнительныхРасходов(ПараметрыРасчета, Ложь);
	
	//++ Локализация	
	// Формирует движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	// - ДвиженияНоменклатураДоходыРасходы
	СписатьОстаткиМалоценныхМЦ(ПараметрыРасчета);
	//-- Локализация
	
	// Формирует движения по регистрам:
	// - ПрочиеРасходы
	Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов Тогда
		СкорректироватьСтоимостьПрочегоСписанияНезавершенногоПроизводства(ПараметрыРасчета);
	КонецЕсли;
				
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВтСтоимостиНезавершенногоПроизводства, ВтСтоимостиНезавершенногоПроизводстваРегл,
		//++ Локализация
		|ВтНезавершенноеПроизводствоВключениеИсключениеНДС,
		//-- Локализация
		|РезервыПредстоящихРасходов, ДокументыДвиженияРезервов");
	//-- НЕ УТ
		
	// Формирует движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	// - Закупки
	СкорректироватьСтоимостьПродаж(ПараметрыРасчета);
		
	// Формирует движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	// - ПрочиеРасходы
	// - ДвиженияНоменклатураДоходыРасходы
	РасчетСебестоимостиЛокализация.ВключитьИсключитьНДСВСтоимостьПродаж(ПараметрыРасчета);
		
	Если ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиСебестоимостьРегл > 0
	 ИЛИ ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиСебестоимостьУпр > 0
	 ИЛИ ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиРасходыРегл > 0
	 ИЛИ ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиРасходыУпр > 0 Тогда
		// Формирует движения по регистрам:
		// - СебестоимостьТоваров
		// - ПрочиеРасходы
		// - ПрочиеРасходыНезавершенногоПроизводства
		// - ДвиженияНоменклатураДоходыРасходы
		// - ДвиженияНоменклатураНоменклатура
		СписатьОшибкиОкругленияРасчетаСебестоимости(ПараметрыРасчета);
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "СтоимостьВНЗП");
	
	// Записываем движения (в случае, если расчет себестоимости запущен самостоятельно, а не как этап расчета партий)
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаписатьСформированныеДвижения(
		ПараметрыРасчета,
		ПараметрыОтладки.ПротоколыРасчета);

КонецПроцедуры
	
// Выполняется формирование движений по регистрам.
// Перечень исходящих регистров см. РасчетСебестоимости.ИсходящиеДанныеМеханизма()
//
// Параметры:
//	ПараметрыЗапуска - Структура - параметры запуска процедуры 
//	ПараметрыРасчета - Структура - параметры расчета, сформированные в вызывающем механизме.
//	ПараметрыОтладки - Структура - предназначена для переопределения одноименных свойств структуры ПараметрыРасчета.
//		Подробнее см. пояснения в коде РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыРасчетаПартий() к параметру ПараметрыОтладки. 
//
Процедура СформироватьДвиженияПоРегистрамФинансовыйРезультат(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки) Экспорт
	
	Если НЕ ПараметрыРасчета.ИспользоватьУчетСебестоимости Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОтладки = Неопределено Тогда
		ПараметрыОтладки = Новый Структура; // для упрощения дальнейших обращений к этому свойству
	КонецЕсли;
	
	ПараметрыЗапуска.Вставить("ТолькоРасчетСебестоимости", Ложь);
	ПараметрыЗапуска.Вставить("РегламентноеЗадание", Ложь);
	ПараметрыЗапуска.Вставить("ПредварительныйРасчет", Ложь);
	
	// Инициализируем параметры расчета
	ИнициализироватьОбщиеПараметрыРасчетаСебестоимости(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки);
	
	Если ПараметрыРасчета.ФО.ФормироватьФинансовыйРезультат Тогда
		// Формирует движения по регистрам:
		// - ФинансовыеРезультаты
		РаспределитьВыручкуПоНаправлениямДеятельности(ПараметрыРасчета);
	КонецЕсли;
	
	// Формирует движения по регистрам:
	// - ПрочиеАктивыПассивы
	ОтразитьПрибылиИУбытки(ПараметрыРасчета);
	
	// Этап Распределение расходов будущих периодов
	// Формирует движения по регистрам;
	// - ПрочиеРасходы
	РасчетСебестоимостиПостатейныеЗатраты.РаспределитьРасходыБудущихПериодов(ПараметрыРасчета);
	
	Если ПараметрыРасчета.ФО.ФормироватьУправленческийБаланс Тогда
		// Формирует движения управленческого баланса
		ОтразитьВУправленческомБалансе(ПараметрыРасчета);
	КонецЕсли;
	
	// Записываем движения (в случае, если расчет себестоимости запущен самостоятельно, а не как этап расчета партий)
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаписатьСформированныеДвижения(
		ПараметрыРасчета,
		ПараметрыОтладки.ПротоколыРасчета);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиЭтаповЗакрытияМесяца

#Область ИсправлениеОшибокВИсходныхДанных

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - см. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_ОчисткаДвиженийПриОтключенномУчетеСебестоимости(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.ОчисткаДвиженийПриОтключенномУчетеСебестоимости,
		Истина, Ложь, Ложь);
	НоваяСтрока.ВыполняетсяВручную = Истина;
	НоваяСтрока.ТекстВыполнить     = НСтр("ru = 'Очистить';
											|en = 'Clear'", ОбщегоНазначения.КодОсновногоЯзыка());
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"РасчетСебестоимостиКорректировкаСтоимости.Использование_ОчисткаДвиженийПриОтключенномУчетеСебестоимости");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Обработки.ОчисткаДвиженийПриОтключенномУчетеСебестоимости.Формы.Форма.ПолноеИмя());
	
КонецПроцедуры

// Обработчики этапа.

// Процедура определяет необходимость выполнения этапа.
//
// Параметры:
//  ПараметрыОбработчика - Структура - параметры обработчика события этапа.
//
Процедура Использование_ОчисткаДвиженийПриОтключенномУчетеСебестоимости(ПараметрыОбработчика) Экспорт
	
	КоличествоДокументов = Обработки.ОчисткаДвиженийПриОтключенномУчетеСебестоимости.КоличествоРегистраторовСНеиспользуемымиДвижениями();
	
	Если КоличествоДокументов = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'При отключенном учете себестоимости отсутствуют документы с движениями по регистрам учета себестоимости.';
				|en = 'When the cost accounting is off, there are no documents with movements by cost accounting registers.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	Иначе
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При отключенном учете себестоимости найдены документы с движениями по регистрам учета себестоимости: %1';
				|en = 'When the cost accounting is off, documents with movements by cost accounting registers are found: %1'", ОбщегоНазначения.КодОсновногоЯзыка()),
			Формат(КоличествоДокументов, "ЧГ="));
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеВыполнен(
			ПараметрыОбработчика,
			ТекстСообщения,
			,
			,
			Перечисления.ВариантыВажностиПроблемыСостоянияСистемы.Ошибка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РасчетПартийИСебестоимости

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - см. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца
// 	ТекущийРодитель - Строка - идентификатор группы.
//
Процедура ДобавитьЭтап_РасчетПартийИСебестоимости(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.РасчетПартийИСебестоимости);
	ПредшествующиеЭтапы = НоваяСтрока.ПредшествующиеЭтапы; // Массив	
	ПредшествующиеЭтапы.Добавить(Перечисления.ОперацииЗакрытияМесяца.ОформлениеВыкупаТоваров);
	ПредшествующиеЭтапы.Добавить(Перечисления.ОперацииЗакрытияМесяца.ОформлениеОстатковТоваровКПередаче);
	ПредшествующиеЭтапы.Добавить(Перечисления.ОперацииЗакрытияМесяца.ОформлениеОтчетовКомитентамОСписании);
	ПредшествующиеЭтапы.Добавить(Перечисления.ОперацииЗакрытияМесяца.ОформлениеОтчетовПоКомиссииМеждуОрганизациями);
	ПредшествующиеЭтапы.Добавить(Перечисления.ОперацииЗакрытияМесяца.ОформлениеПередачТоваров);
	//++ НЕ УТ
	ПредшествующиеЭтапы.Добавить(Перечисления.ОперацииЗакрытияМесяца.ОформлениеПроизводстваБезЗаказов);
	ПредшествующиеЭтапы.Добавить(Перечисления.ОперацииЗакрытияМесяца.ФормированиеРезервовПоСомнительнымДолгам);
	//-- НЕ УТ
	ПредшествующиеЭтапы.Добавить(Перечисления.ОперацииЗакрытияМесяца.ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов);
	//++ НЕ УТКА
	ОбновитьСостояниеЭтапов = НоваяСтрока.ОбновитьСостояниеЭтапов; // Массив	
	ОбновитьСостояниеЭтапов.Добавить(Перечисления.ОперацииЗакрытияМесяца.ИсправлениеОшибокКорреспонденцииФинансовыхРегистров);
	//-- НЕ УТКА
	
	НоваяСтрока.ТекстВыполнить = НСтр("ru = 'Рассчитать';
										|en = 'Calculate'", ОбщегоНазначения.КодОсновногоЯзыка());
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"РасчетСебестоимостиКорректировкаСтоимости.Использование_РасчетПартийИСебестоимости");
	НоваяСтрока.ДействиеОформление = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"РасчетСебестоимостиКорректировкаСтоимости.Оформление_РасчетПартийИСебестоимости");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ВыполнитьРасчет(
		"РасчетСебестоимостиКорректировкаСтоимости.Выполнить_РасчетПартийИСебестоимости");
	НоваяСтрока.ДействиеПодробнее = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.РегистрыСведений.ПротоколыРасчетаПартийИСебестоимости.Формы.ФормаПросмотраПротоколов.ПолноеИмя());
	НоваяСтрока.ДействиеПодробнее.ОткрыватьВместоЖР = Истина;
	НоваяСтрока.ДействиеПодробнее.НеТребуетсяПриУспешномВыполнении = Истина;
	НоваяСтрока.ВыполняетсяПриПредварительномЗакрытииМесяца = Истина;
	
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_РасчетПартийИСебестоимости(ПараметрыОбработчика) Экспорт
	
	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	ПериодРасчета    = ПараметрыРасчета.ПериодРегистрации;
	
	// Проверим ведение учета себестоимости - расчет возможен начиная с месяца, предшествующему началу учета (с момента ввода остатков).
	Если НЕ РасчетСебестоимостиПовтИсп.ВозможенРасчетСебестоимости(НачалоМесяца(ПериодРасчета)) Тогда
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Нет движений по регистрам себестоимости и прочих расходов.';
				|en = 'No records in registers of cost and other expenses.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОбработчика.Свойство("ТолькоОднаОрганизация") И ПараметрыОбработчика.ТолькоОднаОрганизация Тогда
		ПараметрыОбработчика.ДанныеЭтапа.МассивОрганизаций = ОбщегоНазначенияУТКлиентСервер.Массив(ПараметрыРасчета.МассивОрганизаций);
	Иначе
		// Дополним связанными по Интеркампани организациями и добавим информационные сообщения.
		ПараметрыОбработчика.ДанныеЭтапа.МассивОрганизаций = РасчетСебестоимостиПрикладныеАлгоритмы.СвязиОрганизацийПоСхемеИнтеркампани(
			ПериодРасчета,
			ПараметрыРасчета.МассивОрганизаций);
	КонецЕсли;
	
	МассивОрганизаций = ПараметрыОбработчика.ДанныеЭтапа.МассивОрганизаций;
	МассивДополнительныеОрганизации = Новый Массив;
	
	Для Каждого ТекущаяОрганизация Из МассивОрганизаций Цикл
		Если ПараметрыРасчета.МассивОрганизаций.Найти(ТекущаяОрганизация) = Неопределено Тогда
			МассивДополнительныеОрганизации.Добавить(ТекущаяОрганизация);
		КонецЕсли;
	КонецЦикла;
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, МассивОрганизаций.Количество());
	
	Если МассивДополнительныеОрганизации.Количество() > 0 Тогда
		
		ТекстДополнительныеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Также будет выполнен расчет для организаций, связанных по схеме Интеркампани: %1';
				|en = 'Calculation will be also performed for companies connected under Intercompany: %1'", ОбщегоНазначения.КодОсновногоЯзыка()),
			РасчетСебестоимостиПрикладныеАлгоритмы.ПредставлениеОрганизаций(МассивДополнительныеОрганизации, ", ", Истина));
		
		ЗакрытиеМесяцаСервер.ДобавитьПоясняющуюИнформациюКЭтапу(
			ПараметрыОбработчика,
			ТекстДополнительныеОрганизации,
			,
			,
			Перечисления.ВариантыВажностиПроблемыСостоянияСистемы.ВажнаяИнформация);
		
	КонецЕсли;
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, МассивОрганизаций.Количество());
	
	Если РасчетСебестоимостиПрикладныеАлгоритмы.ПроверитьНеобходимостьВключенияНастройкиРаспределениеДопРасходовПоВыбывшимТоварам(ПараметрыРасчета) Тогда
		
		ТекстРекомендации = НСтр("ru = 'Обнаружены расходы, которые можно списать на выбытия прошлых периодов.
			|Рекомендуется включить настройку ""Распределение доп. расходов по выбывшим товарам"".';
			|en = 'Expenses which can be written off as outflows of previous periods are detected.
			|It is recommended that you enable the ""Allocate add. expenses by retired goods"" setting.'", ОбщегоНазначения.КодОсновногоЯзыка());
		
		ОписаниеДействия = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
				Метаданные.Обработки.ПанельАдминистрированияУТ.Формы.ФинансовыйРезультатИКонтроллинг.ПолноеИмя());
		
		ЗакрытиеМесяцаСервер.ДобавитьПоясняющуюИнформациюКЭтапу(
			ПараметрыОбработчика,
			ТекстРекомендации,
			,
			ОписаниеДействия,
			Перечисления.ВариантыВажностиПроблемыСостоянияСистемы.ПолезныйСовет);
		
	КонецЕсли;
	
	НачалоПериодаРасчета = Макс(
		РасчетСебестоимостиПрикладныеАлгоритмы.НачалоПериодаРасчета(ПериодРасчета, МассивОрганизаций),
		НачалоМесяца(НачалоМесяца(Константы.ДатаНачалаУчетаСебестоимости.Получить()) - 1));
	
	Если НачалоПериодаРасчета <= ПериодРасчета Тогда
		
		ПараметрыОбработчика.ДанныеЭтапа.ДатаНачалаРасчета = НачалоПериодаРасчета;
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеВыполнен(
			ПараметрыОбработчика,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Требуется пересчет начиная с периода %1.';
					|en = 'Recalculation is required starting from the period of %1.'", ОбщегоНазначения.КодОсновногоЯзыка()),
				РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(НачалоПериодаРасчета)));
		Возврат; // партии не актуальны
		
	КонецЕсли;
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	Если РасчетСебестоимостиПрикладныеАлгоритмы.ЕстьНекорректныеДвиженияСебестоимости(ПериодРасчета, МассивОрганизаций) Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеВыполнен(
			ПараметрыОбработчика,
			НСтр("ru = 'Период еще не был пересчитан в партионном учете версии 2.2.';
				|en = 'Period has not been recalculated in lot accounting 2.2.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		Возврат; // период не рассчитывался в партионном учете версии 2.2
		
	КонецЕсли;
	
	ОрганизацииСДвижениямиПоСебестоимости = РасчетСебестоимостиПрикладныеАлгоритмы.ОрганизацииСДвижениямиПоСебестоимости(
		ПериодРасчета,
		МассивОрганизаций);
		
	Если РасчетСебестоимостиПрикладныеАлгоритмы.ЕстьОбязательныеКорректировкиОстатков(ПериодРасчета) Тогда
		ОрганизацииСОстаткамиПоСебестоимости = РасчетСебестоимостиПрикладныеАлгоритмы.ОрганизацииСОстаткамиПоСебестоимости(
			ПериодРасчета,
			МассивОрганизаций);
	Иначе
		ОрганизацииСОстаткамиПоСебестоимости = Неопределено;
	КонецЕсли;
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, ОрганизацииСДвижениямиПоСебестоимости.Количество());
	
	Если (ЗначениеЗаполнено(ОрганизацииСДвижениямиПоСебестоимости)
	 	И НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ЕстьДокументыРасчетаСебестоимости(ПериодРасчета, ОрганизацииСДвижениямиПоСебестоимости))
	 ИЛИ (ЗначениеЗаполнено(ОрганизацииСОстаткамиПоСебестоимости)
	 	И НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ЕстьДокументыРасчетаСебестоимости(НачалоМесяца(ПериодРасчета - 1), ОрганизацииСОстаткамиПоСебестоимости)) Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеВыполнен(
			ПараметрыОбработчика,
			НСтр("ru = 'Расчет себестоимости в данном периоде еще не выполнялся.';
				|en = 'Cost has not been calculated in this period.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		Возврат;
		
	КонецЕсли;
	
	Если ПараметрыОбработчика.ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ОкончательноеЗакрытие
	 И РасчетСебестоимостиПрикладныеАлгоритмы.ЕстьДокументыПредварительногоРасчетаСебестоимости(ПериодРасчета, 
	 	ОрганизацииСДвижениямиПоСебестоимости) Тогда
	 		
	 	ЗакрытиеМесяцаСервер.УстановитьСостояниеНеВыполнен(
			ПараметрыОбработчика,
			НСтр("ru = 'В данном периоде было выполнено только предварительное закрытие месяца.';
				|en = 'Only preliminary month-end closing has been performed in this period.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		Возврат;
		
	КонецЕсли;
	
	РасчетСебестоимостиЛокализация.Использование_РасчетПартийИСебестоимости(ПараметрыОбработчика);
	
КонецПроцедуры

Процедура Оформление_РасчетПартийИСебестоимости(ПараметрыОбработчика) Экспорт
	
	ПараметрыОбработчика.ДанныеЭтапа.ТекстПодробнее = "";
	
	Если ЗакрытиеМесяцаСервер.ТребуетсяПересчетЭтапа(ПараметрыОбработчика.ДанныеЭтапа) Тогда
		
		ПротоколыРасчета = РегистрыСведений.ОшибкиРасчетаПартийИСебестоимости.ПолучитьПротоколыРасчета(
			ПараметрыОбработчика.ПараметрыРасчета.ПериодРегистрации,
			ПараметрыОбработчика.ПараметрыРасчета.МассивОрганизаций);
		
		ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, ПротоколыРасчета.Количество());
		
		Если ЗначениеЗаполнено(ПротоколыРасчета) Тогда
			ПараметрыОбработчика.ДанныеЭтапа.ТекстПодробнее = ЗакрытиеМесяцаСервер.ТекстПодробнееПоУмолчанию();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Выполнить_РасчетПартийИСебестоимости(ПараметрыОбработчика) Экспорт
	
	РегистрыСведений.ЗаданияКРасчетуСебестоимости.СоздатьЗаписьРегистра(
		ПараметрыОбработчика.ПараметрыРасчета.ПериодРегистрации,
		Неопределено,
		ПараметрыОбработчика.ПараметрыРасчета.МассивОрганизаций);
		
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("Дата", 					    ПараметрыОбработчика.ПараметрыРасчета.ПериодРегистрации);
	ПараметрыЗапуска.Вставить("НачалоПериода", 				ПараметрыОбработчика.ПараметрыРасчета.НачалоПериода);
	ПараметрыЗапуска.Вставить("КонецПериода", 				ПараметрыОбработчика.ПараметрыРасчета.КонецПериода);
	ПараметрыЗапуска.Вставить("МассивОрганизаций",  	    ПараметрыОбработчика.ПараметрыРасчета.МассивОрганизаций);
	ПараметрыЗапуска.Вставить("МестоВызоваРасчета", 	    "РасчетСебестоимостиКорректировкаСтоимости.Выполнить_РасчетПартийИСебестоимости");
	ПараметрыЗапуска.Вставить("ВыполняетсяЗакрытиеМесяца",  Истина);
	ПараметрыЗапуска.Вставить("АвтоматическоеТестирование", ПараметрыОбработчика.АвтоматическоеТестирование);
	ПараметрыЗапуска.Вставить("РежимЗакрытияМесяца",        ПараметрыОбработчика.РежимЗакрытияМесяца);
	Если ПараметрыОбработчика.Свойство("ТолькоОднаОрганизация") Тогда 
		ПараметрыЗапуска.Вставить("ТолькоОднаОрганизация",	ПараметрыОбработчика.ТолькоОднаОрганизация);
	Иначе
		ПараметрыЗапуска.Вставить("ТолькоОднаОрганизация",	Ложь);
	КонецЕсли;
	
	РасчетСебестоимости.РассчитатьВсеВПопыткеИсключении(ПараметрыЗапуска);
	
КонецПроцедуры

// Проверки состояния системы, относящиеся к этапу.

Процедура ОписаниеПроверок_РасчетПартийИСебестоимости(ТаблицаПроверок) Экспорт
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьПроверкиДляРегистрации(ТаблицаПроверок);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Инициализация

// Перед началом расчета заполняет все необходимые параметры и инициализирует все структуры данных, используемые алгоритма расчета.
// Если расчет себестоимости вызывается не самостоятельно, а как этап расчета партий,
// то параметр ПараметрыРасчета уже будет инициализирован общими свойствами механизмов расчета.
//
// Внимание: если какая-то сущность используется более чем в одном этапе расчета, то ее стоит занести в ПараметрыРасчета.
//
Процедура ИнициализироватьОбщиеПараметрыРасчетаСебестоимости(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ИнициализироватьОбщиеПараметрыРасчетаСебестоимости");
	
	// Создадим контейнер всех параметров, используемых механизмом расчета партий
	ПараметрыИнициализации = Новый Структура;
	ТолькоРасчетСебестоимости =
		?(ПараметрыЗапуска.Свойство("ТолькоРасчетСебестоимости"), ПараметрыЗапуска.ТолькоРасчетСебестоимости, Ложь);
	ПредварительныйРасчет =
		?(ПараметрыЗапуска.Свойство("ПредварительныйРасчет"), ПараметрыЗапуска.ПредварительныйРасчет, Ложь);
	ПараметрыИнициализации.Вставить("Дата",
		?(ТолькоРасчетСебестоимости И ПредварительныйРасчет,
			КонецДня(ПараметрыЗапуска.Дата), КонецМесяца(ПараметрыЗапуска.Дата)));
	ПараметрыИнициализации.Вставить("НачалоПериода", НачалоМесяца(ПараметрыЗапуска.Дата));
	ПараметрыИнициализации.Вставить("КонецПериода", ПараметрыИнициализации.Дата);
	Если ПараметрыЗапуска.Свойство("ТолькоОднаОрганизация") И ПараметрыЗапуска.ТолькоОднаОрганизация Тогда
		ПараметрыИнициализации.Вставить("МассивОрганизаций", ПараметрыЗапуска.МассивОрганизаций);
	Иначе
		ПараметрыИнициализации.Вставить("МассивОрганизаций",
			?(ТипЗнч(ПараметрыЗапуска.МассивОрганизаций) <> Тип("Массив") И ЗначениеЗаполнено(ПараметрыЗапуска.МассивОрганизаций),
				РасчетСебестоимостиПрикладныеАлгоритмы.СвязиОрганизацийПоСхемеИнтеркампани(НачалоМесяца(ПараметрыЗапуска.Дата), ПараметрыЗапуска.МассивОрганизаций),
				ПараметрыЗапуска.МассивОрганизаций));
	КонецЕсли;
	ПараметрыИнициализации.Вставить("ЗапущенРасчетПартий", Ложь);
	ПараметрыИнициализации.Вставить("ТолькоПредварительныйРасчетСебестоимости",
		?(ТолькоРасчетСебестоимости, ПредварительныйРасчет, Ложь));
	ПараметрыИнициализации.Вставить("ЗапущеноРегламентнымЗаданием", 
		?(ПараметрыЗапуска.Свойство("РегламентноеЗадание"), ПараметрыЗапуска.РегламентноеЗадание, Ложь));
	
	Если ПараметрыЗапуска.Свойство("ИзмененоДокументов") Тогда
		// Штатный вызов из механизма партионного учета версии 2.1.
		ПараметрыИнициализации.Вставить("ИзмененоДокументов", ПараметрыЗапуска.ИзмененоДокументов);
	КонецЕсли;
	Если ПараметрыЗапуска.Свойство("ОписаниеЗамера") Тогда
		// Штатный вызов из механизма партионного учета версии 2.1.
		ПараметрыИнициализации.Вставить("ОписаниеЗамера", ПараметрыЗапуска.ОписаниеЗамера);
	КонецЕсли;
	
	Если ПараметрыЗапуска.Свойство("АвтоматическоеТестирование") И ПараметрыЗапуска.АвтоматическоеТестирование Тогда
		ПараметрыИнициализации.Вставить("АвтоматическоеТестирование", Истина); // вызывается при тестировании
	Иначе
		ПараметрыИнициализации.Вставить("АвтоматическоеТестирование", Ложь);
	КонецЕсли;
	
	Если ТолькоРасчетСебестоимости И ПараметрыЗапуска.Свойство("МестоВызоваРасчета") Тогда
		ПараметрыИнициализации.Вставить("МестоВызоваРасчета", ПараметрыЗапуска.МестоВызоваРасчета);
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьОбщиеПараметрыРасчета(
		ПараметрыИнициализации, ПараметрыРасчета, ПараметрыОтладки);
		
	Если ПараметрыРасчета.ЗапущенРасчетПартий Тогда
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыполняетсяМеханизмРасчетаСебестоимости(ПараметрыРасчета, Истина);
		
		Если РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ВТСтоимостьПартийТоваров") > 0 Тогда
			
			РасчетСебестоимостиПротоколРасчета.ОчисткаСформированныхДвижений(
				ПараметрыРасчета,
				Метаданные.РегистрыСведений.СтоимостьТоваров.Имя);
			
		КонецЕсли;
		
		Если РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ВтУзлыКорректировкиСебестоимости") > 0 Тогда
			
			РасчетСебестоимостиПрикладныеАлгоритмы.ОчиститьВременнуюТаблицу(ПараметрыРасчета, "ВтУзлыКорректировкиСебестоимости");
			РасчетСебестоимостиПрикладныеАлгоритмы.ОчиститьВременнуюТаблицу(ПараметрыРасчета, "ВтСвязиУзловКорректировкиСебестоимости");
			
		КонецЕсли;
		
	Иначе
		
		НомерЗаданияДоРасчета = РегистрыСведений.ЗаданияКРасчетуСебестоимости.ПолучитьНомерЗадания();
		ПараметрыРасчета.Вставить("НомерЗаданияДоРасчета", НомерЗаданияДоРасчета - 1);
		
		// Запомним протокол расчета и вернем его в место вызова расчета
		ПараметрыОтладки.Вставить("ПротоколыРасчета", Новый Массив);
		
		// Инициализируем кэши регистров, обслуживаемых механизмом партионного учета
		// Непосредственное обновление кэшей будет выполнено в ИнициализироватьПараметрыРасчетаСебестоимостиПоГруппеОрганизаций
		Для Каждого КлючИЗначение Из ИспользуемыеКэшиРегистровПартионногоУчета() Цикл
			
			Регистр = КлючИЗначение.Ключ; // ОбъектМетаданныхРегистрНакопления
			РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьДанныеРегистра(ПараметрыРасчета, Регистр);
			
			ОписаниеРегистра = ПараметрыРасчета.Движения[Регистр.Имя];
			ОписаниеРегистра.ИспользоватьВТКэш = Ложь; // расчетные движения брать из данных ИБ
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Общие параметры расчета себестоимости
	ПараметрыРасчета.Вставить("ПредварительныйРасчет", ПредварительныйРасчет);
	ПараметрыРасчета.Вставить("СохранитьСЛУ",
		ПараметрыЗапуска.Свойство("СохранитьСЛУ") И ПараметрыЗапуска.СохранитьСЛУ);
	
КонецПроцедуры

Процедура ИнициализироватьПараметрыРасчетаСебестоимостиПоГруппеОрганизаций(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ИнициализироватьПараметрыРасчетаСебестоимостиПоГруппеОрганизаций");
	
	РасчетСебестоимостиПротоколРасчета.УвеличитьКоличествоОбработанныхДанныхДляЗамера(
		ПараметрыРасчета,
		ПараметрыЗапуска.ГруппаОрганизаций.Количество());
	
	// Заменим основной отбор по организациям на текущую рассчитываемую группу.
	// При окончании расчета себестоимости основной отбор будет восстановлен из ПараметрыРасчета.КопияМассивОрганизаций
	ТолькоОднаОрганизация = ПараметрыЗапуска.Свойство("ТолькоОднаОрганизация") И ПараметрыЗапуска.ТолькоОднаОрганизация;
	Если НЕ ТолькоОднаОрганизация Тогда
		ПараметрыРасчета.Вставить("МассивОрганизаций", ПараметрыЗапуска.ГруппаОрганизаций);
	КонецЕсли;
	ПараметрыРасчета.Вставить("МетодОценки", 	   ПараметрыЗапуска.МетодОценки); // общий метод оценки для этой группы организаций
	
	// Обновим временные таблицы с отборами по организациям.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьВременныеТаблицыДляОтборов(ПараметрыРасчета);
	
	// Обновим все расчетные кэши остатков и оборотов - в них должны быть только записи по рассчитываемой группе организаций
	// Если расчет вызван регламентной операцией, то считаем стоимость по средней (без учета партий)
	// Для этого в расчетном кэше оборотов и остатков будут "очищены" поля, относящиеся к партиям
	// Если расчет себестоимости вызван из механизма партионного учета, то по окончании расчета себестоимости
	// расчетные кэши будут восстановлены автоматически.
	РасчетСебестоимостиПрикладныеАлгоритмы.ОбновитьРасчетныеКэшиРегистров(ПараметрыРасчета);
	
	ПараметрыРасчета.Вставить("КоличествоУзлов",     0);
	ПараметрыРасчета.Вставить("КоличествоУзловРегл", 0);
	
	// Добавим информацию о текущей итерации расчета себестоимости в протокол расчета
	СтрокаПротокола = НСтр("ru = 'Вид расчета себестоимости';
							|en = 'Cost calculation kind'", ОбщегоНазначения.КодОсновногоЯзыка()) + ": "
		+ ?(ПараметрыРасчета.ПредварительныйРасчет, НСтр("ru = 'Предварительный';
														|en = 'Preliminary'", ОбщегоНазначения.КодОсновногоЯзыка()), НСтр("ru = 'Фактический';
																																|en = 'Actual'", ОбщегоНазначения.КодОсновногоЯзыка()));
	РасчетСебестоимостиПротоколРасчета.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
	
	Если ПараметрыРасчета.ПредварительныйРасчет Тогда
		// Метод оценки не влияет на алгоритм расчета
		ПредставлениеМетодаОценки = НСтр("ru = 'Не влияет на результат расчета';
										|en = 'Does not affect the calculation result'", ОбщегоНазначения.КодОсновногоЯзыка());
	ИначеЕсли ПараметрыРасчета.ПартионныйУчетВерсии22 И НЕ ЗначениеЗаполнено(ПараметрыРасчета.МетодОценки) Тогда
		// См. РасчетСебестоимостиПрикладныеАлгоритмы.ОпределитьМетодОценкиСтоимостиДляГруппыОрганизаций()
		ПредставлениеМетодаОценки = НСтр("ru = 'Отличный от ""ФИФО (взвешенная оценка)""';
										|en = 'Different from ""FIFO (weighted estimate)""'", ОбщегоНазначения.КодОсновногоЯзыка());
	Иначе
		ПредставлениеМетодаОценки = ПараметрыРасчета.МетодОценки;
	КонецЕсли;
	
	СтрокаПротокола = НСтр("ru = 'Метод оценки стоимости';
							|en = 'Cost evaluation method'", ОбщегоНазначения.КодОсновногоЯзыка()) + ": "
		+ РасчетСебестоимостиПротоколРасчета.ПредставлениеЗначения(ПредставлениеМетодаОценки);
	РасчетСебестоимостиПротоколРасчета.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
	
	СтрокаПротокола = НСтр("ru = 'Организации';
							|en = 'Companies'", ОбщегоНазначения.КодОсновногоЯзыка()) + ": "
		+ РасчетСебестоимостиПрикладныеАлгоритмы.ПредставлениеОрганизаций(ПараметрыРасчета.МассивОрганизаций, ", ", Истина);
	РасчетСебестоимостиПротоколРасчета.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ОчиститьВременнуюТаблицу(ПараметрыРасчета, "ВТПромежуточнаяСебестоимостьТоваров");
	
КонецПроцедуры

#КонецОбласти

#Область ЭтапыРасчета

// Этап 9 (вызов механизма расчета себестоимости)
//
Процедура КорректировкаСтоимостиВозвратовИсправленийПрошлыхПериодов(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки) Экспорт
	
	Если НЕ ПараметрыРасчета.ИспользоватьУчетСебестоимости Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализируем параметры расчета
	ИнициализироватьОбщиеПараметрыРасчетаСебестоимости(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки);
	
	// Формирует движения по регистрам (если выполняется фактический расчет):
	// - СебестоимостьТоваров
	// - ВыручкаИСебестоимостьПродаж
	// - ПрочиеРасходы
	// - ПрочиеДоходы
	// - ДвиженияНоменклатураДоходыРасходы
	// - ДвиженияНоменклатураНоменклатура
	СкорректироватьСтоимостьВозвратовПрошлыхПериодов(ПараметрыРасчета);
	
	// Формирует движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	// - ПрочиеДоходы
	// - ДвиженияНоменклатураДоходыРасходы
	// - ДвиженияНоменклатураНоменклатура
	СкорректироватьСтоимостьСторноДвиженийИсправленныхДокументов(ПараметрыРасчета);
	
	// Этап сохранения движений документа "Распределение расходов будущих периодов" в кэш.
	// Формирует движения по регистрам:
	// - ПрочиеРасходы
	ПодготовкаДанныхДляПрочихРасходов(ПараметрыРасчета);
	
	Если ПараметрыРасчета.ЗапущенРасчетПартий Тогда
			
		// Возврат в механизм расчета партий из расчета себестоимости
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыполняетсяМеханизмРасчетаСебестоимости(ПараметрыРасчета, Ложь);
			
		// Восстановим все расчетные кэши остатков и оборотов по всем организациям
		РасчетСебестоимостиПрикладныеАлгоритмы.ОбновитьРасчетныеКэшиРегистров(ПараметрыРасчета);
		
	КонецЕсли;
		
КонецПроцедуры

// Этап сохранения движений документа "Распределение расходов будущих периодов" в кэш.
//
Процедура ПодготовкаДанныхДляПрочихРасходов(ПараметрыРасчета) Экспорт

	Если ПараметрыРасчета.ПредварительныйРасчет Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ПодготовкаДанныхДляПрочихРасходов");
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля =
		"Период, ВидДвижения, Организация, Подразделение, НаправлениеДеятельности, ХозяйственнаяОперация,
		|СтатьяРасходов, АналитикаРасходов, Сумма, СуммаБезНДС, СуммаРегл, СуммаУпр, ПостояннаяРазница, ВременнаяРазница,
		|КорПодразделение, КорНаправлениеДеятельности, КорСтатьяРасходов, КорАналитикаРасходов";
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Период,
	|	Т.ВидДвижения,
	|	Т.Регистратор,
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.Сумма,
	|	Т.СуммаБезНДС,
	|	Т.СуммаРегл,
	|	Т.СуммаУпр,
	|	Т.ПостояннаяРазница,
	|	Т.ВременнаяРазница,
	|	Т.КорПодразделение,
	|	Т.КорНаправлениеДеятельности,
	|	Т.КорСтатьяРасходов,
	|	Т.КорАналитикаРасходов,
	|	Т.ХозяйственнаяОперация
	|ПОМЕСТИТЬ ВтДвиженияПрочиеРасходы
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов КАК Распределение
	|		ПО Распределение.Ссылка = Т.Регистратор 
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.Активность
	|	И Распределение.Дата < &НачалоПериода
	|	И (Т.РасчетПартий ИЛИ Т.РасчетСебестоимости)";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	СоответствиеВременныхТаблицДвижений = Новый Соответствие;
	
	ИмяВременнойТаблицы = "ВтПрочиеРасходыРБП";
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияПрочиеРасходы");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияПрочиеРасходы", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвиженияИзВременныхТаблиц(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	
	// Уничтожим ненужные временные таблицы.
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета, СуществующиеВТ);
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
КонецПроцедуры

// Этап 3.3
// Выполняет корректировку стоимости возвратов от клиента прошлых периодов
//
Процедура СкорректироватьСтоимостьВозвратовПрошлыхПериодов(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьВозвратовПрошлыхПериодов");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
	
	СоответствиеВременныхТаблицДвижений = Новый Соответствие;

#Область ЗапросДанных
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	СУММА(ДД.Количество) КАК Количество,
	|	МАКСИМУМ(Стоимости.Период) КАК Период
	|ПОМЕСТИТЬ СторноОтчетыКомиссионера
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьТоваров КАК Стоимости
	|		ПО Стоимости.Период < &НачалоПериода
	|		И Стоимости.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
	|		И Стоимости.РазделУчета = ДД.РазделУчета
	|		И Стоимости.ВидЗапасов = ДД.ВидЗапасов
	|		И Стоимости.Организация = ДД.АналитикаУчетаПоПартнерам.Организация
	|ГДЕ
	|	ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|СГРУППИРОВАТЬ ПО
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаУчетаПоПартнерам.Организация
	|ИМЕЮЩИЕ
	|	СУММА(ДД.Количество) < 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Себестоимость.ДокументИсточник КАК Ссылка
	|ПОМЕСТИТЬ ВтРеализацииПрошлыхПериодов
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|ГДЕ
	|	Себестоимость.СлужебноеВидДвиженияПриход
	|	И Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|	И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
	// Для записей "Сторно" стоимость определяется в процедуре СкорректироватьСтоимостьСторноДвиженийИсправленныхДокументов() 
	|	И НЕ Себестоимость.Сторно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Себестоимость.ДокументИсточник КАК Ссылка
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Реестр.Организация = Себестоимость.Организация
	|		И Реестр.Ссылка = Себестоимость.ДокументИсточник
	|		И НЕ Реестр.ДополнительнаяЗапись
	|ГДЕ
	|	НЕ Себестоимость.СлужебноеВидДвиженияПриход
	|	И Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|	И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
	|	И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
	|	И Реестр.ДатаДокументаИБ < &НачалоПериода
	// Условия выборки данных должны соответствовать функции РасчетСебестоимостиРешениеСЛУ.ТекстВтУзлыКорректировки_МатериальныеИТрудозатраты()
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Регистратор                         КАК Ссылка,
	|	Себестоимость.АналитикаУчетаНоменклатуры          КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета                         КАК РазделУчета,
	|	Себестоимость.ВидЗапасов                          КАК ВидЗапасов,
	|	Себестоимость.Организация               		  КАК Организация,
	|	Себестоимость.Партия                          	  КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий                КАК АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета           КАК АналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА НЕ &ПартионныйУчетВерсии22
	|		 ИЛИ Себестоимость.Период < &ДатаПереходаНаПартионныйУчетВерсии22
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		КОГДА Себестоимость.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА Себестоимость.ВидДеятельностиНДС
	|		ИНАЧЕ Себестоимость.КорВидДеятельностиНДС
	|	КОНЕЦ                                             КАК ВидДеятельностиНДС,
	|
	|	СУММА(Себестоимость.Количество)                   КАК Количество,
	|	СУММА(Себестоимость.Стоимость)                    КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС)              КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.СтоимостьЗабалансовая)        КАК СтоимостьЗабалансовая,
	|	СУММА(Себестоимость.ДопРасходы)             	  КАК ДопРасходы,
	|	СУММА(Себестоимость.ДопРасходыБезНДС)       	  КАК ДопРасходыБезНДС,
	|	СУММА(Себестоимость.Трудозатраты)       		  КАК Трудозатраты,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеСНДС)    КАК ПостатейныеПостоянныеСНДС,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеБезНДС)  КАК ПостатейныеПостоянныеБезНДС,
	|	СУММА(Себестоимость.ПостатейныеПеременныеСНДС)    КАК ПостатейныеПеременныеСНДС,
	|	СУММА(Себестоимость.ПостатейныеПеременныеБезНДС)  КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(Себестоимость.СтоимостьРегл)                КАК СтоимостьРегл,
	|	СУММА(Себестоимость.СтоимостьЗабалансоваяРегл)    КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(Себестоимость.ПостояннаяРазница)            КАК ПостояннаяРазница,
	|	СУММА(Себестоимость.ВременнаяРазница)             КАК ВременнаяРазница,
	|	СУММА(Себестоимость.ДопРасходыРегл)               КАК ДопРасходыРегл,
	|	СУММА(Себестоимость.ТрудозатратыРегл)             КАК ТрудозатратыРегл,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеРегл)    КАК ПостатейныеПостоянныеРегл,
	|	СУММА(Себестоимость.ПостатейныеПеременныеРегл)    КАК ПостатейныеПеременныеРегл,
	|	СУММА(Себестоимость.СтоимостьУпр)    			  КАК СтоимостьУпр,
	|	СУММА(Себестоимость.ДопРасходыУпр)    			  КАК ДопРасходыУпр,
	|	СУММА(Себестоимость.ТрудозатратыУпр)    		  КАК ТрудозатратыУпр,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеУпр)     КАК ПостатейныеПостоянныеУпр,
	|	СУММА(Себестоимость.ПостатейныеПеременныеУпр)     КАК ПостатейныеПеременныеУпр
	|ПОМЕСТИТЬ ВтСуммыРеализацийПрошлыхПериодов
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРеализацииПрошлыхПериодов КАК Продажи
	|		ПО Продажи.Ссылка = Себестоимость.Регистратор
	|ГДЕ
	|	Себестоимость.Период < &НачалоПериода
	|	И Себестоимость.Организация В(&МассивОрганизаций)
	|	И Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Себестоимость.Активность
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Регистратор,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА НЕ &ПартионныйУчетВерсии22
	|		 ИЛИ Себестоимость.Период < &ДатаПереходаНаПартионныйУчетВерсии22
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		КОГДА Себестоимость.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА Себестоимость.ВидДеятельностиНДС
	|		ИНАЧЕ Себестоимость.КорВидДеятельностиНДС
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(Себестоимость.Количество) <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СебестоимостьПродаж.ДокументДвижения                  КАК Ссылка,
	|	СебестоимостьПродаж.АналитикаУчетаНоменклатуры        КАК АналитикаУчетаНоменклатуры,
	|	СебестоимостьПродаж.РазделУчета                       КАК РазделУчета,
	|	СебестоимостьПродаж.ВидЗапасов                        КАК ВидЗапасов,
	|	СебестоимостьПродаж.Организация               		  КАК Организация,
	|	СебестоимостьПродаж.Партия                            КАК Партия,
	|	СебестоимостьПродаж.АналитикаУчетаПартий              КАК АналитикаУчетаПартий,
	|	СебестоимостьПродаж.АналитикаФинансовогоУчета         КАК АналитикаФинансовогоУчета,
	|	СебестоимостьПродаж.ВидДеятельностиНДС                КАК ВидДеятельностиНДС,
	|
	|	СУММА(СебестоимостьПродаж.ДопРасходы)             	  КАК ДопРасходы,
	|	СУММА(СебестоимостьПродаж.ДопРасходыБезНДС)       	  КАК ДопРасходыБезНДС,
	|	СУММА(СебестоимостьПродаж.ДопРасходыРегл)             КАК ДопРасходыРегл,
	|	СУММА(СебестоимостьПродаж.ДопРасходыУпр)    		  КАК ДопРасходыУпр
	|
	|ПОМЕСТИТЬ ВтСуммыДопРасходовПрошлыхПериодов
	|ИЗ (
	|	ВЫБРАТЬ
	|		СебестоимостьПродаж.ДокументДвижения,
	|		СебестоимостьПродаж.АналитикаУчетаНоменклатуры,
	|		СебестоимостьПродаж.РазделУчета,
	|		СебестоимостьПродаж.ВидЗапасов,
	|		АналитикаПартнеров.Организация,
	|		СебестоимостьПродаж.Партия,
	|		СебестоимостьПродаж.АналитикаУчетаПартий,
	|		СебестоимостьПродаж.АналитикаФинансовогоУчета,
	|		СебестоимостьПродаж.ВидДеятельностиНДС,
	|
	|		СебестоимостьПродаж.ДопРасходы,
	|		СебестоимостьПродаж.ДопРасходыБезНДС,
	|		СебестоимостьПродаж.ДопРасходыРегл,
	|		СебестоимостьПродаж.ДопРасходыУпр
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК СебестоимостьПродаж
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК АналитикаПартнеров
	|			ПО СебестоимостьПродаж.АналитикаУчетаПоПартнерам = АналитикаПартнеров.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРеализацииПрошлыхПериодов КАК Продажи
	|			ПО Продажи.Ссылка = СебестоимостьПродаж.ДокументДвижения
	|	ГДЕ
	|		СебестоимостьПродаж.Период < &НачалоПериода
	|		И АналитикаПартнеров.Организация В(&МассивОрганизаций)
	|		И СебестоимостьПродаж.РасчетПартий
	|		И СебестоимостьПродаж.Активность
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		СебестоимостьПродаж.ДокументДвижения,
	|		СебестоимостьПродаж.АналитикаУчетаНоменклатуры,
	|		СебестоимостьПродаж.РазделУчета,
	|		СебестоимостьПродаж.ВидЗапасов,
	|		АналитикаПартнеров.Организация,
	|		СебестоимостьПродаж.Партия,
	|		СебестоимостьПродаж.АналитикаУчетаПартий,
	|		СебестоимостьПродаж.АналитикаФинансовогоУчета,
	|		СебестоимостьПродаж.ВидДеятельностиНДС,
	|
	|		СебестоимостьПродаж.ДопРасходы,
	|		СебестоимостьПродаж.ДопРасходыБезНДС,
	|		СебестоимостьПродаж.ДопРасходыРегл,
	|		СебестоимостьПродаж.ДопРасходыУпр
	|	ИЗ
	|		ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК СебестоимостьПродаж
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК АналитикаПартнеров
	|			ПО СебестоимостьПродаж.АналитикаУчетаПоПартнерам = АналитикаПартнеров.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРеализацииПрошлыхПериодов КАК Продажи
	|			ПО Продажи.Ссылка = СебестоимостьПродаж.ДокументДвижения
	|	ГДЕ
	|		СебестоимостьПродаж.РасчетПартий
	|
	|	) КАК СебестоимостьПродаж
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьПродаж.ДокументДвижения,
	|	СебестоимостьПродаж.АналитикаУчетаНоменклатуры,
	|	СебестоимостьПродаж.РазделУчета,
	|	СебестоимостьПродаж.ВидЗапасов,
	|	СебестоимостьПродаж.Организация,
	|	СебестоимостьПродаж.Партия,
	|	СебестоимостьПродаж.АналитикаУчетаПартий,
	|	СебестоимостьПродаж.АналитикаФинансовогоУчета,
	|	СебестоимостьПродаж.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Выручка.Регистратор,
	|	Выручка.АналитикаУчетаНоменклатуры,
	|	Выручка.ВидЗапасов,
	|	Выручка.ЗаказКлиента,
	|	МАКСИМУМ(Выручка.Соглашение) КАК Соглашение,
	|	МАКСИМУМ(Выручка.Менеджер) КАК Менеджер,
	|	МАКСИМУМ(Выручка.Склад) КАК Склад,
	|	МАКСИМУМ(Выручка.Договор) КАК Договор,
	|	МАКСИМУМ(Выручка.ИсточникГФУНоменклатуры) КАК ИсточникГФУНоменклатуры,
	|	МАКСИМУМ(Выручка.ИсточникГФУРасчетов) КАК ИсточникГФУРасчетов
	|ПОМЕСТИТЬ РеквизитыВыручки
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Выручка
	|ГДЕ
	|	Выручка.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|СГРУППИРОВАТЬ ПО
	|	Выручка.Регистратор,
	|	Выручка.АналитикаУчетаНоменклатуры,
	|	Выручка.ВидЗапасов,
	|	Выручка.ЗаказКлиента
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Движения.Регистратор,
	|	Движения.АналитикаУчетаНоменклатуры,
	|	Движения.ВидЗапасов,
	|	МАКСИМУМ(Движения.Склад) КАК Склад,
	|	МАКСИМУМ(Движения.ИсточникГФУНоменклатуры) КАК ИсточникГФУНоменклатуры
	|ПОМЕСТИТЬ РеквизитыДвиженияНоменклатураДоходыРасходы
	|ИЗ
	|	РегистрНакопления.ДвиженияНоменклатураДоходыРасходы КАК Движения
	|ГДЕ
	|	Движения.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Движения.Организация В(&МассивОрганизаций)
	|	И Движения.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы)
	|	И НЕ Движения.РасчетСебестоимости
	|	И Движения.Активность
	|СГРУППИРОВАТЬ ПО
	|	Движения.Регистратор,
	|	Движения.АналитикаУчетаНоменклатуры,
	|	Движения.ВидЗапасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Себестоимость.Период                              КАК Период,
	|	Себестоимость.Регистратор                         КАК Регистратор,
	|	ВЫБОР КОГДА Себестоимость.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                   						  КАК ВидДвижения,
	|	Себестоимость.АналитикаУчетаНоменклатуры          КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета                         КАК РазделУчета,
	|	Себестоимость.ВидЗапасов                          КАК ВидЗапасов,
	|	Себестоимость.ВидЗапасов.ТипЗапасов               КАК ТипЗапасов,
	|	Себестоимость.Партия                          	  КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий                КАК АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета           КАК АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС                  КАК ВидДеятельностиНДС,
	|	(ВЫБОР
	|		КОГДА Себестоимость.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА Себестоимость.ВидДеятельностиНДС
	|		ИНАЧЕ Себестоимость.КорВидДеятельностиНДС
	|	КОНЕЦ)                                            КАК КорВидДеятельностиНДС,
	|
	// В кор. части могут быть данные об исходной аналитике продажи (если возврат идет на другой склад)
	|	ВЫБОР КОГДА Себестоимость.КорВидЗапасов <> Значение(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|			Себестоимость.КорВидЗапасов
	|		ИНАЧЕ
	|			Себестоимость.ВидЗапасов
	|	КОНЕЦ                                             КАК ВидыЗапасовДляЦены,
	// В кор. части могут быть данные об исходном виде запасов продажи (в случае возврата проданного по Интеркампани товара)
	|	ВЫБОР КОГДА Себестоимость.КорАналитикаУчетаНоменклатуры <> Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) ТОГДА
	|			Себестоимость.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ
	|			Себестоимость.АналитикаУчетаНоменклатуры
	|	КОНЕЦ                                             КАК АналитикаНоменклатурыДляЦены,
	|
	|	СУММА(Себестоимость.Количество)                   КАК Количество,
	|
	|	СУММА(Себестоимость.Стоимость)                    КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС)              КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.СтоимостьЗабалансовая)        КАК СтоимостьЗабалансовая,
	|
	|	СУММА(Себестоимость.ДопРасходы)             	  КАК ДопРасходы,
	|	СУММА(Себестоимость.ДопРасходыБезНДС)       	  КАК ДопРасходыБезНДС,
	|	СУММА(Себестоимость.Трудозатраты)       		  КАК Трудозатраты,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеСНДС)	  КАК ПостатейныеПостоянныеСНДС,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеБезНДС)  КАК ПостатейныеПостоянныеБезНДС,
	|	СУММА(Себестоимость.ПостатейныеПеременныеСНДС)	  КАК ПостатейныеПеременныеСНДС,
	|	СУММА(Себестоимость.ПостатейныеПеременныеБезНДС)  КАК ПостатейныеПеременныеБезНДС,
	|
	|	СУММА(Себестоимость.СтоимостьРегл)                КАК СтоимостьРегл,
	|	СУММА(Себестоимость.СтоимостьЗабалансоваяРегл)    КАК СтоимостьЗабалансоваяРегл,
	|
	|	СУММА(Себестоимость.ПостояннаяРазница)            КАК ПостояннаяРазница,
	|	СУММА(Себестоимость.ВременнаяРазница)             КАК ВременнаяРазница,
	|
	|	СУММА(Себестоимость.ДопРасходыРегл)               КАК ДопРасходыРегл,
	|	СУММА(Себестоимость.ТрудозатратыРегл)             КАК ТрудозатратыРегл,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеРегл)	  КАК ПостатейныеПостоянныеРегл,
	|	СУММА(Себестоимость.ПостатейныеПеременныеРегл)	  КАК ПостатейныеПеременныеРегл,
	
	|	СУММА(Себестоимость.СтоимостьУпр)	  			  КАК СтоимостьУпр,
	|	СУММА(Себестоимость.ДопРасходыУпр)	  			  КАК ДопРасходыУпр,
	|	СУММА(Себестоимость.ТрудозатратыУпр)	  		  КАК ТрудозатратыУпр,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеУпр)	  КАК ПостатейныеПостоянныеУпр,
	|	СУММА(Себестоимость.ПостатейныеПеременныеУпр)	  КАК ПостатейныеПеременныеУпр,
	|
	|	Себестоимость.ХозяйственнаяОперация               КАК ХозяйственнаяОперация,
	|	Себестоимость.КорАналитикаУчетаНоменклатуры       КАК КорАналитикаУчетаНоменклатуры,
	|	Себестоимость.КорРазделУчета                      КАК КорРазделУчета,
	|	Себестоимость.КорВидЗапасов                       КАК КорВидЗапасов,
	|	Себестоимость.КорВидЗапасов.ТипЗапасов            КАК КорТипЗапасов,
	|	Себестоимость.АналитикаУчетаПоПартнерам           КАК АналитикаУчетаПоПартнерам,
	|	Себестоимость.ЗаказКлиента                        КАК ЗаказКлиента,
	|	Себестоимость.Подразделение                       КАК Подразделение,
	|	Себестоимость.Организация                         КАК Организация,
	|	Себестоимость.КорОрганизация                      КАК КорОрганизация,
	|	Себестоимость.ПериодПродажи                       КАК ПериодПродажи,
	|	ЕСТЬNULL(СторноОтчетыКомиссионера.Период,
	|		НАЧАЛОПЕРИОДА(Себестоимость.ПериодПродажи, МЕСЯЦ)) КАК ПериодРеализации,
	|	Себестоимость.АналитикаРасходов                   КАК АналитикаРасходов,
	|	Себестоимость.СтатьяРасходовСписания              КАК СтатьяРасходовСписания,
	|	Себестоимость.СтатьяДоходов                       КАК СтатьяДоходов,
	|	Себестоимость.АналитикаДоходов                    КАК АналитикаДоходов,
	|	Себестоимость.ГруппаПродукции                     КАК ГруппаПродукции,
	|	Себестоимость.ИдентификаторСтроки                 КАК ИдентификаторСтроки,
	|	Себестоимость.КодСтроки                 		  КАК КодСтроки,
	|	Себестоимость.КорПартия                 		  КАК КорПартия,
	|	Себестоимость.КорАналитикаУчетаПартий             КАК КорАналитикаУчетаПартий,
	|	Себестоимость.КорАналитикаФинансовогоУчета        КАК КорАналитикаФинансовогоУчета,
	|	Себестоимость.НДСРегл                 			  КАК НДСРегл,
	|	Себестоимость.НДСУпр                 			  КАК НДСУпр,
	|	Себестоимость.СтатьяКалькуляции                   КАК СтатьяКалькуляции,
	|	Себестоимость.ТипЗаписи                 		  КАК ТипЗаписи,
	|	Себестоимость.ДокументИсточник                 	  КАК ДокументИсточник,
	|	Себестоимость.НастройкаХозяйственнойОперации      КАК НастройкаХозяйственнойОперации,
	|	Себестоимость.ИдентификаторФинЗаписи              КАК ИдентификаторФинЗаписи,
	|	ЕСТЬNULL(РеквизитыВыручки.Соглашение, НЕОПРЕДЕЛЕНО) КАК Соглашение,
	|	ЕСТЬNULL(РеквизитыВыручки.Менеджер, НЕОПРЕДЕЛЕНО) КАК Менеджер,
	|	(ВЫБОР
	|		КОГДА НЕ СторноСписанияНаРасходы.Склад ЕСТЬ NULL
	|			ТОГДА РеквизитыДвиженияНоменклатураДоходыРасходы.Склад
	|		ИНАЧЕ ЕСТЬNULL(РеквизитыВыручки.Склад, НЕОПРЕДЕЛЕНО) КОНЕЦ) КАК Склад,
	|	ЕСТЬNULL(РеквизитыВыручки.Договор, НЕОПРЕДЕЛЕНО) КАК Договор,
	|	(ВЫБОР
	|		КОГДА НЕ СторноСписанияНаРасходы.Склад ЕСТЬ NULL
	|			ТОГДА РеквизитыДвиженияНоменклатураДоходыРасходы.ИсточникГФУНоменклатуры
	|		ИНАЧЕ ЕСТЬNULL(РеквизитыВыручки.ИсточникГФУНоменклатуры, НЕОПРЕДЕЛЕНО) КОНЕЦ) КАК ИсточникГФУНоменклатуры,
	|	ЕСТЬNULL(РеквизитыВыручки.ИсточникГФУРасчетов, НЕОПРЕДЕЛЕНО) КАК ИсточникГФУРасчетов,
	|
	|	ВЫБОР КОГДА Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
	|	  И Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|	  И (НЕ &ПартионныйУчетВерсии22 ИЛИ Себестоимость.ПериодПродажи < &ДатаПереходаНаПартионныйУчетВерсии22)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ											  КАК ПоЦенеПродажи,
	|	ВЫБОР КОГДА Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
	|	  И Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|	  И &ПартионныйУчетВерсии22
	|	  И Себестоимость.ПериодПродажи > &ДатаПереходаНаПартионныйУчетВерсии22
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ											  КАК ПоЦенеПродажи22
	|ПОМЕСТИТЬ ВтВозвратыПрошлыхПериодов
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрочееОприходованиеТоваров КАК СторноСписанияНаРасходы
	|		ПО СторноСписанияНаРасходы.Ссылка = Себестоимость.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ СторноОтчетыКомиссионера КАК СторноОтчетыКомиссионера
	|		ПО СторноОтчетыКомиссионера.АналитикаУчетаНоменклатуры = Себестоимость.АналитикаУчетаНоменклатуры
	|		И СторноОтчетыКомиссионера.РазделУчета = Себестоимость.РазделУчета
	|		И СторноОтчетыКомиссионера.ВидЗапасов = Себестоимость.ВидЗапасов
	|		И СторноОтчетыКомиссионера.Организация = Себестоимость.Организация
	|	ЛЕВОЕ СОЕДИНЕНИЕ РеквизитыВыручки КАК РеквизитыВыручки
	|		ПО РеквизитыВыручки.Регистратор = Себестоимость.Регистратор
	|		И РеквизитыВыручки.АналитикаУчетаНоменклатуры = Себестоимость.АналитикаУчетаНоменклатуры
	|		И РеквизитыВыручки.ВидЗапасов = Себестоимость.ВидЗапасов
	|		И РеквизитыВыручки.ЗаказКлиента = Себестоимость.ЗаказКлиента
	|	ЛЕВОЕ СОЕДИНЕНИЕ РеквизитыДвиженияНоменклатураДоходыРасходы КАК РеквизитыДвиженияНоменклатураДоходыРасходы
	|		ПО РеквизитыДвиженияНоменклатураДоходыРасходы.Регистратор = Себестоимость.Регистратор
	|		И РеквизитыДвиженияНоменклатураДоходыРасходы.АналитикаУчетаНоменклатуры = Себестоимость.АналитикаУчетаНоменклатуры
	|		И РеквизитыДвиженияНоменклатураДоходыРасходы.ВидЗапасов = Себестоимость.ВидЗапасов
	|ГДЕ
	|	((Себестоимость.СлужебноеВидДвиженияПриход
	|		И Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов))
	|		ИЛИ (Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|			И НЕ СторноОтчетыКомиссионера.Период ЕСТЬ NULL)
	|	)
	|	И НЕ Себестоимость.РасчетСебестоимости
	// Для записей "Сторно" стоимость определяется в процедуре СкорректироватьСтоимостьСторноДвиженийИсправленныхДокументов() 
	|	И НЕ Себестоимость.Сторно
	|	
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Период,
	|	ВЫБОР КОГДА Себестоимость.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.ВидЗапасов.ТипЗапасов,
	|	Себестоимость.Подразделение,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	(ВЫБОР
	|		КОГДА Себестоимость.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА Себестоимость.ВидДеятельностиНДС
	|		ИНАЧЕ Себестоимость.КорВидДеятельностиНДС
	|	КОНЕЦ),
	|	ВЫБОР КОГДА Себестоимость.КорАналитикаУчетаНоменклатуры <> Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		ТОГДА Себестоимость.КорАналитикаУчетаНоменклатуры
	|	ИНАЧЕ Себестоимость.АналитикаУчетаНоменклатуры КОНЕЦ,
	|	ВЫБОР КОГДА Себестоимость.КорВидЗапасов <> Значение(Справочник.ВидыЗапасов.ПустаяСсылка) ТОГДА
	|			Себестоимость.КорВидЗапасов
	|		ИНАЧЕ
	|			Себестоимость.ВидЗапасов
	|	КОНЕЦ,
	|	Себестоимость.КорАналитикаУчетаНоменклатуры,
	|	Себестоимость.ЗаказКлиента,
	|	Себестоимость.АналитикаУчетаПоПартнерам,
	|	Себестоимость.ХозяйственнаяОперация,
	|	Себестоимость.КорРазделУчета,
	|	Себестоимость.КорВидЗапасов,
	|	Себестоимость.КорВидЗапасов.ТипЗапасов,
	|	Себестоимость.ПериодПродажи,
	|	ЕСТЬNULL(СторноОтчетыКомиссионера.Период,
	|		НАЧАЛОПЕРИОДА(Себестоимость.ПериодПродажи, МЕСЯЦ)),
	|	Себестоимость.Организация,
	|	Себестоимость.КорОрганизация,
	|	Себестоимость.АналитикаРасходов,
	|	Себестоимость.СтатьяРасходовСписания,
	|	Себестоимость.СтатьяДоходов,
	|	Себестоимость.АналитикаДоходов,
	|	Себестоимость.ГруппаПродукции,
	|	Себестоимость.Регистратор,
	|	Себестоимость.ИдентификаторСтроки,
	|	Себестоимость.КодСтроки,
	|	Себестоимость.КорПартия,
	|	Себестоимость.КорАналитикаУчетаПартий,
	|	Себестоимость.КорАналитикаФинансовогоУчета,
	|	Себестоимость.НДСРегл,
	|	Себестоимость.НДСУпр,
	|	Себестоимость.СтатьяКалькуляции,
	|	Себестоимость.ТипЗаписи,
	|	Себестоимость.ДокументИсточник,
	|	Себестоимость.НастройкаХозяйственнойОперации,
	|	Себестоимость.ИдентификаторФинЗаписи,
	|	ЕСТЬNULL(РеквизитыВыручки.Соглашение, НЕОПРЕДЕЛЕНО),
	|	ЕСТЬNULL(РеквизитыВыручки.Менеджер, НЕОПРЕДЕЛЕНО),
	|	(ВЫБОР
	|		КОГДА НЕ СторноСписанияНаРасходы.Склад ЕСТЬ NULL
	|			ТОГДА РеквизитыДвиженияНоменклатураДоходыРасходы.Склад
	|		ИНАЧЕ ЕСТЬNULL(РеквизитыВыручки.Склад, НЕОПРЕДЕЛЕНО) КОНЕЦ), // Склад
	|	ЕСТЬNULL(РеквизитыВыручки.Договор, НЕОПРЕДЕЛЕНО),
	|	(ВЫБОР
	|		КОГДА НЕ СторноСписанияНаРасходы.Склад ЕСТЬ NULL
	|			ТОГДА РеквизитыДвиженияНоменклатураДоходыРасходы.ИсточникГФУНоменклатуры
	|		ИНАЧЕ ЕСТЬNULL(РеквизитыВыручки.ИсточникГФУНоменклатуры, НЕОПРЕДЕЛЕНО) КОНЕЦ), // ИсточникГФУНоменклатуры
	|	ЕСТЬNULL(РеквизитыВыручки.ИсточникГФУРасчетов, НЕОПРЕДЕЛЕНО),
	|	ВЫБОР КОГДА Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
	|	  И Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|	  И (НЕ &ПартионныйУчетВерсии22 ИЛИ Себестоимость.ПериодПродажи < &ДатаПереходаНаПартионныйУчетВерсии22)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
	|	  И Себестоимость.ХозяйственнаяОперация В (&МассивОперацийВозвратыПрошлыхПериодов)
	|	  И &ПартионныйУчетВерсии22
	|	  И Себестоимость.ПериодПродажи > &ДатаПереходаНаПартионныйУчетВерсии22
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаВозвратов.Период                        КАК Период,
	|	ТаблицаВозвратов.Регистратор                   КАК Регистратор,
	|	ТаблицаВозвратов.Регистратор                   КАК ДокументДвижения,
	|	ТаблицаВозвратов.ВидДвижения                   КАК ВидДвижения,
	|	ТаблицаВозвратов.Организация                   КАК Организация,
	|	ТаблицаВозвратов.КорОрганизация                КАК КорОрганизация,
	|	ТаблицаВозвратов.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаВозвратов.РазделУчета                   КАК РазделУчета,
	|	ТаблицаВозвратов.ВидЗапасов                    КАК ВидЗапасов,
	|	ТаблицаВозвратов.Партия                        КАК Партия,
	|	ТаблицаВозвратов.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	ТаблицаВозвратов.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	ТаблицаВозвратов.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	ЕСТЬNULL(ТаблицаВозвратов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) КАК ТипЗапасов,
	|	ТаблицаВозвратов.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	ТаблицаВозвратов.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	ТаблицаВозвратов.КорРазделУчета                КАК КорРазделУчета,
	|	ТаблицаВозвратов.КорВидЗапасов                 КАК КорВидЗапасов,
	|	ТаблицаВозвратов.ТипЗапасов                    КАК КорТипЗапасов,
	|	ТаблицаВозвратов.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаВозвратов.ЗаказКлиента                  КАК ЗаказКлиента,
	|	ТаблицаВозвратов.Подразделение                 КАК Подразделение,
	|	ТаблицаВозвратов.ПериодРеализации              КАК ПериодРеализации,
	|	ТаблицаВозвратов.АналитикаДоходов              КАК АналитикаДоходов,
	|	ТаблицаВозвратов.СтатьяДоходов                 КАК СтатьяДоходов,
	|	ТаблицаВозвратов.АналитикаРасходов             КАК АналитикаРасходов,
	|	ТаблицаВозвратов.СтатьяРасходовСписания        КАК СтатьяРасходовСписания,
	|	ТаблицаВозвратов.ГруппаПродукции               КАК ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК КорНаправлениеДеятельности,
	//++ Локализация
	//++ НЕ УТ
	|	ЛОЖЬ                                           КАК СписаниеПриПередачеНУ,
	//-- НЕ УТ
	//-- Локализация
	|	ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовУпр, НЕОПРЕДЕЛЕНО) КАК ВариантРаспределенияРасходовУпр,
	|	ЕСТЬNULL(СтатьиРасходов.ВариантРаспределенияРасходовРегл, НЕОПРЕДЕЛЕНО) КАК ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(СтатьиРасходов.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	НЕОПРЕДЕЛЕНО                                   КАК АналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО                                   КАК СтатьяАктивовПассивов,
	|	ТаблицаВозвратов.ИдентификаторСтроки           КАК ИдентификаторСтроки,
	|	ТаблицаВозвратов.КодСтроки                 	   КАК КодСтроки,
	|	ТаблицаВозвратов.Менеджер                      КАК Менеджер,
	|	ТаблицаВозвратов.Склад                         КАК Склад,
	|	ТаблицаВозвратов.Соглашение                    КАК Соглашение,
	|	ТаблицаВозвратов.Договор                       КАК Договор,
	|	ТаблицаВозвратов.ИсточникГФУНоменклатуры       КАК ИсточникГФУНоменклатуры,
	|	ТаблицаВозвратов.ИсточникГФУРасчетов           КАК ИсточникГФУРасчетов,
	|	ТаблицаВозвратов.ПериодПродажи                 КАК ПериодПродажи,
	|	ТаблицаВозвратов.КорПартия                     КАК КорПартия,
	|	ТаблицаВозвратов.КорАналитикаУчетаПартий       КАК КорАналитикаУчетаПартий,
	|	ТаблицаВозвратов.КорАналитикаФинансовогоУчета  КАК КорАналитикаФинансовогоУчета,
	|	ТаблицаВозвратов.КорВидДеятельностиНДС         КАК КорВидДеятельностиНДС,
	|	ТаблицаВозвратов.НДСРегл                       КАК НДСРегл,
	|	ТаблицаВозвратов.НДСУпр                        КАК НДСУпр,
	|	ТаблицаВозвратов.СтатьяКалькуляции             КАК СтатьяКалькуляции,
	|	ТаблицаВозвратов.ТипЗаписи                     КАК ТипЗаписи,
	|	ТаблицаВозвратов.ДокументИсточник              КАК ДокументИсточник,
	|	ТаблицаВозвратов.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	ТаблицаВозвратов.ИдентификаторФинЗаписи        КАК ИдентификаторФинЗаписи,
	|	ЛОЖЬ                                           КАК Сторно,
	|	0                                              КАК КорСтоимость,
	|
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.Стоимость / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.Стоимость / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.Стоимость
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.Стоимость КАК ЧИСЛО(31,2)) 							КАК Стоимость,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.СтоимостьБезНДС / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.СтоимостьБезНДС / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьБезНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СтоимостьБезНДС КАК ЧИСЛО(31,2)) 					КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.СтоимостьЗабалансовая / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.СтоимостьЗабалансовая / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьЗабалансовая
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СтоимостьЗабалансовая КАК ЧИСЛО(31,2)) 				КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ДопРасходы / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА (СтоимостиПродаж22.ДопРасходы + ЕСТЬNULL(СуммыДопРасходов.ДопРасходы, 0)) / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьДопРасходы
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ДопРасходы КАК ЧИСЛО(31,2)) 						КАК ДопРасходы,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ДопРасходыБезНДС / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА (СтоимостиПродаж22.ДопРасходыБезНДС + ЕСТЬNULL(СуммыДопРасходов.ДопРасходыБезНДС, 0)) / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьДопРасходыБезНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ДопРасходыБезНДС КАК ЧИСЛО(31,2)) 					КАК ДопРасходыБезНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.Трудозатраты / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.Трудозатраты / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.Трудозатраты
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.Трудозатраты КАК ЧИСЛО(31,2)) 						КАК Трудозатраты,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПостоянныеСНДС / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПостоянныеСНДС / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПостоянныеСНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПостоянныеСНДС КАК ЧИСЛО(31,2)) 			КАК ПостатейныеПостоянныеСНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПостоянныеБезНДС / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПостоянныеБезНДС / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПостоянныеБезНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПостоянныеБезНДС КАК ЧИСЛО(31,2)) 		КАК ПостатейныеПостоянныеБезНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПеременныеСНДС / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПеременныеСНДС / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПеременныеСНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПеременныеСНДС КАК ЧИСЛО(31,2)) 			КАК ПостатейныеПеременныеСНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПеременныеБезНДС / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПеременныеБезНДС / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПеременныеБезНДС
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПеременныеБезНДС КАК ЧИСЛО(31,2)) 		КАК ПостатейныеПеременныеБезНДС,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.СтоимостьРегл / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.СтоимостьРегл / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СтоимостьРегл КАК ЧИСЛО(31,2)) 						КАК СтоимостьРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.СтоимостьЗабалансоваяРегл / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.СтоимостьЗабалансоваяРегл / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьЗабалансоваяРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СтоимостьЗабалансоваяРегл КАК ЧИСЛО(31,2)) 			КАК СтоимостьЗабалансоваяРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостояннаяРазница / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостояннаяРазница / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостояннаяРазница
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостояннаяРазница КАК ЧИСЛО(31,2)) 					КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ВременнаяРазница / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ВременнаяРазница / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ВременнаяРазница
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ВременнаяРазница КАК ЧИСЛО(31,2)) 					КАК ВременнаяРазница,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ДопРасходыРегл / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА (СтоимостиПродаж22.ДопРасходыРегл + ЕСТЬNULL(СуммыДопРасходов.ДопРасходыРегл, 0)) / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ДопРасходыРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ДопРасходыРегл КАК ЧИСЛО(31,2)) 					КАК ДопРасходыРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ТрудозатратыРегл / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ТрудозатратыРегл / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ТрудозатратыРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ТрудозатратыРегл КАК ЧИСЛО(31,2)) 					КАК ТрудозатратыРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПостоянныеРегл / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПостоянныеРегл / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПостоянныеРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПостоянныеРегл КАК ЧИСЛО(31,2)) 			КАК ПостатейныеПостоянныеРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПеременныеРегл / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПеременныеРегл / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПеременныеРегл
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПеременныеРегл КАК ЧИСЛО(31,2)) 			КАК ПостатейныеПеременныеРегл,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.СтоимостьУпр / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.СтоимостьУпр / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.СтоимостьУпр
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.СтоимостьУпр КАК ЧИСЛО(31,2)) 						КАК СтоимостьУпр,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ДопРасходыУпр / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА (СтоимостиПродаж22.ДопРасходыУпр + ЕСТЬNULL(СуммыДопРасходов.ДопРасходыУпр, 0)) / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ДопРасходыУпр
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ДопРасходыУпр КАК ЧИСЛО(31,2)) 						КАК ДопРасходыУпр,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ТрудозатратыУпр / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ТрудозатратыУпр / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ТрудозатратыУпр
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ТрудозатратыУпр КАК ЧИСЛО(31,2)) 					КАК ТрудозатратыУпр,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПостоянныеУпр / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПостоянныеУпр / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПостоянныеУпр
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПостоянныеУпр КАК ЧИСЛО(31,2)) 			КАК ПостатейныеПостоянныеУпр,
	|	ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА ТаблицаВозвратов.ПоЦенеПродажи И НЕ СтоимостиПродаж.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж.ПостатейныеПеременныеУпр / СтоимостиПродаж.Количество
	|		КОГДА ТаблицаВозвратов.ПоЦенеПродажи22 И НЕ СтоимостиПродаж22.Ссылка ЕСТЬ NULL
	|			ТОГДА СтоимостиПродаж22.ПостатейныеПеременныеУпр / СтоимостиПродаж22.Количество
	|			ИНАЧЕ СтоимостьТоваров.ПостатейныеПеременныеУпр
	|		КОНЕЦ * ТаблицаВозвратов.Количество
	|		- ТаблицаВозвратов.ПостатейныеПеременныеУпр КАК ЧИСЛО(31,2)) 			КАК ПостатейныеПеременныеУпр,
	|	0 КАК РезервПодОбесценениеРегл,
	|	0 КАК РезервПодОбесценениеУпр
	|
	|ПОМЕСТИТЬ ДвиженияТаблицаКорректировки
	|ИЗ
	|	ВтВозвратыПрошлыхПериодов КАК ТаблицаВозвратов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтСуммыРеализацийПрошлыхПериодов КАК СтоимостиПродаж
	|		ПО ТаблицаВозвратов.ПоЦенеПродажи
	|			И ТаблицаВозвратов.ДокументИсточник          	= СтоимостиПродаж.Ссылка
	|			И ТаблицаВозвратов.АналитикаНоменклатурыДляЦены = СтоимостиПродаж.АналитикаУчетаНоменклатуры
	|			И (ТаблицаВозвратов.ВидыЗапасовДляЦены        	= СтоимостиПродаж.ВидЗапасов
	|				ИЛИ СтоимостиПродаж.ВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка))
	|			И ТаблицаВозвратов.Организация               	= СтоимостиПродаж.Организация
	|			И ТаблицаВозвратов.РазделУчета               	= СтоимостиПродаж.РазделУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтСуммыРеализацийПрошлыхПериодов КАК СтоимостиПродаж22
	|		ПО ТаблицаВозвратов.ПоЦенеПродажи22
	|			И ТаблицаВозвратов.ДокументИсточник          	= СтоимостиПродаж22.Ссылка
	|			И ТаблицаВозвратов.АналитикаНоменклатурыДляЦены = СтоимостиПродаж22.АналитикаУчетаНоменклатуры
	|			И (ТаблицаВозвратов.ВидыЗапасовДляЦены        	= СтоимостиПродаж22.ВидЗапасов
	|				ИЛИ СтоимостиПродаж22.ВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка))
	|			И ТаблицаВозвратов.Организация               	= СтоимостиПродаж22.Организация
	|			И ТаблицаВозвратов.РазделУчета               	= СтоимостиПродаж22.РазделУчета
	|			И ТаблицаВозвратов.Партия               		= СтоимостиПродаж22.Партия
	|			И ТаблицаВозвратов.АналитикаУчетаПартий         = СтоимостиПродаж22.АналитикаУчетаПартий
	|			И ТаблицаВозвратов.АналитикаФинансовогоУчета    = СтоимостиПродаж22.АналитикаФинансовогоУчета
	|			И ТаблицаВозвратов.КорВидДеятельностиНДС        = СтоимостиПродаж22.ВидДеятельностиНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтСуммыДопРасходовПрошлыхПериодов КАК СуммыДопРасходов
	|		ПО ТаблицаВозвратов.ДокументИсточник          		= СуммыДопРасходов.Ссылка
	|			И ТаблицаВозвратов.АналитикаНоменклатурыДляЦены = СуммыДопРасходов.АналитикаУчетаНоменклатуры
	|			И (ТаблицаВозвратов.ВидыЗапасовДляЦены        	= СуммыДопРасходов.ВидЗапасов
	|				ИЛИ СуммыДопРасходов.ВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка))
	|			И ТаблицаВозвратов.Организация               	= СуммыДопРасходов.Организация
	|			И ТаблицаВозвратов.РазделУчета               	= СуммыДопРасходов.РазделУчета
	|			И ТаблицаВозвратов.Партия               		= СуммыДопРасходов.Партия
	|			И ТаблицаВозвратов.АналитикаУчетаПартий         = СуммыДопРасходов.АналитикаУчетаПартий
	|			И ТаблицаВозвратов.АналитикаФинансовогоУчета    = СуммыДопРасходов.АналитикаФинансовогоУчета
	|			И ТаблицаВозвратов.КорВидДеятельностиНДС        = СуммыДопРасходов.ВидДеятельностиНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьТоваров КАК СтоимостьТоваров
	|		ПО ТаблицаВозвратов.ПериодРеализации          		= СтоимостьТоваров.Период
	|			И ТаблицаВозвратов.АналитикаНоменклатурыДляЦены = СтоимостьТоваров.АналитикаУчетаНоменклатуры
	|			И (ТаблицаВозвратов.ВидыЗапасовДляЦены        	= СтоимостьТоваров.ВидЗапасов
	|				ИЛИ СтоимостьТоваров.ВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка))
	|			И ТаблицаВозвратов.Организация               	= СтоимостьТоваров.Организация
	|			И ТаблицаВозвратов.РазделУчета               	= СтоимостьТоваров.РазделУчета
	|			И ТаблицаВозвратов.Партия = НЕОПРЕДЕЛЕНО
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|		ПО ТаблицаВозвратов.СтатьяРасходовСписания = СтатьиРасходов.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ТаблицаВозвратов.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО Назначения.Ссылка = Аналитика.Назначение
	|
	|ГДЕ
	|	(ТаблицаВозвратов.ПоЦенеПродажи И СтоимостиПродаж.Ссылка ЕСТЬ НЕ NULL)
	|		ИЛИ (ТаблицаВозвратов.ПоЦенеПродажи22 И СтоимостиПродаж22.Ссылка ЕСТЬ НЕ NULL)
	|		ИЛИ (НЕ ТаблицаВозвратов.ПоЦенеПродажи И СтоимостьТоваров.Период ЕСТЬ НЕ NULL)
	|		ИЛИ (НЕ ТаблицаВозвратов.ПоЦенеПродажи22 И СтоимостьТоваров.Период ЕСТЬ НЕ NULL)
	|";
#КонецОбласти
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	УсловиеЗапроса = "
	|	ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы)
	|	)";
	
	СтруктураКорректировкиСумм = Новый Структура();
	СтруктураКорректировкиСумм.Вставить("КоэффициентСуммыСНДС", -1);
	СтруктураКорректировкиСумм.Вставить("КоэффициентСуммыБезНДС", -1);
	СтруктураКорректировкиСумм.Вставить("КоэффициентСуммыРегл", -1);
	СтруктураКорректировкиСумм.Вставить("КоэффициентСуммыУпр", -1);
	СтруктураКорректировкиСумм.Вставить("КоэффициентКорСуммы", 0);

	СформироватьДвиженияНоменклатураДоходыРасходыЗапросом(ПараметрыРасчета, "ВтДоходыРасходыСторноСписаниеТоваров", 
		СоответствиеВременныхТаблицДвижений, УсловиеЗапроса, , , СтруктураКорректировкиСумм);

#Область СебестоимостьТоваров
	
	ИмяВременнойТаблицы = "ВтДвиженияВозвратыПрошлыхПериодов";
	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ДвиженияТаблицаКорректировки");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);

#КонецОбласти

#Область ВыручкаИСебестоимостьПродаж

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Т.Период,
	|	Т.Регистратор,
	// Измерения
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ЗаказКлиента,
	|	Т.АналитикаУчетаПоПартнерам,
	|	Т.Подразделение,
	|	Т.ТипЗапасов,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.Менеджер,
	|	Т.Склад,
	|	Т.Соглашение,
	|	Т.Договор,
	|	Т.ХозяйственнаяОперация,
	// Ресурсы
	|	-Т.Стоимость КАК Стоимость,
	|	-Т.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	-Т.ДопРасходы КАК ДопРасходы,
	|	-Т.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	-Т.СтоимостьУпр КАК СтоимостьУпр,
	|	-Т.СтоимостьРегл КАК СтоимостьРегл,
	|	-Т.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	-Т.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|	-Т.ПостояннаяРазница КАК ПостояннаяРазница,
	|	-Т.ДопРасходыУпр КАК ДопРасходыУпр,
	|	-Т.ДопРасходыРегл КАК ДопРасходыРегл,
	|	-Т.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|	-Т.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|	-Т.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|	-Т.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|	-Т.Трудозатраты КАК Трудозатраты,
	|	-Т.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|	-Т.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|	-Т.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|	-Т.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|	-Т.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
	|	-Т.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|	-Т.ВременнаяРазница КАК ВременнаяРазница,
	// Реквизиты
	|	Т.Регистратор КАК ДокументДвижения,
	|	Т.ИсточникГФУНоменклатуры,
	|	Т.ИсточникГФУРасчетов,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи
	|ПОМЕСТИТЬ ВтДвиженияСебестоимостьПродаж
	|ИЗ
	|	ДвиженияТаблицаКорректировки КАК Т
	|ГДЕ
	|	НЕ Т.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера))
	|";
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтДвиженияСебестоимостьПродажВозвратыПрошлыхПериодов";
	ИмяРегистра = Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияСебестоимостьПродаж");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияСебестоимостьПродаж", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);

#КонецОбласти

#Область ПрочиеДоходы

	// Формирование прочих доходов при возврате тары от клиента
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Т.Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Т.Регистратор,
	// Измерения
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.СтатьяДоходов,
	|	Т.АналитикаДоходов,
	// Ресурсы
	|	(ВЫБОР
	|		КОГДА Т.Стоимость + Т.ДопРасходы + Т.Трудозатраты + Т.ПостатейныеПостоянныеСНДС + Т.ПостатейныеПеременныеСНДС > 0
	|			ТОГДА Т.Стоимость + Т.ДопРасходы + Т.Трудозатраты + Т.ПостатейныеПостоянныеСНДС + Т.ПостатейныеПеременныеСНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК Сумма,
	|	(ВЫБОР
	|		КОГДА Т.СтоимостьРегл + Т.ДопРасходыРегл + Т.ТрудозатратыРегл + Т.ПостатейныеПостоянныеРегл + Т.ПостатейныеПеременныеРегл > 0
	|			ТОГДА Т.СтоимостьРегл + Т.ДопРасходыРегл + Т.ТрудозатратыРегл + Т.ПостатейныеПостоянныеРегл + Т.ПостатейныеПеременныеРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаРегл,
	|	(ВЫБОР
	|		КОГДА Т.СтоимостьУпр + Т.ДопРасходыУпр + Т.ТрудозатратыУпр + Т.ПостатейныеПостоянныеУпр + Т.ПостатейныеПеременныеУпр > 0
	|			ТОГДА Т.СтоимостьУпр + Т.ДопРасходыУпр + Т.ТрудозатратыУпр + Т.ПостатейныеПостоянныеУпр + Т.ПостатейныеПеременныеУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаУпр,
	// Реквизиты
	|	Т.ХозяйственнаяОперация,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи
	|ПОМЕСТИТЬ ВтДвиженияПрочиеДоходы
	|ИЗ
	|	ДвиженияТаблицаКорректировки КАК Т
	|ГДЕ
	|	&ИспользоватьУчетПрочихДоходовРасходов
	|	И Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов)
	|	И (Т.Стоимость + Т.ДопРасходы + Т.Трудозатраты + Т.ПостатейныеПостоянныеСНДС + Т.ПостатейныеПеременныеСНДС > 0
	|		ИЛИ Т.СтоимостьРегл + Т.ДопРасходыРегл + Т.ТрудозатратыРегл + Т.ПостатейныеПостоянныеРегл + Т.ПостатейныеПеременныеРегл > 0
	|		ИЛИ Т.СтоимостьУпр + Т.ДопРасходыУпр + Т.ТрудозатратыУпр + Т.ПостатейныеПостоянныеУпр + Т.ПостатейныеПеременныеУпр > 0
	|		)
	|";
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтДвиженияВозвратыПрошлыхПериодовПрочиеДоходы";
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеДоходы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияПрочиеДоходы");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияПрочиеДоходы", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);

#КонецОбласти

#Область ПрочиеРасходы

	// Формирование прочих расходов при возврате тары от клиента
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Т.Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Т.Регистратор,
	// Измерения
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.СтатьяРасходовСписания КАК СтатьяРасходов,
	|	Т.АналитикаРасходов,
	// Реквизиты статьи расходов
	|	Т.ВариантРаспределенияРасходовУпр,
	|	Т.ВариантРаспределенияРасходовРегл,
	|	т.ПринятиеКНалоговомуУчету,
	// Ресурсы
	|	-(ВЫБОР
	|		КОГДА Т.Стоимость + Т.ДопРасходы + Т.Трудозатраты + Т.ПостатейныеПостоянныеСНДС + Т.ПостатейныеПеременныеСНДС < 0
	|			ТОГДА Т.Стоимость + Т.ДопРасходы + Т.Трудозатраты + Т.ПостатейныеПостоянныеСНДС + Т.ПостатейныеПеременныеСНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК Сумма,
	|	-(ВЫБОР
	|		КОГДА Т.СтоимостьБезНДС + Т.ДопРасходыБезНДС + Т.Трудозатраты + Т.ПостатейныеПостоянныеБезНДС + Т.ПостатейныеПеременныеБезНДС < 0
	|			ТОГДА Т.СтоимостьБезНДС + Т.ДопРасходыБезНДС + Т.Трудозатраты + Т.ПостатейныеПостоянныеБезНДС + Т.ПостатейныеПеременныеБезНДС
	|	 	ИНАЧЕ 0 КОНЕЦ) КАК СуммаБезНДС,
	|	-(ВЫБОР
	|		КОГДА Т.СтоимостьРегл + Т.ДопРасходыРегл + Т.ТрудозатратыРегл + Т.ПостатейныеПостоянныеРегл + Т.ПостатейныеПеременныеРегл < 0
	|			ТОГДА Т.СтоимостьРегл + Т.ДопРасходыРегл + Т.ТрудозатратыРегл + Т.ПостатейныеПостоянныеРегл + Т.ПостатейныеПеременныеРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаРегл,
	|	-(ВЫБОР
	|		КОГДА Т.СтоимостьРегл + Т.ДопРасходыРегл + Т.ТрудозатратыРегл + Т.ПостатейныеПостоянныеРегл + Т.ПостатейныеПеременныеРегл < 0
	|			ТОГДА Т.ПостояннаяРазница
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостояннаяРазница,
	|	-(ВЫБОР
	|		КОГДА Т.СтоимостьРегл + Т.ДопРасходыРегл + Т.ТрудозатратыРегл + Т.ПостатейныеПостоянныеРегл + Т.ПостатейныеПеременныеРегл < 0
	|			ТОГДА Т.ВременнаяРазница
	|		ИНАЧЕ 0 КОНЕЦ) КАК ВременнаяРазница,
	|	-(ВЫБОР
	|		КОГДА Т.СтоимостьУпр + Т.ДопРасходыУпр + Т.ТрудозатратыУпр + Т.ПостатейныеПостоянныеУпр + Т.ПостатейныеПеременныеУпр < 0
	|			ТОГДА Т.СтоимостьУпр + Т.ДопРасходыУпр + Т.ТрудозатратыУпр + Т.ПостатейныеПостоянныеУпр + Т.ПостатейныеПеременныеУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаУпр,
	// Реквизиты
	|	Т.ХозяйственнаяОперация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи
	|
	|ПОМЕСТИТЬ ВтДвиженияПрочиеРасходы
	|ИЗ
	|	ДвиженияТаблицаКорректировки КАК Т
	|ГДЕ
	|	&ИспользоватьУчетПрочихДоходовРасходов
	|	И Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов)
	|	И (Т.Стоимость + Т.ДопРасходы + Т.Трудозатраты + Т.ПостатейныеПостоянныеСНДС + Т.ПостатейныеПеременныеСНДС < 0
	|		ИЛИ Т.СтоимостьБезНДС + Т.ДопРасходыБезНДС + Т.Трудозатраты + Т.ПостатейныеПостоянныеБезНДС + Т.ПостатейныеПеременныеБезНДС < 0
	|		ИЛИ Т.СтоимостьРегл + Т.ДопРасходыРегл + Т.ТрудозатратыРегл + Т.ПостатейныеПостоянныеРегл + Т.ПостатейныеПеременныеРегл < 0
	|		ИЛИ Т.СтоимостьУпр + Т.ДопРасходыУпр + Т.ТрудозатратыУпр + Т.ПостатейныеПостоянныеУпр + Т.ПостатейныеПеременныеУпр < 0
	|		)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Т.Регистратор КАК ДокументДвижения,
	// Измерения
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	// Реквизиты статьи расходов
	|	Т.ВариантРаспределенияРасходовУпр,
	|	Т.ВариантРаспределенияРасходовРегл,
	|	т.ПринятиеКНалоговомуУчету,
	// Ресурсы
	|	-(Т.Стоимость + Т.ДопРасходы + Т.Трудозатраты + Т.ПостатейныеПостоянныеСНДС + Т.ПостатейныеПеременныеСНДС) КАК Сумма,
	|	-(Т.СтоимостьБезНДС + Т.ДопРасходыБезНДС + Т.Трудозатраты + Т.ПостатейныеПостоянныеБезНДС + Т.ПостатейныеПеременныеБезНДС) КАК СуммаБезНДС,
	|	-(Т.СтоимостьРегл + Т.ДопРасходыРегл + Т.ТрудозатратыРегл + Т.ПостатейныеПостоянныеРегл + Т.ПостатейныеПеременныеРегл) КАК СуммаРегл,
	|	-Т.ПостояннаяРазница КАК ПостояннаяРазница,
	|	-Т.ВременнаяРазница КАК ВременнаяРазница,
	|	-(Т.СтоимостьУпр + Т.ДопРасходыУпр + Т.ТрудозатратыУпр + Т.ПостатейныеПостоянныеУпр + Т.ПостатейныеПеременныеУпр) КАК СуммаУпр,
	// Реквизиты
	|	Т.ХозяйственнаяОперация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи
	|ИЗ
	|	ДвиженияТаблицаКорректировки КАК Т
	|ГДЕ
	|	&ИспользоватьУчетПрочихДоходовРасходов
	|	И Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы)
	|";
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтДвиженияВозвратыПрошлыхПериодовПрочиеРасходы";
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияПрочиеРасходы");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияПрочиеРасходы", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);

#КонецОбласти

	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвиженияИзВременныхТаблиц(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	
	// Уничтожим ненужные временные таблицы.
	СуществующиеВТ = РасчетСебестоимостиУниверсальныеАлгоритмы.СоединитьСтроки(СуществующиеВТ, "СторноОтчетыКомиссионера");
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета, СуществующиеВТ);
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
КонецПроцедуры

// Выполняет формирование стоимостных движений для исправлений документов прошлых периодов. 
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура СкорректироватьСтоимостьСторноДвиженийИсправленныхДокументов(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьСторноДвиженийИсправленныхДокументов");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
	
	СоответствиеВременныхТаблицДвижений = Новый Соответствие;

#Область ИсправленныеДокументы
	Запрос.Текст = РасчетСебестоимостиЗаполнениеПартий.ТекстИсправленныеДокументы(); // вт ИсправленныеДокументы
	//++ НЕ УТ
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияУТ.РазделительЗапросовВПакете()
	+ РасчетСебестоимостиЗаполнениеПартий.ТекстИсправленныеПартииПроизводства(); // вт ИсправленныеПартииПроизводства
	//-- НЕ УТ
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
#КонецОбласти

#Область ИсправлениеСебестоимостьТоваров

	// Заполнение полей должно соответствовать функции РасчетСебестоимостиЗаполнениеПартий.ТекстСторноДвиженияИсправленныхДокументовПрошлогоПериода()
	// Поля: Регистратор, Период, ТипЗаписи, ДокументИсточник
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	(ВЫБОР
	|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода)
	|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДополнениеПрошлыйПериод)
	|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СторноВозвратаПрошлыхПериодов)
	|		КОГДА ДД.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода)
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода) КОНЕЦ) КАК ТипЗаписи,
	|	ИсправленныеДокументы.Период КАК Период,
	|	ИсправленныеДокументы.Регистратор КАК Регистратор,
	|	ДД.ВидДвижения,
	// Измерения
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.Организация,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	// Ресурсы
	|	-ДД.Стоимость КАК Стоимость,
	|	-ДД.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	-ДД.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	-ДД.СтоимостьУпр КАК СтоимостьУпр,
	|	-ДД.ДопРасходыУпр КАК ДопРасходыУпр,
	|	-ДД.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|	-ДД.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|	-ДД.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|	-ДД.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|	-ДД.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
	|	-ДД.ДопРасходы КАК ДопРасходы,
	|	-ДД.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	-ДД.Трудозатраты КАК Трудозатраты,
	|	-ДД.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|	-ДД.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|	-ДД.СтоимостьРегл КАК СтоимостьРегл,
	|	-ДД.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|	-ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	-ДД.ВременнаяРазница КАК ВременнаяРазница,
	|	-ДД.ДопРасходыРегл КАК ДопРасходыРегл,
	|	-ДД.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|	-ДД.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|	-ДД.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|	-ДД.РезервПодОбесценениеРегл КАК РезервПодОбесценениеРегл,
	|	-ДД.РезервПодОбесценениеУпр КАК РезервПодОбесценениеУпр,
	// Реквизиты
	|	ДД.ХозяйственнаяОперация,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорРазделУчета,
	|	ДД.КорВидЗапасов,
	|	ДД.КорОрганизация,
	|	ДД.КорСтоимость,
	|	ДД.АналитикаУчетаПоПартнерам,
	|	ДД.ЗаказКлиента,
	|	ДД.Подразделение,
	|	ДД.АналитикаРасходов,
	|	ДД.СтатьяРасходовСписания,
	|	ДД.СтатьяДоходов,
	|	ДД.АналитикаДоходов,
	|	ДД.ПериодПродажи,
	|	ДД.СтатьяАктивовПассивов,
	|	ДД.АналитикаАктивовПассивов,
	|	ИсправленныеДокументы.Регистратор КАК ДокументДвижения,
	|	ДД.ИдентификаторСтроки,
	|	ДД.ГруппаПродукции,
	|	ДД.КорПартия,
	|	ДД.КорАналитикаУчетаПартий,
	|	ДД.КорАналитикаФинансовогоУчета,
	|	ДД.КорВидДеятельностиНДС,
	|	-ДД.НДСУпр КАК НДСУпр,
	|	-ДД.НДСРегл КАК НДСРегл,
	|	ДД.СтатьяКалькуляции,
	|	ДД.Регистратор КАК ДокументИсточник,
	|	ДД.КорНаправлениеДеятельности,
	|	ДД.КодСтроки,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ИСТИНА КАК Сторно
	|ПОМЕСТИТЬ ВтДвиженияСебестоимости
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправленныеДокументы КАК ИсправленныеДокументы
	|		ПО ИсправленныеДокументы.ДокументИсточник = ДД.Регистратор
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Период < &НачалоПериода 
	|	И ДД.Активность
	|	И ДД.РасчетСебестоимости
	|	И НЕ (&ИспользовалсяПартионныйУчетДоПереходаНаВерсию22 = ИСТИНА // значение параметра может быть НЕОПРЕДЕЛЕНО
	|		И ДД.Период < &ДатаПереходаНаПартионныйУчетВерсии22)
	|	И НЕ ДД.Сторно
	|
	//++ НЕ УТ
	// Распределение материалов на партии производства - приход в незавершенное производство 
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДополнениеРасчетПартий) КАК ТипЗаписи,
	|	ИсправленныеПартииПроизводства.Период КАК Период,
	|	ИсправленныеПартииПроизводства.Регистратор КАК Регистратор,
	|	ДД.ВидДвижения,
	// Измерения
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.Организация,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	// Ресурсы
	|	-ДД.Стоимость КАК Стоимость,
	|	-ДД.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	-ДД.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	-ДД.СтоимостьУпр КАК СтоимостьУпр,
	|	-ДД.ДопРасходыУпр КАК ДопРасходыУпр,
	|	-ДД.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|	-ДД.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|	-ДД.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|	-ДД.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|	-ДД.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
	|	-ДД.ДопРасходы КАК ДопРасходы,
	|	-ДД.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	-ДД.Трудозатраты КАК Трудозатраты,
	|	-ДД.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|	-ДД.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|	-ДД.СтоимостьРегл КАК СтоимостьРегл,
	|	-ДД.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|	-ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	-ДД.ВременнаяРазница КАК ВременнаяРазница,
	|	-ДД.ДопРасходыРегл КАК ДопРасходыРегл,
	|	-ДД.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|	-ДД.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|	-ДД.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|	-ДД.РезервПодОбесценениеРегл КАК РезервПодОбесценениеРегл,
	|	-ДД.РезервПодОбесценениеУпр КАК РезервПодОбесценениеУпр,
	// Реквизиты
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПроизводственныхЗатрат) КАК ХозяйственнаяОперация,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорРазделУчета,
	|	ДД.КорВидЗапасов,
	|	ДД.КорОрганизация,
	|	ДД.КорСтоимость,
	|	ДД.АналитикаУчетаПоПартнерам,
	|	ДД.ЗаказКлиента,
	|	ДД.Подразделение,
	|	ДД.АналитикаРасходов,
	|	ДД.СтатьяРасходовСписания,
	|	ДД.СтатьяДоходов,
	|	ДД.АналитикаДоходов,
	|	ДД.ПериодПродажи,
	|	ДД.СтатьяАктивовПассивов,
	|	ДД.АналитикаАктивовПассивов,
	|	ИсправленныеПартииПроизводства.Регистратор КАК ДокументДвижения,
	|	ДД.ИдентификаторСтроки,
	|	ДД.ГруппаПродукции,
	|	ДД.КорПартия,
	|	ДД.КорАналитикаУчетаПартий,
	|	ДД.КорАналитикаФинансовогоУчета,
	|	ДД.КорВидДеятельностиНДС,
	|	-ДД.НДСУпр КАК НДСУпр,
	|	-ДД.НДСРегл КАК НДСРегл,
	|	ДД.СтатьяКалькуляции,
	|	ДД.Регистратор КАК ДокументИсточник,
	|	ДД.КорНаправлениеДеятельности,
	|	ДД.КодСтроки,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СторноПроизводственныхЗатрат) КАК НастройкаХозяйственнойОперации,
	|	ИСТИНА КАК Сторно
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправленныеПартииПроизводства КАК ИсправленныеПартииПроизводства
	|		ПО ИсправленныеПартииПроизводства.Партия = ДД.Партия
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Период < &НачалоПериода 
	|	И ДД.Активность
	|	И ДД.ВидДвижения =ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ТИПЗНАЧЕНИЯ(ДД.Регистратор) В (
	|		ТИП(Документ.РаспределениеПроизводственныхЗатрат),
	|		ТИП(Документ.РаспределениеВозвратныхОтходов))
	|	И ДД.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|	И ДД.РасчетСебестоимости
	|	И НЕ ДД.Сторно
	//-- НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	(ВЫБОР
	|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СторноВозвратаПрошлыхПериодов)
	|		КОГДА ДД.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода) КОНЕЦ) КАК ТипЗаписи,
	|	ИсправленныеДокументы.Период КАК Период,
	|	ИсправленныеДокументы.Регистратор КАК Регистратор,
	|	(ВЫБОР
	|		КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КОНЕЦ) КАК ВидДвижения,
	// Измерения
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.Организация,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	// Ресурсы
	|	-ДД.Стоимость КАК Стоимость,
	|	-ДД.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	-ДД.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	-ДД.СтоимостьУпр КАК СтоимостьУпр,
	|	-ДД.ДопРасходыУпр КАК ДопРасходыУпр,
	|	-ДД.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|	-ДД.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|	-ДД.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|	-ДД.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|	-ДД.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
	|	-ДД.ДопРасходы КАК ДопРасходы,
	|	-ДД.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	-ДД.Трудозатраты КАК Трудозатраты,
	|	-ДД.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|	-ДД.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|	-ДД.СтоимостьРегл КАК СтоимостьРегл,
	|	-ДД.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|	-ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	-ДД.ВременнаяРазница КАК ВременнаяРазница,
	|	-ДД.ДопРасходыРегл КАК ДопРасходыРегл,
	|	-ДД.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|	-ДД.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|	-ДД.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|	-ДД.РезервПодОбесценениеРегл КАК РезервПодОбесценениеРегл,
	|	-ДД.РезервПодОбесценениеУпр КАК РезервПодОбесценениеУпр,
	// Реквизиты
	|	ДД.ХозяйственнаяОперация,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорРазделУчета,
	|	ДД.КорВидЗапасов,
	|	ДД.КорОрганизация,
	|	ДД.КорСтоимость,
	|	ДД.АналитикаУчетаПоПартнерам,
	|	ДД.ЗаказКлиента,
	|	ДД.Подразделение,
	|	ДД.АналитикаРасходов,
	|	ДД.СтатьяРасходовСписания,
	|	ДД.СтатьяДоходов,
	|	ДД.АналитикаДоходов,
	|	ДД.ПериодПродажи,
	|	ДД.СтатьяАктивовПассивов,
	|	ДД.АналитикаАктивовПассивов,
	|	ИсправленныеДокументы.Регистратор КАК ДокументДвижения,
	|	ДД.ИдентификаторСтроки,
	|	ДД.ГруппаПродукции,
	|	ДД.КорПартия,
	|	ДД.КорАналитикаУчетаПартий,
	|	ДД.КорАналитикаФинансовогоУчета,
	|	ДД.КорВидДеятельностиНДС,
	|	-ДД.НДСУпр КАК НДСУпр,
	|	-ДД.НДСРегл КАК НДСРегл,
	|	ДД.СтатьяКалькуляции,
	|	ДД.Регистратор КАК ДокументИсточник,
	|	ДД.КорНаправлениеДеятельности,
	|	ДД.КодСтроки,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ИСТИНА КАК Сторно
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправленныеДокументы КАК ИсправленныеДокументы
	|		ПО ИсправленныеДокументы.ДокументИсточник = ДД.Регистратор
	|ГДЕ
	|	ДД.РасчетСебестоимости
	|	И НЕ ДД.Сторно
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтСебестоимостьСторноДвижений";
	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	ИмяВременнойТаблицыИсточник = "ВтДвиженияСебестоимости";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьИдентификаторыВоВременнуюТаблицу(ПараметрыРасчета, ОписаниеПриемника, ИмяВременнойТаблицыИсточник);
	
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, ИмяВременнойТаблицыИсточник);
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, ИмяВременнойТаблицыИсточник, ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти

//++ НЕ УТ
#Область ИсправлениеПрочиеРасходыНезавершенногоПроизводства

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИсправленныеДокументы.Период КАК Период,
	|	ИсправленныеДокументы.Регистратор КАК Регистратор,
	|	ДД.ВидДвижения,
	// Измерения
	|	ДД.СтатьяРасходов,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	ДД.ПартияПроизводства,
	|	ДД.ПартияПроизводства,
	|	ДД.СтатьяКалькуляции,
	|	ДД.ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск,
	// Ресурсы
	|	-ДД.Стоимость КАК Стоимость,
	|	-ДД.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	-ДД.СтоимостьРегл КАК СтоимостьРегл,
	|	-ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	-ДД.ВременнаяРазница КАК ВременнаяРазница,
	|	-ДД.СтоимостьУпр КАК СтоимостьУпр,
	// Реквизиты
	|	ДД.АналитикаУчетаПродукции,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.КорАналитикаУчетаПартий,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ИСТИНА КАК Сторно
	|
	|ПОМЕСТИТЬ ВтДвиженияПрочиеРасходыНезавершенногоПроизводства
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправленныеДокументы КАК ИсправленныеДокументы
	|		ПО ИсправленныеДокументы.ДокументИсточник = ДД.Регистратор
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Период < &НачалоПериода
	|	И ДД.Активность
	|	И НЕ (&ИспользовалсяПартионныйУчетДоПереходаНаВерсию22 = ИСТИНА // значение параметра может быть НЕОПРЕДЕЛЕНО
	|		И ДД.Период < &ДатаПереходаНаПартионныйУчетВерсии22)
	|	И НЕ ДД.Сторно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсправленныеПартииПроизводства.Период КАК Период,
	|	ИсправленныеПартииПроизводства.Регистратор КАК Регистратор,
	|	ДД.ВидДвижения,
	// Измерения
	|	ДД.СтатьяРасходов,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	ДД.ПартияПроизводства,
	|	ДД.ПартияПроизводства,
	|	ДД.СтатьяКалькуляции,
	|	ДД.ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск,
	// Ресурсы
	|	-ДД.Стоимость КАК Стоимость,
	|	-ДД.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	-ДД.СтоимостьРегл КАК СтоимостьРегл,
	|	-ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	-ДД.ВременнаяРазница КАК ВременнаяРазница,
	|	-ДД.СтоимостьУпр КАК СтоимостьУпр,
	// Реквизиты
	|	ДД.АналитикаУчетаПродукции,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.КорАналитикаУчетаПартий,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СторноПроизводственныхЗатрат) КАК НастройкаХозяйственнойОперации,
	|	ИСТИНА КАК Сторно
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправленныеПартииПроизводства КАК ИсправленныеПартииПроизводства
	|		ПО ИсправленныеПартииПроизводства.Партия = ДД.ПартияПроизводства
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Период < &НачалоПериода
	|	И ДД.Активность
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И НЕ (&ИспользовалсяПартионныйУчетДоПереходаНаВерсию22 = ИСТИНА // значение параметра может быть НЕОПРЕДЕЛЕНО
	|		И ДД.Период < &ДатаПереходаНаПартионныйУчетВерсии22)
	|	И НЕ ДД.Сторно
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтПрочиеРасходыНезавершенногоПроизводстваСторноДвижений";
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходыНезавершенногоПроизводства.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	ИмяВременнойТаблицыИсточник = "ВтДвиженияПрочиеРасходыНезавершенногоПроизводства";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьИдентификаторыВоВременнуюТаблицу(ПараметрыРасчета, ОписаниеПриемника, ИмяВременнойТаблицыИсточник);
	
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, ИмяВременнойТаблицыИсточник);
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, ИмяВременнойТаблицыИсточник, ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти
//-- НЕ УТ

#Область ИсправлениеПрочиеРасходы

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИсправленныеДокументы.Период КАК Период,
	|	ИсправленныеДокументы.Регистратор КАК Регистратор,
	|	ДД.ВидДвижения,
	// Измерения
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	// Ресурсы
	|	-ДД.Сумма КАК Сумма,
	|	-ДД.СуммаБезНДС КАК СуммаБезНДС,
	|	-ДД.СуммаРегл КАК СуммаРегл,
	|	-ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	-ДД.ВременнаяРазница КАК ВременнаяРазница,
	|	-ДД.СуммаУпр КАК СуммаУпр,
	// Реквизиты
	|	ДД.ХозяйственнаяОперация,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ДокументДвижения,
	|	ДД.ИдентификаторСтроки,
	|	ДД.КорНаправлениеДеятельности,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ДД.ИдентификаторФинЗаписи,
	|	ИСТИНА КАК Сторно
	|
	|ПОМЕСТИТЬ ВтДвиженияПрочиеРасходы
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправленныеДокументы КАК ИсправленныеДокументы
	|		ПО ИсправленныеДокументы.ДокументИсточник = ДД.Регистратор
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Период < &НачалоПериода
	|	И ДД.Активность
	|	И ДД.РасчетСебестоимости
	|	И НЕ (&ИспользовалсяПартионныйУчетДоПереходаНаВерсию22 = ИСТИНА // значение параметра может быть НЕОПРЕДЕЛЕНО
	|		И ДД.Период < &ДатаПереходаНаПартионныйУчетВерсии22)
	|	И НЕ ДД.Сторно
	|
	//++ НЕ УТ
	// Отнесение стоимости материалов на прочие расходы (при сторнировании производства без заказов)
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	// Измерения
	|	ДД.Организация,
	|	ДД.АналитикаУчетаНоменклатуры.Подразделение КАК Подразделение,
	|	ПартииПроизводства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.СторноПроизводственныхЗатрат) КАК СтатьяРасходов,
	|	ДД.Партия КАК АналитикаРасходов,
	// Ресурсы
	|	-(ДД.Стоимость
	|		+ ДД.ДопРасходы
	|		+ ДД.Трудозатраты
	|		+ ДД.ПостатейныеПостоянныеСНДС
	|		+ ДД.ПостатейныеПеременныеСНДС) КАК Сумма,
	|	-(ДД.СтоимостьБезНДС
	|		+ ДД.ДопРасходыБезНДС
	|		+ ДД.Трудозатраты
	|		+ ДД.ПостатейныеПостоянныеБезНДС
	|		+ ДД.ПостатейныеПеременныеБезНДС) КАК СуммаБезНДС,
	|	-(ДД.СтоимостьРегл
	|		+ ДД.ДопРасходыРегл
	|		+ ДД.ТрудозатратыРегл
	|		+ ДД.ПостатейныеПостоянныеРегл
	|		+ ДД.ПостатейныеПеременныеРегл
	|		+ ДД.РезервПодОбесценениеРегл) КАК СуммаРегл,
	|	-ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	-ДД.ВременнаяРазница КАК ВременнаяРазница,
	|	-(ДД.СтоимостьУпр
	|		+ ДД.ДопРасходыРегл
	|		+ ДД.ДопРасходыУпр
	|		+ ДД.ПостатейныеПостоянныеУпр
	|		+ ДД.ПостатейныеПеременныеУпр
	|		+ ДД.РезервПодОбесценениеУпр) КАК СуммаУпр,
	// Реквизиты
	|	ДД.ХозяйственнаяОперация,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ДокументДвижения,
	|	ДД.ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ДД.ИдентификаторФинЗаписи,
	|	ИСТИНА КАК Сторно
	|ИЗ
	|	ВтДвиженияСебестоимости КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК ПартииПроизводства
	|		ПО ПартииПроизводства.Ссылка = ДД.Партия
	|ГДЕ
	|	ДД.ВидДвижения =ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПроизводственныхЗатрат)
	|	И ДД.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СторноПроизводственныхЗатрат)
	|
	// Отнесение стоимости постатейных затрат на прочие расходы (при сторнировании производства без заказов)
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	// Измерения
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.СторноПроизводственныхЗатрат) КАК СтатьяРасходов,
	|	ДД.ПартияПроизводства КАК АналитикаРасходов,
	// Ресурсы
	|	-ДД.Стоимость КАК Сумма,
	|	-ДД.СтоимостьБезНДС КАК СуммаБезНДС,
	|	-ДД.СтоимостьРегл КАК СуммаРегл,
	|	-ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	-ДД.ВременнаяРазница КАК ВременнаяРазница,
	|	-ДД.СтоимостьУпр КАК СуммаУпр,
	// Реквизиты
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПроизводственныхЗатрат) КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	"""" КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ДД.ИдентификаторФинЗаписи,
	|	ИСТИНА КАК Сторно
	|ИЗ
	|	ВтДвиженияПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|ГДЕ
	|	ДД.ВидДвижения =ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СторноПроизводственныхЗатрат)
	//-- НЕ УТ
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтПрочиеРасходыСторноДвижений";
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияПрочиеРасходы");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияПрочиеРасходы", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти

#Область ИсправлениеПрочиеДоходы

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИсправленныеДокументы.Период КАК Период,
	|	ИсправленныеДокументы.Регистратор КАК Регистратор,
	|	ДД.ВидДвижения,
	// Измерения
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяДоходов,
	|	ДД.АналитикаДоходов,
	// Ресурсы
	|	-ДД.Сумма КАК Сумма,
	|	-ДД.СуммаРегл КАК СуммаРегл,
	|	-ДД.СуммаУпр КАК СуммаУпр,
	// Реквизиты
	|	ДД.ХозяйственнаяОперация,
	|	ДД.КорНаправлениеДеятельности,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ДД.ИдентификаторФинЗаписи,
	|	ИСТИНА КАК Сторно
	|
	|ПОМЕСТИТЬ ВтДвиженияПрочиеДоходы
	|ИЗ
	|	РегистрНакопления.ПрочиеДоходы КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправленныеДокументы КАК ИсправленныеДокументы
	|		ПО ИсправленныеДокументы.ДокументИсточник = ДД.Регистратор
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Период < &НачалоПериода
	|	И ДД.Активность
	|	И ДД.РасчетСебестоимости
	|	И НЕ (&ИспользовалсяПартионныйУчетДоПереходаНаВерсию22 = ИСТИНА // значение параметра может быть НЕОПРЕДЕЛЕНО
	|		И ДД.Период < &ДатаПереходаНаПартионныйУчетВерсии22)
	|	И НЕ ДД.Сторно
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтПрочиеДоходыСторноДвижений";
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеДоходы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияПрочиеДоходы");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияПрочиеДоходы", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти

#Область ИсправлениеПрочиеАктивыПассивы

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИсправленныеДокументы.Период КАК Период,
	|	ИсправленныеДокументы.Регистратор КАК Регистратор,
	|	ДД.ВидДвижения,
	// Измерения
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.Статья,
	|	ДД.Аналитика,
	// Ресурсы
	|	-ДД.Сумма КАК Сумма,
	// Реквизиты
	|	ДД.ВидИсточника,
	|	ДД.Источник,
	|	ИСТИНА КАК Сторно
	|
	|ПОМЕСТИТЬ ВтДвиженияПрочиеАктивыПассивы
	|ИЗ
	|	РегистрНакопления.ПрочиеАктивыПассивы КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправленныеДокументы КАК ИсправленныеДокументы
	|		ПО ИсправленныеДокументы.ДокументИсточник = ДД.Регистратор
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Период < &НачалоПериода
	|	И ДД.Активность
	|	И ДД.РасчетСебестоимости
	|	И НЕ (&ИспользовалсяПартионныйУчетДоПереходаНаВерсию22 = ИСТИНА // значение параметра может быть НЕОПРЕДЕЛЕНО
	|		И ДД.Период < &ДатаПереходаНаПартионныйУчетВерсии22)
	|	И НЕ ДД.Сторно
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтПрочиеАктивыПассивыСторноДвижений";
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияПрочиеАктивыПассивы");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияПрочиеАктивыПассивы", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти

#Область ИсправлениеДвиженияНоменклатураДоходыРасходы

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИсправленныеДокументы.Период КАК Период,
	|	ИсправленныеДокументы.Регистратор КАК Регистратор,
	// Измерения
	|	ДД.ХозяйственнаяОперация,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельностиНоменклатуры,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.Склад,
	|	ДД.ТипЗапасов,
	|	ДД.ВидЗапасов,
	|	ДД.НаправлениеДеятельностиСтатьи,
	|	ДД.СтатьяДоходовРасходов,
	|	ДД.АналитикаДоходов,
	|	ДД.АналитикаРасходов,
	|	ДД.АналитикаАктивовПассивов,
	// Ресурсы
	|	-ДД.Стоимость КАК Стоимость,
	|	-ДД.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	-ДД.СтоимостьУпр КАК СтоимостьУпр,
	|	-ДД.СтоимостьРегл КАК СтоимостьРегл,
	|	-ДД.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	-ДД.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|	-ДД.ДопРасходы КАК ДопРасходы,
	|	-ДД.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	-ДД.ДопРасходыУпр КАК ДопРасходыУпр,
	|	-ДД.ДопРасходыРегл КАК ДопРасходыРегл,
	|	-ДД.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|	-ДД.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|	-ДД.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|	-ДД.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|	-ДД.Трудозатраты КАК Трудозатраты,
	|	-ДД.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|	-ДД.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|	-ДД.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|	-ДД.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|	-ДД.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
	|	-ДД.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|	-ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	-ДД.ВременнаяРазница КАК ВременнаяРазница,
	|	-ДД.РезервПодОбесценениеРегл КАК РезервПодОбесценениеРегл,
	|	-ДД.РезервПодОбесценениеУпр КАК РезервПодОбесценениеУпр,
	// Реквизиты
	|	ДД.ИсточникГФУНоменклатуры,
	|	ИСТИНА КАК Сторно
	|ПОМЕСТИТЬ ВтДвиженияНоменклатураДоходыРасходы
	|ИЗ
	|	РегистрНакопления.ДвиженияНоменклатураДоходыРасходы КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправленныеДокументы КАК ИсправленныеДокументы
	|		ПО ИсправленныеДокументы.ДокументИсточник = ДД.Регистратор
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Период < &НачалоПериода 
	|	И ДД.Активность
	|	И ДД.РасчетСебестоимости
	|	И НЕ (&ИспользовалсяПартионныйУчетДоПереходаНаВерсию22 = ИСТИНА // значение параметра может быть НЕОПРЕДЕЛЕНО
	|		И ДД.Период < &ДатаПереходаНаПартионныйУчетВерсии22)
	|	И НЕ ДД.Сторно
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтДвиженияНоменклатураДоходыРасходыСторноДвижений";
	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияНоменклатураДоходыРасходы");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияНоменклатураДоходыРасходы", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти

#Область ИсправлениеДвиженияНоменклатураНоменклатура

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИсправленныеДокументы.Период КАК Период,
	|	ИсправленныеДокументы.Регистратор КАК Регистратор,
	// Измерения
	|	ДД.ХозяйственнаяОперация,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.Склад,
	|	ДД.ТипЗапасов,
	|	ДД.ВидЗапасов,
	|	ДД.КорНаправлениеДеятельности,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорСклад,
	|	ДД.КорТипЗапасов,
	|	ДД.КорВидЗапасов,
	// Ресурсы
	|	-ДД.Стоимость КАК Стоимость,
	|	-ДД.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	-ДД.СтоимостьУпр КАК СтоимостьУпр,
	|	-ДД.СтоимостьРегл КАК СтоимостьРегл,
	|	-ДД.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	-ДД.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|	-ДД.ДопРасходы КАК ДопРасходы,
	|	-ДД.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	-ДД.ДопРасходыУпр КАК ДопРасходыУпр,
	|	-ДД.ДопРасходыРегл КАК ДопРасходыРегл,
	|	-ДД.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|	-ДД.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|	-ДД.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|	-ДД.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|	-ДД.Трудозатраты КАК Трудозатраты,
	|	-ДД.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|	-ДД.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|	-ДД.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|	-ДД.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|	-ДД.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
	|	-ДД.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|	-ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	-ДД.ВременнаяРазница КАК ВременнаяРазница,
	|	-ДД.РезервПодОбесценениеРегл КАК РезервПодОбесценениеРегл,
	|	-ДД.РезервПодОбесценениеУпр КАК РезервПодОбесценениеУпр,
	// Реквизиты
	|	ДД.ИсточникГФУНоменклатуры,
	|	ДД.КорИсточникГФУНоменклатуры,
	|	ДД.КорОрганизация,
	|	ИСТИНА КАК Сторно
	|ПОМЕСТИТЬ ВтДвиженияНоменклатураНоменклатура
	|ИЗ
	|	РегистрНакопления.ДвиженияНоменклатураНоменклатура КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправленныеДокументы КАК ИсправленныеДокументы
	|		ПО ИсправленныеДокументы.ДокументИсточник = ДД.Регистратор
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Период < &НачалоПериода 
	|	И ДД.Активность
	|	И ДД.РасчетСебестоимости
	|	И НЕ (&ИспользовалсяПартионныйУчетДоПереходаНаВерсию22 = ИСТИНА // значение параметра может быть НЕОПРЕДЕЛЕНО
	|		И ДД.Период < &ДатаПереходаНаПартионныйУчетВерсии22)
	|	И НЕ ДД.Сторно
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтДвиженияНоменклатураНоменклатураСторноДвижений";
	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураНоменклатура.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияНоменклатураНоменклатура");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияНоменклатураНоменклатура", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвиженияИзВременныхТаблиц(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	
	// Уничтожим ненужные временные таблицы.
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета, СуществующиеВТ);
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
КонецПроцедуры

// Этап сохранения ранее рассчитанных движений.
// Выполняет сохранение стоимостных движений для ранее рассчитанных документов. 
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура СохранитьДвиженияРасчетаСебестоимостиРассчитанныхДокументов(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СохранитьДвиженияРасчетаСебестоимостиРассчитанныхДокументов");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
	
	СоответствиеВременныхТаблицДвижений = Новый Соответствие;
	
#Область СебестоимостьТоваров

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.ВидДвижения,
	// Измерения
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.Организация,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	// Ресурсы
	|	СУММА(ДД.Стоимость) КАК Стоимость,
	|	СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(ДД.СтоимостьЗабалансовая) КАК СтоимостьЗабалансовая,
	|	СУММА(ДД.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(ДД.ДопРасходыУпр) КАК ДопРасходыУпр,
	|	СУММА(ДД.ПостатейныеПеременныеСНДС) КАК ПостатейныеПеременныеСНДС,
	|	СУММА(ДД.ПостатейныеПеременныеБезНДС) КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(ДД.ТрудозатратыУпр) КАК ТрудозатратыУпр,
	|	СУММА(ДД.ПостатейныеПостоянныеУпр) КАК ПостатейныеПостоянныеУпр,
	|	СУММА(ДД.ПостатейныеПеременныеУпр) КАК ПостатейныеПеременныеУпр,
	|	СУММА(ДД.ДопРасходы) КАК ДопРасходы,
	|	СУММА(ДД.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
	|	СУММА(ДД.Трудозатраты) КАК Трудозатраты,
	|	СУММА(ДД.ПостатейныеПостоянныеСНДС) КАК ПостатейныеПостоянныеСНДС,
	|	СУММА(ДД.ПостатейныеПостоянныеБезНДС) КАК ПостатейныеПостоянныеБезНДС,
	|	СУММА(ДД.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(ДД.СтоимостьЗабалансоваяРегл) КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(ДД.ВременнаяРазница) КАК ВременнаяРазница,
	|	СУММА(ДД.ДопРасходыРегл) КАК ДопРасходыРегл,
	|	СУММА(ДД.ТрудозатратыРегл) КАК ТрудозатратыРегл,
	|	СУММА(ДД.ПостатейныеПостоянныеРегл) КАК ПостатейныеПостоянныеРегл,
	|	СУММА(ДД.ПостатейныеПеременныеРегл) КАК ПостатейныеПеременныеРегл,
	// Реквизиты
	|	ДД.ХозяйственнаяОперация,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорРазделУчета,
	|	ДД.КорВидЗапасов,
	|	ДД.КорОрганизация,
	|	ДД.КорСтоимость,
	|	ДД.АналитикаУчетаПоПартнерам,
	|	ДД.ЗаказКлиента,
	|	ДД.Подразделение,
	|	ДД.АналитикаРасходов,
	|	ДД.СтатьяРасходовСписания,
	|	ДД.СтатьяДоходов,
	|	ДД.АналитикаДоходов,
	|	ДД.ПериодПродажи,
	|	ДД.СтатьяАктивовПассивов,
	|	ДД.АналитикаАктивовПассивов,
	|	ДД.ДокументДвижения,
	|	ДД.ИдентификаторСтроки,
	|	ДД.ГруппаПродукции,
	|	ДД.КорПартия,
	|	ДД.КорАналитикаУчетаПартий,	
	|	ДД.КорАналитикаФинансовогоУчета,
	|	ДД.КорВидДеятельностиНДС,
	|	ДД.НДСУпр КАК НДСУпр,
	|	ДД.НДСРегл КАК НДСРегл,
	|	ДД.СтатьяКалькуляции,
	|	ДД.ТипЗаписи,
	|	ДД.ДокументИсточник,
	|	ДД.КорНаправлениеДеятельности,
	|	ДД.КодСтроки,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ДД.ИдентификаторФинЗаписи,
	|	ДД.Сторно,
	|	ДД.НастройкаСчетовУчета,
	|	(ВЫБОР
	|		КОГДА &РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие)
	|		 ИЛИ НЕ &ВыделятьОтклоненияСебестоимостиОкончательногоРасчета
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДД.ДокументРасчета КОНЕЦ) КАК ДокументРасчета,
	|	(ВЫБОР
	|		КОГДА ДД.РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПустаяСсылка)
	|			ТОГДА &РежимЗакрытияМесяца
	|		ИНАЧЕ ДД.РежимЗакрытияМесяца КОНЕЦ) КАК РежимЗакрытияМесяца
	|
	|ПОМЕСТИТЬ ВтДвиженияСебестоимости
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РассчитанныеДокументы КАК РассчитанныеДокументы
	|		ПО РассчитанныеДокументы.Период = ДД.Период
	|		И РассчитанныеДокументы.Регистратор = ДД.Регистратор
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Организация В(&МассивОрганизаций)
	|	И ДД.Активность
	|	И ДД.РасчетСебестоимости
	|	И НЕ ДД.Сторно
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.ВидДвижения,
	// Измерения
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.Организация,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	// Реквизиты
	|	ДД.ХозяйственнаяОперация,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорРазделУчета,
	|	ДД.КорВидЗапасов,
	|	ДД.КорОрганизация,
	|	ДД.КорСтоимость,
	|	ДД.АналитикаУчетаПоПартнерам,
	|	ДД.ЗаказКлиента,
	|	ДД.Подразделение,
	|	ДД.АналитикаРасходов,
	|	ДД.СтатьяРасходовСписания,
	|	ДД.СтатьяДоходов,
	|	ДД.АналитикаДоходов,
	|	ДД.ПериодПродажи,
	|	ДД.СтатьяАктивовПассивов,
	|	ДД.АналитикаАктивовПассивов,
	|	ДД.ДокументДвижения,
	|	ДД.ИдентификаторСтроки,
	|	ДД.ГруппаПродукции,
	|	ДД.КорПартия,
	|	ДД.КорАналитикаУчетаПартий,	
	|	ДД.КорАналитикаФинансовогоУчета,
	|	ДД.КорВидДеятельностиНДС,
	|	ДД.НДСУпр,
	|	ДД.НДСРегл,
	|	ДД.СтатьяКалькуляции,
	|	ДД.ТипЗаписи,
	|	ДД.ДокументИсточник,
	|	ДД.КорНаправлениеДеятельности,
	|	ДД.КодСтроки,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ДД.ИдентификаторФинЗаписи,
	|	ДД.Сторно,
	|	ДД.НастройкаСчетовУчета,
	|	(ВЫБОР
	|		КОГДА &РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие)
	|		 ИЛИ НЕ &ВыделятьОтклоненияСебестоимостиОкончательногоРасчета
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДД.ДокументРасчета КОНЕЦ),
	|	(ВЫБОР
	|		КОГДА ДД.РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПустаяСсылка)
	|			ТОГДА &РежимЗакрытияМесяца
	|		ИНАЧЕ ДД.РежимЗакрытияМесяца КОНЕЦ)
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтСебестоимостьСохранениеДвижений";
	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияСебестоимости");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияСебестоимости", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти

#Область ВыручкаИСебестоимостьПродаж

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	// Измерения
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ЗаказКлиента,
	|	ДД.АналитикаУчетаПоПартнерам,
	|	ДД.Подразделение,
	|	ДД.ТипЗапасов,
	|	ДД.ВидЗапасов,
	|	ДД.РазделУчета,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.Менеджер,
	|	ДД.Склад,
	|	ДД.Соглашение,
	|	ДД.Договор,
	|	ДД.ХозяйственнаяОперация,
	|	ДД.АналитикаУчетаНаборов,
	|	ДД.НаправлениеДеятельностиКонтрагента,
	|	ДД.НаправлениеДеятельностиНоменклатуры,
	// Ресурсы
	|	ДД.Количество,
	|	ДД.СуммаВыручки,
	|	ДД.СуммаВыручкиБезНДС,
	|	ДД.Стоимость,
	|	ДД.СтоимостьБезНДС,
	|	ДД.ДопРасходы,
	|	ДД.ДопРасходыБезНДС,
	|	ДД.СтоимостьУпр,
	|	ДД.СтоимостьРегл,
	|	ДД.СтоимостьЗабалансовая,
	|	ДД.СтоимостьЗабалансоваяРегл,
	|	ДД.СуммаВыручкиРегл,
	|	ДД.ПостояннаяРазница,
	|	ДД.ДопРасходыУпр,
	|	ДД.ДопРасходыРегл,
	|	ДД.ПостатейныеПостоянныеСНДС,
	|	ДД.ПостатейныеПостоянныеБезНДС,
	|	ДД.ПостатейныеПостоянныеУпр,
	|	ДД.ПостатейныеПостоянныеРегл,
	|	ДД.Трудозатраты,
	|	ДД.ТрудозатратыУпр,
	|	ДД.ТрудозатратыРегл,
	|	ДД.ПостатейныеПеременныеСНДС,
	|	ДД.ПостатейныеПеременныеБезНДС,
	|	ДД.ПостатейныеПеременныеУпр,
	|	ДД.ПостатейныеПеременныеРегл,
	|	ДД.ВременнаяРазница,
	|	ДД.СуммаВыручкиСНДСРегл,
	|	ДД.СуммаРучнойСкидки,
	|	ДД.СуммаАвтоматическойСкидки,
	// Реквизиты
	|	ДД.НалогообложениеНДС,
	|	ДД.ВалютаВзаиморасчетов,
	|	ДД.СуммаВВалютеВзаиморасчетов,
	|	ДД.СуммаБезНДСВВалютеВзаиморасчетов,
	|	ДД.ВалютаДокумента,
	|	ДД.СуммаВВалютеДокумента,
	|	ДД.СуммаБезНДСВВалютеДокумента,
	|	ДД.ИсточникГФУНоменклатуры,
	|	ДД.ДокументДвижения,
	|	ДД.РасчетСебестоимости,
	|	ДД.РасчетПартий,
	|	ДД.РасчетНеЗавершен,
	|	ДД.НДСРегл,
	|	ДД.НДСУпр,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ДД.ИдентификаторФинЗаписи,
	|	ДД.ИсточникГФУРасчетов,
	|	(ВЫБОР
	|		КОГДА &РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие)
	|		 ИЛИ НЕ &ВыделятьОтклоненияСебестоимостиОкончательногоРасчета
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДД.ДокументРасчета КОНЕЦ) КАК ДокументРасчета,
	|	(ВЫБОР
	|		КОГДА ДД.РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПустаяСсылка)
	|			ТОГДА &РежимЗакрытияМесяца
	|		ИНАЧЕ ДД.РежимЗакрытияМесяца КОНЕЦ) КАК РежимЗакрытияМесяца
	|
	|ПОМЕСТИТЬ ВтДвиженияВыручкаИСебестоимостьПродаж
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РассчитанныеДокументы КАК РассчитанныеДокументы
	|		ПО РассчитанныеДокументы.Период = ДД.Период
	|		И РассчитанныеДокументы.Регистратор = ДД.Регистратор
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.АналитикаУчетаПоПартнерам.Организация В(&МассивОрганизаций)
	|	И ДД.Активность
	|	И ДД.РасчетСебестоимости
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтВыручкаИСебестоимостьПродажСохранениеДвижений";
	ИмяРегистра = Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияВыручкаИСебестоимостьПродаж");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияВыручкаИСебестоимостьПродаж", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти

#Область ПрочиеРасходы

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.ВидДвижения,
	// Измерения
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	// Ресурсы
	|	ДД.Сумма КАК Сумма,
	|	ДД.СуммаБезНДС КАК СуммаБезНДС,
	|	ДД.СуммаРегл КАК СуммаРегл,
	|	ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	ДД.ВременнаяРазница КАК ВременнаяРазница,
	|	ДД.СуммаУпр КАК СуммаУпр,
	// Реквизиты
	|	ДД.ХозяйственнаяОперация,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ДокументДвижения,
	|	ДД.ИдентификаторСтроки,
	|	ДД.КорНаправлениеДеятельности,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ДД.ИдентификаторФинЗаписи,
	|	ДД.Сторно,
	|	(ВЫБОР
	|		КОГДА &РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие)
	|		 ИЛИ НЕ &ВыделятьОтклоненияСебестоимостиОкончательногоРасчета
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДД.ДокументРасчета КОНЕЦ) КАК ДокументРасчета,
	|	(ВЫБОР
	|		КОГДА ДД.РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПустаяСсылка)
	|			ТОГДА &РежимЗакрытияМесяца
	|		ИНАЧЕ ДД.РежимЗакрытияМесяца КОНЕЦ) КАК РежимЗакрытияМесяца
	|
	|ПОМЕСТИТЬ ВтДвиженияПрочиеРасходы
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РассчитанныеДокументы КАК РассчитанныеДокументы
	|		ПО РассчитанныеДокументы.Период = ДД.Период
	|		И РассчитанныеДокументы.Регистратор = ДД.Регистратор
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Организация В(&МассивОрганизаций)
	|	И ДД.Активность
	|	И ДД.РасчетСебестоимости
	|	И НЕ ДД.Сторно
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтПрочиеРасходыСохранениеДвижений";
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияПрочиеРасходы");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияПрочиеРасходы", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти

//++ НЕ УТ
#Область ПрочиеРасходыНезавершенногоПроизводства

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.ВидДвижения,
	// Измерения
	|	ДД.СтатьяРасходов,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	ДД.ПартияПроизводства,
	|	ДД.УдалитьПартияПроизводства,
	|	ДД.ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция,
	|	ДД.Этап,
	|	ДД.СтатьяКалькуляции,
	|	ДД.ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск,
	// Ресурсы
	|	СУММА(ДД.Стоимость) КАК Стоимость,
	|	СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(ДД.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(ДД.ВременнаяРазница) КАК ВременнаяРазница,
	|	СУММА(ДД.ДоляСтоимости) КАК ДоляСтоимости,
	|	СУММА(ДД.СтоимостьУпр) КАК СтоимостьУпр,
	// Реквизиты
	|	ДД.Продукция,
	|	ДД.ХарактеристикаПродукции,
	|	ДД.КоличествоПродукции,
	|	ДД.АналитикаУчетаПродукции,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.ДокументДвижения,
	|	ДД.ДокументИсточник,
	|	ДД.ДокументВыпуска,
	|	ДД.РасчетСебестоимости,
	|	ДД.РасчетПартий,
	|	ДД.ПоказательОтнесенияНаПартию,
	|	ДД.ПоказательОтнесенияНаПартиюБезНДС,
	|	ДД.ПоказательОтнесенияНаПартиюРегл,
	|	ДД.ПоказательОтнесенияНаПартиюУпр,
	|	ДД.АналитикаПартииВыпуска,
	|	ДД.КорАналитикаУчетаПартий,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ДД.ИдентификаторФинЗаписи
	|
	|ПОМЕСТИТЬ ВтДвиженияПрочиеРасходыНЗП
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РассчитанныеДокументы КАК РассчитанныеДокументы
	|		ПО РассчитанныеДокументы.Период = ДД.Период
	|		И РассчитанныеДокументы.Регистратор = ДД.Регистратор
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Организация В(&МассивОрганизаций)
	|	И ДД.Активность
	|	И ДД.РасчетСебестоимости
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.ВидДвижения,
	// Измерения
	|	ДД.СтатьяРасходов,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	ДД.ПартияПроизводства,
	|	ДД.УдалитьПартияПроизводства,
	|	ДД.ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция,
	|	ДД.Этап,
	|	ДД.СтатьяКалькуляции,
	|	ДД.ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск,
	// Реквизиты
	|	ДД.Продукция,
	|	ДД.ХарактеристикаПродукции,
	|	ДД.КоличествоПродукции,
	|	ДД.АналитикаУчетаПродукции,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.ДокументДвижения,
	|	ДД.ДокументИсточник,
	|	ДД.ДокументВыпуска,
	|	ДД.РасчетСебестоимости,
	|	ДД.РасчетПартий,
	|	ДД.ПоказательОтнесенияНаПартию,
	|	ДД.ПоказательОтнесенияНаПартиюБезНДС,
	|	ДД.ПоказательОтнесенияНаПартиюРегл,
	|	ДД.ПоказательОтнесенияНаПартиюУпр,
	|	ДД.АналитикаПартииВыпуска,
	|	ДД.КорАналитикаУчетаПартий,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ДД.ИдентификаторФинЗаписи
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтПрочиеРасходыНЗПСохранениеДвижений";
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходыНезавершенногоПроизводства.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияПрочиеРасходыНЗП");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияПрочиеРасходыНЗП", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти
//-- НЕ УТ

#Область ПрочиеДоходы

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.ВидДвижения,
	// Измерения
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяДоходов,
	|	ДД.АналитикаДоходов,
	// Ресурсы
	|	ДД.Сумма КАК Сумма,
	|	ДД.СуммаРегл КАК СуммаРегл,
	|	ДД.СуммаУпр КАК СуммаУпр,
	// Реквизиты
	|	ДД.ХозяйственнаяОперация,
	|	ДД.КорНаправлениеДеятельности,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ДД.ИдентификаторФинЗаписи,
	|	ДД.Сторно,
	|	(ВЫБОР
	|		КОГДА &РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие)
	|		 ИЛИ НЕ &ВыделятьОтклоненияСебестоимостиОкончательногоРасчета
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДД.ДокументРасчета КОНЕЦ) КАК ДокументРасчета,
	|	(ВЫБОР
	|		КОГДА ДД.РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПустаяСсылка)
	|			ТОГДА &РежимЗакрытияМесяца
	|		ИНАЧЕ ДД.РежимЗакрытияМесяца КОНЕЦ) КАК РежимЗакрытияМесяца
	|
	|ПОМЕСТИТЬ ВтДвиженияПрочиеДоходы
	|ИЗ
	|	РегистрНакопления.ПрочиеДоходы КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РассчитанныеДокументы КАК РассчитанныеДокументы
	|		ПО РассчитанныеДокументы.Период = ДД.Период
	|		И РассчитанныеДокументы.Регистратор = ДД.Регистратор
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Организация В(&МассивОрганизаций)
	|	И ДД.Активность
	|	И ДД.РасчетСебестоимости
	|	И НЕ ДД.Сторно
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтПрочиеДоходыСохранениеДвижений";
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеДоходы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияПрочиеДоходы");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияПрочиеДоходы", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти

#Область ПрочиеАктивыПассивы

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.ВидДвижения,
	// Измерения
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.Статья,
	|	ДД.Аналитика,
	// Ресурсы
	|	ДД.Сумма КАК Сумма,
	// Реквизиты
	|	ДД.ВидИсточника,
	|	ДД.Источник,
	|	ДД.Сторно
	|
	|ПОМЕСТИТЬ ВтДвиженияПрочиеАктивыПассивы
	|ИЗ
	|	РегистрНакопления.ПрочиеАктивыПассивы КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РассчитанныеДокументы КАК РассчитанныеДокументы
	|		ПО РассчитанныеДокументы.Период = ДД.Период
	|		И РассчитанныеДокументы.Регистратор = ДД.Регистратор
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Организация В(&МассивОрганизаций)
	|	И ДД.Активность
	|	И ДД.РасчетСебестоимости
	|	И НЕ ДД.Сторно
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтПрочиеАктивыПассивыСохранениеДвижений";
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияПрочиеАктивыПассивы");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияПрочиеАктивыПассивы", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти

#Область ДвиженияНоменклатураДоходыРасходы

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	// Измерения
	|	ДД.ХозяйственнаяОперация,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельностиНоменклатуры,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.Склад,
	|	ДД.ТипЗапасов,
	|	ДД.ВидЗапасов,
	|	ДД.НаправлениеДеятельностиСтатьи,
	|	ДД.СтатьяДоходовРасходов,
	|	ДД.АналитикаДоходов,
	|	ДД.АналитикаРасходов,
	|	ДД.АналитикаАктивовПассивов,
	// Ресурсы
	|	ДД.Стоимость КАК Стоимость,
	|	ДД.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ДД.СтоимостьУпр КАК СтоимостьУпр,
	|	ДД.СтоимостьРегл КАК СтоимостьРегл,
	|	ДД.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	ДД.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|	ДД.ДопРасходы КАК ДопРасходы,
	|	ДД.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	ДД.ДопРасходыУпр КАК ДопРасходыУпр,
	|	ДД.ДопРасходыРегл КАК ДопРасходыРегл,
	|	ДД.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|	ДД.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|	ДД.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|	ДД.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|	ДД.Трудозатраты КАК Трудозатраты,
	|	ДД.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|	ДД.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|	ДД.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|	ДД.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|	ДД.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
	|	ДД.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|	ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	ДД.ВременнаяРазница КАК ВременнаяРазница,
	// Реквизиты
	|	ДД.ИсточникГФУНоменклатуры,
	|	ИСТИНА КАК Сторно
	|ПОМЕСТИТЬ ВтДвиженияНоменклатураДоходыРасходы
	|ИЗ
	|	РегистрНакопления.ДвиженияНоменклатураДоходыРасходы КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РассчитанныеДокументы КАК РассчитанныеДокументы
	|		ПО РассчитанныеДокументы.Период = ДД.Период
	|		И РассчитанныеДокументы.Регистратор = ДД.Регистратор
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Организация В(&МассивОрганизаций)
	|	И ДД.Активность
	|	И ДД.РасчетСебестоимости
	|	И НЕ ДД.Сторно
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтДвиженияНоменклатураДоходыРасходыСохранениеДвижений";
	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияНоменклатураДоходыРасходы");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияНоменклатураДоходыРасходы", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти

#Область ДвиженияНоменклатураНоменклатура

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	// Измерения
	|	ДД.ХозяйственнаяОперация,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.Склад,
	|	ДД.ТипЗапасов,
	|	ДД.ВидЗапасов,
	|	ДД.КорНаправлениеДеятельности,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорСклад,
	|	ДД.КорТипЗапасов,
	|	ДД.КорВидЗапасов,
	// Ресурсы
	|	ДД.Стоимость КАК Стоимость,
	|	ДД.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ДД.СтоимостьУпр КАК СтоимостьУпр,
	|	ДД.СтоимостьРегл КАК СтоимостьРегл,
	|	ДД.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	ДД.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|	ДД.ДопРасходы КАК ДопРасходы,
	|	ДД.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	ДД.ДопРасходыУпр КАК ДопРасходыУпр,
	|	ДД.ДопРасходыРегл КАК ДопРасходыРегл,
	|	ДД.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|	ДД.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|	ДД.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|	ДД.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|	ДД.Трудозатраты КАК Трудозатраты,
	|	ДД.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|	ДД.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|	ДД.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|	ДД.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|	ДД.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
	|	ДД.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|	ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	ДД.ВременнаяРазница КАК ВременнаяРазница,
	// Реквизиты
	|	ДД.ИсточникГФУНоменклатуры,
	|	ДД.КорИсточникГФУНоменклатуры,
	|	ДД.КорОрганизация,
	|	ДД.Сторно
	|ПОМЕСТИТЬ ВтДвиженияНоменклатураНоменклатура
	|ИЗ
	|	РегистрНакопления.ДвиженияНоменклатураНоменклатура КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РассчитанныеДокументы КАК РассчитанныеДокументы
	|		ПО РассчитанныеДокументы.Период = ДД.Период
	|		И РассчитанныеДокументы.Регистратор = ДД.Регистратор
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Организация В(&МассивОрганизаций)
	|	И ДД.Активность
	|	И ДД.РасчетСебестоимости
	|	И НЕ ДД.Сторно
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтДвиженияНоменклатураНоменклатураСохранениеДвижений";
	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураНоменклатура.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияНоменклатураНоменклатура");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияНоменклатураНоменклатура", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвиженияИзВременныхТаблиц(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	
	// Уничтожим ненужные временные таблицы.
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета, СуществующиеВТ);
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
КонецПроцедуры

//++ НЕ УТ

// Этап 3.4
// Формирует временные таблицы ВтНезавершенноеПроизводство
//
Процедура РаспределитьПрочиеРасходыНезавершенногоПроизводства(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределитьПрочиеРасходыНезавершенногоПроизводства");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Если ПараметрыРасчета.ПредварительныйРасчет Тогда
		
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 0
			|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)				КАК Организация,
			|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
			|	ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)		КАК Партия,
			|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)	КАК ВидДеятельностиНДС,
			|	НЕОПРЕДЕЛЕНО												КАК АналитикаУчетаПартий,
			|	0															КАК КодСтрокиПродукция,
			|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
			|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
			|	НЕОПРЕДЕЛЕНО												КАК АналитикаРасходов,
			|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)		КАК Подразделение,
			|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)			КАК СтатьяКалькуляции,
			|	ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка)			КАК Этап,
			|	ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка) КАК ГруппаПродукции,
			|	ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка) КАК ПравилоОтнесенияНаВыпуск,
			
			|	0 КАК Количество,
			|	0 КАК КоличествоБезНДС,
			|	0 КАК КоличествоРегл,
			|	0 КАК КоличествоУпр,
			
			|	0 КАК Сумма,
			|	0 КАК СуммаБезНДС,
			|	0 КАК СуммаУпр,
			|	0 КАК СуммаРегл,
			|	0 КАК ПостояннаяРазница,
			|	0 КАК ВременнаяРазница
			|
			|ПОМЕСТИТЬ ВтНезавершенноеПроизводство
			|;
			|
			|ВЫБРАТЬ ПЕРВЫЕ 0
			|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)				КАК Организация,
			|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
			|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
			|	НЕОПРЕДЕЛЕНО												КАК АналитикаРасходов,
			|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)		КАК Подразделение,
			|	0 КАК СуммаРегл,
			|	0 КАК СуммаУпр
			|ПОМЕСТИТЬ ПокрываемыеРезервамиСтатьиРасходов";
		
		Запрос.Выполнить();
		
		Возврат;
		
	КонецЕсли;
	
	//++ Локализация
	Если НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ВременнаяТаблицаСуществует(ПараметрыРасчета, "ВТСписаниеПостатейныхЗатрат") Тогда
		
		Запрос.Текст = РасчетСебестоимостиНДС.ТекстОписаниеДанныхДляРаспределениеПартийНДСФИФОСкользящая();
		Запрос.Текст = РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПриемникЗапросаОписанияДанных(Запрос.Текст, "ВТСписаниеПостатейныхЗатрат");
		
		Запрос.Выполнить();
		
	КонецЕсли;
	//-- Локализация
	
	Запрос.Текст = ТекстВтНезавершенноеПроизводство();
	Запрос.Текст = УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, Запрос.Текст);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ВтНезавершенноеПроизводство");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ДолиСписанияКосвенныхРасходов, ПрочиеРасходыНезавершенногоПроизводстваОстатки, 
		|ПокрываемыеРезервамиСтатьиРасходовПредварительная, СуммыРасходов, ВтОстаткиНезавершенногоПроизводства, ВтРаспределениеНаПартии");
	
КонецПроцедуры

Функция ТекстВтНезавершенноеПроизводство() Экспорт
	
	ТекстыЗапросов = Новый Массив;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДД.Организация                                   КАК Организация,
	|	ДД.ПартияПроизводства                            КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                           КАК ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция                            КАК КодСтрокиПродукция,
	|	ДД.НаправлениеДеятельности                       КАК НаправлениеДеятельности,
	|	ДД.Подразделение                                 КАК Подразделение,
	|	ДД.СтатьяРасходов                                КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                             КАК АналитикаРасходов,
	|	ДД.СтатьяКалькуляции                             КАК СтатьяКалькуляции,
	|	ДД.Этап                                			 КАК Этап,
	|	ДД.ГруппаПродукции                               КАК ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск                      КАК ПравилоОтнесенияНаВыпуск,
	|	СУММА(ДД.СтоимостьОстаток)                       КАК СтоимостьОстаток,
	|	СУММА(ДД.СтоимостьБезНДСОстаток)                 КАК СтоимостьБезНДСОстаток,
	|	СУММА(ДД.СтоимостьУпрОстаток)                    КАК СтоимостьУпрОстаток,
	|	СУММА(ДД.СтоимостьРеглОстаток)                   КАК СтоимостьРеглОстаток,
	|	СУММА(ДД.ПостояннаяРазницаОстаток)               КАК ПостояннаяРазницаОстаток,
	|	СУММА(ДД.ВременнаяРазницаОстаток)                КАК ВременнаяРазницаОстаток,
	|	СУММА(ДД.ДоляСтоимостиОстаток)                   КАК ДоляСтоимостиОстаток
	|ПОМЕСТИТЬ ПрочиеРасходыНезавершенногоПроизводстваОстатки
	|ИЗ (
	|	ВЫБРАТЬ
	|		ДД.Организация                                   КАК Организация,
	|		ДД.ПартияПроизводства                            КАК ПартияПроизводства,
	|		ДД.ЗаказНаПроизводство                           КАК ЗаказНаПроизводство,
	|		ДД.КодСтрокиПродукция                            КАК КодСтрокиПродукция,
	|		ДД.НаправлениеДеятельности                       КАК НаправлениеДеятельности,
	|		ДД.Подразделение                                 КАК Подразделение,
	|		ДД.СтатьяРасходов                                КАК СтатьяРасходов,
	|		ДД.АналитикаРасходов                             КАК АналитикаРасходов,
	|		ДД.СтатьяКалькуляции                             КАК СтатьяКалькуляции,
	|		ДД.Этап                                			 КАК Этап,
	|		ДД.ГруппаПродукции                               КАК ГруппаПродукции,
	|		ДД.ПравилоОтнесенияНаВыпуск                      КАК ПравилоОтнесенияНаВыпуск,
	|		ДД.СтоимостьОстаток                              КАК СтоимостьОстаток,
	|		ДД.СтоимостьБезНДСОстаток                        КАК СтоимостьБезНДСОстаток,
	|		ДД.СтоимостьУпрОстаток                           КАК СтоимостьУпрОстаток,
	|		ДД.СтоимостьРеглОстаток                          КАК СтоимостьРеглОстаток,
	|		ДД.ПостояннаяРазницаОстаток                      КАК ПостояннаяРазницаОстаток,
	|		ДД.ВременнаяРазницаОстаток                       КАК ВременнаяРазницаОстаток,
	|		ДД.ДоляСтоимостиОстаток                          КАК ДоляСтоимостиОстаток
	|	ИЗ
	|		РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(&НачалоПериода,
	|			Организация В (&МассивОрганизаций) И &ПартионныйУчетВерсии22) КАК ДД
	|
	//++ НЕ УТКА
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДД.Организация                                   КАК Организация,
	|		ДД.ПартияПроизводства                            КАК ПартияПроизводства,
	|		ДД.ЗаказНаПроизводство                           КАК ЗаказНаПроизводство,
	|		ДД.КодСтрокиПродукция                            КАК КодСтрокиПродукция,
	|		ДД.НаправлениеДеятельности                       КАК НаправлениеДеятельности,
	|		ДД.Подразделение                                 КАК Подразделение,
	|		ДД.СтатьяРасходов                                КАК СтатьяРасходов,
	|		ДД.АналитикаРасходов                             КАК АналитикаРасходов,
	|		ДД.СтатьяКалькуляции                             КАК СтатьяКалькуляции,
	|		ДД.Этап                                			 КАК Этап,
	|		ДД.ГруппаПродукции                               КАК ГруппаПродукции,
	|		ДД.ПравилоОтнесенияНаВыпуск                      КАК ПравилоОтнесенияНаВыпуск,
	|		ДД.Стоимость                                     КАК СтоимостьОстаток,
	|		ДД.СтоимостьБезНДС                               КАК СтоимостьБезНДСОстаток,
	|		ДД.СтоимостьУпр                                  КАК СтоимостьУпрОстаток,
	|		ДД.СтоимостьРегл                                 КАК СтоимостьРеглОстаток,
	|		ДД.ПостояннаяРазница                             КАК ПостояннаяРазницаОстаток,
	|		ДД.ВременнаяРазница                              КАК ВременнаяРазницаОстаток,
	|		ДД.ДоляСтоимости                                 КАК ДоляСтоимостиОстаток
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачальныеОстаткиНЗППоПартиямПроизводства КАК НачальныеОстатки
	|			ПО НачальныеОстатки.Ссылка = ДД.Регистратор
	//-- НЕ УТКА
	|	) КАК ДД
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция,
	|	ДД.НаправлениеДеятельности,
	|	ДД.Подразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.Этап,
	|	ДД.СтатьяКалькуляции,
	|	ДД.ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ПартияПроизводства,
	|	ЗаказНаПроизводство,
	|	КодСтрокиПродукция,
	|	НаправлениеДеятельности,
	|	Подразделение,
	|	СтатьяРасходов,
	|	АналитикаРасходов,
	|	Этап,
	|	СтатьяКалькуляции,
	|	ГруппаПродукции,
	|	ПравилоОтнесенияНаВыпуск
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Организация                                   КАК Организация,
	|	ДД.Подразделение                                 КАК Подразделение,
	|	ДД.НаправлениеДеятельности                       КАК НаправлениеДеятельности,
	|	ДД.ДокументВыпуска                               КАК Партия,
	|	ДД.АналитикаПартииВыпуска                        КАК АналитикаУчетаПартий,
	|	ДД.КодСтрокиПродукция                            КАК КодСтрокиПродукция,
	|	ДД.СтатьяРасходов                                КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                             КАК АналитикаРасходов,
	|	ДД.СтатьяКалькуляции                             КАК СтатьяКалькуляции,
	|	ДД.Этап                                			 КАК Этап,
	|	ДД.ГруппаПродукции                               КАК ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск                      КАК ПравилоОтнесенияНаВыпуск,
	|	ЕСТЬNULL(ОстаткиНЗП.СтоимостьОстаток, 0)            КАК Стоимость,
	|	ЕСТЬNULL(ОстаткиНЗП.СтоимостьБезНДСОстаток, 0)      КАК СтоимостьБезНДС,
	|	ЕСТЬNULL(ОстаткиНЗП.СтоимостьУпрОстаток, 0)         КАК СтоимостьУпр,
	|	ЕСТЬNULL(ОстаткиНЗП.СтоимостьРеглОстаток, 0)        КАК СтоимостьРегл,
	|	ЕСТЬNULL(ОстаткиНЗП.ПостояннаяРазницаОстаток, 0)    КАК ПостояннаяРазница,
	|	ЕСТЬNULL(ОстаткиНЗП.ВременнаяРазницаОстаток, 0)     КАК ВременнаяРазница,
	|	ЕСТЬNULL(ОстаткиНЗП.ДоляСтоимостиОстаток, 0)        КАК ДоляСтоимости,
	|	ВЫРАЗИТЬ((ЕСТЬNULL(Материальные.Остаток, 0) + ЕСТЬNULL(Трудозатраты.Остаток, 0) + ЕСТЬNULL(Продукция.Остаток, 0) + ЕСТЬNULL(Продукция21.Остаток, 0)) / ЕСТЬNULL(Коэффициенты.Коэффициент, 1) КАК ЧИСЛО (23, 10)) КАК ПоказательОтнесенияНаВыпуск,
	|	ВЫРАЗИТЬ((ЕСТЬNULL(Материальные.ОстатокБезНДС, 0) + ЕСТЬNULL(Трудозатраты.ОстатокБезНДС, 0) + ЕСТЬNULL(Продукция.ОстатокБезНДС, 0) + ЕСТЬNULL(Продукция21.ОстатокБезНДС, 0)) / ЕСТЬNULL(Коэффициенты.КоэффициентБезНДС, 1) КАК ЧИСЛО (23, 10)) КАК ПоказательОтнесенияНаВыпускБезНДС,
	|	ВЫРАЗИТЬ((ЕСТЬNULL(Материальные.ОстатокРегл, 0) + ЕСТЬNULL(Трудозатраты.ОстатокРегл, 0) + ЕСТЬNULL(Продукция.ОстатокРегл, 0) + ЕСТЬNULL(Продукция21.ОстатокРегл, 0)) / ЕСТЬNULL(Коэффициенты.КоэффициентРегл, 1) КАК ЧИСЛО (23, 10)) КАК ПоказательОтнесенияНаВыпускРегл,
	|	ВЫРАЗИТЬ((ЕСТЬNULL(Материальные.ОстатокУпр, 0) + ЕСТЬNULL(Трудозатраты.ОстатокУпр, 0) + ЕСТЬNULL(Продукция.ОстатокУпр, 0) + ЕСТЬNULL(Продукция21.ОстатокУпр, 0)) / ЕСТЬNULL(Коэффициенты.КоэффициентУпр, 1) КАК ЧИСЛО (23, 10)) КАК ПоказательОтнесенияНаВыпускУпр
	|ПОМЕСТИТЬ ВтОстаткиНезавершенногоПроизводства
	|ИЗ
	|	ПартииДляОтнесенияРасходов КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПрочиеРасходыНезавершенногоПроизводстваОстатки КАК ОстаткиНЗП
	|		ПО ДД.Организация = ОстаткиНЗП.Организация
	|		И ДД.Подразделение = ОстаткиНЗП.Подразделение
	|		И ДД.ПартияПроизводства = ОстаткиНЗП.ПартияПроизводства
	|		И ДД.ЗаказНаПроизводство = ОстаткиНЗП.ЗаказНаПроизводство
	|		И ДД.КодСтрокиПродукция = ОстаткиНЗП.КодСтрокиПродукция
	|		И ДД.НаправлениеДеятельности = ОстаткиНЗП.НаправлениеДеятельности
	|		И ДД.СтатьяКалькуляции = ОстаткиНЗП.СтатьяКалькуляции
	|		И ДД.СтатьяРасходов = ОстаткиНЗП.СтатьяРасходов
	|		И ДД.АналитикаРасходов = ОстаткиНЗП.АналитикаРасходов
	|		И ДД.Этап = ОстаткиНЗП.Этап
	|		И ДД.ГруппаПродукции = ОстаткиНЗП.ГруппаПродукции
	|		И ДД.ПравилоОтнесенияНаВыпуск = ОстаткиНЗП.ПравилоОтнесенияНаВыпуск
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиБазРаспределения КАК Материальные
	|		ПО ДД.Подразделение = Материальные.Подразделение
	|			И ДД.ПартияПроизводства = Материальные.ПартияПроизводства
	|			И ДД.ЗаказНаПроизводство = Материальные.ЗаказНаПроизводство
	|			И ДД.КодСтрокиПродукция = Материальные.КодСтрокиПродукция
	|			И (ВЫБОР
	|				КОГДА ДД.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымЗатратам)
	|						ИЛИ ДД.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымИТрудозатратам)
	|					ТОГДА Материальные.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымЗатратам)
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиБазРаспределения КАК Трудозатраты
	|		ПО ДД.Подразделение = Трудозатраты.Подразделение
	|			И ДД.ПартияПроизводства = Трудозатраты.ПартияПроизводства
	|			И ДД.ЗаказНаПроизводство = Трудозатраты.ЗаказНаПроизводство
	|			И ДД.КодСтрокиПродукция = Трудозатраты.КодСтрокиПродукция
	|			И (ВЫБОР
	|				КОГДА ДД.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоТрудозатратам)
	|						ИЛИ ДД.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымИТрудозатратам)
	|					ТОГДА Трудозатраты.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоТрудозатратам)
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиБазРаспределения КАК Продукция
	|		ПО Продукция.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			И ДД.ПартияПроизводства = Продукция.ПартияПроизводства
	|			И ДД.ЗаказНаПроизводство = Продукция.ЗаказНаПроизводство
	|			И ДД.КодСтрокиПродукция = Продукция.КодСтрокиПродукция
	|			И (ВЫБОР
	|				КОГДА ДД.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукцииСУчетомБудущихВыпусков)
	|					ТОГДА Продукция.ПравилоОтнесенияНаВыпуск = ДД.ПравилоОтнесенияНаВыпуск
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиБазРаспределения КАК Продукция21
	|		ПО Продукция21.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			И ДД.ПартияПроизводства = Продукция21.ПартияПроизводства
	|			И ДД.ЗаказНаПроизводство = Продукция21.ЗаказНаПроизводство
	|			И ДД.КодСтрокиПродукция = Продукция21.КодСтрокиПродукция
	|			И (ВЫБОР
	|				КОГДА ДД.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка)
	|					ТОГДА Продукция21.ПравилоОтнесенияНаВыпуск = ДД.ПравилоОтнесенияНаВыпуск
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыПриведения КАК Коэффициенты
	|		ПО Коэффициенты.ПартияПроизводства = ДД.ПартияПроизводства
	|		И Коэффициенты.ЗаказНаПроизводство = ДД.ЗаказНаПроизводство
	|		И Коэффициенты.ПравилоОтнесенияНаВыпуск = ДД.ПравилоОтнесенияНаВыпуск
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И (ЕСТЬNULL(ОстаткиНЗП.СтоимостьОстаток,0) <> 0
	|	ИЛИ ЕСТЬNULL(ОстаткиНЗП.СтоимостьБезНДСОстаток,0) <> 0
	|	ИЛИ ЕСТЬNULL(ОстаткиНЗП.СтоимостьРеглОстаток,0) <> 0
	|	ИЛИ ЕСТЬNULL(ОстаткиНЗП.ПостояннаяРазницаОстаток,0) <> 0
	|	ИЛИ ЕСТЬNULL(ОстаткиНЗП.ВременнаяРазницаОстаток,0) <> 0
	|	ИЛИ (ЕСТЬNULL(Материальные.Остаток, 0) + ЕСТЬNULL(Трудозатраты.Остаток, 0) + ЕСТЬNULL(Продукция.Остаток, 0)) <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Организация,
	|	ДД.НаправлениеДеятельности,
	|	ДД.ВидРезервов,
	|	ДД.ОбъектУчетаРезервов,
	|	СуммыРасходов.СтатьяРасходов,
	|	СуммыРасходов.АналитикаРасходов,
	|	СуммыРасходов.Подразделение,
	|	МАКСИМУМ(-ДД.СуммаРегл) КАК РезервРегл,
	|	МАКСИМУМ(-ДД.СуммаУпр) КАК РезервУпр
	|ПОМЕСТИТЬ РезервыПоРасходам
	|ИЗ
	|	ВТКэшРасчетныеОстаткиРезервыПредстоящихРасходов КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыУчетаРезервовПредстоящихРасходов.ИспользованиеРезерва КАК Статьи
	|		ПО ДД.ОбъектУчетаРезервов = Статьи.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммыРасходов КАК СуммыРасходов
	|		ПО ДД.Организация = СуммыРасходов.Организация
	|		И ДД.НаправлениеДеятельности = СуммыРасходов.НаправлениеДеятельности
	|		И Статьи.СтатьяРасходов = СуммыРасходов.СтатьяРасходов
	|		И (Статьи.АналитикаРасходов = СуммыРасходов.АналитикаРасходов ИЛИ Статьи.ЛюбаяАналитикаРасходов)
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И (СуммыРасходов.СуммаУпр >= 0 ИЛИ СуммыРасходов.СуммаРегл >= 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.НаправлениеДеятельности,
	|	ДД.ВидРезервов,
	|	ДД.ОбъектУчетаРезервов,
	|	СуммыРасходов.СтатьяРасходов,
	|	СуммыРасходов.АналитикаРасходов,
	|	СуммыРасходов.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.Подразделение
	|ПОМЕСТИТЬ ПокрываемыеРезервамиСтатьиРасходовПредварительная
	|ИЗ
	|	РезервыПоРасходам КАК ДД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерУзла,
	|	ДД.Организация,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.Подразделение,
	|	ЕСТЬNULL(СуммыРасходов.СуммаРегл, 0) КАК СуммаРегл,
	|	ЕСТЬNULL(СуммыРасходов.СуммаУпр, 0) КАК СуммаУпр
	|ПОМЕСТИТЬ ПокрываемыеРезервамиСтатьиРасходов
	|ИЗ
	|	ПокрываемыеРезервамиСтатьиРасходовПредварительная КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыРасходов КАК СуммыРасходов
	|		ПО ДД.Организация = СуммыРасходов.Организация
	|			И ДД.Подразделение = СуммыРасходов.Подразделение
	|			И ДД.НаправлениеДеятельности = СуммыРасходов.НаправлениеДеятельности
	|			И ДД.СтатьяРасходов = СуммыРасходов.СтатьяРасходов
	|			И ДД.АналитикаРасходов = СуммыРасходов.АналитикаРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиРезервов.Организация КАК Организация,
	|	ОстаткиРезервов.ВидРезервов КАК ВидРезервов,
	|	МАКСИМУМ(Реквизиты.Ссылка)	КАК ДокументДвижения
	|ПОМЕСТИТЬ ДокументыДвиженияРезервов
	|ИЗ
	|	ВТКэшРасчетныеОстаткиРезервыПредстоящихРасходов КАК ОстаткиРезервов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеСписаниеРезервовПредстоящихРасходов КАК Реквизиты
	|		ПО ОстаткиРезервов.Организация = Реквизиты.Организация
	|			И ОстаткиРезервов.ВидРезервов = Реквизиты.ВидРезервов
	|ГДЕ
	|	Реквизиты.Проведен
	|	И Реквизиты.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиРезервов.Организация,
	|	ОстаткиРезервов.ВидРезервов		
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расходы.Организация				КАК Организация,
	|	Расходы.СтатьяРасходов			КАК СтатьяРасходов,
	|	Расходы.АналитикаРасходов		КАК АналитикаРасходов,
	|	Расходы.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	Расходы.Подразделение			КАК Подразделение,
	|	СУММА(Расходы.Количество)		КАК Количество,
	|	СУММА(Расходы.КоличествоБезНДС)	КАК КоличествоБезНДС,
	|	СУММА(Расходы.КоличествоРегл)	КАК КоличествоРегл,
	|	СУММА(Расходы.КоличествоУпр)	КАК КоличествоУпр	
	|ПОМЕСТИТЬ ВтРаспределениеНаПартии
	|ИЗ (
	// распределение на этапы при ПУ21
	|	ВЫБРАТЬ
	|		Расходы.Организация					КАК Организация,
	|		Операция.СтатьяРасходов				КАК СтатьяРасходов,
	|		Операция.АналитикаРасходов			КАК АналитикаРасходов,
	|		Операция.Подразделение				КАК Подразделение,
	|		Операция.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|		Расходы.ДоляСтоимости				КАК Количество,
	|		Расходы.ДоляСтоимости				КАК КоличествоБезНДС,
	|		Расходы.ДоляСтоимости				КАК КоличествоРегл,
	|		Расходы.ДоляСтоимости				КАК КоличествоУпр
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Операция
	|			ПО Операция.Ссылка = Расходы.Регистратор
	|	ГДЕ
	|		Расходы.СлужебноеВидДвиженияПриход
	|		И НЕ &ПартионныйУчетВерсии22
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// распределение на другие статьи при ПУ21
	|	ВЫБРАТЬ
	|		Операция.Организация,
	|		Операция.СтатьяРасходов,
	|		Операция.АналитикаРасходов,
	|		Операция.Подразделение,
	|		Операция.НаправлениеДеятельности,
	|		Строки.ДоляСтоимости,
	|		Строки.ДоляСтоимости,
	|		Строки.ДоляСтоимости,
	|		Строки.ДоляСтоимости
	|	ИЗ
	|		Документ.РаспределениеПрочихЗатрат КАК Операция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат.Списание КАК Строки
	|			ПО Строки.Ссылка = Операция.Ссылка
	|	ГДЕ
	|		Операция.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Операция.Организация В(&МассивОрганизаций)
	|		И Операция.Проведен
	|		И НЕ &ПартионныйУчетВерсии22
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// распределение для ПУ 2.2
	|	ВЫБРАТЬ
	|		ДД.Организация,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ДД.ДоляСтоимости,
	|		ДД.ДоляСтоимостиБезНДС,
	|		ДД.ДоляСтоимостиРегл,
	|		ДД.ДоляСтоимостиУпр	
	|	ИЗ
	|		ДолиПроизводственныхРасходов КАК ДД
	|	ГДЕ
	|		ДД.Организация В(&МассивОрганизаций)
	|		И &ПартионныйУчетВерсии22
	|		И НЕ (ДД.ДоляСтоимости = 0
	|			И ДД.ДоляСтоимостиБезНДС = 0
	|			И ДД.ДоляСтоимостиРегл = 0
	|			И ДД.ДоляСтоимостиУпр = 0)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// распределение для расходов на себестоимость производства
	|	ВЫБРАТЬ
	|		ДД.Организация,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ДД.ДоляСтоимости,
	|		ДД.ДоляСтоимостиБезНДС,
	|		ДД.ДоляСтоимостиРегл,
	|		ДД.ДоляСтоимостиУпр	
	|	ИЗ
	|		ПрямыеПроизводственныеРасходы КАК ДД
	|	ГДЕ
	|		ДД.Организация В(&МассивОрганизаций)
	|	) КАК Расходы
	|
	|СГРУППИРОВАТЬ ПО
	|	Расходы.Организация,
	|	Расходы.СтатьяРасходов,
	|	Расходы.АналитикаРасходов,
	|	Расходы.Подразделение,
	|	Расходы.НаправлениеДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//++ Локализация
	|ВЫБРАТЬ
	|	ДД.Организация                           КАК Организация,
	|	ДД.Партия                                КАК Партия,
	|	НЕОПРЕДЕЛЕНО					 		 КАК ВидДеятельностиНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|	ЕСТЬNULL(ДД.АналитикаУчетаПартий.КодСтроки, 0) КАК КодСтрокиПродукция,
	|	ВЫРАЗИТЬ(ДД.СтатьяРасходовАктивов КАК ПланВидовХарактеристик.СтатьиРасходов) КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                     КАК АналитикаРасходов,
	|	ЕСТЬNULL(Доли.КорПодразделение, ДД.Подразделение) КАК Подразделение,
	|	ДД.КорНаправлениеДеятельности            КАК НаправлениеДеятельности,
	|	Доли.СтатьяКалькуляции                   КАК СтатьяКалькуляции,
	|	ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка)        КАК Этап,
	|	Доли.ГруппаПродукции                     КАК ГруппаПродукции,
	|	Доли.ПравилоОтнесенияНаВыпуск            КАК ПравилоОтнесенияНаВыпуск,
	|	0  			 							 КАК ПоказательОтнесенияНаВыпуск,
	|	0	 	 								 КАК ПоказательОтнесенияНаВыпускБезНДС,
	|	0	 	 								 КАК ПоказательОтнесенияНаВыпускРегл,
	|	0		 	 							 КАК ПоказательОтнесенияНаВыпускУпр,
	|	0              							 КАК Сумма,
	|	0                       				 КАК СуммаБезНДС,
	|	СУММА(ВЫБОР КОГДА ДД.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|	 И ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДД.НДСУпр
	|
	|	КОГДА ДД.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|	 И ДД.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|	 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА ДД.НДСУпр
	|
	|	КОГДА ДД.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|	 И ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА -ДД.НДСУпр
	|	КОГДА ДД.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|	 И ДД.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|	 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА -ДД.НДСУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ) 									 КАК СуммаУпр,
	|	СУММА(ВЫБОР КОГДА ДД.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|	 И ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ДД.НДС
	|
	|	КОГДА ДД.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|	 И ДД.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|	 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА ДД.НДС
	|
	|	КОГДА ДД.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|	 И ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА -ДД.НДС
	|	КОГДА ДД.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|	 И ДД.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|	 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА -ДД.НДС
	|		ИНАЧЕ 0
	|	КОНЕЦ) 									 КАК СуммаРегл,
	|	0                     					 КАК ПостояннаяРазница,
	|	0                      					 КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВтНезавершенноеПроизводствоВключениеИсключениеНДСПредварительная
	|ИЗ
	|	ВТСписаниеПостатейныхЗатрат КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДолиПроизводственныхРасходов КАК Доли
	|		ПО ДД.Организация = Доли.Организация
	|		И ДД.Регистратор = Доли.Регистратор
	|		И ДД.Партия = Доли.ПартияПроизводства
	|		И ДД.КорНаправлениеДеятельности = Доли.КорНаправлениеДеятельности
	|		И ДД.СтатьяРасходовАктивов = Доли.СтатьяРасходов
	|		И ДД.АналитикаРасходов = Доли.АналитикаРасходов
	|		И (ДД.СтатьяКалькуляции = Доли.СтатьяКалькуляции
	|			ИЛИ (ДД.СтатьяКалькуляции В (ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
	|		  	  И Доли.СтатьяКалькуляции В (ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка), НЕОПРЕДЕЛЕНО)))
	|		И (ДД.ГруппаПродукции = Доли.ГруппаПродукции
	|			ИЛИ (ДД.ГруппаПродукции В (ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
	|		  	  И Доли.ГруппаПродукции В (ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка), НЕОПРЕДЕЛЕНО)))
	|		И (ДД.ПравилоОтнесенияНаВыпуск = Доли.ПравилоОтнесенияНаВыпуск
	|			ИЛИ (ДД.ПравилоОтнесенияНаВыпуск В (ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
	|		  	  И Доли.ПравилоОтнесенияНаВыпуск В (ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка), НЕОПРЕДЕЛЕНО)))
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ДанныеПервичныхДокументов.Организация = ДД.Организация
	|		И ДанныеПервичныхДокументов.Документ = ДД.ДокументПоступления
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И ДД.Организация В(&МассивОрганизаций)
	|	И ДД.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	И ДД.ВидДеятельностиНДС <> НЕОПРЕДЕЛЕНО
	|	И ДД.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	И ДД.КорВидДеятельностиНДС <> НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДеятельностиНДС <> ДД.КорВидДеятельностиНДС
	|	И ДД.ТипЗаписи В 
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
	|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускПостатейные))
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.Партия,
	|	ЕСТЬNULL(ДД.АналитикаУчетаПартий.КодСтроки, 0),
	|	ВЫРАЗИТЬ(ДД.СтатьяРасходовАктивов КАК ПланВидовХарактеристик.СтатьиРасходов),
	|	ДД.АналитикаРасходов,
	|	ЕСТЬNULL(Доли.КорПодразделение, ДД.Подразделение),
	|	ДД.КорНаправлениеДеятельности,
	|	Доли.СтатьяКалькуляции,
	|	Доли.ГруппаПродукции,
	|	Доли.ПравилоОтнесенияНаВыпуск
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//-- Локализация
	// Распределение на партии
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерУзла,
	|	Расходы.Организация,
	|	Расходы.РазделУчета,
	|	Расходы.Партия,
	|	Расходы.ВидДеятельностиНДС,
	|	Расходы.АналитикаУчетаПартий,
	|	Расходы.КодСтрокиПродукция,
	|	Расходы.НаправлениеДеятельности,
	|	Расходы.СтатьяРасходов,
	|	Расходы.АналитикаРасходов,
	|	Расходы.Подразделение,
	|	Расходы.СтатьяКалькуляции,
	|	Расходы.Этап,
	|	Расходы.ГруппаПродукции,
	|	Расходы.ПравилоОтнесенияНаВыпуск,
	|	Расходы.Количество,
	|	Расходы.КоличествоБезНДС,
	|	Расходы.КоличествоРегл,
	|	Расходы.КоличествоУпр,
	
	|	Расходы.Сумма,
	|	Расходы.СуммаБезНДС,
	|	Расходы.СуммаУпр,
	|	Расходы.СуммаРегл,
	|	Расходы.ПостояннаяРазница,
	|	Расходы.ВременнаяРазница
	|
	|ПОМЕСТИТЬ ВтНезавершенноеПроизводство
	|ИЗ (
	|
	|ВЫБРАТЬ
	|	Расходы.Организация                                        КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК РазделУчета,
	|	ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)	   КАК Партия,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО                                               КАК АналитикаУчетаПартий,
	|	0													       КАК КодСтрокиПродукция,
	|	Расходы.НаправлениеДеятельности                            КАК НаправлениеДеятельности,
	|	Расходы.СтатьяРасходов                                     КАК СтатьяРасходов,
	|	Расходы.АналитикаРасходов                                  КАК АналитикаРасходов,
	|	Расходы.Подразделение                                      КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)        КАК СтатьяКалькуляции,
	|	ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка)        КАК Этап,
	|	ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка) КАК ГруппаПродукции,
	|	ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка) КАК ПравилоОтнесенияНаВыпуск,
	|	Расходы.Количество                                  		КАК Количество,
	|	Расходы.КоличествоБезНДС                            		КАК КоличествоБезНДС,
	|	Расходы.КоличествоРегл                              		КАК КоличествоРегл,
	|	Расходы.КоличествоУпр                               		КАК КоличествоУпр,
	|	ЕСТЬNULL(СуммыРасходовУпр.Сумма, 0)              			КАК Сумма,
	|	ЕСТЬNULL(СуммыРасходовУпр.СуммаБезНДС, 0)        			КАК СуммаБезНДС,
	|	ЕСТЬNULL(СуммыРасходовУпр.СуммаУпр, 0)           			КАК СуммаУпр,
	|	ЕСТЬNULL(СуммыРасходовРегл.СуммаРегл, 0)         			КАК СуммаРегл,
	|	ЕСТЬNULL(СуммыРасходовРегл.ПостояннаяРазница, 0) 			КАК ПостояннаяРазница,
	|	ЕСТЬNULL(СуммыРасходовРегл.ВременнаяРазница, 0)  			КАК ВременнаяРазница
	|ИЗ
	|	ВтРаспределениеНаПартии КАК Расходы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|		ПО Статьи.Ссылка = Расходы.СтатьяРасходов
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтОВЗ КАК ВтОВЗ
	|		ПО Расходы.АналитикаРасходов = ВтОВЗ.ОВЗ
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ СуммыРасходов КАК СуммыРасходовУпр
	|		ПО СуммыРасходовУпр.Организация = Расходы.Организация
	|		И СуммыРасходовУпр.СтатьяРасходов = Расходы.СтатьяРасходов
	|		И СуммыРасходовУпр.АналитикаРасходов = Расходы.АналитикаРасходов
	|		И СуммыРасходовУпр.Подразделение = Расходы.Подразделение
	|		И СуммыРасходовУпр.НаправлениеДеятельности = Расходы.НаправлениеДеятельности
	|		И ЕСТЬNULL(ВтОВЗ.ВариантРаспределенияРасходовУпр, Статьи.ВариантРаспределенияРасходовУпр) В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ СуммыРасходов КАК СуммыРасходовРегл
	|		ПО СуммыРасходовРегл.Организация = Расходы.Организация
	|		И СуммыРасходовРегл.СтатьяРасходов = Расходы.СтатьяРасходов
	|		И СуммыРасходовРегл.АналитикаРасходов = Расходы.АналитикаРасходов
	|		И СуммыРасходовРегл.Подразделение = Расходы.Подразделение
	|		И СуммыРасходовРегл.НаправлениеДеятельности = Расходы.НаправлениеДеятельности
	|		И (ЕСТЬNULL(ВтОВЗ.ВариантРаспределенияРасходовРегл, Статьи.ВариантРаспределенияРасходовРегл) В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			ИЛИ ЕСТЬNULL(ВтОВЗ.ВариантРаспределенияРасходовНУ, Статьи.ВариантРаспределенияРасходовНУ) В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства)))
	|
	|ГДЕ
	|	ЕСТЬNULL(ВтОВЗ.ВариантРаспределенияРасходовУпр, Статьи.ВариантРаспределенияРасходовУпр) В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|	ИЛИ ЕСТЬNULL(ВтОВЗ.ВариантРаспределенияРасходовРегл, Статьи.ВариантРаспределенияРасходовРегл) В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|	ИЛИ ЕСТЬNULL(ВтОВЗ.ВариантРаспределенияРасходовНУ, Статьи.ВариантРаспределенияРасходовНУ) В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// распределение на продукцию
	|ВЫБРАТЬ
	|	ДД.Организация                                       КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство) КАК РазделУчета,
	|	ДД.Партия                                            КАК Партия,
	|	ДД.ВидДеятельностиНДС								 КАК ВидДеятельностиНДС,
	|	ДД.АналитикаУчетаПартий                              КАК АналитикаУчетаПартий,
	|	ДД.КодСтрокиПродукция								 КАК КодСтрокиПродукция,
	|	ДД.НаправлениеДеятельности							 КАК НаправлениеДеятельности,
	|	ДД.СтатьяРасходов                                    КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                 КАК АналитикаРасходов,
	|	ДД.Подразделение                                     КАК Подразделение,
	|	ДД.СтатьяКалькуляции                                 КАК СтатьяКалькуляции,
	|	ДД.Этап												 КАК Этап,
	|	ДД.ГруппаПродукции                                   КАК ГруппаПродукции,
	|	ДД.ПравилоОтнесенияНаВыпуск                          КАК ПравилоОтнесенияНаВыпуск,
	|	СУММА(ДД.ПоказательОтнесенияНаВыпуск)                КАК Количество,
	|	СУММА(ДД.ПоказательОтнесенияНаВыпускБезНДС)          КАК КоличествоБезНДС,
	|	СУММА(ДД.ПоказательОтнесенияНаВыпускРегл)            КАК КоличествоРегл,
	|	СУММА(ДД.ПоказательОтнесенияНаВыпускУпр)             КАК КоличествоУпр,
	|	СУММА(ДД.Сумма)                                      КАК Сумма,
	|	СУММА(ДД.СуммаБезНДС)                                КАК СуммаБезНДС,
	|	СУММА(ДД.СуммаУпр)                                   КАК СуммаУпр,
	|	СУММА(ДД.СуммаРегл)                                  КАК СуммаРегл,
	|	СУММА(ДД.ПостояннаяРазница)                          КАК ПостояннаяРазница,
	|	СУММА(ДД.ВременнаяРазница)                           КАК ВременнаяРазница
	|ИЗ (
	|	ВЫБРАТЬ
	|		ДД.Организация                           КАК Организация,
	|		ДД.ДокументВыпуска                       КАК Партия,
	|		ДД.ВидДеятельностиНДС					 КАК ВидДеятельностиНДС,
	|		ДД.АналитикаПартииВыпуска      			 КАК АналитикаУчетаПартий,
	|		ДД.КодСтрокиПродукция      				 КАК КодСтрокиПродукция,
	|		ДД.СтатьяРасходов                        КАК СтатьяРасходов,
	|		ДД.АналитикаРасходов                     КАК АналитикаРасходов,
	|		ДД.Подразделение                         КАК Подразделение,
	|		ДД.НаправлениеДеятельности               КАК НаправлениеДеятельности,
	|		ДД.СтатьяКалькуляции                     КАК СтатьяКалькуляции,
	|		ДД.Этап              					 КАК Этап,
	|		ДД.ГруппаПродукции                       КАК ГруппаПродукции,
	|		ДД.ПравилоОтнесенияНаВыпуск              КАК ПравилоОтнесенияНаВыпуск,
	|		ДД.ПоказательОтнесенияНаВыпуск			 КАК ПоказательОтнесенияНаВыпуск,
	|		ДД.ПоказательОтнесенияНаВыпускБезНДС	 КАК ПоказательОтнесенияНаВыпускБезНДС,
	|		ДД.ПоказательОтнесенияНаВыпускРегл		 КАК ПоказательОтнесенияНаВыпускРегл,
	|		ДД.ПоказательОтнесенияНаВыпускУпр		 КАК ПоказательОтнесенияНаВыпускУпр,
	|		0                                        КАК Сумма,
	|		0                                        КАК СуммаБезНДС,
	|		0                                        КАК СуммаУпр,
	|		0                                        КАК СуммаРегл,
	|		0                                        КАК ПостояннаяРазница,
	|		0                                        КАК ВременнаяРазница
	|	ИЗ
	|		втПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ГДЕ
	|		ДД.Организация В (&МассивОрганизаций)
	|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И &ПартионныйУчетВерсии22
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	//++ Локализация
	// Включение-исключение НДС
	|	ВЫБРАТЬ
	|		ДД.Организация                           КАК Организация,
	|		ДД.Партия                                КАК Партия,
	|		ДД.ВидДеятельностиНДС				 	 КАК ВидДеятельностиНДС,
	|		ДД.АналитикаУчетаПартий 				 КАК АналитикаУчетаПартий,
	|		ДД.КодСтрокиПродукция 					 КАК КодСтрокиПродукция,
	|		ДД.СтатьяРасходов 						 КАК СтатьяРасходов,
	|		ДД.АналитикаРасходов                     КАК АналитикаРасходов,
	|		ДД.Подразделение                         КАК Подразделение,
	|		ДД.НаправлениеДеятельности               КАК НаправлениеДеятельности,
	|		ДД.СтатьяКалькуляции                     КАК СтатьяКалькуляции,
	|		ДД.Этап        							 КАК Этап,
	|		ДД.ГруппаПродукции                       КАК ГруппаПродукции,
	|		ДД.ПравилоОтнесенияНаВыпуск              КАК ПравилоОтнесенияНаВыпуск,
	|		ДД.ПоказательОтнесенияНаВыпуск			 КАК ПоказательОтнесенияНаВыпуск,
	|		ДД.ПоказательОтнесенияНаВыпускБезНДС	 КАК ПоказательОтнесенияНаВыпускБезНДС,
	|		ДД.ПоказательОтнесенияНаВыпускРегл		 КАК ПоказательОтнесенияНаВыпускРегл,
	|		ДД.ПоказательОтнесенияНаВыпускУпр		 КАК ПоказательОтнесенияНаВыпускУпр,
	|		ДД.Сумма       							 КАК Сумма,
	|		ДД.СуммаБезНДС                       	 КАК СуммаБезНДС,
	|		ДД.СуммаУпр								 КАК СуммаУпр,
	|		ДД.СуммаРегл							 КАК СуммаРегл,
	|		ДД.ПостояннаяРазница   					 КАК ПостояннаяРазница,
	|		ДД.ВременнаяРазница                      КАК ВременнаяРазница
	|	ИЗ
	|		ВтНезавершенноеПроизводствоВключениеИсключениеНДСПредварительная КАК ДД
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	//-- Локализация
	|
	|	ВЫБРАТЬ
	|		ДД.Организация                           КАК Организация,
	|		ДД.Партия                                КАК Партия,
	|		ЕСТЬNULL(
	|			ВЫРАЗИТЬ(ДД.АналитикаУчетаПартий КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Назначение.ВидДеятельностиНДС, НЕОПРЕДЕЛЕНО) КАК ВидДеятельностиНДС,
	|		ДД.АналитикаУчетаПартий                  КАК АналитикаУчетаПартий,
	|		ДД.КодСтрокиПродукция      				 КАК КодСтрокиПродукция,
	|		ДД.СтатьяРасходов                        КАК СтатьяРасходов,
	|		ДД.АналитикаРасходов                     КАК АналитикаРасходов,
	|		ДД.Подразделение                         КАК Подразделение,
	|		ДД.НаправлениеДеятельности               КАК НаправлениеДеятельности,
	|		ДД.СтатьяКалькуляции                     КАК СтатьяКалькуляции,
	|		ДД.Этап              					 КАК Этап,
	|		ДД.ГруппаПродукции                       КАК ГруппаПродукции,
	|		ДД.ПравилоОтнесенияНаВыпуск              КАК ПравилоОтнесенияНаВыпуск,
	|		ДД.ПоказательОтнесенияНаВыпуск           КАК ПоказательОтнесенияНаВыпуск,
	|		ДД.ПоказательОтнесенияНаВыпускБезНДС	 КАК ПоказательОтнесенияНаВыпускБезНДС,
	|		ДД.ПоказательОтнесенияНаВыпускРегл		 КАК ПоказательОтнесенияНаВыпускРегл,
	|		ДД.ПоказательОтнесенияНаВыпускУпр		 КАК ПоказательОтнесенияНаВыпускУпр,
	|		ДД.Стоимость                             КАК Сумма,
	|		ДД.СтоимостьБезНДС                       КАК СуммаБезНДС,
	|		ДД.СтоимостьУпр                          КАК СуммаУпр,
	|		ДД.СтоимостьРегл                         КАК СуммаРегл,
	|		ДД.ПостояннаяРазница                     КАК ПостояннаяРазница,
	|		ДД.ВременнаяРазница                      КАК ВременнаяРазница
	|	ИЗ
	|		ВтОстаткиНезавершенногоПроизводства КАК ДД
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|
	|	) КАК ДД
	|
	|	СГРУППИРОВАТЬ ПО
	|		ДД.Партия,
	|		ДД.ВидДеятельностиНДС,
	|		ДД.АналитикаУчетаПартий,
	|		ДД.КодСтрокиПродукция,
	|		ДД.Организация,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ДД.СтатьяКалькуляции,
	|		ДД.Этап,
	|		ДД.ГруппаПродукции,
	|		ДД.ПравилоОтнесенияНаВыпуск
	|) КАК Расходы
	//++ Локализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Партия,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаУчетаПартий,
	|	Т.КодСтрокиПродукция,
	|	Т.НаправлениеДеятельности,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.Подразделение,
	|	Т.СтатьяКалькуляции,
	|	Т.ГруппаПродукции,
	|	Т.ПравилоОтнесенияНаВыпуск,
	|	Т.СуммаУпр,
	|	Т.СуммаРегл
	|ПОМЕСТИТЬ ВтНезавершенноеПроизводствоВключениеИсключениеНДС
	|ИЗ
	|	ВтНезавершенноеПроизводствоВключениеИсключениеНДСПредварительная КАК Т
	|ГДЕ
	|	Т.СуммаРегл <> 0 ИЛИ Т.СуммаУпр <> 0
	//-- Локализация
	|";
	
	ТекстыЗапросов.Добавить(ТекстСуммыПрочихРасходов());
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	Возврат СтрСоединить(ТекстыЗапросов,
		ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
		
КонецФункции

//-- НЕ УТ

Функция ТекстСуммыПрочихРасходов() Экспорт
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписанияНаРасходыПоФиксированнойСтоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	СписанияНаРасходыПоФиксированнойСтоимости.РазделУчета КАК РазделУчета,
	|	СписанияНаРасходыПоФиксированнойСтоимости.ВидЗапасов КАК ВидЗапасов,
	|	СписанияНаРасходыПоФиксированнойСтоимости.Организация КАК Организация,
	|	СписанияНаРасходыПоФиксированнойСтоимости.Партия КАК Партия,
	|	СписанияНаРасходыПоФиксированнойСтоимости.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	СписанияНаРасходыПоФиксированнойСтоимости.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	СписанияНаРасходыПоФиксированнойСтоимости.ВидДеятельностиНДС КАК ВидДеятельностиНДС
	|
	|ПОМЕСТИТЬ СписаниеНаРасходыИсключения
	|
	|ИЗ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СписанияНаРасходыПоФиксированнойСтоимости
	|
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СписанияНаРасходыПоРасчетнойСтоимости
	|ПО
	|	СписанияНаРасходыПоФиксированнойСтоимости.АналитикаУчетаНоменклатуры = СписанияНаРасходыПоРасчетнойСтоимости.АналитикаУчетаНоменклатуры
	|	И СписанияНаРасходыПоФиксированнойСтоимости.РазделУчета = СписанияНаРасходыПоРасчетнойСтоимости.РазделУчета
	|	И СписанияНаРасходыПоФиксированнойСтоимости.ВидЗапасов = СписанияНаРасходыПоРасчетнойСтоимости.ВидЗапасов
	|	И СписанияНаРасходыПоФиксированнойСтоимости.Организация = СписанияНаРасходыПоРасчетнойСтоимости.Организация
	|	И СписанияНаРасходыПоФиксированнойСтоимости.Партия = СписанияНаРасходыПоРасчетнойСтоимости.Партия
	|	И СписанияНаРасходыПоФиксированнойСтоимости.АналитикаУчетаПартий = СписанияНаРасходыПоРасчетнойСтоимости.АналитикаУчетаПартий
	|	И СписанияНаРасходыПоФиксированнойСтоимости.АналитикаФинансовогоУчета = СписанияНаРасходыПоРасчетнойСтоимости.АналитикаФинансовогоУчета
	|	И СписанияНаРасходыПоФиксированнойСтоимости.ВидДеятельностиНДС = СписанияНаРасходыПоРасчетнойСтоимости.ВидДеятельностиНДС
	|	И СписанияНаРасходыПоФиксированнойСтоимости.СлужебноеВидДвиженияПриход = СписанияНаРасходыПоРасчетнойСтоимости.СлужебноеВидДвиженияПриход
	|	И СписанияНаРасходыПоФиксированнойСтоимости.ХозяйственнаяОперация = 
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|	И СписанияНаРасходыПоРасчетнойСтоимости.ХозяйственнаяОперация = 
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыФиксированнаяСтоимость)
	|
	|ГДЕ
	|	НЕ СписанияНаРасходыПоФиксированнойСтоимости.СлужебноеВидДвиженияПриход
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	РазделУчета,
	|	ВидЗапасов,
	|	Организация,
	|	Партия,
	|	АналитикаУчетаПартий,
	|	АналитикаФинансовогоУчета,
	|	ВидДеятельностиНДС
	|;
	|
	|ВЫБРАТЬ
	|	ДД.Организация,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	СУММА(ДД.Сумма) КАК Сумма,
	|	СУММА(ДД.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(ДД.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ВЫБОР
	|			КОГДА Статьи.ВариантРаспределенияРасходовНУ В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|														   ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства),
	|														   ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И НЕ Статьи.ВариантРаспределенияРасходовРегл В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|														   		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства),
	|																ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				ТОГДА 0
	|			ИНАЧЕ
	|				ДД.СуммаРегл
	|		КОНЕЦ) КАК СуммаРегл,
	|	СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(
	|		ВЫБОР
	|			КОГДА Статьи.КосвенныеЗатратыНУ
	|				ТОГДА ДД.СуммаРегл - ДД.ПостояннаяРазница
	|			КОГДА Статьи.ВариантРаспределенияРасходовНУ В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|														   ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства),
	|														   ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И НЕ Статьи.ВариантРаспределенияРасходовРегл В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|														   		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства),
	|																ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				ТОГДА -(ДД.СуммаРегл - ДД.ПостояннаяРазница)
	|			ИНАЧЕ
	|				ДД.ВременнаяРазница
	|		КОНЕЦ) КАК ВременнаяРазница
	|ПОМЕСТИТЬ СуммыРасходов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДД.Организация,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ДД.СуммаОстаток КАК Сумма,
	|		ДД.СуммаБезНДСОстаток КАК СуммаБезНДС,
	|		ДД.СуммаУпрОстаток КАК СуммаУпр,
	|		ДД.СуммаРеглОстаток КАК СуммаРегл,
	|		ВЫБОР
	|			КОГДА ЛОЖЬ ТОГДА 0 // Для удобства расстановки тегов
	//++ НЕ УТ
	|			КОГДА ДД.СтатьяРасходов.ВидРасходов В (&ВидыРасходовНормируемые)
	|				ТОГДА 0
	//-- НЕ УТ
	|			ИНАЧЕ
	|				ДД.ПостояннаяРазницаОстаток
	|		КОНЕЦ КАК ПостояннаяРазница,
	|		ДД.ВременнаяРазницаОстаток КАК ВременнаяРазница
	|	ИЗ
	|		РегистрНакопления.ПрочиеРасходы.Остатки(&ГраницаКонецПредыдущегоПериода,
	|			&ПартионныйУчетВерсии22
	|			И Организация В (&МассивОрганизаций)) КАК ДД
	|
	|	ОБЪЕДИНИТЬ ВСЕ	
	|	
	|	ВЫБРАТЬ
	|		ДД.Организация,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.Сумма КАК Сумма,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.СуммаБезНДС КАК СуммаБезНДС,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.СуммаУпр КАК СуммаУпр,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.СуммаРегл КАК СуммаРегл,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.ВременнаяРазница КАК ВременнаяРазница
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПрочиеРасходы КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РассчитанныеДокументы КАК РассчитанныеДокументы
	|			ПО РассчитанныеДокументы.Период = ДД.Период
	|			И РассчитанныеДокументы.Регистратор = ДД.Регистратор
	|			И &РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДвиженияСебестоимости
	|			ПО ДвиженияСебестоимости.Период = ДД.Период
	|			И ДвиженияСебестоимости.Регистратор = ДД.Регистратор
	|			И ДвиженияСебестоимости.ИдентификаторФинЗаписи = ДД.ИдентификаторФинЗаписи
	|			И ДвиженияСебестоимости.НастройкаХозяйственнойОперации = ДД.НастройкаХозяйственнойОперации
	|			И ДвиженияСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыФиксированнаяСтоимость)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписаниеНаРасходыИсключения КАК СписаниеНаРасходыИсключения
	|			ПО ДвиженияСебестоимости.АналитикаУчетаНоменклатуры = СписаниеНаРасходыИсключения.АналитикаУчетаНоменклатуры
	|			И ДвиженияСебестоимости.РазделУчета = СписаниеНаРасходыИсключения.РазделУчета
	|			И ДвиженияСебестоимости.ВидЗапасов = СписаниеНаРасходыИсключения.ВидЗапасов
	|			И ДвиженияСебестоимости.Организация = СписаниеНаРасходыИсключения.Организация
	|			И ДвиженияСебестоимости.Партия = СписаниеНаРасходыИсключения.Партия
	|			И ДвиженияСебестоимости.АналитикаУчетаПартий = СписаниеНаРасходыИсключения.АналитикаУчетаПартий
	|			И ДвиженияСебестоимости.АналитикаФинансовогоУчета = СписаниеНаРасходыИсключения.АналитикаФинансовогоУчета
	|			И ДвиженияСебестоимости.ВидДеятельностиНДС = СписаниеНаРасходыИсключения.ВидДеятельностиНДС
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И НЕ ДД.Регистратор Ссылка Документ.РаспределениеДоходовПоНаправлениямДеятельности
	// В старых релизах у документа РаспределениеПрочихЗатрат были движения списания на финансовый результат, формируемые без призанка ""Расчетное
	|		И НЕ (ДД.Регистратор Ссылка Документ.РаспределениеПрочихЗатрат И НЕ ДД.РасчетПартий И НЕ ДД.РасчетСебестоимости)
	// Исключаем суммы расходов, сформированные документами выпуска продукции (работ), где выпуск проходит как по фиксированной, так и по расчетной оценке.
	// Суммы таких расходов будут взяты из себестоимости товаров.
	|		И СписаниеНаРасходыИсключения.АналитикаУчетаНоменклатуры ЕСТЬ NULL
	// Исключаем суммы расходов, сформированные документами выпуска продукции (работ), где выпуск проходит по плановой стоимости
	// Фактические суммы таких расходов будут взяты из себестоимости товаров.
	|		И НЕ (ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию) И НЕ (ДД.Сторно ИЛИ ДД.РасчетПартий))
	// При предварительном расчете исключаем документы, для которых сохранены ранее рассчитанные движения
	|		И РассчитанныеДокументы.Регистратор ЕСТЬ NULL
	|
	|	ОБЪЕДИНИТЬ ВСЕ	
	|	
	|	ВЫБРАТЬ
	|		ДД.Организация,
	|		ДД.СтатьяРасходов,
	|		ДД.АналитикаРасходов,
	|		ДД.Подразделение,
	|		ДД.НаправлениеДеятельности,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.Сумма КАК Сумма,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.СуммаБезНДС КАК СуммаБезНДС,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.СуммаУпр КАК СуммаУпр,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.СуммаРегл КАК СуммаРегл,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|		ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход ТОГДА 1 ИНАЧЕ - 1 КОНЕЦ * ДД.ВременнаяРазница КАК ВременнаяРазница
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПрочиеРасходы КАК ДД
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Т
	|			ПО ДД.Регистратор = Т.Ссылка
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И ДД.РасчетСебестоимости
	|		И НЕ ДД.Регистратор Ссылка Документ.РаспределениеДоходовПоНаправлениямДеятельности
	|		И (Т.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ Т.НазначениеНастройкиРаспределения = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаФинансовыйРезультат))
	|
	|	ОБЪЕДИНИТЬ ВСЕ	
	|	
	|	ВЫБРАТЬ
	|		ДД.Организация,
	|		ДД.СтатьяРасходовСписания,
	|		ДД.АналитикаРасходов,
	|		ДД.Подразделение,
	|		ДД.КорНаправлениеДеятельности,
	|		0 КАК Сумма,
	|		0 КАК СуммаБезНДС,
	|		0 КАК СуммаУпр,
	|		0 КАК СуммаРегл,
	|		0 КАК ПостояннаяРазница,
	|		0 КАК ВременнаяРазница
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|	ГДЕ
	|		ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|	) КАК ДД
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|		ПО Статьи.Ссылка = ДД.СтатьяРасходов
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.НаправлениеДеятельности,
	|	ДД.Подразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов;
	|
	|УНИЧТОЖИТЬ СписаниеНаРасходыИсключения";
	Возврат ТекстЗапроса;
КонецФункции

// Этап 3.14
// Процедура рассчитывает отклонения в суммах движений по регистру СебестоимостьТоваров от рассчитанной себестоимости 
// и производит корректировку движений следующих регистров:
// СебестоимостьТоваров, ПрочиеРасходы
//
Процедура СкорректироватьСтоимостьСписанияЗапасов(ПараметрыРасчета) Экспорт

	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьСписанияЗапасов");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Если ПараметрыРасчета.Свойство("УзлыСПереполнениемПоля") Тогда
		УзлыСПереполнениемПоля = ПараметрыРасчета.УзлыСПереполнениемПоля;
	Иначе
		УзлыСПереполнениемПоля = Новый Массив;
	КонецЕсли;
	Запрос.УстановитьПараметр("УзлыСПереполнениемПоля", УзлыСПереполнениемПоля);
	
	#Область ВыборкаДанных
	
	#Область ЕстьВозвратныеОтходы
	
	Запрос.Текст = РасчетСебестоимостиРешениеСЛУ.ТекстВтЕстьВозвратныеОтходы() + ";";
	
	#КонецОбласти
	
	#Область РаботыДляДавальца
	
	Запрос.Текст = Запрос.Текст + "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.ВидЗапасов.ТипЗапасов КАК ТипЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорВидЗапасов,
	|	ДД.АналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|	ИСТИНА КАК РаботаДляДавальца
	|ПОМЕСТИТЬ
	|	РаботыДляДавальца
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	И ДД.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	И НЕ ДД.Сторно
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КорАналитикаУчетаНоменклатуры,
	|	КорВидЗапасов
	|;";
	#КонецОбласти
	
	#Область РеквизитыКорДвижений
	
	Запрос.Текст = Запрос.Текст + "
	|ВЫБРАТЬ
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	МАКСИМУМ(ДД.КорАналитикаУчетаНоменклатуры) КАК КорАналитикаУчетаНоменклатуры,
	|	МАКСИМУМ(ДД.ХозяйственнаяОперация) КАК ХозяйственнаяОперация,
	|	МАКСИМУМ(ДД.ТипЗаписи) КАК ТипЗаписи,
	|	МАКСИМУМ(ДД.НастройкаХозяйственнойОперации) КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ РеквизитыКорДвижений
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.СлужебноеВидДвиженияПриход
	|	И ДД.Количество <> 0
	|	И ДД.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)
	|	И ДД.НастройкаХозяйственнойОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ДД.Регистратор,
	|	ДД.ИдентификаторФинЗаписи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	ИдентификаторФинЗаписи
	|;";
	#КонецОбласти
	
	#Область ВтТаблицаКорректировки
	
	Запрос.Текст = Запрос.Текст + "
	|ВЫБРАТЬ
	|	УчетСебестоимости.Период                        	КАК Период,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                   							КАК ВидДвижения,
	|	УчетСебестоимости.Регистратор                   	КАК ДокументДвижения,
	|	ЕСТЬNULL(РегистраторыРасчета.Ссылка,
	|		ЗНАЧЕНИЕ(Документ.РегистраторРасчетаСебестоимости.ПустаяСсылка)) КАК ДокументРасчета,
	|	УчетСебестоимости.Организация                   	КАК Организация,
	|	АналитикаНоменклатуры.МестоХранения             	КАК Склад,
	|	АналитикаНоменклатуры.Номенклатура             		КАК Номенклатура,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры    	КАК АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		 И УчетСебестоимости.Количество < 0
	|		 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|		ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ) КАК РазделУчета,
	|	УчетСебестоимости.ВидЗапасов                    	КАК ВидЗапасов,
	|	УчетСебестоимости.ВидЗапасов.ТипЗапасов            	КАК ТипЗапасов,
	|	УчетСебестоимости.ХозяйственнаяОперация         	КАК ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры 	КАК КорАналитикаУчетаНоменклатуры,
	|	КорАналитикаНоменклатуры.МестоХранения          	КАК КорСклад,
	|	КорАналитикаНоменклатуры.Номенклатура           	КАК КорНоменклатура,
	|	УчетСебестоимости.КорРазделУчета                	КАК КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов                 	КАК КорВидЗапасов,
	|	УчетСебестоимости.КорВидЗапасов.ТипЗапасов         	КАК КорТипЗапасов,
	|	УчетСебестоимости.КорОрганизация                	КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение                 	КАК Подразделение,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам     	КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента                  	КАК ЗаказКлиента,
	|	УчетСебестоимости.АналитикаРасходов            		КАК АналитикаРасходов,
	|	УчетСебестоимости.СтатьяРасходовСписания        	КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр		  КАК ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл		  КАК ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.СтатьяДоходов                 	КАК СтатьяДоходов,
	|	УчетСебестоимости.АналитикаДоходов              	КАК АналитикаДоходов,
	|	УчетСебестоимости.СтатьяАктивовПассивов         	КАК СтатьяАктивовПассивов,
	|	УчетСебестоимости.АналитикаАктивовПассивов      	КАК АналитикаАктивовПассивов,
	|	УчетСебестоимости.ИдентификаторСтроки           	КАК ИдентификаторСтроки,
	|	УчетСебестоимости.КодСтроки                     	КАК КодСтроки,
	|	УчетСебестоимости.ПериодПродажи                 	КАК ПериодПродажи,
	|	УчетСебестоимости.ГруппаПродукции               	КАК ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	УчетСебестоимости.КорНаправлениеДеятельности        КАК КорНаправлениеДеятельности,
	|	ВЫБОР КОГДА НЕ СторноОтчетыКомиссионера.Период ЕСТЬ NULL
	|	 И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ 												КАК СторноОтчетПоКомиссии,
	|	УчетСебестоимости.Партия                          	КАК Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий              КАК АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета         КАК АналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС                КАК ВидДеятельностиНДС,
	|	УчетСебестоимости.КорПартия                 		КАК КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий           КАК КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета      КАК КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС             КАК КорВидДеятельностиНДС,
	|	УчетСебестоимости.СтатьяКалькуляции                 КАК СтатьяКалькуляции,
	|	УчетСебестоимости.ТипЗаписи                 		КАК ТипЗаписи,
	|	УчетСебестоимости.ДокументИсточник                 	КАК ДокументИсточник,
	|	УчетСебестоимости.Сторно                            КАК Сторно,
	|	УчетСебестоимости.НастройкаХозяйственнойОперации    КАК НастройкаХозяйственнойОперации,
	|	УчетСебестоимости.ИдентификаторФинЗаписи            КАК ИдентификаторФинЗаписи,
	|	УчетСебестоимости.НастройкаСчетовУчета              КАК НастройкаСчетовУчета,
	|	ЕСТЬNULL(РаботыДляДавальца.РаботаДляДавальца, ЛОЖЬ) КАК ПродукцияДавальца,
	|	ЛОЖЬ												КАК РаботаДляДавальца,
	|
	|	ЕСТЬNULL(РеквизитыКорДвижений.ХозяйственнаяОперация,
	|		УчетСебестоимости.ХозяйственнаяОперация)        КАК ПриходХозяйственнаяОперация,
	|	ЕСТЬNULL(РеквизитыКорДвижений.ТипЗаписи,
	|		УчетСебестоимости.ТипЗаписи)                    КАК ПриходТипЗаписи,
	|	ЕСТЬNULL(РеквизитыКорДвижений.НастройкаХозяйственнойОперации,
	|		УчетСебестоимости.НастройкаХозяйственнойОперации) КАК ПриходНастройкаХозяйственнойОперации,
	|	ЕСТЬNULL(РеквизитыКорДвижений.КорАналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры) КАК ПриходКорАналитикаУчетаНоменклатуры,
	|
	|	СУММА(УчетСебестоимости.Количество)        			КАК Количество,
	|	СУММА(УчетСебестоимости.Стоимость)              	КАК Стоимость,
	|	СУММА(УчетСебестоимости.СтоимостьБезНДС)        	КАК СтоимостьБезНДС,
	|	СУММА(УчетСебестоимости.СтоимостьРегл)          	КАК СтоимостьРегл,
	|	СУММА(УчетСебестоимости.ПостояннаяРазница)      	КАК ПостояннаяРазница,
	|	СУММА(УчетСебестоимости.ВременнаяРазница)       	КАК ВременнаяРазница,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансовая)      КАК СтоимостьЗабалансовая,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансоваяРегл)  КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(УчетСебестоимости.РезервПодОбесценениеРегл)   КАК РезервПодОбесценениеРегл,
	|	СУММА(УчетСебестоимости.РезервПодОбесценениеУпр)    КАК РезервПодОбесценениеУпр,
	|	СУММА(УчетСебестоимости.КорСтоимость)           	КАК КорСтоимость,
	|	СУММА(УчетСебестоимости.НДСРегл)           			КАК НДСРегл,
	|	СУММА(УчетСебестоимости.СтоимостьУпр)              	КАК СтоимостьУпр,
	|	СУММА(УчетСебестоимости.НДСУпр)           			КАК НДСУпр
	|ПОМЕСТИТЬ ВтТаблицаКорректировки
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО УчетСебестоимости.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитикаНоменклатуры
	|		ПО УчетСебестоимости.КорАналитикаУчетаНоменклатуры = КорАналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ СторноОтчетыКомиссионера КАК СторноОтчетыКомиссионера // Создается в процедуре СкорректироватьСтоимостьВозвратовПрошлыхПериодов()
	|		ПО СторноОтчетыКомиссионера.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И СторноОтчетыКомиссионера.РазделУчета = УчетСебестоимости.РазделУчета
	|		И СторноОтчетыКомиссионера.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|		И СторноОтчетыКомиссионера.Организация = УчетСебестоимости.Организация
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО Назначения.Ссылка = АналитикаНоменклатуры.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|		ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|		И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|		И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ РаботыДляДавальца КАК РаботыДляДавальца
	|		ПО РаботыДляДавальца.Регистратор = УчетСебестоимости.Регистратор
	|		И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры = УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|		И РаботыДляДавальца.КорВидЗапасов = УчетСебестоимости.КорВидЗапасов
	|		И РаботыДляДавальца.КорАналитикаУчетаПартий = УчетСебестоимости.КорАналитикаУчетаПартий
	|	ЛЕВОЕ СОЕДИНЕНИЕ РеквизитыКорДвижений КАК РеквизитыКорДвижений
	|		ПО РеквизитыКорДвижений.Регистратор = УчетСебестоимости.Регистратор
	|		И РеквизитыКорДвижений.ИдентификаторФинЗаписи = УчетСебестоимости.ИдентификаторФинЗаписи
	|	ЛЕВОЕ СОЕДИНЕНИЕ РассчитанныеДокументы КАК РассчитанныеДокументы
	|		ПО РассчитанныеДокументы.Период = УчетСебестоимости.Период
	|		И РассчитанныеДокументы.Регистратор = УчетСебестоимости.Регистратор
	|		И &РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие)
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистраторыРасчетаСебестоимости КАК РегистраторыРасчета
	|		ПО РегистраторыРасчета.Организация = УчетСебестоимости.Организация
	|ГДЕ
	|	(НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И НЕ УчетСебестоимости.ТипЗаписи В (ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
	|											ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|											ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|											ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|		ИЛИ (УчетСебестоимости.Количество <> 0
	|			 И УчетСебестоимости.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика)))
	|		ИЛИ УчетСебестоимости.Сторно
	|		 И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
	|		 И УчетСебестоимости.Количество <> 0
	|		 И УчетСебестоимости.Стоимость <> 0
	|	)
	|	И (УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
	|		ИЛИ УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаПартийТоваров))
	//++ НЕ УТ
	|	И НЕ (УчетСебестоимости.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика
	|		И НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И УчетСебестоимости.ДокументДвижения = УчетСебестоимости.Регистратор)
	|	И НЕ (УчетСебестоимости.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|		И НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|		И УчетСебестоимости.ДокументДвижения = УчетСебестоимости.Регистратор)
	//-- НЕ УТ
	|	И НЕ (УчетСебестоимости.Сторно
	|		И УчетСебестоимости.ТипЗаписи В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДополнениеПрошлыйПериод)))
	// Исключаем списания на расходы по фиксированной стоимости.
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыФиксированнаяСтоимость)
	// При предварительном расчете исключаем документы, для которых сохранены ранее рассчитанные движения
	|	И РассчитанныеДокументы.Регистратор ЕСТЬ NULL
	|	
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Период,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	УчетСебестоимости.Регистратор,
	|	ЕСТЬNULL(РегистраторыРасчета.Ссылка,
	|		ЗНАЧЕНИЕ(Документ.РегистраторРасчетаСебестоимости.ПустаяСсылка)), // ДокументРасчета
	|	УчетСебестоимости.Организация,
	|	АналитикаНоменклатуры.МестоХранения,
	|	АналитикаНоменклатуры.Номенклатура,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		 И УчетСебестоимости.Количество < 0
	|		 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ),
	|	УчетСебестоимости.ВидЗапасов,
	|	УчетСебестоимости.ВидЗапасов.ТипЗапасов,
	|	УчетСебестоимости.ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры,
	|	КорАналитикаНоменклатуры.МестоХранения,
	|	КорАналитикаНоменклатуры.Номенклатура,
	|	УчетСебестоимости.КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов,
	|	УчетСебестоимости.КорВидЗапасов.ТипЗапасов,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	УчетСебестоимости.АналитикаРасходов,
	|	УчетСебестоимости.СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ),
	|	УчетСебестоимости.СтатьяДоходов,
	|	УчетСебестоимости.АналитикаДоходов,
	|	УчетСебестоимости.СтатьяАктивовПассивов,
	|	УчетСебестоимости.АналитикаАктивовПассивов,
	|	УчетСебестоимости.ИдентификаторСтроки,
	|	УчетСебестоимости.КодСтроки,
	|	УчетСебестоимости.ПериодПродажи,
	|	УчетСебестоимости.ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	УчетСебестоимости.КорНаправлениеДеятельности,
	|	ВЫБОР КОГДА НЕ СторноОтчетыКомиссионера.Период ЕСТЬ NULL
	|	 И УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	УчетСебестоимости.Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС,
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	УчетСебестоимости.СтатьяКалькуляции,
	|	УчетСебестоимости.ТипЗаписи,
	|	УчетСебестоимости.ДокументИсточник,
	|	УчетСебестоимости.Сторно,
	|	УчетСебестоимости.НастройкаХозяйственнойОперации,
	|	УчетСебестоимости.ИдентификаторФинЗаписи,
	|	УчетСебестоимости.НастройкаСчетовУчета,
	|	ЕСТЬNULL(РаботыДляДавальца.РаботаДляДавальца, ЛОЖЬ),
	|	ЕСТЬNULL(РеквизитыКорДвижений.ХозяйственнаяОперация,
	|		УчетСебестоимости.ХозяйственнаяОперация),
	|	ЕСТЬNULL(РеквизитыКорДвижений.ТипЗаписи,
	|		УчетСебестоимости.ТипЗаписи),
	|	ЕСТЬNULL(РеквизитыКорДвижений.НастройкаХозяйственнойОперации,
	|		УчетСебестоимости.НастройкаХозяйственнойОперации),
	|	ЕСТЬNULL(РеквизитыКорДвижений.КорАналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	УчетСебестоимости.Период                        	КАК Период,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                   							КАК ВидДвижения,
	|	УчетСебестоимости.Регистратор                   	КАК ДокументДвижения,
	|	ЕСТЬNULL(РегистраторыРасчета.Ссылка,
	|		ЗНАЧЕНИЕ(Документ.РегистраторРасчетаСебестоимости.ПустаяСсылка)) КАК ДокументРасчета,
	|	УчетСебестоимости.Организация                   	КАК Организация,
	|	АналитикаНоменклатуры.МестоХранения             	КАК Склад,
	|	АналитикаНоменклатуры.Номенклатура             		КАК Номенклатура,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры    	КАК АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		 И УчетСебестоимости.Количество < 0
	|		 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|		ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ) КАК РазделУчета,
	|	УчетСебестоимости.ВидЗапасов                    	КАК ВидЗапасов,
	|	УчетСебестоимости.ВидЗапасов.ТипЗапасов            	КАК ТипЗапасов,
	|	УчетСебестоимости.ХозяйственнаяОперация         	КАК ХозяйственнаяОперация,
	|	РаботыДляДавальца.АналитикаУчетаНоменклатуры 		КАК КорАналитикаУчетаНоменклатуры,
	|	КорАналитикаНоменклатуры.МестоХранения          	КАК КорСклад,
	|	КорАналитикаНоменклатуры.Номенклатура           	КАК КорНоменклатура,
	|	РаботыДляДавальца.РазделУчета                		КАК КорРазделУчета,
	|	РаботыДляДавальца.ВидЗапасов                 		КАК КорВидЗапасов,
	|	РаботыДляДавальца.ТипЗапасов         				КАК КорТипЗапасов,
	|	УчетСебестоимости.КорОрганизация                	КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение                 	КАК Подразделение,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам     	КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента                  	КАК ЗаказКлиента,
	|	УчетСебестоимости.АналитикаРасходов            		КАК АналитикаРасходов,
	|	УчетСебестоимости.СтатьяРасходовСписания        	КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр		  КАК ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл		  КАК ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.СтатьяДоходов                 	КАК СтатьяДоходов,
	|	УчетСебестоимости.АналитикаДоходов              	КАК АналитикаДоходов,
	|	УчетСебестоимости.СтатьяАктивовПассивов         	КАК СтатьяАктивовПассивов,
	|	УчетСебестоимости.АналитикаАктивовПассивов      	КАК АналитикаАктивовПассивов,
	|	УчетСебестоимости.ИдентификаторСтроки           	КАК ИдентификаторСтроки,
	|	УчетСебестоимости.КодСтроки                     	КАК КодСтроки,
	|	УчетСебестоимости.ПериодПродажи                 	КАК ПериодПродажи,
	|	УчетСебестоимости.ГруппаПродукции               	КАК ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	УчетСебестоимости.КорНаправлениеДеятельности        КАК КорНаправлениеДеятельности,
	|	ЛОЖЬ 												КАК СторноОтчетПоКомиссии,
	|	УчетСебестоимости.Партия                          	КАК Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий              КАК АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета         КАК АналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС                КАК ВидДеятельностиНДС,
	|	УчетСебестоимости.КорПартия                 		КАК КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий           КАК КорАналитикаУчетаПартий,
	|	РаботыДляДавальца.АналитикаФинансовогоУчета         КАК КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС             КАК КорВидДеятельностиНДС,
	|	УчетСебестоимости.СтатьяКалькуляции                 КАК СтатьяКалькуляции,
	|	УчетСебестоимости.ТипЗаписи                 		КАК ТипЗаписи,
	|	УчетСебестоимости.ДокументИсточник                 	КАК ДокументИсточник,
	|	УчетСебестоимости.Сторно                            КАК Сторно,
	|	УчетСебестоимости.НастройкаХозяйственнойОперации    КАК НастройкаХозяйственнойОперации,
	|	УчетСебестоимости.ИдентификаторФинЗаписи            КАК ИдентификаторФинЗаписи,
	|	УчетСебестоимости.НастройкаСчетовУчета              КАК НастройкаСчетовУчета,
	|	ЛОЖЬ												КАК ПродукцияДавальца,
	|	ИСТИНА												КАК РаботаДляДавальца,
	|
	|	ЕСТЬNULL(РеквизитыКорДвижений.ХозяйственнаяОперация,
	|		УчетСебестоимости.ХозяйственнаяОперация)        КАК ПриходХозяйственнаяОперация,
	|	ЕСТЬNULL(РеквизитыКорДвижений.ТипЗаписи,
	|		УчетСебестоимости.ТипЗаписи)                    КАК ПриходТипЗаписи,
	|	ЕСТЬNULL(РеквизитыКорДвижений.НастройкаХозяйственнойОперации,
	|		УчетСебестоимости.НастройкаХозяйственнойОперации) КАК ПриходНастройкаХозяйственнойОперации,
	|	ЕСТЬNULL(РеквизитыКорДвижений.КорАналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры) КАК ПриходКорАналитикаУчетаНоменклатуры,
	|
	|	СУММА(УчетСебестоимости.Количество)        			КАК Количество,
	|	СУММА(УчетСебестоимости.Стоимость)              	КАК Стоимость,
	|	СУММА(УчетСебестоимости.СтоимостьБезНДС)        	КАК СтоимостьБезНДС,
	|	СУММА(УчетСебестоимости.СтоимостьРегл)          	КАК СтоимостьРегл,
	|	СУММА(УчетСебестоимости.ПостояннаяРазница)      	КАК ПостояннаяРазница,
	|	СУММА(УчетСебестоимости.ВременнаяРазница)       	КАК ВременнаяРазница,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансовая)      КАК СтоимостьЗабалансовая,
	|	СУММА(УчетСебестоимости.СтоимостьЗабалансоваяРегл)  КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(УчетСебестоимости.РезервПодОбесценениеРегл)   КАК РезервПодОбесценениеРегл,
	|	СУММА(УчетСебестоимости.РезервПодОбесценениеУпр)    КАК РезервПодОбесценениеУпр,
	|	СУММА(УчетСебестоимости.КорСтоимость)           	КАК КорСтоимость,
	|	СУММА(УчетСебестоимости.НДСРегл)           			КАК НДСРегл,
	|	СУММА(УчетСебестоимости.СтоимостьУпр)              	КАК СтоимостьУпр,
	|	СУММА(УчетСебестоимости.НДСУпр)           			КАК НДСУпр
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаботыДляДавальца КАК РаботыДляДавальца
	|		ПО РаботыДляДавальца.Регистратор = УчетСебестоимости.Регистратор
	|		И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры = УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|		И РаботыДляДавальца.КорВидЗапасов = УчетСебестоимости.КорВидЗапасов
	|		И РаботыДляДавальца.КорАналитикаУчетаПартий = УчетСебестоимости.КорАналитикаУчетаПартий
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО УчетСебестоимости.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитикаНоменклатуры
	|		ПО РаботыДляДавальца.АналитикаУчетаНоменклатуры = КорАналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО Назначения.Ссылка = АналитикаНоменклатуры.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
	|		ПО ЕстьВозвратныеОтходы.Организация = УчетСебестоимости.Организация
	|		И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И ЕстьВозвратныеОтходы.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|		И ЕстьВозвратныеОтходы.РазделУчета = УчетСебестоимости.РазделУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ РеквизитыКорДвижений КАК РеквизитыКорДвижений
	|		ПО РеквизитыКорДвижений.Регистратор = УчетСебестоимости.Регистратор
	|		И РеквизитыКорДвижений.ИдентификаторФинЗаписи = УчетСебестоимости.ИдентификаторФинЗаписи
	|	ЛЕВОЕ СОЕДИНЕНИЕ РассчитанныеДокументы КАК РассчитанныеДокументы
	|		ПО РассчитанныеДокументы.Период = УчетСебестоимости.Период
	|		И РассчитанныеДокументы.Регистратор = УчетСебестоимости.Регистратор
	|		И &РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие)
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистраторыРасчетаСебестоимости КАК РегистраторыРасчета
	|		ПО РегистраторыРасчета.Организация = УчетСебестоимости.Организация
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И НЕ УчетСебестоимости.Сторно
	// При предварительном расчете исключаем документы, для которых сохранены ранее рассчитанные движения
	|	И РассчитанныеДокументы.Регистратор ЕСТЬ NULL
	|	
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Период,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.СлужебноеВидДвиженияПриход
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	УчетСебестоимости.Регистратор,
	|	ЕСТЬNULL(РегистраторыРасчета.Ссылка,
	|		ЗНАЧЕНИЕ(Документ.РегистраторРасчетаСебестоимости.ПустаяСсылка)), // ДокументРасчета
	|	УчетСебестоимости.Организация,
	|	АналитикаНоменклатуры.МестоХранения,
	|	АналитикаНоменклатуры.Номенклатура,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		 И УчетСебестоимости.Количество < 0
	|		 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
	|			ИНАЧЕ УчетСебестоимости.РазделУчета КОНЕЦ),
	|	УчетСебестоимости.ВидЗапасов,
	|	УчетСебестоимости.ВидЗапасов.ТипЗапасов,
	|	УчетСебестоимости.ХозяйственнаяОперация,
	|	РаботыДляДавальца.АналитикаУчетаНоменклатуры,
	|	КорАналитикаНоменклатуры.МестоХранения,
	|	КорАналитикаНоменклатуры.Номенклатура,
	|	РаботыДляДавальца.РазделУчета,
	|	РаботыДляДавальца.ВидЗапасов,
	|	РаботыДляДавальца.ТипЗапасов,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	УчетСебестоимости.АналитикаРасходов,
	|	УчетСебестоимости.СтатьяРасходовСписания,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ),
	|	УчетСебестоимости.СтатьяДоходов,
	|	УчетСебестоимости.АналитикаДоходов,
	|	УчетСебестоимости.СтатьяАктивовПассивов,
	|	УчетСебестоимости.АналитикаАктивовПассивов,
	|	УчетСебестоимости.ИдентификаторСтроки,
	|	УчетСебестоимости.КодСтроки,
	|	УчетСебестоимости.ПериодПродажи,
	|	УчетСебестоимости.ГруппаПродукции,
	|	ЕСТЬNULL(Назначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	УчетСебестоимости.КорНаправлениеДеятельности,
	|	УчетСебестоимости.Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС,
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	РаботыДляДавальца.АналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	УчетСебестоимости.СтатьяКалькуляции,
	|	УчетСебестоимости.ТипЗаписи,
	|	УчетСебестоимости.ДокументИсточник,
	|	УчетСебестоимости.Сторно,
	|	УчетСебестоимости.НастройкаХозяйственнойОперации,
	|	УчетСебестоимости.ИдентификаторФинЗаписи,
	|	УчетСебестоимости.НастройкаСчетовУчета,
	|	ЕСТЬNULL(РеквизитыКорДвижений.ХозяйственнаяОперация,
	|		УчетСебестоимости.ХозяйственнаяОперация),
	|	ЕСТЬNULL(РеквизитыКорДвижений.ТипЗаписи,
	|		УчетСебестоимости.ТипЗаписи),
	|	ЕСТЬNULL(РеквизитыКорДвижений.НастройкаХозяйственнойОперации,
	|		УчетСебестоимости.НастройкаХозяйственнойОперации),
	|	ЕСТЬNULL(РеквизитыКорДвижений.КорАналитикаУчетаНоменклатуры,
	|		УчетСебестоимости.КорАналитикаУчетаНоменклатуры)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	Организация,
	|	РазделУчета
	|;";
	#КонецОбласти
	
	#Область ВтДанныеТаблицаКорректировки
	
	Запрос.Текст = Запрос.Текст + "
	|ВЫБРАТЬ
	|	ТаблицаКорректировки.Период                        КАК Период,
	|	ТаблицаКорректировки.ВидДвижения                   КАК ВидДвижения,
	|	ТаблицаКорректировки.ДокументДвижения              КАК ДокументДвижения,
	|	ТаблицаКорректировки.ДокументРасчета               КАК ДокументРасчета,
	|	ТаблицаКорректировки.Организация                   КАК Организация,
	|	ТаблицаКорректировки.Склад                         КАК Склад,
	|	ТаблицаКорректировки.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура                             КАК Номенклатура,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		ИНАЧЕ ТаблицаКорректировки.РазделУчета КОНЕЦ) КАК РазделУчета,
	|	ТаблицаКорректировки.ВидЗапасов                    КАК ВидЗапасов,
	|	ЕСТЬNULL(ТаблицаКорректировки.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) КАК ТипЗапасов,
	|	ТаблицаКорректировки.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	ТаблицаКорректировки.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	//++ НЕ УТ
	|	ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	|			ТОГДА РаспределениеВозвратныхОтходов.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ АналитикаНоменклатурыБезНазначения.КлючАналитики
	|	КОНЕЦ                                              КАК АналитикаУчетаНоменклатурыВО,
	|	ВЫБОР
	|		КОГДА &АналитическийУчетПоГруппамПродукции
	|			И НЕ ЕСТЬNULL(СпрНоменклатура.ГруппаАналитическогоУчета,
	|					ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)) =
	|						ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|			ТОГДА СпрНоменклатура.ГруппаАналитическогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                              КАК АналитикаФинансовогоУчетаВО,
	//-- НЕ УТ
	|	ТаблицаКорректировки.КорСклад                      КАК КорСклад,
	|	ТаблицаКорректировки.КорРазделУчета                КАК КорРазделУчета,
	|	ТаблицаКорректировки.КорВидЗапасов                 КАК КорВидЗапасов,
	|	ЕСТЬNULL(ТаблицаКорректировки.КорТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) КАК КорТипЗапасов,
	|	ТаблицаКорректировки.КорОрганизация                КАК КорОрганизация,
	|	ТаблицаКорректировки.Подразделение                 КАК Подразделение,
	|	ТаблицаКорректировки.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаКорректировки.ЗаказКлиента                  КАК ЗаказКлиента,
	|	ТаблицаКорректировки.АналитикаРасходов             КАК АналитикаРасходов,
	|	ТаблицаКорректировки.СтатьяРасходовСписания        КАК СтатьяРасходовСписания,
	|	ТаблицаКорректировки.СтатьяРасходовСписания        КАК СтатьяРасходовСписанияУпр,
	|	ТаблицаКорректировки.АналитикаРасходов             КАК АналитикаРасходовУпр,
	|	ТаблицаКорректировки.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
	|	ТаблицаКорректировки.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
	|	ТаблицаКорректировки.ПринятиеКНалоговомуУчету      КАК ПринятиеКНалоговомуУчету,
	|	ТаблицаКорректировки.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	ТаблицаКорректировки.КорНаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	ТаблицаКорректировки.СтатьяДоходов                 КАК СтатьяДоходов,
	|	ТаблицаКорректировки.АналитикаДоходов              КАК АналитикаДоходов,
	|	ТаблицаКорректировки.СтатьяДоходов                 КАК СтатьяДоходовУпр,
	|	ТаблицаКорректировки.АналитикаДоходов              КАК АналитикаДоходовУпр,
	|	ТаблицаКорректировки.СтатьяАктивовПассивов         КАК СтатьяАктивовПассивов,
	|	ТаблицаКорректировки.АналитикаАктивовПассивов      КАК АналитикаАктивовПассивов,
	|	ТаблицаКорректировки.ИдентификаторСтроки           КАК ИдентификаторСтроки,
	|	ТаблицаКорректировки.КодСтроки                     КАК КодСтроки,
	|	ТаблицаКорректировки.ПериодПродажи                 КАК ПериодПродажи,
	|	ТаблицаКорректировки.ГруппаПродукции               КАК ГруппаПродукции,
	|	ТаблицаКорректировки.СторноОтчетПоКомиссии		   КАК СторноОтчетПоКомиссии,
	|	ТаблицаКорректировки.Партия                        КАК Партия,
	|	ТаблицаКорректировки.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	ТаблицаКорректировки.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	ТаблицаКорректировки.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	ТаблицаКорректировки.КорПартия                 	   КАК КорПартия,
	|	ТаблицаКорректировки.КорАналитикаУчетаПартий       КАК КорАналитикаУчетаПартий,
	|	ТаблицаКорректировки.КорАналитикаФинансовогоУчета  КАК КорАналитикаФинансовогоУчета,
	|	ТаблицаКорректировки.КорВидДеятельностиНДС         КАК КорВидДеятельностиНДС,
	|	ТаблицаКорректировки.СтатьяКалькуляции             КАК СтатьяКалькуляции,
	|	ТаблицаКорректировки.ТипЗаписи                 	   КАК ТипЗаписи,
	|	ТаблицаКорректировки.ДокументИсточник              КАК ДокументИсточник,
	|	ТаблицаКорректировки.Сторно                        КАК Сторно,
	|	ТаблицаКорректировки.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	ТаблицаКорректировки.ИдентификаторФинЗаписи        КАК ИдентификаторФинЗаписи,
	|	ТаблицаКорректировки.НастройкаСчетовУчета          КАК НастройкаСчетовУчета,
	|	ТаблицаКорректировки.ПриходХозяйственнаяОперация   КАК ПриходХозяйственнаяОперация,
	|	ТаблицаКорректировки.ПриходТипЗаписи               КАК ПриходТипЗаписи,
	|	ТаблицаКорректировки.ПриходНастройкаХозяйственнойОперации КАК ПриходНастройкаХозяйственнойОперации,
	|	ТаблицаКорректировки.ПриходКорАналитикаУчетаНоменклатуры  КАК ПриходКорАналитикаУчетаНоменклатуры,
	//++ Локализация
	//++ НЕ УТ
	|	ВЫБОР ЕСТЬNULL(ПартииТМЦВЭксплуатации.СпособПогашенияСтоимостиНУ, ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияСтоимостиТМЦ.ПриПередаче))
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияСтоимостиТМЦ.ПриПередаче) ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СписаниеПриПередачеНУ,
	//-- НЕ УТ
	//-- Локализация
	|	
	|	ВЫБОР
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|			ТОГДА ТаблицаКорректировки.ВидЗапасов
	|		ИНАЧЕ 
	|			ТаблицаКорректировки.Номенклатура
	|	КОНЕЦ КАК ИсточникГФУНоменклатуры,
	|	ВЫБОР
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|			ТОГДА ТаблицаКорректировки.КорВидЗапасов
	|		ИНАЧЕ 
	|			ТаблицаКорректировки.КорНоменклатура
	|	КОНЕЦ КАК КорИсточникГФУНоменклатуры,
	|	ВЫБОР КОГДА ТаблицаКорректировки.ХозяйственнаяОперация В (&МассивОперацийПередачи) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ                                              КАК ЭтоПередачаМеждуОрганизациями,
	|	ТаблицаКорректировки.КорСтоимость                  КАК КорСтоимость,
	|
	|	ВЫБОР
	//++ Устарело_Производство21
	//++ НЕ УТ
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаКорректировки.ДокументДвижения) = ТИП(Документ.ВыпускПродукции) ТОГДА
	|			ИСТИНА
	//-- НЕ УТ
	//-- Устарело_Производство21
	|		КОГДА ИСТИНА ТОГДА // для удобства расстановки тегов
	|			ЛОЖЬ
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ ЭтоВыпускПродукции,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаКорректировки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ ЭтоВозвратМеждуОрганизациями,
	// Резервы под обесценение запасов не списываются, если
	//	- не меняется номенклатура и характеристика
	//++ НЕ УТ
	//	- номенклатура не списывается на партию производства
	//-- НЕ УТ
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|		 И Аналитика.Номенклатура = ЕСТЬNULL(КорАналитика.Номенклатура, НЕОПРЕДЕЛЕНО)
	|		 И Аналитика.Характеристика = ЕСТЬNULL(КорАналитика.Характеристика, НЕОПРЕДЕЛЕНО)
	//++ НЕ УТ
	|		 И ТИПЗНАЧЕНИЯ(ТаблицаКорректировки.КорПартия) <> ТИП(Справочник.ПартииПроизводства)
	//-- НЕ УТ
	|		 И ТаблицаКорректировки.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА КОНЕЦ) КАК СписыватьРезервы,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА - ТаблицаКорректировки.Стоимость
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.Стоимость, 0) КАК ЧИСЛО(31,2))
	|		- ТаблицаКорректировки.Стоимость
	|	КОНЕЦ) КАК Стоимость,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.РаботаДляДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьЗабалансовая, 0) КАК ЧИСЛО(31,2))
	|		- ТаблицаКорректировки.СтоимостьЗабалансовая
	|	КОНЕЦ) КАК СтоимостьЗабалансовая,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА - ТаблицаКорректировки.СтоимостьБезНДС
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьБезНДС, 0) КАК ЧИСЛО(31,2))
	|		- ТаблицаКорректировки.СтоимостьБезНДС
	|	КОНЕЦ) КАК СтоимостьБезНДС,
	|
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ПостояннаяРазница, 0)  КАК ЧИСЛО(31,2))
	|		 	- ТаблицаКорректировки.ПостояннаяРазница КОНЕЦ) КАК ПостояннаяРазница,
	|
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.ВременнаяРазница, 0)  КАК ЧИСЛО(31,2))
	|		 	- ТаблицаКорректировки.ВременнаяРазница КОНЕЦ) КАК ВременнаяРазница,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьДопРасходы, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ДопРасходы,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.СтоимостьДопРасходыБезНДС, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ДопРасходыБезНДС,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.Трудозатраты, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК Трудозатраты,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеСНДС, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПостоянныеСНДС,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеБезНДС, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПостоянныеБезНДС,
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		И ТаблицаКорректировки.Количество < 0
	|		И НЕ &ПартионныйУчетВерсии22
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеСНДС, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПеременныеСНДС,
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		И ТаблицаКорректировки.Количество < 0
	|		И НЕ &ПартионныйУчетВерсии22
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеБезНДС, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПеременныеБезНДС,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ДопРасходыРегл, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ДопРасходыРегл,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ТрудозатратыРегл, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ТрудозатратыРегл,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеРегл, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПостоянныеРегл,
	|
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		И ТаблицаКорректировки.Количество < 0
	|		И НЕ &ПартионныйУчетВерсии22
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеРегл, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПеременныеРегл,
	|
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА - ТаблицаКорректировки.СтоимостьРегл
	|		ИНАЧЕ ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.СтоимостьРегл, 0) КАК ЧИСЛО(31,2))
	|		 	- ТаблицаКорректировки.СтоимостьРегл КОНЕЦ) КАК СтоимостьРегл,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.РаботаДляДавальца ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.СтоимостьЗабалансоваяРегл, 0) КАК ЧИСЛО(31,2))
	|	 		- ТаблицаКорректировки.СтоимостьЗабалансоваяРегл КОНЕЦ) КАК СтоимостьЗабалансоваяРегл,
	|
	|	ВЫРАЗИТЬ(ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.РезервПодОбесценениеРегл, 0) КАК ЧИСЛО(31,2))
	|	 		- ТаблицаКорректировки.РезервПодОбесценениеРегл КАК РезервПодОбесценениеРегл,
	|
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА - ТаблицаКорректировки.СтоимостьУпр
	|		ИНАЧЕ ВЫРАЗИТЬ(
	|			ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.СтоимостьУпр, 0) КАК ЧИСЛО(31,2))
	|		 	- ТаблицаКорректировки.СтоимостьУпр КОНЕЦ) КАК СтоимостьУпр,
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		И ТаблицаКорректировки.Количество < 0
	|		И НЕ &ПартионныйУчетВерсии22
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ДопРасходыУпр, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ДопРасходыУпр,
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		И ТаблицаКорректировки.Количество < 0
	|		И НЕ &ПартионныйУчетВерсии22
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ТрудозатратыУпр, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ТрудозатратыУпр,
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		И ТаблицаКорректировки.Количество < 0
	|		И НЕ &ПартионныйУчетВерсии22
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПостоянныеУпр, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПостоянныеУпр,
	
	|	(ВЫБОР КОГДА ТаблицаКорректировки.ДокументДвижения ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
	|		И ТаблицаКорректировки.Количество < 0
	|		И НЕ &ПартионныйУчетВерсии22
	|	ТОГДА
	|		0
	|	КОГДА ТаблицаКорректировки.ПродукцияДавальца ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировки.Количество * ЕСТЬNULL(СтоимостьТоваров.ПостатейныеПеременныеУпр, 0) КАК ЧИСЛО(31,2))
	|	КОНЕЦ) КАК ПостатейныеПеременныеУпр,
	|
	|	ВЫРАЗИТЬ(ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(СтоимостьТоваров.РезервПодОбесценениеУпр, 0) КАК ЧИСЛО(31,2))
	|	 		- ТаблицаКорректировки.РезервПодОбесценениеУпр КАК РезервПодОбесценениеУпр,
	|
	|	ТаблицаКорректировки.НДСРегл КАК НДСРегл,
	|	ТаблицаКорректировки.НДСУпр КАК НДСУпр,
	|	ТаблицаКорректировки.Стоимость КАК ИсходнаяСтоимость,
	|	ТаблицаКорректировки.СтоимостьБезНДС КАК ИсходнаяСтоимостьБезНДС,
	|	ТаблицаКорректировки.СтоимостьРегл КАК ИсходнаяСтоимостьРегл,
	|	ТаблицаКорректировки.СтоимостьРегл КАК ИсходнаяСтоимостьУпр,
	|	ТаблицаКорректировки.Количество КАК Количество,
	|
	|	(ВЫБОР
	|		КОГДА СтоимостьТоваров.НомерУзла В (&УзлыСПереполнениемПоля)
	|		 И &ПартионныйУчетВерсии22
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РасчетНеЗавершен,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаКорректировки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы)
	|			И НачалоПериода(ТаблицаКорректировки.ПериодПродажи, МЕСЯЦ) < НачалоПериода(ТаблицаКорректировки.Период, МЕСЯЦ) ТОГДА
	|			-1
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ КАК Знак
	|
	|ПОМЕСТИТЬ ВтДанныеТаблицаКорректировки
	|
	|ИЗ
	|	ВтТаблицаКорректировки КАК ТаблицаКорректировки
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО Аналитика.Ссылка = ТаблицаКорректировки.АналитикаУчетаНоменклатуры
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО КорАналитика.Ссылка = ТаблицаКорректировки.КорАналитикаУчетаНоменклатуры
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВТСтоимостьПартийТоваров КАК СтоимостьТоваров
	|	ПО 
	|		СтоимостьТоваров.АналитикаУчетаНоменклатуры 	= ТаблицаКорректировки.АналитикаУчетаНоменклатуры
	|		И СтоимостьТоваров.ВидЗапасов               	= ТаблицаКорректировки.ВидЗапасов
	|		И СтоимостьТоваров.Организация              	= ТаблицаКорректировки.Организация
	|		И СтоимостьТоваров.РазделУчета              	= ТаблицаКорректировки.РазделУчета
	|		И СтоимостьТоваров.Партия 						= ТаблицаКорректировки.Партия
	|		И СтоимостьТоваров.АналитикаУчетаПартий 		= ТаблицаКорректировки.АналитикаУчетаПартий
	|		И СтоимостьТоваров.АналитикаФинансовогоУчета 	= ТаблицаКорректировки.АналитикаФинансовогоУчета
	|		И СтоимостьТоваров.ВидДеятельностиНДС 			= ТаблицаКорректировки.ВидДеятельностиНДС
	|		И (ТаблицаКорректировки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ИЛИ ТаблицаКорректировки.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|			ИЛИ ТаблицаКорректировки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|				И &РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие)
	|			ИЛИ ТаблицаКорректировки.Сторно
	|				И ТаблицаКорректировки.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
	|		)
	|	
	//++ НЕ УТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеВозвратныхОтходов КАК РаспределениеВозвратныхОтходов
	|	ПО РаспределениеВозвратныхОтходов.Ссылка = ТаблицаКорректировки.ДокументДвижения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|	ПО АналитикаНоменклатуры.Ссылка = РаспределениеВозвратныхОтходов.АналитикаУчетаНоменклатуры
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаНоменклатурыБезНазначения
	|	ПО АналитикаНоменклатурыБезНазначения.Номенклатура = АналитикаНоменклатуры.Номенклатура
	|		И АналитикаНоменклатурыБезНазначения.Характеристика = АналитикаНоменклатуры.Характеристика
	|		И АналитикаНоменклатурыБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И АналитикаНоменклатурыБезНазначения.Серия = АналитикаНоменклатуры.Серия
	|		И АналитикаНоменклатурыБезНазначения.МестоХранения = АналитикаНоменклатуры.МестоХранения
	|		И АналитикаНоменклатурыБезНазначения.СтатьяКалькуляции = АналитикаНоменклатуры.СтатьяКалькуляции
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|	ПО СпрНоменклатура.Ссылка = АналитикаНоменклатуры.Номенклатура
	|	
	//++ Локализация
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК ПередачиВЭксплуатацию
	|	ПО ТаблицаКорректировки.ДокументДвижения = ПередачиВЭксплуатацию.Ссылка
	|		И ТаблицаКорректировки.ИдентификаторСтроки = ПередачиВЭксплуатацию.ИдентификаторСтроки
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииТМЦВЭксплуатации КАК ПартииТМЦВЭксплуатации
	|	ПО ПередачиВЭксплуатацию.Партия = ПартииТМЦВЭксплуатации.Ссылка
	//-- Локализация
	//-- НЕ УТ
	|ГДЕ
	|	НЕ ТаблицаКорректировки.СторноОтчетПоКомиссии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ХозяйственнаяОперация
	|;";
	#КонецОбласти
	
	#Область ДвиженияТаблицаКорректировки
	
	Запрос.Текст = Запрос.Текст + "
	|ВЫБРАТЬ
	|	ТаблицаКорректировки.Период                        КАК Период,
	|	ТаблицаКорректировки.ВидДвижения                   КАК ВидДвижения,
	|	ТаблицаКорректировки.ДокументДвижения              КАК ДокументДвижения,
	|	ТаблицаКорректировки.ДокументРасчета               КАК ДокументРасчета,
	|	ТаблицаКорректировки.Организация                   КАК Организация,
	|	ТаблицаКорректировки.Склад                         КАК Склад,
	|	ТаблицаКорректировки.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаКорректировки.РазделУчета КАК РазделУчета,
	|	ТаблицаКорректировки.ВидЗапасов                    КАК ВидЗапасов,
	|	ТаблицаКорректировки.ТипЗапасов КАК ТипЗапасов,
	|	ТаблицаКорректировки.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	ТаблицаКорректировки.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	//++ НЕ УТ
	|	ТаблицаКорректировки.АналитикаУчетаНоменклатурыВО КАК АналитикаУчетаНоменклатурыВО,
	|	ТаблицаКорректировки.АналитикаФинансовогоУчетаВО КАК АналитикаФинансовогоУчетаВО,
	//-- НЕ УТ
	|	ТаблицаКорректировки.КорСклад                      КАК КорСклад,
	|	ТаблицаКорректировки.КорРазделУчета                КАК КорРазделУчета,
	|	ТаблицаКорректировки.КорВидЗапасов                 КАК КорВидЗапасов,
	|	ТаблицаКорректировки.КорТипЗапасов КАК КорТипЗапасов,
	|	ТаблицаКорректировки.КорОрганизация                КАК КорОрганизация,
	|	ТаблицаКорректировки.Подразделение                 КАК Подразделение,
	|	ТаблицаКорректировки.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаКорректировки.ЗаказКлиента                  КАК ЗаказКлиента,
	|	ТаблицаКорректировки.АналитикаРасходов             КАК АналитикаРасходов,
	|	ТаблицаКорректировки.СтатьяРасходовСписания        КАК СтатьяРасходовСписания,
	|	ТаблицаКорректировки.СтатьяРасходовСписанияУпр     КАК СтатьяРасходовСписанияУпр,
	|	ТаблицаКорректировки.АналитикаРасходовУпр          КАК АналитикаРасходовУпр,
	|	ТаблицаКорректировки.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
	|	ТаблицаКорректировки.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
	|	ТаблицаКорректировки.ПринятиеКНалоговомуУчету      КАК ПринятиеКНалоговомуУчету,
	|	ТаблицаКорректировки.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	ТаблицаКорректировки.КорНаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	ТаблицаКорректировки.СтатьяДоходов                 КАК СтатьяДоходов,
	|	ТаблицаКорректировки.АналитикаДоходов              КАК АналитикаДоходов,
	|	ТаблицаКорректировки.СтатьяДоходовУпр              КАК СтатьяДоходовУпр,
	|	ТаблицаКорректировки.АналитикаДоходовУпр           КАК АналитикаДоходовУпр,
	|	ТаблицаКорректировки.СтатьяАктивовПассивов         КАК СтатьяАктивовПассивов,
	|	ТаблицаКорректировки.АналитикаАктивовПассивов      КАК АналитикаАктивовПассивов,
	|	ТаблицаКорректировки.ИдентификаторСтроки           КАК ИдентификаторСтроки,
	|	ТаблицаКорректировки.КодСтроки                     КАК КодСтроки,
	|	ТаблицаКорректировки.ПериодПродажи                 КАК ПериодПродажи,
	|	ТаблицаКорректировки.ГруппаПродукции               КАК ГруппаПродукции,
	|	ТаблицаКорректировки.СторноОтчетПоКомиссии		   КАК СторноОтчетПоКомиссии,
	|	ТаблицаКорректировки.Партия                        КАК Партия,
	|	ТаблицаКорректировки.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	ТаблицаКорректировки.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	ТаблицаКорректировки.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	ТаблицаКорректировки.КорПартия                 	   КАК КорПартия,
	|	ТаблицаКорректировки.КорАналитикаУчетаПартий       КАК КорАналитикаУчетаПартий,
	|	ТаблицаКорректировки.КорАналитикаФинансовогоУчета  КАК КорАналитикаФинансовогоУчета,
	|	ТаблицаКорректировки.КорВидДеятельностиНДС         КАК КорВидДеятельностиНДС,
	|	ТаблицаКорректировки.СтатьяКалькуляции             КАК СтатьяКалькуляции,
	|	ТаблицаКорректировки.ТипЗаписи                 	   КАК ТипЗаписи,
	|	ТаблицаКорректировки.ДокументИсточник              КАК ДокументИсточник,
	|	ТаблицаКорректировки.Сторно                        КАК Сторно,
	|	ТаблицаКорректировки.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	ТаблицаКорректировки.ИдентификаторФинЗаписи        КАК ИдентификаторФинЗаписи,
	|	ТаблицаКорректировки.НастройкаСчетовУчета          КАК НастройкаСчетовУчета,
	|	ТаблицаКорректировки.ПриходХозяйственнаяОперация   КАК ПриходХозяйственнаяОперация,
	|	ТаблицаКорректировки.ПриходТипЗаписи               КАК ПриходТипЗаписи,
	|	ТаблицаКорректировки.ПриходНастройкаХозяйственнойОперации КАК ПриходНастройкаХозяйственнойОперации,
	|	ТаблицаКорректировки.ПриходКорАналитикаУчетаНоменклатуры  КАК ПриходКорАналитикаУчетаНоменклатуры,
	//++ Локализация
	//++ НЕ УТ
	|	ТаблицаКорректировки.СписаниеПриПередачеНУ КАК СписаниеПриПередачеНУ,
	//-- НЕ УТ
	//-- Локализация
	|	
	|	ТаблицаКорректировки.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
	|	ТаблицаКорректировки.КорИсточникГФУНоменклатуры КАК КорИсточникГФУНоменклатуры,
	|	ТаблицаКорректировки.ЭтоПередачаМеждуОрганизациями КАК ЭтоПередачаМеждуОрганизациями,
	|	ТаблицаКорректировки.КорСтоимость                  КАК КорСтоимость,
	|	ТаблицаКорректировки.Стоимость КАК Стоимость,
	|	ТаблицаКорректировки.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	ТаблицаКорректировки.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ТаблицаКорректировки.ПостояннаяРазница КАК ПостояннаяРазница,
	|	ТаблицаКорректировки.ВременнаяРазница КАК ВременнаяРазница,
	|
	|	ТаблицаКорректировки.ДопРасходы КАК ДопРасходы,
	|
	|	ТаблицаКорректировки.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	ТаблицаКорректировки.Трудозатраты КАК Трудозатраты,
	|	ТаблицаКорректировки.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|	ТаблицаКорректировки.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|	ТаблицаКорректировки.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|	ТаблицаКорректировки.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|	ТаблицаКорректировки.ДопРасходыРегл КАК ДопРасходыРегл,
	|	ТаблицаКорректировки.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|	ТаблицаКорректировки.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|	ТаблицаКорректировки.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|	ТаблицаКорректировки.СтоимостьРегл КАК СтоимостьРегл,
	|	ТаблицаКорректировки.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|	ТаблицаКорректировки.РезервПодОбесценениеРегл КАК РезервПодОбесценениеРегл,
	|	ТаблицаКорректировки.СтоимостьУпр КАК СтоимостьУпр,
	|	ТаблицаКорректировки.ДопРасходыУпр КАК ДопРасходыУпр,
	|	ТаблицаКорректировки.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|	ТаблицаКорректировки.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|	ТаблицаКорректировки.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
	|	ТаблицаКорректировки.РезервПодОбесценениеУпр КАК РезервПодОбесценениеУпр,
	|
	|	ТаблицаКорректировки.НДСРегл КАК НДСРегл,
	|	ТаблицаКорректировки.НДСУпр КАК НДСУпр,
	|	ТаблицаКорректировки.ИсходнаяСтоимость КАК ИсходнаяСтоимость,
	|	ТаблицаКорректировки.ИсходнаяСтоимостьБезНДС КАК ИсходнаяСтоимостьБезНДС,
	|	ТаблицаКорректировки.ИсходнаяСтоимостьРегл КАК ИсходнаяСтоимостьРегл,
	|	ТаблицаКорректировки.ИсходнаяСтоимостьУпр КАК ИсходнаяСтоимостьУпр,
	|	ТаблицаКорректировки.Количество КАК Количество,
	|
	|	ТаблицаКорректировки.ЭтоВыпускПродукции КАК ЭтоВыпускПродукции,
	|	ТаблицаКорректировки.ЭтоВозвратМеждуОрганизациями КАК ЭтоВозвратМеждуОрганизациями,
	|	ТаблицаКорректировки.СписыватьРезервы,
	|	ТаблицаКорректировки.РасчетНеЗавершен,
	|	
	|	(ТаблицаКорректировки.Стоимость + ТаблицаКорректировки.ДопРасходы + ТаблицаКорректировки.Трудозатраты
	|	+ ТаблицаКорректировки.ПостатейныеПостоянныеСНДС + ТаблицаКорректировки.ПостатейныеПеременныеСНДС)
	|	- ТаблицаКорректировки.КорСтоимость КАК ПолнаяСуммаПереоценки,
	|
	|	Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС КАК СуммаСНДС,
	|	СтоимостьБезНДС + ДопРасходыБезНДС + Трудозатраты + ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС КАК СуммаБезНДС,
	|	СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл КАК СуммаРегл,
	|	СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр КАК СуммаУпр,
	|	ТаблицаКорректировки.Знак КАК Знак
	|
	|ПОМЕСТИТЬ ДвиженияТаблицаКорректировки
	|
	|ИЗ
	|	ВтДанныеТаблицаКорректировки КАК ТаблицаКорректировки
	|ГДЕ
	|	НЕ (ТаблицаКорректировки.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПереданнойВозвратнойТары),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТары),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТарыВозвратНаДругойСклад))
	|	И ТаблицаКорректировки.РазделУчета В (
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты))
	|	ИЛИ ТаблицаКорректировки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаПартийТоваров)
	|	ИЛИ ТаблицаКорректировки.Сторно
	|		И ТаблицаКорректировки.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения) 
	|	)
	|";
	#КонецОбласти
	
	#Область ДвиженияТаблицаКорректировки_ПрочиеДоходы
	
	// Отклонение в стоимости - отнесение на прочие доходы
	Запрос.Текст = Запрос.Текст + "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаКорректировки.Период                        КАК Период,
	|	ТаблицаКорректировки.ВидДвижения                   КАК ВидДвижения,
	|	ТаблицаКорректировки.ДокументДвижения              КАК ДокументДвижения,
	|	ТаблицаКорректировки.ДокументРасчета               КАК ДокументРасчета,
	|	ТаблицаКорректировки.Организация                   КАК Организация,
	|	ТаблицаКорректировки.Склад                         КАК Склад,
	|	ТаблицаКорректировки.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаКорректировки.РазделУчета КАК РазделУчета,
	|	ТаблицаКорректировки.ВидЗапасов                    КАК ВидЗапасов,
	|	ТаблицаКорректировки.ТипЗапасов КАК ТипЗапасов,
	|	ТаблицаКорректировки.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	ТаблицаКорректировки.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	//++ НЕ УТ
	|	ТаблицаКорректировки.АналитикаУчетаНоменклатурыВО КАК АналитикаУчетаНоменклатурыВО,
	|	ТаблицаКорректировки.АналитикаФинансовогоУчетаВО КАК АналитикаФинансовогоУчетаВО,
	//-- НЕ УТ
	|	ТаблицаКорректировки.КорСклад                      КАК КорСклад,
	|	ТаблицаКорректировки.КорРазделУчета                КАК КорРазделУчета,
	|	ТаблицаКорректировки.КорВидЗапасов                 КАК КорВидЗапасов,
	|	ТаблицаКорректировки.КорТипЗапасов КАК КорТипЗапасов,
	|	ТаблицаКорректировки.КорОрганизация                КАК КорОрганизация,
	|	ТаблицаКорректировки.Подразделение                 КАК Подразделение,
	|	ТаблицаКорректировки.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаКорректировки.ЗаказКлиента                  КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО                                       КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО                                       КАК СтатьяРасходовСписания,
	|	НЕОПРЕДЕЛЕНО                                       КАК СтатьяРасходовСписанияУпр,
	|	НЕОПРЕДЕЛЕНО                                       КАК АналитикаРасходовУпр,
	|	НЕОПРЕДЕЛЕНО                                       КАК ВариантРаспределенияРасходовУпр,
	|	НЕОПРЕДЕЛЕНО                                       КАК ВариантРаспределенияРасходовРегл,
	|	ТаблицаКорректировки.ПринятиеКНалоговомуУчету      КАК ПринятиеКНалоговомуУчету,
	|	ТаблицаКорректировки.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	ТаблицаКорректировки.КорНаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.СтатьяДоходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ОтклонениеВСтоимостиТоваров)
	|		ИНАЧЕ ТаблицаКорректировки.СтатьяДоходов КОНЕЦ) КАК СтатьяДоходов,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.СтатьяДоходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка)
	|			ТОГДА ТаблицаКорректировки.Номенклатура
	|		ИНАЧЕ ТаблицаКорректировки.АналитикаДоходов КОНЕЦ) КАК АналитикаДоходов,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.СтатьяДоходовУпр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ОтклонениеВСтоимостиТоваров)
	|		ИНАЧЕ ТаблицаКорректировки.СтатьяДоходовУпр КОНЕЦ) КАК СтатьяДоходовУпр,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.СтатьяДоходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка)
	|			ТОГДА ТаблицаКорректировки.Номенклатура
	|		ИНАЧЕ ТаблицаКорректировки.АналитикаДоходовУпр КОНЕЦ) КАК АналитикаДоходовУпр,
	|	ТаблицаКорректировки.СтатьяАктивовПассивов         КАК СтатьяАктивовПассивов,
	|	ТаблицаКорректировки.АналитикаАктивовПассивов      КАК АналитикаАктивовПассивов,
	|	ТаблицаКорректировки.ИдентификаторСтроки           КАК ИдентификаторСтроки,
	|	ТаблицаКорректировки.КодСтроки                     КАК КодСтроки,
	|	ТаблицаКорректировки.ПериодПродажи                 КАК ПериодПродажи,
	|	ТаблицаКорректировки.ГруппаПродукции               КАК ГруппаПродукции,
	|	ТаблицаКорректировки.СторноОтчетПоКомиссии		   КАК СторноОтчетПоКомиссии,
	|	ТаблицаКорректировки.Партия                        КАК Партия,
	|	ТаблицаКорректировки.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	ТаблицаКорректировки.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	ТаблицаКорректировки.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	ТаблицаКорректировки.КорПартия                 	   КАК КорПартия,
	|	ТаблицаКорректировки.КорАналитикаУчетаПартий       КАК КорАналитикаУчетаПартий,
	|	ТаблицаКорректировки.КорАналитикаФинансовогоУчета  КАК КорАналитикаФинансовогоУчета,
	|	ТаблицаКорректировки.КорВидДеятельностиНДС         КАК КорВидДеятельностиНДС,
	|	ТаблицаКорректировки.СтатьяКалькуляции             КАК СтатьяКалькуляции,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.Сторно И ТаблицаКорректировки.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
	|			ТОГДА ЗНАЧЕНИЕ(ПеречислениЕ.ТипыЗаписейПартий.ОтклонениеВСтоимостиНаПрочиеДоходы)
	|		ИНАЧЕ ТаблицаКорректировки.ТипЗаписи КОНЕЦ)    КАК ТипЗаписи,
	|	ТаблицаКорректировки.ДокументИсточник              КАК ДокументИсточник,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.Сторно И ТаблицаКорректировки.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТаблицаКорректировки.Сторно КОНЕЦ)       КАК Сторно,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ОтклонениеВСтоимостиТоваровДоходы) КАК НастройкаХозяйственнойОперации,
	// Отклонения в стоимости отражаем по идентификатору строки документа.
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ИдентификаторСтроки <> """"
	|			ТОГДА ТаблицаКорректировки.ИдентификаторСтроки
	|		ИНАЧЕ ТаблицаКорректировки.ИдентификаторФинЗаписи КОНЕЦ) КАК ИдентификаторФинЗаписи,
	|	ТаблицаКорректировки.НастройкаСчетовУчета          КАК НастройкаСчетовУчета,
	|	ТаблицаКорректировки.ПриходХозяйственнаяОперация   КАК ПриходХозяйственнаяОперация,
	|	ТаблицаКорректировки.ПриходТипЗаписи               КАК ПриходТипЗаписи,
	|	ТаблицаКорректировки.ПриходНастройкаХозяйственнойОперации КАК ПриходНастройкаХозяйственнойОперации,
	|	ТаблицаКорректировки.ПриходКорАналитикаУчетаНоменклатуры  КАК ПриходКорАналитикаУчетаНоменклатуры,
	//++ Локализация
	//++ НЕ УТ
	|	ТаблицаКорректировки.СписаниеПриПередачеНУ КАК СписаниеПриПередачеНУ,
	//-- НЕ УТ
	//-- Локализация
	|	
	|	ТаблицаКорректировки.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
	|	ТаблицаКорректировки.КорИсточникГФУНоменклатуры КАК КорИсточникГФУНоменклатуры,
	|	ТаблицаКорректировки.ЭтоПередачаМеждуОрганизациями КАК ЭтоПередачаМеждуОрганизациями,
	|	ТаблицаКорректировки.КорСтоимость                  КАК КорСтоимость,
	|	(ВЫБОР 
	|		КОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС < 0
	|			ТОГДА Стоимость
	|		ИНАЧЕ 0 КОНЕЦ) КАК Стоимость,
	|	(ВЫБОР 
	|		КОГДА СтоимостьЗабалансовая < 0
	|			ТОГДА СтоимостьЗабалансовая
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьЗабалансовая,
	|	(ВЫБОР 
	|		КОГДА СтоимостьБезНДС + ДопРасходыБезНДС + Трудозатраты + ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС < 0
	|			ТОГДА СтоимостьБезНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьБезНДС,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл < 0
	|			ТОГДА ПостояннаяРазница
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостояннаяРазница,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл < 0
	|			ТОГДА ВременнаяРазница
	|		ИНАЧЕ 0 КОНЕЦ) КАК ВременнаяРазница,
	|
	|	(ВЫБОР 
	|		КОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС < 0
	|			ТОГДА ДопРасходы
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходы,
	|	(ВЫБОР 
	|		КОГДА СтоимостьБезНДС + ДопРасходыБезНДС + Трудозатраты + ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС < 0
	|			ТОГДА ДопРасходыБезНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыБезНДС,
	|	(ВЫБОР 
	|		КОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС < 0
	|			ТОГДА Трудозатраты
	|		ИНАЧЕ 0 КОНЕЦ) КАК Трудозатраты,
	|	(ВЫБОР 
	|		КОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС < 0
	|			ТОГДА ПостатейныеПостоянныеСНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеСНДС,
	|	(ВЫБОР 
	|		КОГДА СтоимостьБезНДС + ДопРасходыБезНДС + Трудозатраты + ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС < 0
	|			ТОГДА ПостатейныеПостоянныеБезНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеБезНДС,
	|	(ВЫБОР 
	|		КОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС < 0
	|			ТОГДА ПостатейныеПеременныеСНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеСНДС,
	|	(ВЫБОР 
	|		КОГДА СтоимостьБезНДС + ДопРасходыБезНДС + Трудозатраты + ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС < 0
	|			ТОГДА ПостатейныеПеременныеБезНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеБезНДС,
	|
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл < 0
	|			ТОГДА ДопРасходыРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыРегл,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл < 0
	|			ТОГДА ТрудозатратыРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК ТрудозатратыРегл,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл < 0
	|			ТОГДА ПостатейныеПостоянныеРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеРегл,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл < 0
	|			ТОГДА ПостатейныеПеременныеРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеРегл,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл < 0
	|			ТОГДА СтоимостьРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьРегл,
	|	(ВЫБОР 
	|		КОГДА СтоимостьЗабалансоваяРегл < 0
	|			ТОГДА СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьЗабалансоваяРегл,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл < 0
	|			ТОГДА РезервПодОбесценениеРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК РезервПодОбесценениеРегл,
	|
	|	(ВЫБОР 
	|		КОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр < 0
	|			ТОГДА СтоимостьУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьУпр,
	|	(ВЫБОР 
	|		КОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр < 0
	|			ТОГДА ДопРасходыУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыУпр,
	|	(ВЫБОР 
	|		КОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр < 0
	|			ТОГДА ТрудозатратыУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК ТрудозатратыУпр,
	|	(ВЫБОР 
	|		КОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр < 0
	|			ТОГДА ПостатейныеПостоянныеУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеУпр,
	|	(ВЫБОР 
	|		КОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр < 0
	|			ТОГДА ПостатейныеПеременныеУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеУпр,
	|	(ВЫБОР 
	|		КОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр < 0
	|			ТОГДА РезервПодОбесценениеУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК РезервПодОбесценениеУпр,
	|
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	ТаблицаКорректировки.ИсходнаяСтоимость КАК ИсходнаяСтоимость,
	|	ТаблицаКорректировки.ИсходнаяСтоимостьБезНДС КАК ИсходнаяСтоимостьБезНДС,
	|	ТаблицаКорректировки.ИсходнаяСтоимостьРегл КАК ИсходнаяСтоимостьРегл,
	|	ТаблицаКорректировки.ИсходнаяСтоимостьУпр КАК ИсходнаяСтоимостьУпр,
	|	ТаблицаКорректировки.Количество КАК Количество,
	|
	|	ТаблицаКорректировки.ЭтоВыпускПродукции КАК ЭтоВыпускПродукции,
	|	ТаблицаКорректировки.ЭтоВозвратМеждуОрганизациями КАК ЭтоВозвратМеждуОрганизациями,
	|	ТаблицаКорректировки.СписыватьРезервы,
	|	ТаблицаКорректировки.РасчетНеЗавершен,
	|	
	|	(ТаблицаКорректировки.Стоимость + ТаблицаКорректировки.ДопРасходы + ТаблицаКорректировки.Трудозатраты
	|	+ ТаблицаКорректировки.ПостатейныеПостоянныеСНДС + ТаблицаКорректировки.ПостатейныеПеременныеСНДС)
	|	- ТаблицаКорректировки.КорСтоимость КАК ПолнаяСуммаПереоценки,
	|
	|	(ВЫБОР 
	|		КОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС < 0
	|			ТОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаСНДС,
	|	(ВЫБОР 
	|		КОГДА СтоимостьБезНДС + ДопРасходыБезНДС + Трудозатраты + ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС < 0
	|			ТОГДА СтоимостьБезНДС + ДопРасходыБезНДС + Трудозатраты + ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаБезНДС,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл < 0
	|			ТОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаРегл,
	|	(ВЫБОР 
	|		КОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр < 0
	|			ТОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаУпр,
	|	ТаблицаКорректировки.Знак КАК Знак
	|ИЗ
	|	ВтДанныеТаблицаКорректировки КАК ТаблицаКорректировки
	|ГДЕ
	|	(ТаблицаКорректировки.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПереданнойВозвратнойТары),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТары),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТарыВозвратНаДругойСклад))
	|	И ТаблицаКорректировки.РазделУчета В (
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты))
	|	ИЛИ ТаблицаКорректировки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаПартийТоваров)
	|	ИЛИ ТаблицаКорректировки.Сторно
	|		И ТаблицаКорректировки.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
	|	)
	// На прочие доходы будут отнесены отрицательные суммы отклонения в стоимости
	|	И (ВЫБОР 
	|		КОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС < 0
	|			ИЛИ СтоимостьБезНДС + ДопРасходыБезНДС + Трудозатраты + ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС < 0
	|			ИЛИ СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл < 0
	|			ИЛИ СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр < 0
	|			ИЛИ СтоимостьЗабалансовая < 0
	|			ИЛИ СтоимостьЗабалансоваяРегл < 0
	|				ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ)
	|";
	#КонецОбласти
	
	#Область ДвиженияТаблицаКорректировки_ПрочиеРасходы
	
	// Отклонение в стоимости - отнесение на прочие расходы
	Запрос.Текст = Запрос.Текст + "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаКорректировки.Период                        КАК Период,
	|	ТаблицаКорректировки.ВидДвижения                   КАК ВидДвижения,
	|	ТаблицаКорректировки.ДокументДвижения              КАК ДокументДвижения,
	|	ТаблицаКорректировки.ДокументРасчета               КАК ДокументРасчета,
	|	ТаблицаКорректировки.Организация                   КАК Организация,
	|	ТаблицаКорректировки.Склад                         КАК Склад,
	|	ТаблицаКорректировки.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаКорректировки.РазделУчета КАК РазделУчета,
	|	ТаблицаКорректировки.ВидЗапасов                    КАК ВидЗапасов,
	|	ТаблицаКорректировки.ТипЗапасов КАК ТипЗапасов,
	|	ТаблицаКорректировки.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	ТаблицаКорректировки.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	//++ НЕ УТ
	|	ТаблицаКорректировки.АналитикаУчетаНоменклатурыВО КАК АналитикаУчетаНоменклатурыВО,
	|	ТаблицаКорректировки.АналитикаФинансовогоУчетаВО КАК АналитикаФинансовогоУчетаВО,
	//-- НЕ УТ
	|	ТаблицаКорректировки.КорСклад                      КАК КорСклад,
	|	ТаблицаКорректировки.КорРазделУчета                КАК КорРазделУчета,
	|	ТаблицаКорректировки.КорВидЗапасов                 КАК КорВидЗапасов,
	|	ТаблицаКорректировки.КорТипЗапасов КАК КорТипЗапасов,
	|	ТаблицаКорректировки.КорОрганизация                КАК КорОрганизация,
	|	ТаблицаКорректировки.Подразделение                 КАК Подразделение,
	|	ТаблицаКорректировки.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаКорректировки.ЗаказКлиента                  КАК ЗаказКлиента,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ТаблицаКорректировки.Номенклатура
	|		ИНАЧЕ ТаблицаКорректировки.АналитикаРасходов КОНЕЦ) КАК АналитикаРасходов,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ОтклонениеВСтоимостиТоваров)
	|		ИНАЧЕ ТаблицаКорректировки.СтатьяРасходовСписания КОНЕЦ) КАК СтатьяРасходовСписания,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.СтатьяРасходовСписанияУпр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ОтклонениеВСтоимостиТоваров)
	|		ИНАЧЕ ТаблицаКорректировки.СтатьяРасходовСписанияУпр КОНЕЦ) КАК СтатьяРасходовСписанияУпр,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.СтатьяРасходовСписанияУпр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ТаблицаКорректировки.Номенклатура
	|		ИНАЧЕ ТаблицаКорректировки.АналитикаРасходовУпр КОНЕЦ) КАК АналитикаРасходовУпр,
	|	ТаблицаКорректировки.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
	|	ТаблицаКорректировки.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
	|	ТаблицаКорректировки.ПринятиеКНалоговомуУчету      КАК ПринятиеКНалоговомуУчету,
	|	ТаблицаКорректировки.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	ТаблицаКорректировки.КорНаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                                       КАК СтатьяДоходов,
	|	НЕОПРЕДЕЛЕНО                                       КАК АналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО                                       КАК СтатьяДоходовУпр,
	|	НЕОПРЕДЕЛЕНО                                       КАК АналитикаДоходовУпр,
	|	ТаблицаКорректировки.СтатьяАктивовПассивов         КАК СтатьяАктивовПассивов,
	|	ТаблицаКорректировки.АналитикаАктивовПассивов      КАК АналитикаАктивовПассивов,
	|	ТаблицаКорректировки.ИдентификаторСтроки           КАК ИдентификаторСтроки,
	|	ТаблицаКорректировки.КодСтроки                     КАК КодСтроки,
	|	ТаблицаКорректировки.ПериодПродажи                 КАК ПериодПродажи,
	|	ТаблицаКорректировки.ГруппаПродукции               КАК ГруппаПродукции,
	|	ТаблицаКорректировки.СторноОтчетПоКомиссии		   КАК СторноОтчетПоКомиссии,
	|	ТаблицаКорректировки.Партия                        КАК Партия,
	|	ТаблицаКорректировки.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	ТаблицаКорректировки.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	ТаблицаКорректировки.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	ТаблицаКорректировки.КорПартия                 	   КАК КорПартия,
	|	ТаблицаКорректировки.КорАналитикаУчетаПартий       КАК КорАналитикаУчетаПартий,
	|	ТаблицаКорректировки.КорАналитикаФинансовогоУчета  КАК КорАналитикаФинансовогоУчета,
	|	ТаблицаКорректировки.КорВидДеятельностиНДС         КАК КорВидДеятельностиНДС,
	|	ТаблицаКорректировки.СтатьяКалькуляции             КАК СтатьяКалькуляции,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.Сторно
	|		 И ТаблицаКорректировки.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимостиНаПрочиеРасходы)
	|		ИНАЧЕ ТаблицаКорректировки.ТипЗаписи КОНЕЦ)    КАК ТипЗаписи,
	|	ТаблицаКорректировки.ДокументИсточник              КАК ДокументИсточник,
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.Сторно
	|		 И ТаблицаКорректировки.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТаблицаКорректировки.Сторно КОНЕЦ)    КАК Сторно,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ОтклонениеВСтоимостиТоваровРасходы) КАК НастройкаХозяйственнойОперации,
	// Отклонения в стоимости отражаем по идентификатору строки документа.
	|	(ВЫБОР
	|		КОГДА ТаблицаКорректировки.ИдентификаторСтроки <> """"
	|			ТОГДА ТаблицаКорректировки.ИдентификаторСтроки
	|		ИНАЧЕ ТаблицаКорректировки.ИдентификаторФинЗаписи КОНЕЦ) КАК ИдентификаторФинЗаписи,
	|	ТаблицаКорректировки.НастройкаСчетовУчета          КАК НастройкаСчетовУчета,
	|	ТаблицаКорректировки.ПриходХозяйственнаяОперация   КАК ПриходХозяйственнаяОперация,
	|	ТаблицаКорректировки.ПриходТипЗаписи               КАК ПриходТипЗаписи,
	|	ТаблицаКорректировки.ПриходНастройкаХозяйственнойОперации КАК ПриходНастройкаХозяйственнойОперации,
	|	ТаблицаКорректировки.ПриходКорАналитикаУчетаНоменклатуры  КАК ПриходКорАналитикаУчетаНоменклатуры,
	//++ Локализация
	//++ НЕ УТ
	|	ТаблицаКорректировки.СписаниеПриПередачеНУ КАК СписаниеПриПередачеНУ,
	//-- НЕ УТ
	//-- Локализация
	|	
	|	ТаблицаКорректировки.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
	|	ТаблицаКорректировки.КорИсточникГФУНоменклатуры КАК КорИсточникГФУНоменклатуры,
	|	ТаблицаКорректировки.ЭтоПередачаМеждуОрганизациями КАК ЭтоПередачаМеждуОрганизациями,
	|	ТаблицаКорректировки.КорСтоимость                  КАК КорСтоимость,
	|	(ВЫБОР 
	|		КОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС > 0
	|			ТОГДА Стоимость
	|		ИНАЧЕ 0 КОНЕЦ) КАК Стоимость,
	|	(ВЫБОР 
	|		КОГДА СтоимостьЗабалансовая > 0
	|			ТОГДА СтоимостьЗабалансовая
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьЗабалансовая,
	|	(ВЫБОР 
	|		КОГДА СтоимостьБезНДС + ДопРасходыБезНДС + Трудозатраты + ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС > 0
	|			ТОГДА СтоимостьБезНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьБезНДС,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл >= 0
	|			ТОГДА ПостояннаяРазница
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостояннаяРазница,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл >= 0
	|			ТОГДА ВременнаяРазница
	|		ИНАЧЕ 0 КОНЕЦ) КАК ВременнаяРазница,
	|
	|	(ВЫБОР 
	|		КОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС > 0
	|			ТОГДА ДопРасходы
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходы,
	|	(ВЫБОР 
	|		КОГДА СтоимостьБезНДС + ДопРасходыБезНДС + Трудозатраты + ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС > 0
	|			ТОГДА ДопРасходыБезНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыБезНДС,
	|	(ВЫБОР 
	|		КОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС > 0
	|			ТОГДА Трудозатраты
	|		ИНАЧЕ 0 КОНЕЦ) КАК Трудозатраты,
	|	(ВЫБОР 
	|		КОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС > 0
	|			ТОГДА ПостатейныеПостоянныеСНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеСНДС,
	|	(ВЫБОР 
	|		КОГДА СтоимостьБезНДС + ДопРасходыБезНДС + Трудозатраты + ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС > 0
	|			ТОГДА ПостатейныеПостоянныеБезНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеБезНДС,
	|	(ВЫБОР 
	|		КОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС > 0
	|			ТОГДА ПостатейныеПеременныеСНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеСНДС,
	|	(ВЫБОР 
	|		КОГДА СтоимостьБезНДС + ДопРасходыБезНДС + Трудозатраты + ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС > 0
	|			ТОГДА ПостатейныеПеременныеБезНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеБезНДС,
	|
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл >= 0
	|			ТОГДА ДопРасходыРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыРегл,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл >= 0
	|			ТОГДА ТрудозатратыРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК ТрудозатратыРегл,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл >= 0
	|			ТОГДА ПостатейныеПостоянныеРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеРегл,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл >= 0
	|			ТОГДА ПостатейныеПеременныеРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеРегл,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл >= 0
	|			ТОГДА СтоимостьРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьРегл,
	|	(ВЫБОР 
	|		КОГДА СтоимостьЗабалансоваяРегл > 0
	|			ТОГДА СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьЗабалансоваяРегл,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл >= 0
	|			ТОГДА РезервПодОбесценениеРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК РезервПодОбесценениеРегл,
	|
	|	(ВЫБОР 
	|		КОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр >= 0
	|			ТОГДА СтоимостьУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьУпр,
	|	(ВЫБОР 
	|		КОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр >= 0
	|			ТОГДА ДопРасходыУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыУпр,
	|	(ВЫБОР 
	|		КОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр >= 0
	|			ТОГДА ТрудозатратыУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК ТрудозатратыУпр,
	|	(ВЫБОР 
	|		КОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр >= 0
	|			ТОГДА ПостатейныеПостоянныеУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеУпр,
	|	(ВЫБОР 
	|		КОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр >= 0
	|			ТОГДА ПостатейныеПеременныеУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеУпр,
	|	(ВЫБОР 
	|		КОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр >= 0
	|			ТОГДА РезервПодОбесценениеУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК РезервПодОбесценениеУпр,
	|
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	ТаблицаКорректировки.ИсходнаяСтоимость КАК ИсходнаяСтоимость,
	|	ТаблицаКорректировки.ИсходнаяСтоимостьБезНДС КАК ИсходнаяСтоимостьБезНДС,
	|	ТаблицаКорректировки.ИсходнаяСтоимостьРегл КАК ИсходнаяСтоимостьРегл,
	|	ТаблицаКорректировки.ИсходнаяСтоимостьУпр КАК ИсходнаяСтоимостьУпр,
	|	ТаблицаКорректировки.Количество КАК Количество,
	|
	|	ТаблицаКорректировки.ЭтоВыпускПродукции КАК ЭтоВыпускПродукции,
	|	ТаблицаКорректировки.ЭтоВозвратМеждуОрганизациями КАК ЭтоВозвратМеждуОрганизациями,
	|	ТаблицаКорректировки.СписыватьРезервы,
	|	ТаблицаКорректировки.РасчетНеЗавершен,
	|	
	|	(ТаблицаКорректировки.Стоимость + ТаблицаКорректировки.ДопРасходы + ТаблицаКорректировки.Трудозатраты
	|	+ ТаблицаКорректировки.ПостатейныеПостоянныеСНДС + ТаблицаКорректировки.ПостатейныеПеременныеСНДС)
	|	- ТаблицаКорректировки.КорСтоимость КАК ПолнаяСуммаПереоценки,
	|
	|	(ВЫБОР 
	|		КОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС > 0
	|			ТОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаСНДС,
	|	(ВЫБОР 
	|		КОГДА СтоимостьБезНДС + ДопРасходыБезНДС + Трудозатраты + ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС > 0
	|			ТОГДА СтоимостьБезНДС + ДопРасходыБезНДС + Трудозатраты + ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаБезНДС,
	|	(ВЫБОР 
	|		КОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл >= 0
	|			ТОГДА СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаРегл,
	|	(ВЫБОР 
	|		КОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр >= 0
	|			ТОГДА СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаУпр,
	|	ТаблицаКорректировки.Знак КАК Знак
	|ИЗ
	|	ВтДанныеТаблицаКорректировки КАК ТаблицаКорректировки
	|ГДЕ
	|	(ТаблицаКорректировки.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПереданнойВозвратнойТары),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТары),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТарыВозвратНаДругойСклад))
	|	И ТаблицаКорректировки.РазделУчета В (
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты))
	|	ИЛИ ТаблицаКорректировки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаПартийТоваров)
	|	ИЛИ ТаблицаКорректировки.Сторно
	|		И ТаблицаКорректировки.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
	|	)
	// На прочие расходы будут отнесены положительные суммы отклонения в стоимости
	|	И (ВЫБОР 
	|		КОГДА Стоимость + ДопРасходы + Трудозатраты + ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС > 0
	|			ИЛИ СтоимостьБезНДС + ДопРасходыБезНДС + Трудозатраты + ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС > 0
	|			ИЛИ СтоимостьРегл + ДопРасходыРегл + ТрудозатратыРегл + ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл + РезервПодОбесценениеРегл >= 0
	|			ИЛИ СтоимостьУпр + ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр + РезервПодОбесценениеУпр >= 0
	|			ИЛИ СтоимостьЗабалансовая > 0
	|			ИЛИ СтоимостьЗабалансоваяРегл > 0
	|				ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ХозяйственнаяОперация
	|;
	|";
	
	#КонецОбласти
	
	#КонецОбласти
	
	// Формируются движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	// - ПрочиеДоходы
	// - ДвиженияНоменклатураДоходыРасходы
	// - ДвиженияНоменклатураНоменклатура
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	СоответствиеВременныхТаблицДвижений = Новый Соответствие;
	
	// Корректировка списания товаров
	СформироватьДвиженияСебестоимостьТоваровЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	СформироватьДвиженияСебестоимостьТоваровСписаниеРезервовЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);

	// Если есть кор. раздел - необходимо скорректировать стоимость в кор. части.
	СформироватьКорДвиженияСебестоимостьТоваровЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
		
	// Сторнирование себестоимости товаров по управленческой организации.
	СформироватьДвиженияСебестоимостьТоваровСторноВУпрУчетеЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);

	// Корректировка списания товаров на затраты в регистре учет прочих расходов.
	Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов Тогда
		
		УсловиеГДЕ = "(
		|	(
		|		ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваров)
		|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
		|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы)
		|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровУХранителя)
		//++ НЕ УТ
		|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВСоставОС)
		|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВСоставНМА)
		//-- НЕ УТ
		|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаПрочиеЦели)
		|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатацию)
		|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатациюБУНУ)
		|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионераОСписании)
		|		ИЛИ (ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
		|				И (НЕ СтатьяРасходовСписания ЕСТЬ NULL И СтатьяРасходовСписания <> Неопределено И СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
		|				И (НЕ КорОрганизация ЕСТЬ NULL И КорОрганизация <> Неопределено И КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|			)
		|	)
		|)
		| И РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
		| И РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
		|";
	
		УсловиеГДЕПрочиеАктивыПассивы = УсловиеГДЕ + "
		| И НЕ (СтатьяАктивовПассивов ЕСТЬ NULL ИЛИ СтатьяАктивовПассивов = Неопределено ИЛИ СтатьяАктивовПассивов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка))
		|";
		
		СформироватьДвиженияПрочиеАктивыПассивыЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений, УсловиеГДЕПрочиеАктивыПассивы);

		УсловиеГДЕПрочиеРасходы = УсловиеГДЕ + "
		| И (СтатьяАктивовПассивов ЕСТЬ NULL ИЛИ СтатьяАктивовПассивов = Неопределено ИЛИ СтатьяАктивовПассивов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка))
		|";
		
		СтруктураТекстовСуммовыхПоказателей = Новый Структура;
		СтруктураТекстовСуммовыхПоказателей.Вставить("ТекстСумма", "(СуммаСНДС + ВЫБОР КОГДА ЭтоВыпускПродукции ТОГДА ИсходнаяСтоимость ИНАЧЕ 0 КОНЕЦ)");
		СтруктураТекстовСуммовыхПоказателей.Вставить("ТекстСуммаБезНДС", "(СуммаБезНДС + ВЫБОР КОГДА ЭтоВыпускПродукции ТОГДА ИсходнаяСтоимостьБезНДС ИНАЧЕ 0 КОНЕЦ)");
		СтруктураТекстовСуммовыхПоказателей.Вставить("ТекстСуммаРегл", "(СуммаРегл + ВЫБОР КОГДА ЭтоВыпускПродукции ТОГДА ИсходнаяСтоимостьРегл ИНАЧЕ 0 КОНЕЦ)");
		СтруктураТекстовСуммовыхПоказателей.Вставить("ТекстСуммаУпр", "(СуммаУпр + ВЫБОР КОГДА ЭтоВыпускПродукции ТОГДА ИсходнаяСтоимостьУпр ИНАЧЕ 0 КОНЕЦ)");
		СтруктураТекстовСуммовыхПоказателей.Вставить("ТекстПостояннаяРазница", "ПостояннаяРазница");
		СтруктураТекстовСуммовыхПоказателей.Вставить("ТекстВременнаяРазница", "ВременнаяРазница");
		
		СформироватьДвиженияПрочиеРасходыЗапросом(ПараметрыРасчета, "ВтПрочиеРасходыНаЗатраты", СоответствиеВременныхТаблицДвижений, УсловиеГДЕПрочиеРасходы,
			СтруктураТекстовСуммовыхПоказателей);

	КонецЕсли;
	
	СформироватьДвиженияПоПрочимАктивамПассивамЗапросом(ПараметрыРасчета, Запрос, СоответствиеВременныхТаблицДвижений);
	
	// Формирование прочих доходов/расходов при отклонениях в стоимости товаров
	Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов Тогда
		
		УсловиеГДЕ = "
		|	(
		|		ХозяйственнаяОперация В (
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПереданнойВозвратнойТары),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТары),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТарыВозвратНаДругойСклад),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаПартийТоваров))
		|		ИЛИ ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейпартий.ОтклонениеВСтоимостиНаПрочиеДоходы)
		|	)
		|	И РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
		|	И РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
		|	";
		
		СтруктураТекстовСуммовыхПоказателей = Новый Структура;
		СтруктураТекстовСуммовыхПоказателей.Вставить("ТекстСумма", "СуммаСНДС");
		СтруктураТекстовСуммовыхПоказателей.Вставить("ТекстСуммаБезНДС", "СуммаБезНДС");
		СтруктураТекстовСуммовыхПоказателей.Вставить("ТекстСуммаУпр", "СуммаУпр");
		
		СформироватьДвиженияПрочиеРасходыВУпрУчетеЗапросом(ПараметрыРасчета, "ВтПрочиеРасходыВозвратПоставщикуУпр", СоответствиеВременныхТаблицДвижений, 
			УсловиеГДЕ + "
				|	И СуммаСНДС > 0
				|	И (НЕ СтатьяРасходовСписанияУпр ЕСТЬ NULL 
				|		И СтатьяРасходовСписанияУпр <> Неопределено 
				|		И СтатьяРасходовСписанияУпр <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
				|		И СтатьяРасходовСписанияУпр <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
				|	)"
				,
			СтруктураТекстовСуммовыхПоказателей);

		СформироватьДвиженияПрочиеДоходыВУпрУчетеЗапросом(ПараметрыРасчета, "ВтПрочиеДоходыВозвратПоставщикуУпр", СоответствиеВременныхТаблицДвижений, 
			УсловиеГДЕ + "
				|	И (НЕ СтатьяДоходовУпр ЕСТЬ NULL 
				|		И СтатьяДоходовУпр <> Неопределено 
				|		И СтатьяДоходовУпр <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка)
				|	)"
				,
			"-СуммаСНДС",
			"- СуммаУпр");
	
		// Формирование прочих доходов/расходов при отклонения в стоимости товаров.
		Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходовРегл Тогда
			
			СтруктураТекстовСуммовыхПоказателей = Новый Структура;
			СтруктураТекстовСуммовыхПоказателей.Вставить("ТекстСумма", "0");
			СтруктураТекстовСуммовыхПоказателей.Вставить("ТекстСуммаБезНДС", "0");
			СтруктураТекстовСуммовыхПоказателей.Вставить("ТекстСуммаУпр", "0");
			СтруктураТекстовСуммовыхПоказателей.Вставить("ТекстСуммаРегл", "СуммаРегл");
			СтруктураТекстовСуммовыхПоказателей.Вставить("ТекстПостояннаяРазница", "ПостояннаяРазница");
			СтруктураТекстовСуммовыхПоказателей.Вставить("ТекстВременнаяРазница", "ВременнаяРазница");
			
			СформироватьДвиженияПрочиеРасходыЗапросом(ПараметрыРасчета, "ВтПрочиеРасходыВозвратПоставщику", СоответствиеВременныхТаблицДвижений, 
				УсловиеГДЕ + "
					|	И (НЕ СтатьяРасходовСписания ЕСТЬ NULL 
					|		И СтатьяРасходовСписания <> Неопределено 
					|		И СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
					|		И СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
					|	)"
					,
				СтруктураТекстовСуммовыхПоказателей);

			СформироватьДвиженияПрочиеДоходыЗапросом(ПараметрыРасчета, "ВтПрочиеДоходыВозвратПоставщику", СоответствиеВременныхТаблицДвижений, 
				УсловиеГДЕ + "
					|	И (НЕ СтатьяДоходов ЕСТЬ NULL 
					|		И СтатьяДоходов <> Неопределено 
					|		И СтатьяДоходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка)
					|	)"
					,
				"0",
				"- СуммаРегл",
				"0");

		КонецЕсли;
				
	КонецЕсли;			
	
	// Корректировка движений по оборотным регистрам управленческого учета.
	СформироватьДвиженияПоОборотнымРегистрамУпрУчетаЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвиженияИзВременныхТаблиц(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	
	МассивЛокальныхВт = Новый Массив;
	МассивЛокальныхВт.Добавить("ДвиженияТаблицаКорректировки");
	Для Каждого КлючЗначение Из СоответствиеВременныхТаблицДвижений Цикл
		МассивЛокальныхВт.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, 
		"ВтТаблицаКорректировки, ВтДанныеТаблицаКорректировки, ЕстьВозвратныеОтходы, РаботыДляДавальца, СторноОтчетыКомиссионера, РеквизитыКорДвижений"
		+ СтрСоединить(МассивЛокальныхВт, ","));
	
КонецПроцедуры

Процедура СформироватьДвиженияСебестоимостьТоваровЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	ИмяВременнойТаблицы = "ВтСебестоимостьТоваров";
	
	// Кор. стоимость не включается в список полей.
	КопируемыеПоля = "
	|Период, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация,
	|ХозяйственнаяОперация, ДокументРасчета,
	|КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов,КорОрганизация,
	|АналитикаУчетаПоПартнерам, ЗаказКлиента,
	|Подразделение, АналитикаРасходов, СтатьяРасходовСписания, СтатьяДоходов, АналитикаДоходов,
	|СтатьяАктивовПассивов, АналитикаАктивовПассивов,
	|ИдентификаторСтроки, КодСтроки, ДокументДвижения, ПериодПродажи, ГруппаПродукции,
	|КорНаправлениеДеятельности,
	|Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, ДопРасходы, ДопРасходыБезНДС,
	|ПостояннаяРазница, ВременнаяРазница, СтоимостьРегл, СтоимостьЗабалансоваяРегл,
	|КорПартия, КорАналитикаУчетаПартий, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС,
	|НДСРегл, НДСУпр, СтатьяКалькуляции, ТипЗаписи, ДокументИсточник, Сторно,
	|НастройкаХозяйственнойОперации, ИдентификаторФинЗаписи, НастройкаСчетовУчета, РасчетНеЗавершен
	|";
	
	Если ПараметрыРасчета.ПартионныйУчетВерсии22 Тогда
		КопируемыеПоля = КопируемыеПоля + ",
		|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС,
		|Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС,
		|ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл,
		|ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, ПостатейныеПеременныеРегл,
		|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр,
		|РезервПодОбесценениеРегл, РезервПодОбесценениеУпр,
		|";
	КонецЕсли;

	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РезервПодОбесценениеРегл",
	"ВЫБОР
	|	КОГДА НЕ СписыватьРезервы ТОГДА РезервПодОбесценениеРегл
	|	ИНАЧЕ 0
	|КОНЕЦ");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РезервПодОбесценениеУпр",
	"ВЫБОР
	|	КОГДА НЕ СписыватьРезервы ТОГДА РезервПодОбесценениеУпр
	|	ИНАЧЕ 0
	|КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Количество", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ВидДвижения");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РежимЗакрытияМесяца", "&РежимЗакрытияМесяца");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

Процедура СформироватьДвиженияСебестоимостьТоваровСписаниеРезервовЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	ИмяВременнойТаблицы = "ВтСебестоимостьТоваровРезервы";
	
	КопируемыеПоля = "
	|Период, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация,
	|ХозяйственнаяОперация,
	|КорАналитикаУчетаНоменклатуры, КорВидЗапасов, КорОрганизация,
	|АналитикаУчетаПоПартнерам, ЗаказКлиента,
	|Подразделение, АналитикаРасходов, СтатьяРасходовСписания, СтатьяДоходов, АналитикаДоходов,
	|СтатьяАктивовПассивов, АналитикаАктивовПассивов,
	|ИдентификаторСтроки, КодСтроки, ДокументДвижения, ПериодПродажи, ГруппаПродукции,
	|КорНаправлениеДеятельности,
	|КорПартия, КорАналитикаУчетаПартий, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС,
	|СтатьяКалькуляции, ТипЗаписи, ДокументИсточник, Сторно,
	|НастройкаХозяйственнойОперации, ИдентификаторФинЗаписи, НастройкаСчетовУчета,
	|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС,
	|РезервПодОбесценениеРегл, РезервПодОбесценениеУпр
	|";
	
	Если ПараметрыРасчета.Движения.Свойство(ИмяРегистра) Тогда
		ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	Иначе
		ОписаниеПриемника = ПараметрыРасчета.ВспомогательныеВременныеТаблицы[ИмяРегистра];
	КонецЕсли;
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "КорРазделУчета", "
	|ВЫБОР
	|	КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) 
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|	ИНАЧЕ
	|		КорРазделУчета
	|КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РезервПодОбесценениеРегл",
	"ВЫБОР
	|	КОГДА СписыватьРезервы ТОГДА РезервПодОбесценениеРегл
	|	ИНАЧЕ 0
	|КОНЕЦ");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РезервПодОбесценениеУпр",
	"ВЫБОР
	|	КОГДА СписыватьРезервы ТОГДА РезервПодОбесценениеУпр
	|	ИНАЧЕ 0
	|КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Количество", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ВидДвижения");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ХозяйственнаяОперация", 
		"ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРезервовПодОбесценениеЗапасов)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НастройкаХозяйственнойОперации", 
		"ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеРезервовПодОбесценениеЗапасов)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РежимЗакрытияМесяца", "&РежимЗакрытияМесяца");
	
	УсловиеГДЕ = "
	|	СписыватьРезервы 
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГДЕ);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

Процедура СформироватьКорДвиженияСебестоимостьТоваровЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	ИмяВременнойТаблицы = "ВтСебестоимостьТоваровКор";
	
	КопируемыеПоля = "
	|Период, ДокументДвижения, ИдентификаторСтроки, Сторно,
	|Подразделение, ГруппаПродукции, ДокументРасчета,
	|Стоимость, СтоимостьЗабалансовая, СтоимостьБезНДС, ДопРасходы, ДопРасходыБезНДС,
	|СтоимостьРегл, СтоимостьЗабалансоваяРегл, ПостояннаяРазница, ВременнаяРазница,
	|ИдентификаторФинЗаписи, НастройкаСчетовУчета";
	Если ПараметрыРасчета.ПартионныйУчетВерсии22 Тогда
		КопируемыеПоля = КопируемыеПоля + ",
		|СтатьяКалькуляции,
		|Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС,
		|ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл,
		|ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, ПостатейныеПеременныеРегл,
		|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр, НДСУпр
		|РезервПодОбесценениеРегл, РезервПодОбесценениеУпр";
	КонецЕсли;
	
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	// Заполним дополнительные свойства движения
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "ИСТИНА");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаУчетаНоменклатуры", "КорАналитикаУчетаНоменклатуры");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РазделУчета", "КорРазделУчета");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидЗапасов", "КорВидЗапасов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ХозяйственнаяОперация", "ПриходХозяйственнаяОперация");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ТипЗаписи", "ПриходТипЗаписи");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НастройкаХозяйственнойОперации", "ПриходНастройкаХозяйственнойОперации");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РежимЗакрытияМесяца", "&РежимЗакрытияМесяца");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Организация", 
			"ВЫБОР 
			|	КОГДА КорОрганизация ЕСТЬ NULL ИЛИ КорОрганизация = Неопределено 
			|		ИЛИ КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА 
			|		Организация 
			|	ИНАЧЕ 
			|		КорОрганизация 
			|КОНЕЦ"); 
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Количество", "0");
	
	Если ПараметрыРасчета.ПартионныйУчетВерсии22 Тогда
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Партия", "КорПартия");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаУчетаПартий", "КорАналитикаУчетаПартий");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаФинансовогоУчета", "КорАналитикаФинансовогоУчета");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДеятельностиНДС", "КорВидДеятельностиНДС");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "КорВидДеятельностиНДС", "ВидДеятельностиНДС");
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "КорАналитикаФинансовогоУчета", "
		|ВЫБОР 
		|	КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) ТОГДА
		|		ВЫБОР 
		|			КОГДА АналитикаФинансовогоУчета ССЫЛКА Справочник.ГруппыАналитическогоУчетаНоменклатуры ТОГДА
		|				АналитикаФинансовогоУчета
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
		|		КОНЕЦ
		|	ИНАЧЕ
		|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "АналитикаФинансовогоУчета") + "
		|КОНЕЦ");
				
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ГруппаПродукции", "
		|ВЫБОР 
		|	КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) ТОГДА
		|		КорАналитикаФинансовогоУчета
		|	ИНАЧЕ
		|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "ГруппаПродукции") + "
		|КОНЕЦ");
		
		//++ НЕ УТ
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "КорАналитикаУчетаНоменклатуры", "
		|ВЫБОР 
		|	КОГДА ДокументДвижения ССЫЛКА Документ.РаспределениеВозвратныхОтходов
		|		И КорРазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство) ТОГДА
		|		АналитикаУчетаНоменклатурыВО
		|	ИНАЧЕ
		|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "ПриходКорАналитикаУчетаНоменклатуры") + "
		|КОНЕЦ");
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "КорАналитикаФинансовогоУчета", "
		|ВЫБОР 
		|	КОГДА ДокументДвижения ССЫЛКА Документ.РаспределениеВозвратныхОтходов
		|		И КорРазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство) ТОГДА
		|		АналитикаФинансовогоУчетаВО
		|	ИНАЧЕ
		|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "АналитикаФинансовогоУчета") + "
		|КОНЕЦ");
		
		//-- НЕ УТ
		
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьРегл",
		"ВЫБОР КОГДА ЭтоПередачаМеждуОрганизациями ТОГДА 0 ИНАЧЕ СтоимостьРегл КОНЕЦ
		|	+ 
		|	ВЫБОР КОГДА НЕ ЭтоПередачаМеждуОрганизациями И СписыватьРезервы ТОГДА РезервПодОбесценениеРегл
		|	ИНАЧЕ 0
		|	КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьЗабалансоваяРегл",
		"ВЫБОР КОГДА ЭтоПередачаМеждуОрганизациями ТОГДА 0 ИНАЧЕ СтоимостьЗабалансоваяРегл КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостояннаяРазница", 
		"ВЫБОР КОГДА ЭтоПередачаМеждуОрганизациями ТОГДА 0 ИНАЧЕ ПостояннаяРазница КОНЕЦ");
			
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВременнаяРазница",
		"ВЫБОР КОГДА ЭтоПередачаМеждуОрганизациями ТОГДА 0 ИНАЧЕ ВременнаяРазница КОНЕЦ
		|	+ ВЫБОР
		|		КОГДА НЕ ЭтоПередачаМеждуОрганизациями И СписыватьРезервы ТОГДА РезервПодОбесценениеРегл
		|	ИНАЧЕ 0
		|	КОНЕЦ");
	
	Если ПараметрыРасчета.ПартионныйУчетВерсии22 Тогда
	
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ДопРасходыРегл",
			"ВЫБОР КОГДА ЭтоПередачаМеждуОрганизациями ТОГДА 0 ИНАЧЕ ДопРасходыРегл КОНЕЦ");
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ТрудозатратыРегл",
			"ВЫБОР КОГДА ЭтоПередачаМеждуОрганизациями ТОГДА 0 ИНАЧЕ ТрудозатратыРегл КОНЕЦ");
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостатейныеПостоянныеРегл",
			"ВЫБОР КОГДА ЭтоПередачаМеждуОрганизациями ТОГДА 0 ИНАЧЕ ПостатейныеПостоянныеРегл КОНЕЦ");
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостатейныеПеременныеРегл",
			"ВЫБОР КОГДА ЭтоПередачаМеждуОрганизациями ТОГДА 0 ИНАЧЕ ПостатейныеПеременныеРегл КОНЕЦ");
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РезервПодОбесценениеРегл",
			"ВЫБОР
			|	КОГДА ЭтоПередачаМеждуОрганизациями
			|		ТОГДА 0
			|	КОГДА НЕ СписыватьРезервы ТОГДА РезервПодОбесценениеРегл
			|	ИНАЧЕ 0
			|КОНЕЦ");
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьУпр",
			"ВЫБОР КОГДА ЭтоПередачаМеждуОрганизациями ТОГДА 0 ИНАЧЕ СтоимостьУпр КОНЕЦ
			|	+ ВЫБОР
			|		КОГДА НЕ ЭтоПередачаМеждуОрганизациями И СписыватьРезервы ТОГДА РезервПодОбесценениеУпр
			|	ИНАЧЕ 0
			|	КОНЕЦ");
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ДопРасходыУпр",
			"ВЫБОР КОГДА ЭтоПередачаМеждуОрганизациями ТОГДА 0 ИНАЧЕ ДопРасходыУпр КОНЕЦ");
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ТрудозатратыУпр",
			"ВЫБОР КОГДА ЭтоПередачаМеждуОрганизациями ТОГДА 0 ИНАЧЕ ТрудозатратыУпр КОНЕЦ");
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостатейныеПостоянныеУпр",
			"ВЫБОР КОГДА ЭтоПередачаМеждуОрганизациями ТОГДА 0 ИНАЧЕ ПостатейныеПостоянныеУпр КОНЕЦ");
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостатейныеПеременныеУпр",
			"ВЫБОР КОГДА ЭтоПередачаМеждуОрганизациями ТОГДА 0 ИНАЧЕ ПостатейныеПеременныеУпр КОНЕЦ");
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РезервПодОбесценениеУпр",
			"ВЫБОР
			|	КОГДА ЭтоПередачаМеждуОрганизациями
			|		ТОГДА 0
			|	КОГДА НЕ СписыватьРезервы ТОГДА РезервПодОбесценениеУпр
			|	ИНАЧЕ 0
			|КОНЕЦ");
			
	КонецЕсли;
	
	УсловиеГДЕ = "
	|	НЕ КорРазделУчета ЕСТЬ NULL 
	|	И КорРазделУчета <> Неопределено
	|	И КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|	И НЕ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|	И НЕ (
	|		ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) 
	|		И РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|	)
	|";
	
	Если ПараметрыРасчета.Свойство("ТолькоОднаОрганизация") И ПараметрыРасчета.ТолькоОднаОрганизация Тогда
		УсловиеГДЕ = УсловиеГДЕ + "
		|	И (ВЫБОР 
		|		КОГДА КорОрганизация ЕСТЬ NULL ИЛИ КорОрганизация = НЕОПРЕДЕЛЕНО 
		|		 ИЛИ КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		КОГДА НЕ КорОрганизация В (&МассивОрганизаций)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА КОНЕЦ)
		|";
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГДЕ);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

Процедура СформироватьДвиженияСебестоимостьТоваровСторноВУпрУчетеЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений)

	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	ИмяВременнойТаблицы = "ВтСебестоимостьТоваровСторноУпр";
	
	КопируемыеПоля = "
	|Период, Организация, РазделУчета,
	|ХозяйственнаяОперация, ДокументДвижения, Регистратор, ДокументРасчета,
	|Подразделение, АналитикаРасходов, СтатьяРасходовСписания,
	|НастройкаХозяйственнойОперации, ИдентификаторФинЗаписи, НастройкаСчетовУчета,
	|Стоимость, СтоимостьБезНДС, ДопРасходы, ДопРасходыБезНДС,
	|СтатьяКалькуляции, ТипЗаписи, ДокументИсточник, Сторно,
	|Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС,
	|ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС";
	
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	// Заполним дополнительные свойства движения
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "ИСТИНА");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Организация", "КорОрганизация");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаУчетаНоменклатуры", "КорАналитикаУчетаНоменклатуры");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидЗапасов", "КорВидЗапасов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьРегл", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьУпр", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Количество", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РежимЗакрытияМесяца", "&РежимЗакрытияМесяца");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РазделУчета", "
	|ВЫБОР
	|	КОГДА РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	ИНАЧЕ
	|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "РазделУчета") + "
	|КОНЕЦ
	|");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Партия", "КорПартия");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаУчетаПартий", "КорАналитикаУчетаПартий");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаФинансовогоУчета", "КорАналитикаФинансовогоУчета");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДеятельностиНДС", "КорВидДеятельностиНДС");
	
	УсловиеГДЕ = "
	|	ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|	ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет)
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГДЕ);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

Процедура СформироватьДвиженияНоменклатураДоходыРасходыЗапросом(ПараметрыРасчета, ИмяВременнойТаблицы, СоответствиеВременныхТаблицДвижений, УсловиеГДЕ,
			ЭтоДоход = Ложь, ХозяйственнаяОперация = Неопределено, СтруктураКорректировкиСумм = Неопределено)

	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя;
	
	КопируемыеПоля =
	"Период, ХозяйственнаяОперация, Организация, Подразделение,
	|АналитикаУчетаНоменклатуры,Склад,ТипЗапасов,ВидЗапасов,
	|ИсточникГФУНоменклатуры, ДокументДвижения, Сторно";
	
	СуммовыеПоля = "
	|Стоимость, СтоимостьБезНДС, ДопРасходы, ДопРасходыБезНДС, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, 
	|СтоимостьРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр,
	|СтоимостьЗабалансовая, СтоимостьЗабалансоваяРегл,
	|ПостояннаяРазница, ВременнаяРазница,
	|НДСРегл, НДСУпр, 
	|РезервПодОбесценениеРегл, РезервПодОбесценениеУпр
	|";
	
	КопируемыеПоля = КопируемыеПоля + ", " + СуммовыеПоля;

	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	Если ХозяйственнаяОперация <> Неопределено Тогда
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ХозяйственнаяОперация", "&ХозяйственнаяОперация");
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РезервПодОбесценениеРегл",
	"ВЫБОР
	|	КОГДА СписыватьРезервы ТОГДА РезервПодОбесценениеРегл
	|	ИНАЧЕ 0
	|КОНЕЦ");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РезервПодОбесценениеУпр",
	"ВЫБОР
	|	КОГДА СписыватьРезервы ТОГДА РезервПодОбесценениеУпр
	|	ИНАЧЕ 0
	|КОНЕЦ");
	
	Если ЭтоДоход Тогда
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтатьяДоходовРасходов", "СтатьяДоходов");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаДоходов", "АналитикаДоходов");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НаправлениеДеятельностиНоменклатуры", "НаправлениеДеятельности");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НаправлениеДеятельностиСтатьи", "КорНаправлениеДеятельности");
		
	Иначе
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтатьяДоходовРасходов", "СтатьяРасходовСписания");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаРасходов", "АналитикаРасходов");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НаправлениеДеятельностиСтатьи", "КорНаправлениеДеятельности");
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НаправлениеДеятельностиНоменклатуры", "
		|ВЫБОР
		|	КОГДА " + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "ХозяйственнаяОперация") 
					+ " = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию) И КорТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар) ТОГДА
		|		КорНаправлениеДеятельности
		|	ИНАЧЕ
		|		НаправлениеДеятельности
		|	КОНЕЦ");
		
	КонецЕсли;
	
	Если СтруктураКорректировкиСумм <> Неопределено Тогда
		
		МассивПолей = СтрРазделить(СуммовыеПоля, ",");
		Для Каждого Поле Из МассивПолей Цикл
			
			мПоле = СтрЗаменить(СтрЗаменить(СокрЛП(Поле), Символы.ПС, ""), Символы.Таб, "");
			НовоеПоле = СкорректироватьСуммовоеПолеДвиженияНоменклатурыЗапросом(мПоле, СтруктураКорректировкиСумм);
			
			РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, мПоле, НовоеПоле);
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ХозяйственнаяОперация", ХозяйственнаяОперация);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГДЕ, СтруктураПараметров);
			
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

Процедура СформироватьДвиженияНоменклатураНоменклатураЗапросом(ПараметрыРасчета, ИмяВременнойТаблицы, СоответствиеВременныхТаблицДвижений, УсловиеГДЕ, ТекстХозяйственнаяОперация)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураНоменклатура.Имя;
	
	КопируемыеПоля =
	"Период, ХозяйственнаяОперация, Организация,
	|АналитикаУчетаНоменклатуры,Склад,ТипЗапасов,ВидЗапасов,
	|КорАналитикаУчетаНоменклатуры,КорСклад,КорТипЗапасов,КорВидЗапасов,
	|ИсточникГФУНоменклатуры, КорИсточникГФУНоменклатуры, ДокументДвижения, КорОрганизация, Сторно";

	СуммовыеПоля = "
	|Стоимость, СтоимостьБезНДС, ДопРасходы, ДопРасходыБезНДС, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, 
	|СтоимостьРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр,
	|СтоимостьЗабалансовая, СтоимостьЗабалансоваяРегл,
	|ПостояннаяРазница, ВременнаяРазница,
	|НДСРегл, НДСУпр, 
	|РезервПодОбесценениеРегл, РезервПодОбесценениеУпр
	|";
	
	КопируемыеПоля = КопируемыеПоля + ", " + СуммовыеПоля;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Подразделение", "
	|ВЫБОР
	|	КОГДА Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		ТОГДА Подразделение
	|	КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|		ТОГДА АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	|	ИНАЧЕ КорАналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	|КОНЕЦ");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НаправлениеДеятельности", "
	|АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "КорНаправлениеДеятельности", "
	|КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ХозяйственнаяОперация", ТекстХозяйственнаяОперация);
		
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Организация", "
	|ВЫБОР
	|	КОГДА " + ТекстХозяйственнаяОперация + " В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутреннееПоступлениеТоваров), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутреннееПоступлениеРабот)) ТОГДА
	|		КорОрганизация
	|	ИНАЧЕ
	|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "Организация") + "
	|КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "КорОрганизация", "
	|ВЫБОР
	|	КОГДА " + ТекстХозяйственнаяОперация + " В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутреннееПоступлениеТоваров), 
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутреннееПоступлениеРабот)) ТОГДА
	|		Организация
	|	ИНАЧЕ
	|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "КорОрганизация") + "
	|КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Количество", "
	|ВЫБОР
	|	КОГДА Склад ССЫЛКА Справочник.Партнеры ТОГДА
	|		Количество
	|	ИНАЧЕ
	|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "Количество") + "
	|КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "КорНаправлениеДеятельности", "
	|ВЫБОР
	|	КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию) ТОГДА
	|		НаправлениеДеятельности
	|	ИНАЧЕ
	|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "КорНаправлениеДеятельности") + "
	|КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГДЕ);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

Процедура СформироватьДвиженияПоОборотнымРегистрамУпрУчетаЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений)
	
	ТекстЕстьНенулеваяПолнаяСумма = "
	|	ВЫБОР 
	|		КОГДА СуммаСНДС <> 0 ИЛИ СуммаБезНДС  <> 0 ИЛИ СуммаРегл  <> 0 ИЛИ СуммаУпр <> 0
	|		 ИЛИ РезервПодОбесценениеРегл <> 0 ИЛИ РезервПодОбесценениеУпр <> 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ
	|";
	
	УсловиеЗапроса = ТекстЕстьНенулеваяПолнаяСумма + "
	|	И ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы),
	//++ НЕ УТ
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВСоставОС),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВСоставНМА),
	//-- НЕ УТ
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаПрочиеЦели),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатацию),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатациюБУНУ),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионераОСписании),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакрытиеМесяца),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровУХранителя)
	|	)";

	СформироватьДвиженияНоменклатураДоходыРасходыЗапросом(ПараметрыРасчета, "ВтДоходыРасходыСписаниеТоваров", СоответствиеВременныхТаблицДвижений, УсловиеЗапроса);
			
	УсловиеЗапроса = ТекстЕстьНенулеваяПолнаяСумма + "
	|	И (
	|		(
	|			(
	|				ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами)
	|				ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами)
	|				ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемПередачаРаботМеждуФилиалами)
	|			)
	|			И ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		)
	|		
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратИзПроизводства)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзКладовой)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратПоКомиссииМеждуОрганизациями)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|		ИЛИ (ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика) И ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзКладовой)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаОбособленногоУчета)
	|		ИЛИ ((ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров) ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатов) ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемПередачаРаботМеждуПодразделениями)) И ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВПроизводство)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПереработчику)
	|		ИЛИ (ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров) И ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|		ИЛИ (ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров) И ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|		ИЛИ (ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности) И РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути))
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСНеотфактурованнаяПоставка)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСПоступлениеИзТоваровВПути)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуПоступлениеИзТоваровВПути)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаНеотфактурованнаяПоставка)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаПоступлениеИзТоваровВПути)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтХранителя)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|	)
	|
	|	И НЕ ((КорАналитикаУчетаНоменклатуры ЕСТЬ NULL ИЛИ КорАналитикаУчетаНоменклатуры = Неопределено ИЛИ КорАналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка))
	|		И (
	|			ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|			ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|		 	ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|		)	
	|	)
	|";
			
	СформироватьДвиженияНоменклатураНоменклатураЗапросом(ПараметрыРасчета
		,"ВтДвиженияНоменклатураНоменклатураПеремещение"
		,СоответствиеВременныхТаблицДвижений
		,УсловиеЗапроса
		,"ВЫБОР
		|	КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности) ТОГДА
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтгрузкаБезПереходаПраваСобственности)
		|	ИНАЧЕ
		|		ХозяйственнаяОперация
		|КОНЕЦ");
				
	УсловиеЗапросаВнутреннееПоступлениеТоваров = УсловиеЗапроса + "
	|	И (
	|		ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами)
	|		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами)
	|	)";

	СформироватьДвиженияНоменклатураНоменклатураЗапросом(ПараметрыРасчета
		,"ВтДвиженияНоменклатураНоменклатураВнутреннееПоступлениеТоваров"
		,СоответствиеВременныхТаблицДвижений
		,УсловиеЗапросаВнутреннееПоступлениеТоваров
		,"ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутреннееПоступлениеТоваров)");
	
	УсловиеЗапросаВнутреннееПоступлениеРабот = УсловиеЗапроса + "
	|	И ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемПередачаРаботМеждуФилиалами)";

	СформироватьДвиженияНоменклатураНоменклатураЗапросом(ПараметрыРасчета
		,"ВтДвиженияНоменклатураНоменклатураВнутреннееПоступлениеРабот"
		,СоответствиеВременныхТаблицДвижений
		,УсловиеЗапросаВнутреннееПоступлениеРабот
		,"ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутреннееПоступлениеРабот)");
	
	УсловиеЗапроса = "
	|	(ПолнаяСуммаПереоценки > 0 ИЛИ СуммаРегл > 0 ИЛИ СуммаУпр > 0)
	|	И ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПереданнойВозвратнойТары),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТары),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТарыВозвратНаДругойСклад),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаПартийТоваров))
	|";
	
	СтруктураКорректировкиСумм = Новый Структура();
	СтруктураКорректировкиСумм.Вставить("КоэффициентСуммыСНДС", 1);
	СтруктураКорректировкиСумм.Вставить("КоэффициентСуммыБезНДС", 1);
	СтруктураКорректировкиСумм.Вставить("КоэффициентСуммыРегл", 1);
	СтруктураКорректировкиСумм.Вставить("КоэффициентСуммыУпр", 1);
	СтруктураКорректировкиСумм.Вставить("КоэффициентКорСуммы", 1);
	
	СформироватьДвиженияНоменклатураДоходыРасходыЗапросом(ПараметрыРасчета, "ВтДоходыРасходыРасходыОтПереоценкиТоваров", СоответствиеВременныхТаблицДвижений, УсловиеЗапроса, 
		Ложь, 
		Перечисления.ХозяйственныеОперации.РасходыОтПереоценкиТоваров, 
		СтруктураКорректировкиСумм);
	
	УсловиеЗапроса = "
	|	(ПолнаяСуммаПереоценки < 0 ИЛИ (СуммаРегл + РезервПодОбесценениеРегл) < 0 ИЛИ (СуммаУпр + РезервПодОбесценениеУпр) < 0)
	|	И ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПереданнойВозвратнойТары),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТары),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТарыВозвратНаДругойСклад),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаПартийТоваров))
	|";
	
	СтруктураКорректировкиСумм = Новый Структура();
	СтруктураКорректировкиСумм.Вставить("КоэффициентСуммыСНДС", -1);
	СтруктураКорректировкиСумм.Вставить("КоэффициентСуммыБезНДС", -1);
	СтруктураКорректировкиСумм.Вставить("КоэффициентСуммыРегл", -1);
	СтруктураКорректировкиСумм.Вставить("КоэффициентСуммыУпр", -1);
	СтруктураКорректировкиСумм.Вставить("КоэффициентКорСуммы", 1);
	
	СформироватьДвиженияНоменклатураДоходыРасходыЗапросом(ПараметрыРасчета, "ВтДоходыРасходыДоходыОтПереоценкиТоваров", СоответствиеВременныхТаблицДвижений, УсловиеЗапроса, 
		Истина, 
		Перечисления.ХозяйственныеОперации.ДоходыОтПереоценкиТоваров, 
		СтруктураКорректировкиСумм);
	
КонецПроцедуры

Функция СкорректироватьСуммовоеПолеДвиженияНоменклатурыЗапросом(Поле, СтруктураКорректировкиСумм)
	
	ИменаПолейСНДС   = Новый Структура("Стоимость, ДопРасходы, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС");
	ИменаПолейБезНДС = Новый Структура("СтоимостьБезНДС, ДопРасходыБезНДС, ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС");
	ИменаПолейРегл   = Новый Структура("СтоимостьРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл");
	ИменаПолейУпр 	 = Новый Структура("СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр");
	
	ИменаПолейУменьшаемойСтоимости = Новый Структура("Стоимость, СтоимостьБезНДС");
	
	НовоеПоле = Поле;
	
	Если ИменаПолейСНДС.Свойство(Поле) Тогда
		
		Если ИменаПолейУменьшаемойСтоимости.Свойство(Поле) Тогда
			НовоеПоле = "(" + Поле + " - КорСтоимость * " + Формат(СтруктураКорректировкиСумм.КоэффициентКорСуммы, "ЧРД=.; ЧН=0; ЧГ=0") + ") * " + Формат(СтруктураКорректировкиСумм.КоэффициентСуммыСНДС, "ЧРД=.; ЧН=0; ЧГ=0");
		Иначе
			НовоеПоле = Поле + " * " + Формат(СтруктураКорректировкиСумм.КоэффициентСуммыСНДС, "ЧРД=.; ЧН=0; ЧГ=0");
		КонецЕсли;
		
	ИначеЕсли ИменаПолейБезНДС.Свойство(Поле) Тогда
		
		Если ИменаПолейУменьшаемойСтоимости.Свойство(Поле) Тогда
			НовоеПоле = "(" + Поле + " - КорСтоимость * " + Формат(СтруктураКорректировкиСумм.КоэффициентКорСуммы, "ЧРД=.; ЧН=0; ЧГ=0") + ") * " + Формат(СтруктураКорректировкиСумм.КоэффициентСуммыБезНДС, "ЧРД=.; ЧН=0; ЧГ=0");
		Иначе
			НовоеПоле = Поле + " * " + Формат(СтруктураКорректировкиСумм.КоэффициентСуммыБезНДС, "ЧРД=.; ЧН=0; ЧГ=0");
		КонецЕсли;
	
	ИначеЕсли ИменаПолейРегл.Свойство(Поле) Тогда
		
		НовоеПоле = Поле + " * " + Формат(СтруктураКорректировкиСумм.КоэффициентСуммыРегл, "ЧРД=.; ЧН=0; ЧГ=0");
	
	ИначеЕсли ИменаПолейУпр.Свойство(Поле) Тогда
		
		НовоеПоле = Поле + " * " + Формат(СтруктураКорректировкиСумм.КоэффициентСуммыУпр, "ЧРД=.; ЧН=0; ЧГ=0");
		
	КонецЕсли;
		
	Возврат НовоеПоле;
	
КонецФункции

Процедура СформироватьДвиженияПрочиеАктивыПассивыЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений, УсловиеГде)

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя;
	ИмяВременнойТаблицы = "ВтПрочиеАктивыПассивы";

	КопируемыеПоля = "
	|Период, Организация, Сторно";
	
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	// Заполним дополнительные свойства движения
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "ИСТИНА");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Статья", "СтатьяАктивовПассивов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Аналитика", "АналитикаАктивовПассивов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НаправлениеДеятельности", "КорНаправлениеДеятельности");

	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Сумма", "СуммаСНДС + ВЫБОР КОГДА ЭтоВыпускПродукции ТОГДА ИсходнаяСтоимость ИНАЧЕ 0 КОНЕЦ"); 
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГДЕ);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

Процедура СформироватьДвиженияПоПрочимАктивамПассивамЗапросом(ПараметрыРасчета, Запрос, СоответствиеВременныхТаблицДвижений)
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Т.Период,
	|	Т.ДокументДвижения КАК Регистратор,
	// Измерения
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.СтатьяАктивовПассивов КАК Статья,
	|	Т.АналитикаАктивовПассивов КАК Аналитика,
	|	Т.НастройкаСчетовУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Дебет) КАК ДебетКредит,
	// Ресурсы
	|	Т.СуммаСНДС КАК СуммаСНДС,
	|	Т.СуммаБезНДС КАК СуммаБезНДС,
	|	Т.СуммаРегл КАК СуммаРегл,
	|	Т.СуммаУпр КАК СуммаУпр,
	|	Т.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Т.ВременнаяРазница КАК ВременнаяРазница,
	// Реквизиты
	|	Т.ДокументДвижения,
	|	Т.Сторно,
	|	Т.НастройкаХозяйственнойОперации,
	|	ВЫБОР
	|		КОГДА Т.ДокументДвижения ССЫЛКА Документ.РаспределениеПрочихЗатрат
	|			ТОГДА &ИдентификаторНеиспользуемойФинЗаписи
	|		ИНАЧЕ Т.ИдентификаторФинЗаписи
	|	КОНЕЦ КАК ИдентификаторФинЗаписи
	|ПОМЕСТИТЬ ВтТаблицаДвиженияПоПрочимАктивамПассивам
	|ИЗ
	|	ДвиженияТаблицаКорректировки КАК Т
	|ГДЕ
	|	Т.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|
	// Передача в филиал (на стороне отправителя)
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период,
	|	Т.ДокументДвижения КАК Регистратор,
	// Измерения
	|	Т.Организация,
	|	(ВЫБОР
	|		КОГДА НЕ Т.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение ЕСТЬ NULL
	|			ТОГДА Т.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	|		ИНАЧЕ Т.АналитикаУчетаНоменклатуры.Подразделение КОНЕЦ) КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыСФилиалами) КАК Статья,
	|	Т.КорОрганизация КАК Аналитика,
	|	Т.НастройкаСчетовУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Дебет) КАК ДебетКредит,
	// Ресурсы
	|	Т.СуммаСНДС КАК СуммаСНДС,
	|	Т.СуммаБезНДС КАК СуммаБезНДС,
	|	Т.СуммаРегл КАК СуммаРегл,
	|	Т.СуммаУпр КАК СуммаУпр,
	|	Т.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Т.ВременнаяРазница КАК ВременнаяРазница,
	// Реквизиты
	|	Т.ДокументДвижения,
	|	Т.Сторно,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи
	|ИЗ
	|	ДвиженияТаблицаКорректировки КАК Т
	|ГДЕ
	|	Т.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемПередачаРаботМеждуФилиалами))
	|
	// Передача в филиал (на стороне получателя)
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период,
	|	Т.ДокументДвижения КАК Регистратор,
	// Измерения
	|	Т.КорОрганизация КАК Организация,
	|	(ВЫБОР
	|		КОГДА НЕ Т.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение ЕСТЬ NULL
	|			ТОГДА Т.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	|		ИНАЧЕ Т.АналитикаУчетаНоменклатуры.Подразделение КОНЕЦ) КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.РасчетыСФилиалами) КАК Статья,
	|	Т.Организация КАК Аналитика,
	|	Т.НастройкаСчетовУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Кредит) КАК ДебетКредит,
	// Ресурсы
	|	Т.СуммаСНДС КАК СуммаСНДС,
	|	Т.СуммаБезНДС КАК СуммаБезНДС,
	|	Т.СуммаРегл КАК СуммаРегл,
	|	Т.СуммаУпр КАК СуммаУпр,
	|	Т.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Т.ВременнаяРазница КАК ВременнаяРазница,
	// Реквизиты
	|	Т.ДокументДвижения,
	|	Т.Сторно,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи
	|ИЗ
	|	ДвиженияТаблицаКорректировки КАК Т
	|ГДЕ
	|	Т.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемПередачаРаботМеждуФилиалами))
	|";
	Запрос.УстановитьПараметр("ИдентификаторНеиспользуемойФинЗаписи", ПроведениеДокументов.ИдентификаторНеиспользуемойФинЗаписи());
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтДвиженияПоПрочимАктивамПассивам";
	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияПоПрочимАктивамПассивам.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтТаблицаДвиженияПоПрочимАктивамПассивам");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтТаблицаДвиженияПоПрочимАктивамПассивам", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

Процедура СформироватьДвиженияПрочиеРасходыВУпрУчетеЗапросом(ПараметрыРасчета, ИмяВременнойТаблицы, СоответствиеВременныхТаблицДвижений, УсловиеГДЕ,
			СтруктураТекстовСуммовыхПоказателей)
			
	ТекстСумма = СтруктураТекстовСуммовыхПоказателей.ТекстСумма;
	ТекстСуммаБезНДС = СтруктураТекстовСуммовыхПоказателей.ТекстСуммаБезНДС;
	ТекстСуммаУпр = СтруктураТекстовСуммовыхПоказателей.ТекстСуммаУпр;

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, Подразделение, АналитикаРасходов, ХозяйственнаяОперация,
	|АналитикаУчетаНоменклатуры, ГруппаПродукции, ДокументДвижения, Сторно,
	|НастройкаХозяйственнойОперации, ИдентификаторФинЗаписи, ДокументРасчета";

	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	СтруктураПараметров = Новый Структура();
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	// Заполним дополнительные свойства движения
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "ИСТИНА");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Сумма", "Знак * (" + ТекстСумма + ")");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтатьяРасходов", "СтатьяРасходовСписанияУпр");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаРасходов", "АналитикаРасходовУпр");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НаправлениеДеятельности", "КорНаправлениеДеятельности");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РежимЗакрытияМесяца", "&РежимЗакрытияМесяца");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Организация", "
	|ВЫБОР
	|	КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) ТОГДА
	|		КорОрганизация
	|	ИНАЧЕ
	|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "Организация") + " 
	|КОНЕЦ");

	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаБезНДС", "
	|ВЫБОР
	|	КОГДА НЕ ВариантРаспределенияРасходовУпр В (
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы))
	|		ТОГДА Знак * (" + ТекстСуммаБезНДС + ")
	|	ИНАЧЕ
	|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "СуммаБезНДС") + " 
	|КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаУпр", "
	|ВЫБОР
	|	КОГДА НЕ ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы) ТОГДА
	|		ВЫБОР
	|			КОГДА НЕ &УправленческийУчетОрганизаций ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) ТОГДА
	|				0
	|			КОГДА ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы) И НЕ &ИспользуетсяУправлениеВНА_2_4 ТОГДА
	|				0
	|			ИНАЧЕ
	|				Знак * (" + ТекстСуммаУпр + ")
	|		КОНЕЦ
	|	ИНАЧЕ
	|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "СуммаУпр") + " 
	|КОНЕЦ");
	
	СтруктураПараметров.Вставить("УправленческийУчетОрганизаций", ПараметрыРасчета.УправленческийУчетОрганизаций);
	СтруктураПараметров.Вставить("ИспользуетсяУправлениеВНА_2_4", ПараметрыРасчета.ИспользуетсяУправлениеВНА_2_4);
	СтруктураПараметров.Вставить("ИспользоватьУчетПрочихДоходовРасходовРегл", ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходовРегл);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГДЕ, СтруктураПараметров);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
	// Кор движения
	СформироватьДвиженияПрочиеРасходыКорЗапросом(ПараметрыРасчета, ИмяВременнойТаблицы, СоответствиеВременныхТаблицДвижений, УсловиеГДЕ,
			ТекстСумма, ТекстСуммаБезНДС, ТекстСуммаУпр);
	
КонецПроцедуры

Процедура СформироватьДвиженияПрочиеРасходыЗапросом(ПараметрыРасчета, ИмяВременнойТаблицы, СоответствиеВременныхТаблицДвижений, УсловиеГДЕ,
			СтруктураТекстовСуммовыхПоказателей)
			
	ТекстСумма = СтруктураТекстовСуммовыхПоказателей.ТекстСумма;
	ТекстСуммаБезНДС = СтруктураТекстовСуммовыхПоказателей.ТекстСуммаБезНДС;
	ТекстСуммаРегл = СтруктураТекстовСуммовыхПоказателей.ТекстСуммаРегл;
	ТекстСуммаУпр = СтруктураТекстовСуммовыхПоказателей.ТекстСуммаУпр;
	ТекстПостояннаяРазница = СтруктураТекстовСуммовыхПоказателей.ТекстПостояннаяРазница;
	ТекстВременнаяРазница = СтруктураТекстовСуммовыхПоказателей.ТекстВременнаяРазница;

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, Подразделение, АналитикаРасходов, ХозяйственнаяОперация,
	|АналитикаУчетаНоменклатуры, ГруппаПродукции, ДокументДвижения, Сторно,
	|НастройкаХозяйственнойОперации, ИдентификаторФинЗаписи, ДокументРасчета";

	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	СтруктураПараметров = Новый Структура();
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	// Заполним дополнительные свойства движения
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "ИСТИНА");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Сумма", "Знак * (" + ТекстСумма + ")");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтатьяРасходов", "СтатьяРасходовСписания");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НаправлениеДеятельности", "КорНаправлениеДеятельности");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РежимЗакрытияМесяца", "&РежимЗакрытияМесяца");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Организация", "
	|ВЫБОР
	|	КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) ТОГДА
	|		КорОрганизация
	|	ИНАЧЕ
	|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "Организация") + " 
	|КОНЕЦ");

	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаБезНДС", "
	|ВЫБОР
	|	КОГДА НЕ ВариантРаспределенияРасходовУпр В (
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы))
	|		ТОГДА Знак * (" + ТекстСуммаБезНДС + ")
	|	ИНАЧЕ
	|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "СуммаБезНДС") + " 
	|КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаУпр", "
	|ВЫБОР
	|	КОГДА НЕ ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы) ТОГДА
	|		ВЫБОР
	|			КОГДА НЕ &УправленческийУчетОрганизаций ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию) ТОГДА
	|				0
	|			КОГДА ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы) И НЕ &ИспользуетсяУправлениеВНА_2_4 ТОГДА
	|				0
	|			ИНАЧЕ
	|				Знак * (" + ТекстСуммаУпр + ")
	|		КОНЕЦ
	|	ИНАЧЕ
	|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "СуммаУпр") + " 
	|КОНЕЦ");
	
	СтруктураПараметров.Вставить("УправленческийУчетОрганизаций", ПараметрыРасчета.УправленческийУчетОрганизаций);
	СтруктураПараметров.Вставить("ИспользуетсяУправлениеВНА_2_4", ПараметрыРасчета.ИспользуетсяУправлениеВНА_2_4);
	СтруктураПараметров.Вставить("ИспользоватьУчетПрочихДоходовРасходовРегл", ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходовРегл);
	
	// СуммаРегл
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаРегл", "
	|ВЫБОР
	|	КОГДА НЕ &ИспользоватьУчетПрочихДоходовРасходовРегл
	| 		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	| 		ИЛИ ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	| 		ИЛИ (ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы) И НЕ &ИспользуетсяУправлениеВНА_2_4) ТОГДА
	|		0
	|	КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатацию) ТОГДА
	|		0
	|	КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатациюБУНУ) ТОГДА
	|		0
	|	ИНАЧЕ
	|		Знак * (" + ТекстСуммаРегл + ")
	|КОНЕЦ");
	
	// ПостояннаяРазница
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостояннаяРазница", "
	|ВЫБОР
	|	КОГДА НЕ &ИспользоватьУчетПрочихДоходовРасходовРегл
	| 		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	| 		ИЛИ ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	| 		ИЛИ (ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы) И НЕ &ИспользуетсяУправлениеВНА_2_4) ТОГДА
	|		0
	//++ НЕ УТ
	|	КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатацию) ТОГДА
	|		ВЫБОР 
	|			КОГДА ЛОЖЬ ТОГДА 0 // для удобства расстановки тегов
	//++ Локализация
	|			КОГДА СписаниеПриПередачеНУ И НЕ ПринятиеКНалоговомуУчету ТОГДА
	|				(" + ТекстСуммаРегл + ") - (" + ТекстВременнаяРазница + ") - (" + ТекстПостояннаяРазница + ")
	//-- Локализация
	|			ИНАЧЕ
	|				0
	|			КОНЕЦ
	|	КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатациюБУНУ) ТОГДА
	|		0
	//-- НЕ УТ
	|	ИНАЧЕ
	|		ВЫБОР 
	|			КОГДА НЕ ПринятиеКНалоговомуУчету ТОГДА
	|				Знак * (" + ТекстСуммаРегл + ") - Знак * (" + ТекстВременнаяРазница + ")
	|			ИНАЧЕ
	|				Знак * " + ТекстПостояннаяРазница + "
	|		КОНЕЦ
	|КОНЕЦ");
	
	// ВременнаяРазница
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВременнаяРазница", "
	|ВЫБОР
	|	КОГДА НЕ &ИспользоватьУчетПрочихДоходовРасходовРегл
	| 		ИЛИ ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	| 		ИЛИ ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	| 		ИЛИ (ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы) И НЕ &ИспользуетсяУправлениеВНА_2_4) ТОГДА
	|		0
	//++ НЕ УТ
	|	КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатацию) ТОГДА
	|		ВЫБОР
	|			КОГДА ЛОЖЬ ТОГДА 0 // для удобства расстановки тегов
	//++ Локализация
	|			КОГДА СписаниеПриПередачеНУ И НЕ ПринятиеКНалоговомуУчету ТОГДА
	|				-((" + ТекстСуммаРегл + ") - (" + ТекстВременнаяРазница + ") - (" + ТекстПостояннаяРазница + "))
	|			КОГДА СписаниеПриПередачеНУ И ПринятиеКНалоговомуУчету ТОГДА
	|				-((" + ТекстСуммаРегл + ") - (" + ТекстВременнаяРазница + ") - (" + ТекстПостояннаяРазница + "))
	//-- Локализация
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ
	|	КОГДА ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатациюБУНУ) ТОГДА
	|		0
	//-- НЕ УТ
	|	ИНАЧЕ
	|		Знак * (" + ТекстВременнаяРазница + ")
	|КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГДЕ, СтруктураПараметров);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
	// Отражение списания резервов под обесценение запасов.
	ИмяВременнойТаблицыРезервы = ИмяВременнойТаблицы + "Резервы";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ХозяйственнаяОперация", 
		"ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРезервовПодОбесценениеЗапасов)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НастройкаХозяйственнойОперации", 
		"ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеРезервовПодОбесценениеЗапасов)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Сумма", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаБезНДС", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаУпр", "РезервПодОбесценениеУпр");
	Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходовРегл Тогда
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаРегл", "РезервПодОбесценениеРегл");
	КонецЕсли;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостояннаяРазница", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВременнаяРазница", "РезервПодОбесценениеРегл");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицыРезервы, УсловиеГДЕ, СтруктураПараметров);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицыРезервы, ИмяРегистра);
	
	// Кор движения
	СформироватьДвиженияПрочиеРасходыКорЗапросом(ПараметрыРасчета, ИмяВременнойТаблицы, СоответствиеВременныхТаблицДвижений, УсловиеГДЕ,
			ТекстСумма, ТекстСуммаБезНДС, ТекстСуммаУпр);
	
КонецПроцедуры

Процедура СформироватьДвиженияПрочиеРасходыКорЗапросом(ПараметрыРасчета, ИмяВременнойТаблицы, СоответствиеВременныхТаблицДвижений, УсловиеГДЕ,
			ТекстСумма, ТекстСуммаБезНДС, ТекстСуммаУпр)

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, Подразделение, АналитикаРасходов, ХозяйственнаяОперация,
	|АналитикаУчетаНоменклатуры, ГруппаПродукции, ДокументДвижения, Сторно, ДокументРасчета";
	
	УсловиеГДЕКор = УсловиеГДЕ + "
	|	И (НЕ КорОрганизация ЕСТЬ NULL И КорОрганизация <> Неопределено И КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|	И КорОрганизация <> Организация
	|	И ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|";
	 
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	// СторнированиеРасходовУУ
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "Истина");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтатьяРасходов", "СтатьяРасходовСписания");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Сумма", "-(" + ТекстСумма + ")");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаУпр", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаРегл", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостояннаяРазница", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВременнаяРазница", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ХозяйственнаяОперация",
		"ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторнированиеРасходовУУ)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РежимЗакрытияМесяца", "&РежимЗакрытияМесяца");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаБезНДС", "
	|ВЫБОР
	|	КОГДА НЕ ВариантРаспределенияРасходовУпр В (
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы))
	|		ТОГДА -Знак * (" + ТекстСуммаБезНДС + ")
	|	ИНАЧЕ
	|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "СуммаБезНДС") + " 
	|КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы + "КорСторнированиеРасходовУУ", УсловиеГДЕКор);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы + "КорСторнированиеРасходовУУ", ИмяРегистра);
	
	// РегистрацияРасходовУУ
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "Истина");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Организация", "КорОрганизация");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтатьяРасходов", "СтатьяРасходовСписания");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Сумма", ТекстСумма);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаУпр", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаРегл", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостояннаяРазница", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВременнаяРазница", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РежимЗакрытияМесяца", "&РежимЗакрытияМесяца");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаБезНДС", "
	|ВЫБОР
	|	КОГДА НЕ ВариантРаспределенияРасходовУпр В (
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы))
	|		ТОГДА Знак * (" + ТекстСуммаБезНДС + ")
	|	ИНАЧЕ
	|		" + РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьЗначениеПоляЗапроса(ТаблицаОписанияПолей, "СуммаБезНДС") + " 
	|КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ХозяйственнаяОперация",
		"ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РегистрацияРасходовУУ)");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы + "КорРегистрацияРасходовУУ", УсловиеГДЕКор);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы + "КорРегистрацияРасходовУУ", ИмяРегистра);
	
	
	// Добавим движения по регистру "Активы и пассивы".
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, Подразделение, НаправлениеДеятельности";
	
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	// Заполним дополнительные свойства движения
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "ИСТИНА");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Статья", "ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПрибылиИУбытки)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Аналитика", "Организация");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Сумма", "Знак * (" + ТекстСумма + ")");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы + "ПрочиеАктивыПассивы_Приход", УсловиеГДЕКор);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы + "ПрочиеАктивыПассивы_Приход", ИмяРегистра);
	
	// Добавим движение и заполним его основные свойства
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	// Заполним дополнительные свойства движения
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "ЛОЖЬ");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Организация", "КорОрганизация");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Статья", "ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПрибылиИУбытки)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Аналитика", "КорОрганизация");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Сумма", "Знак * (" + ТекстСумма + ")");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы + "ПрочиеАктивыПассивы_Расход", УсловиеГДЕКор);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы + "ПрочиеАктивыПассивы_Расход", ИмяРегистра);
	
КонецПроцедуры

Процедура СформироватьДвиженияПрочиеДоходыВУпрУчетеЗапросом(ПараметрыРасчета, ИмяВременнойТаблицы, СоответствиеВременныхТаблицДвижений, УсловиеГДЕ,
			ТекстСумма, ТекстСуммаУпр)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеДоходы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, Подразделение, СтатьяДоходов, АналитикаДоходов, ХозяйственнаяОперация, Сторно,
	|НастройкаХозяйственнойОперации, ИдентификаторФинЗаписи, ДокументРасчета";
	
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	СтруктураПараметров = Новый Структура();
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	// Заполним дополнительные свойства движения
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "ИСТИНА");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтатьяДоходов", "СтатьяДоходовУпр");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаДоходов", "АналитикаДоходовУпр");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НаправлениеДеятельности", "КорНаправлениеДеятельности");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Сумма", ТекстСумма);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаУпр", ТекстСуммаУпр);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РежимЗакрытияМесяца", "&РежимЗакрытияМесяца");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГДЕ, СтруктураПараметров);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

Процедура СформироватьДвиженияПрочиеДоходыЗапросом(ПараметрыРасчета, ИмяВременнойТаблицы, СоответствиеВременныхТаблицДвижений, УсловиеГДЕ,
			ТекстСумма, ТекстСуммаРегл, ТекстСуммаУпр)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеДоходы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, Подразделение, СтатьяДоходов, АналитикаДоходов, ХозяйственнаяОперация, Сторно,
	|НастройкаХозяйственнойОперации, ИдентификаторФинЗаписи, ДокументРасчета";
	
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	СтруктураПараметров = Новый Структура();
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	// Заполним дополнительные свойства движения
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "ИСТИНА");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НаправлениеДеятельности", "КорНаправлениеДеятельности");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Сумма", ТекстСумма);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаУпр", ТекстСуммаУпр);
	Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходовРегл Тогда
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаРегл", ТекстСуммаРегл);
	КонецЕсли;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РежимЗакрытияМесяца", "&РежимЗакрытияМесяца");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГДЕ, СтруктураПараметров);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
		
	// Отражение списания резервов под обесценение запасов.
	ИмяВременнойТаблицыРезервы = ИмяВременнойТаблицы + "Резервы";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ХозяйственнаяОперация", 
		"ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРезервовПодОбесценениеЗапасов)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НастройкаХозяйственнойОперации", 
		"ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеРезервовПодОбесценениеЗапасов)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Сумма", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаУпр", "-РезервПодОбесценениеУпр");
	Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходовРегл Тогда
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаРегл", "-РезервПодОбесценениеРегл");
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицыРезервы, УсловиеГДЕ, СтруктураПараметров);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицыРезервы, ИмяРегистра);
	
КонецПроцедуры

//++ НЕ УТ

// Этап 3.15
Процедура СкорректироватьСтоимостьСписанияНезавершенногоПроизводства22(ПараметрыРасчета)
	
	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьСписанияНезавершенногоПроизводства");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	#Область Выпуски
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов, 
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС
	|ПОМЕСТИТЬ
	|	Выпуски
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И ДД.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение))
	|	И НЕ ДД.Сторно
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|";
	#КонецОбласти
	
	#Область ВтТаблицаКорректировки
	Запрос.Текст = Запрос.Текст + "
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
	//++ Устарело_Производство21
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Движения.Регистратор) = ТИП(Документ.ВыпускПродукции)
	|			ТОГДА ВЫРАЗИТЬ(Движения.Регистратор КАК Документ.ВыпускПродукции).Дата
	|		ИНАЧЕ
	//-- Устарело_Производство21 
	|			Движения.Период
	//++ Устарело_Производство21
	|	КОНЕЦ
	//-- Устарело_Производство21
	|	КАК Период,
	|	Движения.ВидДвижения КАК ВидДвижения,
	|	Движения.Регистратор КАК ДокументДвижения,
	|	Движения.Организация КАК Организация,
	|	Движения.ПартияПроизводства КАК ПартияПроизводства,
	// для приходов стоимость формируется без учета партий, аналитик учета партий, групп продукции, статьи калькуляции, правила отнесения,
	// а для расходов - в разрезе этих полей
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|		ИНАЧЕ 
	|			Движения.ДокументВыпуска
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ 
	|			Движения.АналитикаПартииВыпуска
	|	КОНЕЦ КАК АналитикаУчетаПартий,
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|		ИНАЧЕ 
	|			Движения.СтатьяКалькуляции
	|	КОНЕЦ КАК СтатьяКалькуляцииСтоимости,
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ 
	|			Движения.ГруппаПродукции
	|	КОНЕЦ КАК ГруппаПродукцииСтоимости,
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка)
	|		ИНАЧЕ 
	|			Движения.ПравилоОтнесенияНаВыпуск
	|	КОНЕЦ КАК ПравилоОтнесенияНаВыпускСтоимости,
	|	Движения.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Движения.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 0
	|		ИНАЧЕ
	|			Движения.КодСтрокиПродукция
	|	КОНЕЦ КАК КодСтрокиПродукцияДляСтоимости,
	|	Движения.Этап КАК Этап,
	|	Движения.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям ТОГДА Движения.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаПродукцииБезНазначения.КлючАналитики КОНЕЦ) КАК АналитикаУчетаПродукции,
	|	Движения.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|	Движения.РазделУчета КАК РазделУчета,
	|	Движения.ВидЗапасов КАК ВидЗапасов,
	|	Движения.ВидЗапасов.ТипЗапасов КАК ТипЗапасов,
	|	Движения.АналитикаУчетаПродукции.Назначение КАК Назначение,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) КАК ХозяйственнаяОперация,
	|	Движения.Подразделение КАК Подразделение,
	// для приходов выбирается исходное подразделение расхода, а для расходов - подразделение, на которое расход отнесен
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Распределение.Подразделение
	|		ИНАЧЕ Движения.Подразделение
	|	КОНЕЦ КАК ПодразделениеСтоимости,
	|	Движения.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Движения.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	Движения.АналитикаРасходов КАК АналитикаРасходов,
	|	Движения.СтатьяРасходов КАК СтатьяРасходов,
	|	ВЫБОР 
	|		КОГДА Распределение.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ВтОВЗ.ВариантРаспределенияРасходовНУ
	|		ИНАЧЕ Движения.СтатьяРасходов.ВариантРаспределенияРасходовНУ
	|	КОНЕЦ =	ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности) КАК КосвенныеЗатратыНУ,
	|	Движения.СтатьяРасходов.ПринятиеКНалоговомуУчету КАК ПринимаемыеВНУ,
	|	Движения.Продукция КАК Продукция,
	|	Движения.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	Движения.ГруппаПродукции КАК ГруппаПродукции,
	|	Движения.ВидДеятельностиНДС,
	|	ВЫБОР 
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|	КОНЕЦ КАК РазделУчетаСтоимости,
	|	Движения.ДокументВыпуска КАК ДокументВыпуска,
	|	Движения.АналитикаПартииВыпуска КАК АналитикаПартииВыпуска,
	|	Движения.ПравилоОтнесенияНаВыпуск КАК ПравилоОтнесенияНаВыпуск,
	// для приходов количество это ПоказательОтнесенияНаПартию, а для расходов - ПоказательОтнесенияНаВыпуск
	|	СУММА(Движения.ДоляСтоимости) КАК ДоляСтоимости,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Движения.ПоказательОтнесенияНаПартию
	|		ИНАЧЕ Движения.ПоказательОтнесенияНаВыпуск
	|	КОНЕЦ КАК ЧИСЛО(28,10))) КАК Количество,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Движения.ПоказательОтнесенияНаПартиюБезНДС
	|		ИНАЧЕ Движения.ПоказательОтнесенияНаВыпускБезНДС
	|	КОНЕЦ КАК ЧИСЛО(28,10))) КАК КоличествоБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Движения.ПоказательОтнесенияНаПартиюРегл
	|		ИНАЧЕ Движения.ПоказательОтнесенияНаВыпускРегл
	|	КОНЕЦ КАК ЧИСЛО(28,10))) КАК КоличествоРегл,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Движения.ПоказательОтнесенияНаПартиюУпр
	|		ИНАЧЕ Движения.ПоказательОтнесенияНаВыпускУпр
	|	КОНЕЦ КАК ЧИСЛО(28,10))) КАК КоличествоУпр
	|ПОМЕСТИТЬ ВтТаблицаКорректировкиБезИдентификаторов
	|ИЗ
	|	втПрочиеРасходыНезавершенногоПроизводства КАК Движения
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Распределение
	|		ПО Движения.Регистратор = Распределение.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО Аналитика.Ссылка = Движения.АналитикаУчетаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПродукцииБезНазначения
	|		ПО НЕ &УчитыватьСебестоимостьТоваровПоНазначениям
	|		И АналитикаПродукцииБезНазначения.Номенклатура = Аналитика.Номенклатура
	|		И АналитикаПродукцииБезНазначения.Характеристика = Аналитика.Характеристика
	|		И АналитикаПродукцииБезНазначения.Серия = Аналитика.Серия
	|		И АналитикаПродукцииБезНазначения.МестоХранения = Аналитика.МестоХранения
	|		И АналитикаПродукцииБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И АналитикаПродукцииБезНазначения.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтОВЗ КАК ВтОВЗ
	|		ПО Движения.АналитикаРасходов = ВтОВЗ.ОВЗ
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РассчитанныеДокументы КАК РассчитанныеДокументы
	|		ПО РассчитанныеДокументы.Период = Движения.Период
	|		И РассчитанныеДокументы.Регистратор = Движения.Регистратор
	|		И &РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие)
	|ГДЕ
	|	Движения.Организация В (&МассивОрганизаций)
	// При предварительном расчете исключаем документы, для которых сохранены ранее рассчитанные движения
	|	И РассчитанныеДокументы.Регистратор ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	//++ Устарело_Производство21
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Движения.Регистратор) = ТИП(Документ.ВыпускПродукции)
	|			ТОГДА ВЫРАЗИТЬ(Движения.Регистратор КАК Документ.ВыпускПродукции).Дата
	|		ИНАЧЕ
	//-- Устарело_Производство21 
	|			Движения.Период
	//++ Устарело_Производство21
	|	КОНЕЦ
	//-- Устарело_Производство21
	|	,
	|	Движения.СтатьяРасходов,
	|	ВЫБОР 
	|		КОГДА Распределение.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ВтОВЗ.ВариантРаспределенияРасходовНУ
	|		ИНАЧЕ Движения.СтатьяРасходов.ВариантРаспределенияРасходовНУ
	|	КОНЕЦ =	ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности),
	|	Движения.СтатьяРасходов.ПринятиеКНалоговомуУчету,
	|	Движения.АналитикаРасходов,
	|	Движения.НаправлениеДеятельности,
	|	Движения.КорНаправлениеДеятельности,
	|	Распределение.Подразделение,
	|	Движения.ВидДвижения,
	|	Движения.ВидДеятельностиНДС,
	|	Движения.Регистратор,
	|	Движения.Подразделение,
	|	Движения.ПартияПроизводства,
	|	Движения.ЗаказНаПроизводство,
	|	Движения.КодСтрокиПродукция,
	|	Движения.Этап,
	|	Движения.СтатьяКалькуляции,
	|	Движения.ВидЗапасов,
	|	Движения.ВидЗапасов.ТипЗапасов,
	|	Движения.АналитикаУчетаПродукции.Назначение,
	|	Движения.РазделУчета,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям ТОГДА Движения.АналитикаУчетаПродукции
	|		ИНАЧЕ АналитикаПродукцииБезНазначения.КлючАналитики КОНЕЦ),
	|	Движения.КорАналитикаУчетаПартий,
	|	Движения.Продукция,
	|	Движения.ХарактеристикаПродукции,
	|	Движения.ГруппаПродукции,
	|	Движения.Организация,
	|	Движения.Регистратор,
	|	Движения.ДокументИсточник,
	|	Движения.ДокументВыпуска,
	|	Движения.АналитикаПартииВыпуска,
	|	Движения.ПравилоОтнесенияНаВыпуск,
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ 
	|			Движения.ДокументВыпуска
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ 
	|			Движения.АналитикаПартииВыпуска
	|	КОНЕЦ,
	|	ВЫБОР 
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|		ИНАЧЕ 
	|			Движения.СтатьяКалькуляции
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ 
	|			Движения.ГруппаПродукции
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка)
	|		ИНАЧЕ 
	|			Движения.ПравилоОтнесенияНаВыпуск
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументДвижения,
	|	ПартияПроизводства,
	|	СтатьяРасходов,
	|	Подразделение
	|;
	|
	|ВЫБРАТЬ
	|	Т.Период КАК Период,
	|	Т.ВидДвижения КАК ВидДвижения,
	|	Т.ДокументДвижения КАК ДокументДвижения,
	|	Т.Организация КАК Организация,
	|	Т.ПартияПроизводства КАК ПартияПроизводства,
	|	Т.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Т.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|	Т.Этап КАК Этап,
	|	Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Т.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|	Т.Продукция КАК Продукция,
	|	Т.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.ГруппаПродукции КАК ГруппаПродукции,
	|	Т.ПравилоОтнесенияНаВыпуск КАК ПравилоОтнесенияНаВыпуск,
	|	Т.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	МАКСИМУМ(Т.ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи
	|ПОМЕСТИТЬ ИдентификаторыПоПолямТаблицыКорректировки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИСТИНА КАК НовоеДвижение,
	|		Т.Период КАК Период,
	|		Т.ВидДвижения КАК ВидДвижения,
	|		Т.ДокументДвижения КАК ДокументДвижения,
	|		Т.Организация КАК Организация,
	|		Т.ПартияПроизводства КАК ПартияПроизводства,
	|		Т.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|		Т.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.Этап) = ТИП(Справочник.ЭтапыПроизводства)
	|			ТОГДА Т.Этап
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка)
	|		КОНЕЦ КАК Этап,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.СтатьяКалькуляции) = ТИП(Справочник.СтатьиКалькуляции)
	|			ТОГДА Т.СтатьяКалькуляции
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|		КОНЕЦ КАК СтатьяКалькуляции,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.АналитикаУчетаПродукции) = ТИП(Справочник.КлючиАналитикиУчетаНоменклатуры)
	|			ТОГДА Т.АналитикаУчетаПродукции
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		КОНЕЦ КАК АналитикаУчетаПродукции,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.Продукция) = ТИП(Справочник.Номенклатура)
	|			ТОГДА Т.Продукция
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		КОНЕЦ КАК Продукция,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.ХарактеристикаПродукции) = ТИП(Справочник.ХарактеристикиНоменклатуры)
	|			ТОГДА Т.ХарактеристикаПродукции
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		КОНЕЦ КАК ХарактеристикаПродукции,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.РазделУчета) = ТИП(Перечисление.РазделыУчетаСебестоимостиТоваров)
	|			ТОГДА Т.РазделУчета
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|		КОНЕЦ КАК РазделУчета,
	|		Т.Подразделение КАК Подразделение,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.НаправлениеДеятельности) = ТИП(Справочник.НаправленияДеятельности)
	|			ТОГДА Т.НаправлениеДеятельности
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|		КОНЕЦ КАК НаправлениеДеятельности,
	|		Т.АналитикаРасходов КАК АналитикаРасходов,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА Т.СтатьяРасходов
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		КОНЕЦ КАК СтатьяРасходов,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.ГруппаПродукции) = ТИП(Справочник.ГруппыАналитическогоУчетаНоменклатуры)
	|			ТОГДА Т.ГруппаПродукции
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|		КОНЕЦ КАК ГруппаПродукции,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.ПравилоОтнесенияНаВыпуск) = ТИП(Перечисление.ПравилаОтнесенияНаВыпуск)
	|			ТОГДА Т.ПравилоОтнесенияНаВыпуск
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка)
	|		КОНЕЦ КАК ПравилоОтнесенияНаВыпуск,
	|		ЕСТьNULL(НастройкиХозОпераций.Ссылка, ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)) КАК НастройкаХозяйственнойОперации,
	|		Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		"""" КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		ВтТаблицаКорректировкиБезИдентификаторов КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозОпераций
	|			ПО НастройкиХозОпераций.ХозяйственнаяОперация = Т.ХозяйственнаяОперация
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЛОЖЬ КАК НовоеДвижение,
	|		Т.Период КАК Период,
	|		Т.ВидДвижения КАК ВидДвижения,
	|		Т.Регистратор КАК ДокументДвижения,
	|		Т.Организация КАК Организация,
	|		Т.ПартияПроизводства КАК ПартияПроизводства,
	|		Т.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|		Т.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|		Т.Этап КАК Этап,
	|		Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|		Т.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|		Т.Продукция КАК Продукция,
	|		Т.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|		Т.РазделУчета КАК РазделУчета,
	|		Т.Подразделение КАК Подразделение,
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.Регистратор) <> ТИП(Документ.РаспределениеПрочихЗатрат)
	|			ТОГДА Т.НаправлениеДеятельности
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|		КОНЕЦ КАК НаправлениеДеятельности,
	|		Т.АналитикаРасходов КАК АналитикаРасходов,
	|		Т.СтатьяРасходов КАК СтатьяРасходов,
	|		Т.ГруппаПродукции КАК ГруппаПродукции,
	|		Т.ПравилоОтнесенияНаВыпуск КАК ПравилоОтнесенияНаВыпуск,
	|		Т.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|		Т.НастройкаХозяйственнойОперации.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Т.ИдентификаторФинЗаписи ИдентификаторФинЗаписи
	|	ИЗ
	|		РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК Т
	|	ГДЕ
	|		Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Т.Организация В (&МассивОрганизаций)
	|		И Т.Активность
	|) КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Период,
	|	Т.ВидДвижения,
	|	Т.ДокументДвижения,
	|	Т.Организация,
	|	Т.ПартияПроизводства,
	|	Т.ЗаказНаПроизводство,
	|	Т.КодСтрокиПродукция,
	|	Т.Этап,
	|	Т.СтатьяКалькуляции,
	|	Т.АналитикаУчетаПродукции,
	|	Т.Продукция,
	|	Т.ХарактеристикаПродукции,
	|	Т.РазделУчета,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.АналитикаРасходов,
	|	Т.СтатьяРасходов,
	|	Т.ГруппаПродукции,
	|	Т.ПравилоОтнесенияНаВыпуск,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ХозяйственнаяОперация
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Т.НовоеДвижение) = ИСТИНА
	|	И МАКСИМУМ(Т.ИдентификаторФинЗаписи) <> """"
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументДвижения,
	|	ПартияПроизводства,
	|	СтатьяРасходов,
	|	Подразделение
	|;
	|
	|ВЫБРАТЬ
	|	Т.НомерЗаписи,
	|	Т.Период,
	|	Т.ВидДвижения,
	|	Т.ДокументДвижения,
	|	Т.Организация КАК Организация,
	|	Т.ПартияПроизводства,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.СтатьяКалькуляцииСтоимости,
	|	Т.ГруппаПродукцииСтоимости,
	|	Т.ПравилоОтнесенияНаВыпускСтоимости,
	|	Т.ЗаказНаПроизводство,
	|	Т.КодСтрокиПродукция,
	|	Т.КодСтрокиПродукцияДляСтоимости,
	|	Т.Этап,
	|	Т.СтатьяКалькуляции,
	|	Т.АналитикаУчетаПродукции,
	|	Т.КорАналитикаУчетаПартий,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.ТипЗапасов,
	|	Т.Назначение,
	|	Т.ХозяйственнаяОперация,
	|	Т.Подразделение,
	|	Т.ПодразделениеСтоимости КАК ПодразделениеСтоимости,
	|	Т.НаправлениеДеятельности,
	|	Т.КорНаправлениеДеятельности,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.КосвенныеЗатратыНУ,
	|	Т.ПринимаемыеВНУ,
	|	Т.Продукция,
	|	Т.ХарактеристикаПродукции,
	|	Т.ГруппаПродукции,
	|	Т.ВидДеятельностиНДС,
	|	Т.РазделУчетаСтоимости,
	|	Т.ДокументВыпуска,
	|	Т.АналитикаПартииВыпуска,
	|	Т.ПравилоОтнесенияНаВыпуск,
	|	Т.ДоляСтоимости,
	|	Т.Количество,
	|	Т.КоличествоБезНДС,
	|	Т.КоличествоРегл,
	|	Т.КоличествоУпр,
	|	ЕСТЬNULL(Идентификаторы.ИдентификаторФинЗаписи, """") КАК ИдентификаторФинЗаписи
	|ПОМЕСТИТЬ ВтТаблицаКорректировки
	|ИЗ
	|	ВтТаблицаКорректировкиБезИдентификаторов КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ИдентификаторыПоПолямТаблицыКорректировки КАК Идентификаторы
	|		 ПО Т.Период = Идентификаторы.Период
	|		 И Т.ВидДвижения = Идентификаторы.ВидДвижения
	|		 И Т.ДокументДвижения = Идентификаторы.ДокументДвижения
	|		 И Т.Организация = Идентификаторы.Организация
	|		 И Т.ПартияПроизводства = Идентификаторы.ПартияПроизводства
	|		 И Т.ЗаказНаПроизводство = Идентификаторы.ЗаказНаПроизводство
	|		 И Т.КодСтрокиПродукция = Идентификаторы.КодСтрокиПродукция
	|		 И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.Этап) = ТИП(Справочник.ЭтапыПроизводства)
	|			ТОГДА Т.Этап
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка)
	|		  КОНЕЦ = Идентификаторы.Этап
	|		 И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.СтатьяКалькуляции) = ТИП(Справочник.СтатьиКалькуляции)
	|			ТОГДА Т.СтатьяКалькуляции
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|		  КОНЕЦ = Идентификаторы.СтатьяКалькуляции
	|		 И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.АналитикаУчетаПродукции) = ТИП(Справочник.КлючиАналитикиУчетаНоменклатуры)
	|			ТОГДА Т.АналитикаУчетаПродукции
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		  КОНЕЦ = Идентификаторы.АналитикаУчетаПродукции
	|		 И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.Продукция) = ТИП(Справочник.Номенклатура)
	|			ТОГДА Т.Продукция
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		  КОНЕЦ = Идентификаторы.Продукция
	|		 И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.ХарактеристикаПродукции) = ТИП(Справочник.ХарактеристикиНоменклатуры)
	|			ТОГДА Т.ХарактеристикаПродукции
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		  КОНЕЦ = Идентификаторы.ХарактеристикаПродукции
	|		 И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.РазделУчета) = ТИП(Перечисление.РазделыУчетаСебестоимостиТоваров)
	|			ТОГДА Т.РазделУчета
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|		  КОНЕЦ = Идентификаторы.РазделУчета
	|		 И Т.Подразделение = Идентификаторы.Подразделение
	|		 И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.НаправлениеДеятельности) = ТИП(Справочник.НаправленияДеятельности)
	|			ТОГДА Т.НаправлениеДеятельности
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|		  КОНЕЦ = Идентификаторы.НаправлениеДеятельности
	|		 И Т.АналитикаРасходов = Идентификаторы.АналитикаРасходов
	|		 И Т.СтатьяРасходов = Идентификаторы.СтатьяРасходов
	|		 И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.ГруппаПродукции) = ТИП(Справочник.ГруппыАналитическогоУчетаНоменклатуры)
	|			ТОГДА Т.ГруппаПродукции
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|		  КОНЕЦ = Идентификаторы.ГруппаПродукции
	|		 И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.ПравилоОтнесенияНаВыпуск) = ТИП(Перечисление.ПравилаОтнесенияНаВыпуск)
	|			ТОГДА Т.ПравилоОтнесенияНаВыпуск
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка)
	|		  КОНЕЦ = Идентификаторы.ПравилоОтнесенияНаВыпуск
	|		 И Т.ХозяйственнаяОперация = Идентификаторы.ХозяйственнаяОперация
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ПодразделениеСтоимости,
	|	СтатьяРасходов,
	|	АналитикаРасходов
	|;
	|
	|ВЫБРАТЬ
	|	Т.НомерЗаписи
	|ИЗ
	|	ВтТаблицаКорректировки КАК Т
	|ГДЕ
	|	Т.ИдентификаторФинЗаписи = """"
	|";
	#КонецОбласти
	
	ТаблицаИдентификаторов = Новый ТаблицаЗначений;
	ТаблицаИдентификаторов.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТаблицаИдентификаторов.Колонки.Добавить("НомерЗаписи", ОбщегоНазначения.ОписаниеТипаЧисло(31));
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаИдентификаторов.Добавить();
		НоваяСтрока.Идентификатор = Новый УникальныйИдентификатор;
		НоваяСтрока.НомерЗаписи = Выборка.НомерЗаписи;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаИдентификаторов", ТаблицаИдентификаторов);
	
	#Область ВтТаблицаКорректировкиВрем
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаИдентификаторов.Идентификатор КАК Идентификатор,
	|	ТаблицаИдентификаторов.НомерЗаписи КАК НомерЗаписи
	|ПОМЕСТИТЬ ТаблицаИдентификаторов
	|ИЗ
	|	&ТаблицаИдентификаторов КАК ТаблицаИдентификаторов
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерЗаписи
	|;
	|ВЫБРАТЬ
	|	ТаблицаКорректировки.Период КАК Период,
	|	ТаблицаКорректировки.ВидДвижения КАК ВидДвижения,
	|	ТаблицаКорректировки.ДокументДвижения КАК ДокументДвижения,
	|	ТаблицаКорректировки.Организация КАК Организация,
	|	ТаблицаКорректировки.ПартияПроизводства КАК ПартияПроизводства,
	|	ТаблицаКорректировки.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ТаблицаКорректировки.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|	ТаблицаКорректировки.Этап КАК Этап,
	|	ТаблицаКорректировки.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ТаблицаКорректировки.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|	ТаблицаКорректировки.АналитикаУчетаПродукции КАК АналитикаУчетаПродукцииСебестоимость,
	|	ТаблицаКорректировки.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|	ТаблицаКорректировки.Продукция КАК Продукция,
	|	ТаблицаКорректировки.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	ТаблицаКорректировки.РазделУчета КАК РазделУчета,
	|	ЕСТЬNULL(Выпуски.ВидЗапасов, ТаблицаКорректировки.ВидЗапасов) КАК ВидЗапасов,
	|	ЕСТЬNULL(Выпуски.Партия, НЕОПРЕДЕЛЕНО) КАК Партия,
	|	ЕСТЬNULL(Выпуски.АналитикаУчетаПартий, НЕОПРЕДЕЛЕНО) КАК АналитикаУчетаПартий,
	|	ЕСТЬNULL(Выпуски.АналитикаФинансовогоУчета, НЕОПРЕДЕЛЕНО) КАК АналитикаФинансовогоУчета,
	|	ЕСТЬNULL(Выпуски.ВидДеятельностиНДС, НЕОПРЕДЕЛЕНО) КАК ВидДеятельностиНДС,
	|	ЕСТЬNULL(ТаблицаКорректировки.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) КАК ТипЗапасов,
	|	ТаблицаКорректировки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТаблицаКорректировки.Подразделение КАК Подразделение,
	|	ТаблицаКорректировки.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаКорректировки.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ТаблицаКорректировки.АналитикаРасходов КАК АналитикаРасходов,
	|	ТаблицаКорректировки.СтатьяРасходов КАК СтатьяРасходов,
	|	ТаблицаКорректировки.ГруппаПродукции КАК ГруппаПродукции,
	|	ТаблицаКорректировки.ПодразделениеСтоимости КАК ИсходноеПодразделение,
	|	ТаблицаКорректировки.Подразделение КАК КорПодразделение,
	|	ТаблицаКорректировки.АналитикаПартииВыпуска КАК АналитикаПартииВыпуска,
	|	ТаблицаКорректировки.ДокументВыпуска КАК ДокументВыпуска,
	|	ТаблицаКорректировки.ПравилоОтнесенияНаВыпуск КАК ПравилоОтнесенияНаВыпуск,
	|	ТаблицаКорректировки.ДоляСтоимости КАК ДоляСтоимости,
	|	ТаблицаКорректировки.Количество КАК Количество,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.Стоимость, 0) КАК ЧИСЛО(31,2)) КАК Стоимость,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоБезНДС
	|			* ЕСТЬNULL(Стоимости.СтоимостьБезНДС, 0) КАК ЧИСЛО(31,2)) КАК СтоимостьБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.СтоимостьДопРасходы, 0) КАК ЧИСЛО(31,2)) КАК ДопРасходы,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоБезНДС
	|			* ЕСТЬNULL(Стоимости.СтоимостьДопРасходыБезНДС, 0) КАК ЧИСЛО(31,2)) КАК ДопРасходыБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоРегл
	|			* ЕСТЬNULL(СтоимостиРегл.ПостояннаяРазница, 0) КАК ЧИСЛО(31,2)) КАК ПостояннаяРазница,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоРегл
	|			* ВЫБОР
	|			КОГДА ТаблицаКорректировки.КосвенныеЗатратыНУ И ТаблицаКорректировки.ПринимаемыеВНУ
	|				ТОГДА 0
	|				ИНАЧЕ ЕСТЬNULL(СтоимостиРегл.ВременнаяРазница, 0) КОНЕЦ
	|	КАК ЧИСЛО(31,2)) КАК ВременнаяРазница,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоРегл
	|			* ЕСТЬNULL(СтоимостиРегл.СтоимостьРегл, 0) КАК ЧИСЛО(31,2)) КАК СтоимостьРегл,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.СтоимостьЗабалансовая, 0) КАК ЧИСЛО(31,2)) 		КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.Трудозатраты, 0) КАК ЧИСЛО(31,2)) 					КАК Трудозатраты,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.ПостатейныеПостоянныеСНДС, 0) КАК ЧИСЛО(28,10)) 	КАК ПостатейныеПостоянныеСНДС,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоБезНДС
	|			* ЕСТЬNULL(Стоимости.ПостатейныеПостоянныеБезНДС, 0) КАК ЧИСЛО(28,10)) 	КАК ПостатейныеПостоянныеБезНДС,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.ПостатейныеПеременныеСНДС, 0) КАК ЧИСЛО(28,10)) 	КАК ПостатейныеПеременныеСНДС,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоБезНДС
	|			* ЕСТЬNULL(Стоимости.ПостатейныеПеременныеБезНДС, 0) КАК ЧИСЛО(28,10)) 	КАК ПостатейныеПеременныеБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоРегл
	|			* ЕСТЬNULL(СтоимостиРегл.СтоимостьЗабалансоваяРегл, 0) КАК ЧИСЛО(31,2)) КАК СтоимостьЗабалансоваяРегл,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоРегл
	|			* ЕСТЬNULL(СтоимостиРегл.ДопРасходыРегл, 0) КАК ЧИСЛО(31,2)) 			КАК ДопРасходыРегл,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоРегл
	|			* ЕСТЬNULL(СтоимостиРегл.ТрудозатратыРегл, 0) КАК ЧИСЛО(31,2)) 			КАК ТрудозатратыРегл,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоБезНДС
	|			* ЕСТЬNULL(Стоимости.ТрудозатратыБезНДС, 0) КАК ЧИСЛО(31,2)) 			КАК ТрудозатратыБезНДС,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоРегл
	|			* ЕСТЬNULL(СтоимостиРегл.ПостатейныеПостоянныеРегл, 0) КАК ЧИСЛО(28,10)) КАК ПостатейныеПостоянныеРегл,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоРегл
	|			* ЕСТЬNULL(СтоимостиРегл.ПостатейныеПеременныеРегл, 0) КАК ЧИСЛО(28,10)) КАК ПостатейныеПеременныеРегл,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоРегл
	|			* ЕСТЬNULL(СтоимостиРегл.РезервРегл, 0) КАК ЧИСЛО(31,2)) 				КАК РезервРегл,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоУпр
	|			* ЕСТЬNULL(СтоимостиРегл.СтоимостьУпр, 0) КАК ЧИСЛО(31,2))				КАК СтоимостьУпр,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоУпр
	|			* ЕСТЬNULL(СтоимостиРегл.ДопРасходыУпр, 0) КАК ЧИСЛО(31,2)) 			КАК ДопРасходыУпр,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоУпр
	|			* ЕСТЬNULL(СтоимостиРегл.ТрудозатратыУпр, 0) КАК ЧИСЛО(31,2)) 			КАК ТрудозатратыУпр,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоУпр
	|			* ЕСТЬNULL(СтоимостиРегл.ПостатейныеПостоянныеУпр, 0) КАК ЧИСЛО(28,10))	КАК ПостатейныеПостоянныеУпр,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоУпр
	|			* ЕСТЬNULL(СтоимостиРегл.ПостатейныеПеременныеУпр, 0) КАК ЧИСЛО(28,10))	КАК ПостатейныеПеременныеУпр,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоУпр
	|			* ЕСТЬNULL(СтоимостиРегл.РезервУпр, 0) КАК ЧИСЛО(31,2)) 				КАК РезервУпр,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаКорректировки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			И НЕ (ЕСТЬNULL(Стоимости.Стоимость, 0) = 0
	|					И ЕСТЬNULL(Стоимости.СтоимостьБезНДС, 0) = 0
	|					И ЕСТЬNULL(Стоимости.СтоимостьДопРасходы, 0) = 0
	|					И ЕСТЬNULL(Стоимости.СтоимостьДопРасходыБезНДС, 0) = 0
	|					И ЕСТЬNULL(Стоимости.Трудозатраты, 0) = 0
	|					И ЕСТЬNULL(Стоимости.ПостатейныеПостоянныеСНДС, 0) = 0
	|					И ЕСТЬNULL(Стоимости.ПостатейныеПостоянныеБезНДС, 0) = 0
	|					И ЕСТЬNULL(Стоимости.ПостатейныеПеременныеСНДС, 0) = 0
	|					И ЕСТЬNULL(Стоимости.ПостатейныеПеременныеБезНДС, 0) = 0
	|					И ЕСТЬNULL(Стоимости.ТрудозатратыБезНДС, 0) = 0
	|					И ЕСТЬNULL(СтоимостиРегл.СтоимостьУпр, 0) = 0
	|					И ЕСТЬNULL(СтоимостиРегл.ДопРасходыУпр, 0) = 0
	|					И ЕСТЬNULL(СтоимостиРегл.ТрудозатратыУпр, 0) = 0
	|					И ЕСТЬNULL(СтоимостиРегл.ПостатейныеПостоянныеУпр, 0) = 0
	|					И ЕСТЬNULL(СтоимостиРегл.ПостатейныеПеременныеУпр, 0) = 0
	|					И ЕСТЬNULL(СтоимостиРегл.ПостатейныеПеременныеРегл, 0) = 0
	|					И ЕСТЬNULL(СтоимостиРегл.ПостатейныеПостоянныеРегл, 0) = 0
	|					И ЕСТЬNULL(СтоимостиРегл.ТрудозатратыРегл, 0) = 0
	|					И ЕСТЬNULL(СтоимостиРегл.ДопРасходыРегл, 0) = 0
	|					И ЕСТЬNULL(СтоимостиРегл.ВременнаяРазница, 0) = 0
	|					И ЕСТЬNULL(СтоимостиРегл.ПостояннаяРазница, 0) = 0
	|					И ЕСТЬNULL(СтоимостиРегл.СтоимостьРегл, 0) = 0
	|					И ЕСТЬNULL(Стоимости.СтоимостьЗабалансовая, 0) = 0
	|					И ЕСТЬNULL(СтоимостиРегл.СтоимостьЗабалансоваяРегл, 0) = 0)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК ЕстьРасход,
	|	НастройкиХозОпераций.Ссылка КАК НастройкаХозяйственнойОперации,
	|	ЕСТЬNULL(ТаблицаИдентификаторов.Идентификатор, ТаблицаКорректировки.ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи
	|
	|ПОМЕСТИТЬ ВтТаблицаКорректировкиВрем
	|
	|ИЗ
	|	ВтТаблицаКорректировки КАК ТаблицаКорректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ Выпуски КАК Выпуски
	|		ПО Выпуски.Регистратор = ТаблицаКорректировки.ДокументДвижения
	|		И Выпуски.АналитикаУчетаНоменклатуры = ТаблицаКорректировки.АналитикаУчетаПродукции
	|		И Выпуски.РазделУчета = ТаблицаКорректировки.РазделУчета
	|		И Выпуски.АналитикаУчетаПартий = ТаблицаКорректировки.КорАналитикаУчетаПартий
	|		И Выпуски.ВидЗапасов = ТаблицаКорректировки.ВидЗапасов
	|		И (Выпуски.ВидДеятельностиНДС = ТаблицаКорректировки.ВидДеятельностиНДС
	|			ИЛИ ТаблицаКорректировки.ВидДеятельностиНДС = НЕОПРЕДЕЛЕНО)
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтСтоимостиНезавершенногоПроизводства КАК Стоимости
	|	ПО 
	|		ТаблицаКорректировки.Партия = Стоимости.Партия
	|		И ТаблицаКорректировки.АналитикаУчетаПартий = Стоимости.АналитикаУчетаПартий
	|		И ТаблицаКорректировки.СтатьяРасходов = Стоимости.СтатьяРасходов
	|		И ТаблицаКорректировки.АналитикаРасходов = Стоимости.АналитикаРасходов
	|		И ТаблицаКорректировки.ПодразделениеСтоимости = Стоимости.Подразделение
	|		И ТаблицаКорректировки.Этап = Стоимости.Этап
	|		И ТаблицаКорректировки.Организация = Стоимости.Организация
	|		И ТаблицаКорректировки.НаправлениеДеятельности = Стоимости.НаправлениеДеятельности
	|		И ТаблицаКорректировки.СтатьяКалькуляцииСтоимости = Стоимости.СтатьяКалькуляции
	|		И ТаблицаКорректировки.ГруппаПродукцииСтоимости = Стоимости.ГруппаПродукции
	|		И ТаблицаКорректировки.ПравилоОтнесенияНаВыпускСтоимости = Стоимости.ПравилоОтнесенияНаВыпуск
	|		И ТаблицаКорректировки.КодСтрокиПродукцияДляСтоимости = Стоимости.КодСтрокиПродукция
	|		И ТаблицаКорректировки.РазделУчетаСтоимости = Стоимости.РазделУчета
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтСтоимостиНезавершенногоПроизводстваРегл КАК СтоимостиРегл
	|	ПО 
	|		ТаблицаКорректировки.Партия = СтоимостиРегл.Партия
	|		И ТаблицаКорректировки.АналитикаУчетаПартий = СтоимостиРегл.АналитикаУчетаПартий
	|		И ТаблицаКорректировки.СтатьяРасходов = СтоимостиРегл.СтатьяРасходов
	|		И ТаблицаКорректировки.АналитикаРасходов = СтоимостиРегл.АналитикаРасходов
	|		И ТаблицаКорректировки.ПодразделениеСтоимости = СтоимостиРегл.Подразделение
	|		И ТаблицаКорректировки.Этап = СтоимостиРегл.Этап
	|		И ТаблицаКорректировки.Организация = СтоимостиРегл.Организация
	|		И ТаблицаКорректировки.НаправлениеДеятельности = СтоимостиРегл.НаправлениеДеятельности
	|		И ТаблицаКорректировки.СтатьяКалькуляцииСтоимости = СтоимостиРегл.СтатьяКалькуляции
	|		И ТаблицаКорректировки.ГруппаПродукцииСтоимости = СтоимостиРегл.ГруппаПродукции
	|		И ТаблицаКорректировки.ПравилоОтнесенияНаВыпускСтоимости = СтоимостиРегл.ПравилоОтнесенияНаВыпуск
	|		И ТаблицаКорректировки.КодСтрокиПродукцияДляСтоимости = СтоимостиРегл.КодСтрокиПродукция
	|		И ТаблицаКорректировки.РазделУчетаСтоимости = СтоимостиРегл.РазделУчета
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.Назначения КАК СпрНазначения
	|	ПО
	|		ТаблицаКорректировки.Назначение = СпрНазначения.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИдентификаторов КАК ТаблицаИдентификаторов
	|		ПО ТаблицаИдентификаторов.НомерЗаписи = ТаблицаКорректировки.НомерЗаписи
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозОпераций
	|		ПО НастройкиХозОпераций.ХозяйственнаяОперация = ТаблицаКорректировки.ХозяйственнаяОперация
	|ГДЕ
	|	ТаблицаКорректировки.Количество <> 0
	|	ИЛИ ТаблицаКорректировки.КоличествоБезНДС <> 0	
	|	ИЛИ ТаблицаКорректировки.КоличествоРегл <> 0	
	|	ИЛИ ТаблицаКорректировки.КоличествоУпр <> 0	
	|;";
	#КонецОбласти
	
	#Область ПогрешностиПеремещения
	Запрос.Текст = Запрос.Текст + "
	|ВЫБРАТЬ
	|	ТаблицаКорректировки.Период,
	|	ТаблицаКорректировки.Организация,
	|	ТаблицаКорректировки.АналитикаУчетаПродукцииСебестоимость,
	|	ТаблицаКорректировки.РазделУчета,
	|	ТаблицаКорректировки.ВидЗапасов,
	|	ТаблицаКорректировки.Партия,
	|	ТаблицаКорректировки.АналитикаУчетаПартий,
	|	ТаблицаКорректировки.АналитикаФинансовогоУчета,
	|	ТаблицаКорректировки.ВидДеятельностиНДС,
	|	СУММА(ТаблицаКорректировки.Количество),
	|	ВЫРАЗИТЬ(СУММА(ТаблицаКорректировки.ПостатейныеПостоянныеСНДС
	|	   	- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПостоянныеСНДС КАК ЧИСЛО(31,2))) КАК ЧИСЛО(31, 2))  КАК ПостатейныеПостоянныеСНДС,
	|	ВЫРАЗИТЬ(СУММА(ТаблицаКорректировки.ПостатейныеПостоянныеБезНДС
	|	   	- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПостоянныеБезНДС КАК ЧИСЛО(31,2))) КАК ЧИСЛО(31, 2))  КАК ПостатейныеПостоянныеБезНДС,
	|	ВЫРАЗИТЬ(СУММА(ТаблицаКорректировки.ПостатейныеПеременныеСНДС
	|	   	- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПеременныеСНДС КАК ЧИСЛО(31,2))) КАК ЧИСЛО(31, 2))  КАК ПостатейныеПеременныеСНДС,
	|	ВЫРАЗИТЬ(СУММА(ТаблицаКорректировки.ПостатейныеПеременныеБезНДС
	|	   	- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПеременныеБезНДС КАК ЧИСЛО(31,2))) КАК ЧИСЛО(31, 2))  КАК ПостатейныеПеременныеБезНДС,
	|	ВЫРАЗИТЬ(СУММА(ТаблицаКорректировки.ПостатейныеПостоянныеРегл
	|	   	- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПостоянныеРегл КАК ЧИСЛО(31,2))) КАК ЧИСЛО(31, 2))  КАК ПостатейныеПостоянныеРегл,
	|	ВЫРАЗИТЬ(СУММА(ТаблицаКорректировки.ПостатейныеПеременныеРегл
	|	   	- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПеременныеРегл КАК ЧИСЛО(31,2))) КАК ЧИСЛО(31, 2))  КАК ПостатейныеПеременныеРегл,
	|	ВЫРАЗИТЬ(СУММА(ТаблицаКорректировки.ПостатейныеПостоянныеУпр
	|	   	- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПостоянныеУпр КАК ЧИСЛО(31,2))) КАК ЧИСЛО(31, 2))  КАК ПостатейныеПостоянныеУпр,
	|	ВЫРАЗИТЬ(СУММА(ТаблицаКорректировки.ПостатейныеПеременныеУпр
	|	   	- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПеременныеУпр КАК ЧИСЛО(31,2))) КАК ЧИСЛО(31, 2))  КАК ПостатейныеПеременныеУпр
	|ПОМЕСТИТЬ ПогрешностиОкругления
	|ИЗ
	|	ВтТаблицаКорректировкиВрем КАК ТаблицаКорректировки
	|ГДЕ
	|	ТаблицаКорректировки.Количество <> 0
	|	И ТаблицаКорректировки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И НЕ (ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПостоянныеСНДС
	|	   		- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПостоянныеСНДС КАК ЧИСЛО(31,2)) КАК ЧИСЛО(31, 2)) = 0 
	|		И ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПостоянныеБезНДС
	|	   		- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПостоянныеБезНДС КАК ЧИСЛО(31,2)) КАК ЧИСЛО(31, 2)) = 0
	|		И ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПеременныеСНДС
	|	   		- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПеременныеСНДС КАК ЧИСЛО(31,2)) КАК ЧИСЛО(31, 2)) = 0
	|		И ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПеременныеБезНДС
	|	   		- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПеременныеБезНДС КАК ЧИСЛО(31,2)) КАК ЧИСЛО(31, 2)) = 0
	|		И ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПостоянныеСНДС
	|	   		- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПостоянныеСНДС КАК ЧИСЛО(31,2)) КАК ЧИСЛО(31, 2)) = 0
	|		И ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПостоянныеРегл
	|	   		- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПостоянныеРегл КАК ЧИСЛО(31,2)) КАК ЧИСЛО(31, 2)) = 0
	|		И ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПеременныеРегл
	|	   		- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПеременныеРегл КАК ЧИСЛО(31,2)) КАК ЧИСЛО(31, 2)) = 0
	|		И ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПостоянныеУпр
	|	   		- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПостоянныеУпр КАК ЧИСЛО(31,2)) КАК ЧИСЛО(31, 2)) = 0
	|		И ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПеременныеУпр
	|	   		- ВЫРАЗИТЬ(ТаблицаКорректировки.ПостатейныеПеременныеУпр КАК ЧИСЛО(31,2)) КАК ЧИСЛО(31, 2)) = 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаКорректировки.Период,
	|	ТаблицаКорректировки.Организация,
	|	ТаблицаКорректировки.АналитикаУчетаПродукцииСебестоимость,
	|	ТаблицаКорректировки.РазделУчета,
	|	ТаблицаКорректировки.ВидЗапасов,
	|	ТаблицаКорректировки.Партия,
	|	ТаблицаКорректировки.АналитикаУчетаПартий,
	|	ТаблицаКорректировки.АналитикаФинансовогоУчета,
	|	ТаблицаКорректировки.ВидДеятельностиНДС
	|;
	|
	|ВЫБРАТЬ
	|	Т.Период,
	|	Т.ВидДвижения,
	|	Т.ДокументДвижения,
	|	Т.Организация,
	|	Т.ПартияПроизводства,
	|	Т.ЗаказНаПроизводство,
	|	Т.КодСтрокиПродукция,
	|	Т.Этап,
	|	Т.СтатьяКалькуляции,
	|	Т.АналитикаУчетаПродукции,
	|	Т.АналитикаУчетаПродукцииСебестоимость,
	|	Т.КорАналитикаУчетаПартий,
	|	Т.Продукция,
	|	Т.ХарактеристикаПродукции,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.ТипЗапасов,
	|	Т.ХозяйственнаяОперация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.КорНаправлениеДеятельности,
	|	Т.АналитикаРасходов,
	|	Т.СтатьяРасходов,
	|	Т.ГруппаПродукции,
	|	Т.ИсходноеПодразделение,
	|	Т.КорПодразделение,
	|	Т.АналитикаПартииВыпуска,
	|	Т.ДокументВыпуска,
	|	Т.ПравилоОтнесенияНаВыпуск,
	|	Т.ДоляСтоимости,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи,
	|	СУММА(Т.Количество) КАК Количество
	|ПОМЕСТИТЬ ПриемникиПогрешностей
	|ИЗ
	|	ВтТаблицаКорректировкиВрем КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПогрешностиОкругления КАК Погрешности
	|		ПО Погрешности.Организация = Т.Организация
	|			И Погрешности.АналитикаУчетаПродукцииСебестоимость = Т.АналитикаУчетаПродукцииСебестоимость 
	|			И Погрешности.РазделУчета = Т.РазделУчета
	|			И Погрешности.ВидЗапасов = Т.ВидЗапасов
	|			И Погрешности.Партия = Т.Партия
	|			И Погрешности.АналитикаУчетаПартий = Т.АналитикаУчетаПартий
	|			И Погрешности.АналитикаФинансовогоУчета = Т.АналитикаФинансовогоУчета
	|			И Погрешности.ВидДеятельностиНДС = Т.ВидДеятельностиНДС
	|ГДЕ
	|	Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)	
	|	И НЕ Погрешности.Организация ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Период,
	|	Т.ВидДвижения,
	|	Т.ДокументДвижения,
	|	Т.Организация,
	|	Т.ПартияПроизводства,
	|	Т.ЗаказНаПроизводство,
	|	Т.КодСтрокиПродукция,
	|	Т.Этап,
	|	Т.СтатьяКалькуляции,
	|	Т.АналитикаУчетаПродукции,
	|	Т.АналитикаУчетаПродукцииСебестоимость,
	|	Т.КорАналитикаУчетаПартий,
	|	Т.Продукция,
	|	Т.ХарактеристикаПродукции,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.ТипЗапасов,
	|	Т.ХозяйственнаяОперация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.КорНаправлениеДеятельности,
	|	Т.АналитикаРасходов,
	|	Т.СтатьяРасходов,
	|	Т.ГруппаПродукции,
	|	Т.ИсходноеПодразделение,
	|	Т.КорПодразделение,
	|	Т.АналитикаПартииВыпуска,
	|	Т.ДокументВыпуска,
	|	Т.ПравилоОтнесенияНаВыпуск,
	|	Т.ДоляСтоимости,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи
	|;";
	#КонецОбласти
	
	#Область АналитикиРасходныхДвиженийПостатейныхРасходов
	Запрос.Текст = Запрос.Текст + "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.СтатьяРасходов,
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.НаправлениеДеятельности,
	|	Т.ПартияПроизводства,
	|	Т.ЗаказНаПроизводство,
	|	Т.КодСтрокиПродукция,
	|	Т.Этап,
	|	Т.СтатьяКалькуляции,
	|	Т.ГруппаПродукции,
	|	Т.ПравилоОтнесенияНаВыпуск
	|ПОМЕСТИТЬ АналитикиРасходныхДвиженийПостатейныхРасходов
	|ИЗ
	|	ВтТаблицаКорректировкиВрем КАК Т
	|ГДЕ
	|	Т.ЕстьРасход
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Т.СтатьяРасходов,
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.НаправлениеДеятельности,
	|	Т.ПартияПроизводства,
	|	Т.ЗаказНаПроизводство,
	|	Т.КодСтрокиПродукция,
	|	Т.Этап,
	|	Т.СтатьяКалькуляции,
	|	Т.ГруппаПродукции,
	|	Т.ПравилоОтнесенияНаВыпуск
	|;";
	#КонецОбласти
	
	Запрос.Выполнить();
	
	#Область РаспределениеДанных
	
	// Инициализируем распределение
	ПоляСвязи = "Период, Организация, АналитикаУчетаПродукцииСебестоимость, ВидЗапасов, РазделУчета, Партия, АналитикаУчетаПартий,
		|АналитикаФинансовогоУчета, ВидДеятельностиНДС";
	ПараметрыРаспределения = РасчетСебестоимостиУниверсальныеАлгоритмы.ИнициализироватьПараметрыРаспределенияМетодомУменьшаемогоОстатка(
		"ПогрешностиОкругления",
		"ПриемникиПогрешностей",
		ПоляСвязи);
	
	РаспределяемыеРесурсы = "ПостатейныеПостоянныеСНДС,ПостатейныеПеременныеСНДС,ПостатейныеПостоянныеБезНДС,ПостатейныеПеременныеБезНДС,
		|ПостатейныеПостоянныеРегл,ПостатейныеПеременныеРегл,ПостатейныеПостоянныеУпр,ПостатейныеПеременныеУпр";
	РасчетСебестоимостиУниверсальныеАлгоритмы.ИнициализироватьЧисловыеПоляРаспределенияМетодомУменьшаемогоОстатка(
		ПараметрыРаспределения,
		РаспределяемыеРесурсы);
		
	ПрочиеПоляБазы = "ВидДвижения, ДокументДвижения, ПартияПроизводства, ЗаказНаПроизводство, КодСтрокиПродукция, Этап, СтатьяКалькуляции, АналитикаУчетаПродукции, КорАналитикаУчетаПартий,
		|Продукция, ХарактеристикаПродукции, ТипЗапасов, ХозяйственнаяОперация, Подразделение, НаправлениеДеятельности, КорНаправлениеДеятельности, АналитикаРасходов, СтатьяРасходов,
		|ГруппаПродукции, ИсходноеПодразделение, КорПодразделение, АналитикаПартииВыпуска, ДокументВыпуска, ПравилоОтнесенияНаВыпуск, ДоляСтоимости, НастройкаХозяйственнойОперации, ИдентификаторФинЗаписи";
		
	РасчетСебестоимостиУниверсальныеАлгоритмы.ИнициализироватьПрочиеПоляРаспределенияМетодомУменьшаемогоОстатка(
		ПараметрыРаспределения,
		,
		ПрочиеПоляБазы);
		
	// Распределяем
	РасчетСебестоимостиУниверсальныеАлгоритмы.РаспределитьМетодомУменьшаемогоОстатка(Запрос.МенеджерВременныхТаблиц, ПараметрыРаспределения);
	
	#КонецОбласти
	
	#Область ДвиженияТаблицаКорректировки
	
	Запрос.Текст = "
	//++ Локализация
	|ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.КодСтрокиПродукция,
	|	Т.НаправлениеДеятельности,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.Подразделение,
	|	Т.СтатьяКалькуляции,
	|	Т.ГруппаПродукции,
	|	Т.ПравилоОтнесенияНаВыпуск,
	|	Т.СуммаУпр,
	|	Т.СуммаРегл,
	|	МИНИМУМ(Корректировки.ДокументДвижения) КАК ДокументДвижения
	|
	|ПОМЕСТИТЬ ВтНезавершенноеПроизводствоВключениеИсключениеНДССДокументомДвижения
	|ИЗ
	|	ВтНезавершенноеПроизводствоВключениеИсключениеНДС КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТаблицаКорректировкиВрем КАК Корректировки
	|		ПО Т.Организация = Корректировки.Организация
	|		И Т.СтатьяРасходов = Корректировки.СтатьяРасходов
	|		И Т.АналитикаРасходов = Корректировки.АналитикаРасходов
	|		И Т.Партия = Корректировки.ПартияПроизводства
	|		И Т.НаправлениеДеятельности = Корректировки.КорНаправлениеДеятельности
	|		И Т.Подразделение = Корректировки.Подразделение
	|		И Т.СтатьяКалькуляции = Корректировки.СтатьяКалькуляции
	|		И Т.ГруппаПродукции = Корректировки.ГруппаПродукции
	|		И Т.КодСтрокиПродукция = Корректировки.КодСтрокиПродукция
	|		И Т.ПравилоОтнесенияНаВыпуск = Корректировки.ПравилоОтнесенияНаВыпуск
	|		И Корректировки.ДокументДвижения ССЫЛКА Документ.РаспределениеПрочихЗатрат
	|СГРУППИРОВАТЬ ПО
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.КодСтрокиПродукция,
	|	Т.НаправлениеДеятельности,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.Подразделение,
	|	Т.СтатьяКалькуляции,
	|	Т.ГруппаПродукции,
	|	Т.ПравилоОтнесенияНаВыпуск,
	|	Т.СуммаУпр,
	|	Т.СуммаРегл
	|////////////////////////////////////////////////////////////////////////////////
	|
	|;
	//-- Локализация
	|ВЫБРАТЬ
	|	Т.ЭтоКорректировка,
	|	Т.Период,
	|	Т.ВидДвижения,
	|	Т.ДокументДвижения,
	|	Т.Организация,
	|	Т.ПартияПроизводства,
	|	Т.ЗаказНаПроизводство,
	|	Т.КодСтрокиПродукция,
	|	Т.Этап,
	|	Т.СтатьяКалькуляции,
	|	Т.АналитикаУчетаПродукции,
	|	Т.АналитикаУчетаПродукцииСебестоимость,
	|	Т.КорАналитикаУчетаПартий,
	|	Т.Продукция,
	|	Т.ХарактеристикаПродукции,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.ТипЗапасов,
	|	Т.ХозяйственнаяОперация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.КорНаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|			ТОГДА Т.ВидЗапасов
	|		ИНАЧЕ 
	|			Т.Продукция
	|	КОНЕЦ КАК ИсточникГФУНоменклатуры,
	|	Т.АналитикаРасходов,
	|	Т.СтатьяРасходов,
	|	Т.ГруппаПродукции,
	|	Т.ИсходноеПодразделение,
	|	Т.КорПодразделение,
	|	Т.АналитикаПартииВыпуска,
	|	Т.ДокументВыпуска,
	|	Т.ПравилоОтнесенияНаВыпуск,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи,
	|	СУММА(Т.ДоляСтоимости) КАК ДоляСтоимости,
	|	СУММА(Т.Стоимость) КАК Стоимость,
	|	СУММА(Т.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Т.ДопРасходы) КАК ДопРасходы,
	|	СУММА(Т.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
	|	СУММА(Т.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Т.ВременнаяРазница) КАК ВременнаяРазница,
	|	СУММА(Т.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Т.СтоимостьЗабалансовая) КАК СтоимостьЗабалансовая,
	|	СУММА(Т.Трудозатраты) КАК Трудозатраты,
	|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПостоянныеСНДС) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПостоянныеСНДС,
	|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПостоянныеБезНДС) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПостоянныеБезНДС,
	|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПеременныеСНДС) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПеременныеСНДС,
	|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПеременныеБезНДС) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(Т.СтоимостьЗабалансоваяРегл) КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(Т.ДопРасходыРегл) КАК ДопРасходыРегл,
	|	СУММА(Т.ТрудозатратыРегл) КАК ТрудозатратыРегл,
	|	СУММА(Т.ТрудозатратыБезНДС) КАК ТрудозатратыБезНДС,
	|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПостоянныеРегл) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПостоянныеРегл,
	|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПеременныеРегл) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПеременныеРегл,
	|	СУММА(Т.РезервРегл) КАК РезервРегл,
	|	СУММА(Т.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(Т.ДопРасходыУпр) КАК ДопРасходыУпр,
	|	СУММА(Т.ТрудозатратыУпр) КАК ТрудозатратыУпр,
	|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПостоянныеУпр) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПостоянныеУпр,
	|	ВЫРАЗИТЬ(СУММА(Т.ПостатейныеПеременныеУпр) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПеременныеУпр,
	|	СУММА(Т.РезервУпр) КАК РезервУпр,
	|  	
	|	ВЫРАЗИТЬ(СУММА(Т.СуммаСНДС) КАК ЧИСЛО(31, 2)) КАК СуммаСНДС,
	|	ВЫРАЗИТЬ(СУММА(Т.СуммаБезНДС) КАК ЧИСЛО(31, 2)) КАК СуммаБезНДС,
	|	ВЫРАЗИТЬ(СУММА(Т.СуммаРегл) КАК ЧИСЛО(31, 2)) КАК СуммаРегл,
	|	ВЫРАЗИТЬ(СУММА(Т.СуммаУпр) КАК ЧИСЛО(31, 2)) КАК СуммаУпр
	|ПОМЕСТИТЬ ДвиженияТаблицаКорректировки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЛОЖЬ КАК ЭтоКорректировка,
	|		ВтТаблицаКорректировкиВрем.Период КАК Период,
	|		ВтТаблицаКорректировкиВрем.ВидДвижения КАК ВидДвижения,
	|		ВтТаблицаКорректировкиВрем.ДокументДвижения КАК ДокументДвижения,
	|		ВтТаблицаКорректировкиВрем.Организация КАК Организация,
	|		ВтТаблицаКорректировкиВрем.ПартияПроизводства КАК ПартияПроизводства,
	|		ВтТаблицаКорректировкиВрем.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|		ВтТаблицаКорректировкиВрем.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|		ВтТаблицаКорректировкиВрем.Этап КАК Этап,
	|		ВтТаблицаКорректировкиВрем.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|		ВтТаблицаКорректировкиВрем.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|		ВтТаблицаКорректировкиВрем.АналитикаУчетаПродукции КАК АналитикаУчетаПродукцииСебестоимость,
	|		ВтТаблицаКорректировкиВрем.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|		ВтТаблицаКорректировкиВрем.Продукция КАК Продукция,
	|		ВтТаблицаКорректировкиВрем.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|		ВтТаблицаКорректировкиВрем.РазделУчета КАК РазделУчета,
	|		ВтТаблицаКорректировкиВрем.ВидЗапасов КАК ВидЗапасов,
	|		ВтТаблицаКорректировкиВрем.Партия КАК Партия,
	|		ВтТаблицаКорректировкиВрем.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|		ВтТаблицаКорректировкиВрем.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|		ВтТаблицаКорректировкиВрем.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|		ВтТаблицаКорректировкиВрем.ТипЗапасов КАК ТипЗапасов,
	|		ВтТаблицаКорректировкиВрем.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		ВтТаблицаКорректировкиВрем.Подразделение КАК Подразделение,
	|		ВтТаблицаКорректировкиВрем.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ВтТаблицаКорректировкиВрем.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|		ВтТаблицаКорректировкиВрем.АналитикаРасходов КАК АналитикаРасходов,
	|		ВтТаблицаКорректировкиВрем.СтатьяРасходов КАК СтатьяРасходов,
	|		ВтТаблицаКорректировкиВрем.ГруппаПродукции КАК ГруппаПродукции,
	|		ВтТаблицаКорректировкиВрем.ИсходноеПодразделение КАК ИсходноеПодразделение,
	|		ВтТаблицаКорректировкиВрем.Подразделение КАК КорПодразделение,
	|		ВтТаблицаКорректировкиВрем.АналитикаПартииВыпуска КАК АналитикаПартииВыпуска,
	|		ВтТаблицаКорректировкиВрем.ДокументВыпуска КАК ДокументВыпуска,
	|		ВтТаблицаКорректировкиВрем.ПравилоОтнесенияНаВыпуск КАК ПравилоОтнесенияНаВыпуск,
	|		ВтТаблицаКорректировкиВрем.ДоляСтоимости КАК ДоляСтоимости,
	|		ВтТаблицаКорректировкиВрем.Стоимость КАК Стоимость,
	|		ВтТаблицаКорректировкиВрем.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		ВтТаблицаКорректировкиВрем.ДопРасходы КАК ДопРасходы,
	|		ВтТаблицаКорректировкиВрем.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|		ВтТаблицаКорректировкиВрем.ПостояннаяРазница КАК ПостояннаяРазница,
	|		ВтТаблицаКорректировкиВрем.ВременнаяРазница КАК ВременнаяРазница,
	|		ВтТаблицаКорректировкиВрем.СтоимостьРегл КАК СтоимостьРегл,
	|		ВтТаблицаКорректировкиВрем.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|		ВтТаблицаКорректировкиВрем.Трудозатраты КАК Трудозатраты,
	|		ВЫРАЗИТЬ(ВтТаблицаКорректировкиВрем.ПостатейныеПостоянныеСНДС КАК ЧИСЛО(31, 2)) КАК ПостатейныеПостоянныеСНДС,
	|		ВЫРАЗИТЬ(ВтТаблицаКорректировкиВрем.ПостатейныеПостоянныеБезНДС КАК ЧИСЛО(31, 2)) КАК ПостатейныеПостоянныеБезНДС,
	|		ВЫРАЗИТЬ(ВтТаблицаКорректировкиВрем.ПостатейныеПеременныеСНДС КАК ЧИСЛО(31, 2)) КАК ПостатейныеПеременныеСНДС,
	|		ВЫРАЗИТЬ(ВтТаблицаКорректировкиВрем.ПостатейныеПеременныеБезНДС КАК ЧИСЛО(31, 2)) КАК ПостатейныеПеременныеБезНДС,
	|		ВтТаблицаКорректировкиВрем.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|		ВтТаблицаКорректировкиВрем.ДопРасходыРегл КАК ДопРасходыРегл,
	|		ВтТаблицаКорректировкиВрем.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|		ВтТаблицаКорректировкиВрем.ТрудозатратыБезНДС КАК ТрудозатратыБезНДС,
	|		ВЫРАЗИТЬ(ВтТаблицаКорректировкиВрем.ПостатейныеПостоянныеРегл КАК ЧИСЛО(31, 2)) КАК ПостатейныеПостоянныеРегл,
	|		ВЫРАЗИТЬ(ВтТаблицаКорректировкиВрем.ПостатейныеПеременныеРегл КАК ЧИСЛО(31, 2)) КАК ПостатейныеПеременныеРегл,
	|		ВтТаблицаКорректировкиВрем.РезервРегл КАК РезервРегл,
	|		ВтТаблицаКорректировкиВрем.СтоимостьУпр КАК СтоимостьУпр,
	|		ВтТаблицаКорректировкиВрем.ДопРасходыУпр КАК ДопРасходыУпр,
	|		ВтТаблицаКорректировкиВрем.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|		ВЫРАЗИТЬ(ВтТаблицаКорректировкиВрем.ПостатейныеПостоянныеУпр КАК ЧИСЛО(31, 2)) КАК ПостатейныеПостоянныеУпр,
	|		ВЫРАЗИТЬ(ВтТаблицаКорректировкиВрем.ПостатейныеПеременныеУпр КАК ЧИСЛО(31, 2)) КАК ПостатейныеПеременныеУпр,
	|		ВтТаблицаКорректировкиВрем.РезервУпр КАК РезервУпр,
	|		ВтТаблицаКорректировкиВрем.НастройкаХозяйственнойОперации,
	|		ВтТаблицаКорректировкиВрем.ИдентификаторФинЗаписи,
	|		
	|		ВЫРАЗИТЬ(Стоимость КАК ЧИСЛО(31, 2)) 
	|			+ ВЫРАЗИТЬ(ДопРасходы КАК ЧИСЛО(31, 2))  
	|			+ ВЫРАЗИТЬ(Трудозатраты КАК ЧИСЛО(31, 2))  
	|			+ ВЫРАЗИТЬ(ПостатейныеПостоянныеСНДС КАК ЧИСЛО(31, 2))  
	|			+ ВЫРАЗИТЬ(ПостатейныеПеременныеСНДС КАК ЧИСЛО(31, 2)) КАК СуммаСНДС,
	|		ВЫРАЗИТЬ(СтоимостьБезНДС КАК ЧИСЛО(31, 2))  
	|			+ ВЫРАЗИТЬ(ДопРасходыБезНДС КАК ЧИСЛО(31, 2))  
	|			+ ВЫРАЗИТЬ(ТрудозатратыБезНДС КАК ЧИСЛО(31, 2))  
	|			+ ВЫРАЗИТЬ(ПостатейныеПостоянныеБезНДС КАК ЧИСЛО(31, 2))  
	|			+ ВЫРАЗИТЬ(ПостатейныеПеременныеБезНДС КАК ЧИСЛО(31, 2)) КАК СуммаБезНДС,
	|		ВЫРАЗИТЬ(СтоимостьРегл КАК ЧИСЛО(31, 2))  
	|			+ ВЫРАЗИТЬ(ДопРасходыРегл КАК ЧИСЛО(31, 2))  
	|			+ ВЫРАЗИТЬ(ТрудозатратыРегл КАК ЧИСЛО(31, 2))  
	|			+ ВЫРАЗИТЬ(ПостатейныеПостоянныеРегл КАК ЧИСЛО(31, 2))  
	|			+ ВЫРАЗИТЬ(ПостатейныеПеременныеРегл КАК ЧИСЛО(31, 2)) КАК СуммаРегл,
	|		ВЫРАЗИТЬ(СтоимостьУпр КАК ЧИСЛО(31, 2))  
	|			+ ВЫРАЗИТЬ(ДопРасходыУпр КАК ЧИСЛО(31, 2))  
	|			+ ВЫРАЗИТЬ(ТрудозатратыУпр КАК ЧИСЛО(31, 2))  
	|			+ ВЫРАЗИТЬ(ПостатейныеПостоянныеУпр КАК ЧИСЛО(31, 2))  
	|			+ ВЫРАЗИТЬ(ПостатейныеПеременныеУпр КАК ЧИСЛО(31, 2)) КАК СуммаУпр
	|
	|	ИЗ
	|		ВтТаблицаКорректировкиВрем КАК ВтТаблицаКорректировкиВрем
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	//++ Локализация
	|	ВЫБРАТЬ
	|		ИСТИНА КАК ЭтоКорректировка,
	|		ВтТаблицаКорректировкиВрем.Период КАК Период,
	|		ВтТаблицаКорректировкиВрем.ВидДвижения КАК ВидДвижения,
	|		ВтТаблицаКорректировкиВрем.ДокументДвижения КАК ДокументДвижения,
	|		ВтТаблицаКорректировкиВрем.Организация КАК Организация,
	|		ВтТаблицаКорректировкиВрем.ПартияПроизводства КАК ПартияПроизводства,
	|		ВтТаблицаКорректировкиВрем.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|		ВтТаблицаКорректировкиВрем.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|		ВтТаблицаКорректировкиВрем.Этап КАК Этап,
	|		ВтТаблицаКорректировкиВрем.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|		ВтТаблицаКорректировкиВрем.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|		ВтТаблицаКорректировкиВрем.АналитикаУчетаПродукции КАК АналитикаУчетаПродукцииСебестоимость,
	|		ВтТаблицаКорректировкиВрем.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|		ВтТаблицаКорректировкиВрем.Продукция КАК Продукция,
	|		ВтТаблицаКорректировкиВрем.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|		ВтТаблицаКорректировкиВрем.РазделУчета КАК РазделУчета,
	|		ВтТаблицаКорректировкиВрем.ВидЗапасов КАК ВидЗапасов,
	|		ВтТаблицаКорректировкиВрем.Партия КАК Партия,
	|		ВтТаблицаКорректировкиВрем.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|		ВтТаблицаКорректировкиВрем.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|		ВтТаблицаКорректировкиВрем.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|		ВтТаблицаКорректировкиВрем.ТипЗапасов КАК ТипЗапасов,
	|		ВтТаблицаКорректировкиВрем.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		ВтТаблицаКорректировкиВрем.Подразделение КАК Подразделение,
	|		ВтТаблицаКорректировкиВрем.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ВтТаблицаКорректировкиВрем.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|		ВтТаблицаКорректировкиВрем.АналитикаРасходов КАК АналитикаРасходов,
	|		ВтТаблицаКорректировкиВрем.СтатьяРасходов КАК СтатьяРасходов,
	|		ВтТаблицаКорректировкиВрем.ГруппаПродукции КАК ГруппаПродукции,
	|		ВтТаблицаКорректировкиВрем.ИсходноеПодразделение КАК ИсходноеПодразделение,
	|		ВтТаблицаКорректировкиВрем.Подразделение КАК КорПодразделение,
	|		ВтТаблицаКорректировкиВрем.АналитикаПартииВыпуска КАК АналитикаПартииВыпуска,
	|		ВтТаблицаКорректировкиВрем.ДокументВыпуска КАК ДокументВыпуска,
	|		ВтТаблицаКорректировкиВрем.ПравилоОтнесенияНаВыпуск КАК ПравилоОтнесенияНаВыпуск,
	|		0 КАК ДоляСтоимости,
	|		0 КАК Стоимость,
	|		0 КАК СтоимостьБезНДС,
	|		0 КАК ДопРасходы,
	|		0 КАК ДопРасходыБезНДС,
	|		0 КАК ПостояннаяРазница,
	|		0 КАК ВременнаяРазница,
	|		0 КАК СтоимостьРегл,
	|		0 КАК СтоимостьЗабалансовая,
	|		0 КАК Трудозатраты,
	|		0 КАК ПостатейныеПостоянныеСНДС,
	|		0 КАК ПостатейныеПостоянныеБезНДС,
	|		0 КАК ПостатейныеПеременныеСНДС,
	|		0 КАК ПостатейныеПеременныеБезНДС,
	|		0 КАК СтоимостьЗабалансоваяРегл,
	|		0 КАК ДопРасходыРегл,
	|		0 КАК ТрудозатратыРегл,
	|		0 КАК ТрудозатратыБезНДС,
	|		ВЫБОР КОГДА ВтТаблицаКорректировкиВрем.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА ВЫРАЗИТЬ(Корректировки.СуммаРегл КАК Число(31,2))
	|			ИНАЧЕ 0
	|		КОНЕЦ	КАК ПостатейныеПостоянныеРегл,
	|		ВЫБОР КОГДА ВтТаблицаКорректировкиВрем.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
	|			ТОГДА ВЫРАЗИТЬ(Корректировки.СуммаРегл КАК Число(31,2))
	|			ИНАЧЕ 0
	|		КОНЕЦ	КАК ПостатейныеПеременныеРегл,
	|		0 КАК РезервРегл,
	|		0 КАК СтоимостьУпр,
	|		0 КАК ДопРасходыУпр,
	|		0 КАК ТрудозатратыУпр,
	|		ВЫБОР КОГДА ВтТаблицаКорректировкиВрем.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА ВЫРАЗИТЬ(Корректировки.СуммаУпр КАК Число(31,2))
	|			ИНАЧЕ 0
	|		КОНЕЦ	КАК ПостатейныеПостоянныеУпр,
	|		ВЫБОР КОГДА ВтТаблицаКорректировкиВрем.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
	|			ТОГДА ВЫРАЗИТЬ(Корректировки.СуммаУпр КАК Число(31,2))
	|			ИНАЧЕ 0
	|		КОНЕЦ	КАК ПостатейныеПеременныеУпр,
	|		0 КАК РезервУпр,
	|		ВтТаблицаКорректировкиВрем.НастройкаХозяйственнойОперации,
	|		ВтТаблицаКорректировкиВрем.ИдентификаторФинЗаписи,
	|  	
	|		0 КАК СуммаСНДС,
	|		0 КАК СуммаБезНДС,
	|		Корректировки.СуммаРегл КАК СуммаРегл,
	|		Корректировки.СуммаУпр КАК СуммаУпр
	|
	|	ИЗ
	|		ВтТаблицаКорректировкиВрем КАК ВтТаблицаКорректировкиВрем
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНезавершенноеПроизводствоВключениеИсключениеНДССДокументомДвижения КАК Корректировки
	|			ПО ВтТаблицаКорректировкиВрем.Организация = Корректировки.Организация
	|			И ВтТаблицаКорректировкиВрем.СтатьяРасходов = Корректировки.СтатьяРасходов
	|			И ВтТаблицаКорректировкиВрем.АналитикаРасходов = Корректировки.АналитикаРасходов
	|			И ВтТаблицаКорректировкиВрем.ПартияПроизводства = Корректировки.Партия
	|			И ВтТаблицаКорректировкиВрем.КорНаправлениеДеятельности = Корректировки.НаправлениеДеятельности
	|			И ВтТаблицаКорректировкиВрем.Подразделение = Корректировки.Подразделение
	|			И ВтТаблицаКорректировкиВрем.СтатьяКалькуляции = Корректировки.СтатьяКалькуляции
	|			И ВтТаблицаКорректировкиВрем.ГруппаПродукции = Корректировки.ГруппаПродукции
	|			И ВтТаблицаКорректировкиВрем.КодСтрокиПродукция = Корректировки.КодСтрокиПродукция
	|			И ВтТаблицаКорректировкиВрем.ПравилоОтнесенияНаВыпуск = Корректировки.ПравилоОтнесенияНаВыпуск
	|			И ВтТаблицаКорректировкиВрем.ДокументДвижения = Корректировки.ДокументДвижения
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	//-- Локализация
	|	ВЫБРАТЬ
	|		ЛОЖЬ КАК ЭтоКорректировка,
	|		Т.Период КАК Период,
	|		Т.ВидДвижения КАК ВидДвижения,
	|		Т.ДокументДвижения КАК ДокументДвижения,
	|		Т.Организация КАК Организация,
	|		Т.ПартияПроизводства КАК ПартияПроизводства,
	|		Т.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|		Т.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|		Т.Этап КАК Этап,
	|		Т.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|		Т.АналитикаУчетаПродукцииСебестоимость КАК АналитикаУчетаПродукции,
	|		Т.АналитикаУчетаПродукцииСебестоимость КАК АналитикаУчетаПродукцииСебестоимость,
	|		Т.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|		Т.Продукция КАК Продукция,
	|		Т.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|		Т.РазделУчета КАК РазделУчета,
	|		Т.ВидЗапасов КАК ВидЗапасов,
	|		Т.Партия КАК Партия,
	|		Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|		Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|		Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|		Т.ТипЗапасов КАК ТипЗапасов,
	|		Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Т.Подразделение КАК Подразделение,
	|		Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Т.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|		Т.АналитикаРасходов КАК АналитикаРасходов,
	|		Т.СтатьяРасходов КАК СтатьяРасходов,
	|		Т.ГруппаПродукции КАК ГруппаПродукции,
	|		Т.ИсходноеПодразделение КАК ИсходноеПодразделение,
	|		Т.Подразделение КАК КорПодразделение,
	|		Т.АналитикаПартииВыпуска КАК АналитикаПартииВыпуска,
	|		Т.ДокументВыпуска КАК ДокументВыпуска,
	|		Т.ПравилоОтнесенияНаВыпуск КАК ПравилоОтнесенияНаВыпуск,
	|		Т.ДоляСтоимости КАК ДоляСтоимости,
	|		0 КАК Стоимость,
	|		0 КАК СтоимостьБезНДС,
	|		0 КАК ДопРасходы,
	|		0 КАК ДопРасходыБезНДС,
	|		0 КАК ПостояннаяРазница,
	|		0 КАК ВременнаяРазница,
	|		0 КАК СтоимостьРегл,
	|		0 КАК СтоимостьЗабалансовая,
	|		0 КАК Трудозатраты,
	|		Т.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|		Т.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|		Т.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|		Т.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|		0 КАК СтоимостьЗабалансоваяРегл,
	|		0 КАК ДопРасходыРегл,
	|		0 КАК ТрудозатратыРегл,
	|		0 КАК ТрудозатратыБезНДС,
	|		Т.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|		Т.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|		0 КАК РезервРегл,
	|		0 КАК СтоимостьУпр,
	|		0 КАК ДопРасходыУпр,
	|		0 КАК ТрудозатратыУпр,
	|		Т.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|		Т.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
	|		0 КАК РезервУпр,
	|		Т.НастройкаХозяйственнойОперации,
	|		Т.ИдентификаторФинЗаписи,
	|	
	|		ПостатейныеПостоянныеСНДС + ПостатейныеПеременныеСНДС КАК СуммаСНДС,
	|		ПостатейныеПостоянныеБезНДС + ПостатейныеПеременныеБезНДС КАК СуммаБезНДС,
	|		ПостатейныеПостоянныеРегл + ПостатейныеПеременныеРегл КАК СуммаРегл,
	|		ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр КАК СуммаУпр
	|	ИЗ
	|		ВТРезультатРаспределения КАК Т) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоКорректировка,
	|	Т.Период,
	|	Т.ВидДвижения,
	|	Т.ДокументДвижения,
	|	Т.Организация,
	|	Т.ПартияПроизводства,
	|	Т.ЗаказНаПроизводство,
	|	Т.КодСтрокиПродукция,
	|	ВЫБОР
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|			ТОГДА Т.ВидЗапасов
	|		ИНАЧЕ 
	|			Т.Продукция
	|	КОНЕЦ,
	|	Т.Этап,
	|	Т.СтатьяКалькуляции,
	|	Т.АналитикаУчетаПродукции,
	|	Т.АналитикаУчетаПродукцииСебестоимость,
	|	Т.КорАналитикаУчетаПартий,
	|	Т.Продукция,
	|	Т.ХарактеристикаПродукции,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.ТипЗапасов,
	|	Т.ХозяйственнаяОперация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.КорНаправлениеДеятельности,
	|	Т.АналитикаРасходов,
	|	Т.СтатьяРасходов,
	|	Т.ГруппаПродукции,
	|	Т.ИсходноеПодразделение,
	|	Т.КорПодразделение,
	|	Т.АналитикаПартииВыпуска,
	|	Т.ДокументВыпуска,
	|	Т.ПравилоОтнесенияНаВыпуск,
	|	Т.НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи	
	|";
	#КонецОбласти
	
	Запрос.Текст = УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, Запрос.Текст);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВтТаблицаКорректировкиБезИдентификаторов, ИдентификаторыПоПолямТаблицыКорректировки, ВтТаблицаКорректировкиВрем");
	
	СоответствиеВременныхТаблицДвижений = Новый Соответствие;
	
	// Формируются движения по регистрам:
	// - ПрочиеРасходы
	// - ПрочиеРасходыНезавершенногоПроизводства
	// - СебестоимостьТоваров
		
	СформироватьДвиженияПрочиеРасходыНезавершенногоПроизводстваЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	СформироватьДвиженияСебестоимостьТоваровСписаниеНЗПЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	СформироватьДвиженияНоменклатураНоменклатураСписаниеНЗПЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	
	Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов Тогда
		СформироватьДвиженияПрочиеРасходыСписаниеНЗПЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	КонецЕсли;
		
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвиженияИзВременныхТаблиц(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	
	МассивЛокальныхВременныхТаблиц = Новый Массив;
	МассивЛокальныхВременныхТаблиц.Добавить("ДвиженияТаблицаКорректировки");
	МассивЛокальныхВременныхТаблиц.Добавить("ТаблицаИдентификаторов");
	МассивЛокальныхВременныхТаблиц.Добавить("ПриемникиПогрешностей");
	МассивЛокальныхВременныхТаблиц.Добавить("ПогрешностиОкругления");
	Для Каждого КлючЗначение Из СоответствиеВременныхТаблицДвижений Цикл
		МассивЛокальныхВременныхТаблиц.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтТаблицаКорректировки, Выпуски,
		//++ Локализация
		|ВтНезавершенноеПроизводствоВключениеИсключениеНДССДокументомДвижения,
		//-- Локализация
		|" + СтрСоединить(МассивЛокальныхВременныхТаблиц, ","));
	
КонецПроцедуры

// Этап 3.15б
Процедура СкорректироватьСтоимостьСписанияРезервовПредстоящихРасходов(ПараметрыРасчета)
	
	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьСписанияРезервовПредстоящихРасходов");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&КонецПериода КАК Период,
		|	ДокументыДвиженияРезервов.ДокументДвижения,
		|	Движение.Организация,
		|	Движение.НаправлениеДеятельности,
		|	Движение.ВидРезервов,
		|	Движение.ОбъектУчетаРезервов,
		|	Движение.СтатьяРасходов,
		|	Движение.АналитикаРасходов,
		|	Движение.Подразделение,
		|	Движение.СуммаРегл КАК СуммаРегл,
		|	Движение.СуммаУпр КАК СуммаУпр,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовЗаСчетРезервов) КАК ХозяйственнаяОперация,
		|	Движение.ВидРезервов КАК КорВидРезервов,
		|	Движение.ОбъектУчетаРезервов КАК КорОбъектУчетаРезервов
		|ИЗ
		|	РезервыПредстоящихРасходов КАК Движение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДвиженияРезервов КАК ДокументыДвиженияРезервов
		|		ПО Движение.Организация = ДокументыДвиженияРезервов.Организация
		|			И Движение.ВидРезервов = ДокументыДвиженияРезервов.ВидРезервов";
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	// Формируются движения по регистрам:
	// - ПрочиеРасходы
	// - РезервыПредстоящихРасходов
	Пока Выборка.Следующий() Цикл
		
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя, Выборка);
		Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
		
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, Метаданные.РегистрыНакопления.РезервыПредстоящихРасходов.Имя, Выборка);
		Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
		
	КонецЦикла;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.16
Процедура СкорректироватьСтоимостьПрочегоСписанияНезавершенногоПроизводства(ПараметрыРасчета) Экспорт
	
	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьПрочегоСписанияНезавершенногоПроизводства");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Операция.Дата КАК Период,
	|	Операция.Ссылка КАК Регистратор,
	|	Операция.Организация КАК Организация,
	|	Операция.Подразделение КАК Подразделение,
	|	Операция.Подразделение КАК КорПодразделение,
	|	Операция.СтатьяРасходов КАК СтатьяРасходов,
	|	Операция.АналитикаРасходов КАК АналитикаРасходов,
	|	Операция.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиПолучатель,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Строки.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА Строки.СтатьяРасходов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтатьяРасходовПолучатель,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Строки.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА Строки.АналитикаРасходов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК АналитикаРасходовПолучатель,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Строки.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|			ТОГДА Строки.СтатьяРасходов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтатьяАктивовПассивов,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Строки.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|			ТОГДА Строки.АналитикаРасходов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК АналитикаАктивовПассивов,
	|	Строки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов) КАК ХозяйственнаяОперация,
	|	СУММА(Строки.ДоляСтоимости) КАК Количество,
	|	СУММА(Строки.ДоляСтоимости) КАК КоличествоБезНДС,
	|	СУММА(Строки.ДоляСтоимости) КАК КоличествоРегл,
	|	СУММА(Строки.ДоляСтоимости) КАК КоличествоУпр
	|ПОМЕСТИТЬ ВтТаблицаКорректировки
	|ИЗ
	|	Документ.РаспределениеПрочихЗатрат КАК Операция
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат.Списание КАК Строки
	|		ПО Строки.Ссылка = Операция.Ссылка
	|ГДЕ
	|	Операция.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Операция.Организация В(&МассивОрганизаций)
	|	И Операция.Проведен
	|	И НЕ &ПартионныйУчетВерсии22
	|	
	|СГРУППИРОВАТЬ ПО
	|	Операция.Дата,
	|	Операция.Ссылка,
	|	Операция.Организация,
	|	Операция.Подразделение,
	|	Операция.СтатьяРасходов,
	|	Операция.АналитикаРасходов,
	|	Операция.НаправлениеДеятельности,
	|	Строки.НаправлениеДеятельности,
	|	Строки.СтатьяРасходов,
	|	Строки.АналитикаРасходов,
	|	Строки.ИдентификаторСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.КорПодразделение КАК КорПодразделение,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельностиПолучатель,
	|	ДД.КорСтатьяРасходов КАК СтатьяРасходовПолучатель,
	|	ДД.КорАналитикаРасходов КАК АналитикаРасходовПолучатель,
	|	ДД.КорСтатьяАктивовПассивов КАК СтатьяАктивовПассивов,
	|	ДД.КорАналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	ДД.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДД.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СУММА(ДД.ДоляСтоимости),
	|	СУММА(ДД.ДоляСтоимостиБезНДС),
	|	СУММА(ДД.ДоляСтоимостиРегл),
	|	СУММА(ДД.ДоляСтоимостиУпр)
	|ИЗ
	|	ДолиПроизводственныхРасходов КАК ДД
	|ГДЕ
	|	ДД.Организация В(&МассивОрганизаций)
	|	И &ПартионныйУчетВерсии22
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов)
	|	И НЕ (ДД.ДоляСтоимости = 0
	|		И ДД.ДоляСтоимостиБезНДС = 0
	|		И ДД.ДоляСтоимостиРегл = 0
	|		И ДД.ДоляСтоимостиУпр = 0)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.КорПодразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.КорСтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.КорАналитикаРасходов,
	|	ДД.КорСтатьяАктивовПассивов,
	|	ДД.КорАналитикаАктивовПассивов,
	|	ДД.НаправлениеДеятельности,
	|	ДД.КорНаправлениеДеятельности,
	|	ДД.ИдентификаторСтроки,
	|	ДД.ХозяйственнаяОперация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.КорПодразделение КАК КорПодразделение,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельностиПолучатель,
	|	ДД.КорСтатьяРасходов КАК СтатьяРасходовПолучатель,
	|	ДД.КорАналитикаРасходов КАК АналитикаРасходовПолучатель,
	|	ДД.КорСтатьяАктивовПассивов КАК СтатьяАктивовПассивов,
	|	ДД.КорАналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	ДД.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДД.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СУММА(ДД.ДоляСтоимости),
	|	СУММА(ДД.ДоляСтоимостиБезНДС),
	|	СУММА(ДД.ДоляСтоимостиРегл),
	|	СУММА(ДД.ДоляСтоимостиУпр)
	|ИЗ
	|	ПрямыеПроизводственныеРасходы КАК ДД
	|ГДЕ
	|	ДД.Организация В(&МассивОрганизаций)
	|	И &ПартионныйУчетВерсии22
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов)
	|	И НЕ (ДД.ДоляСтоимости = 0
	|		И ДД.ДоляСтоимостиБезНДС = 0
	|		И ДД.ДоляСтоимостиРегл = 0
	|		И ДД.ДоляСтоимостиУпр = 0)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.КорПодразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.КорСтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.КорАналитикаРасходов,
	|	ДД.КорСтатьяАктивовПассивов,
	|	ДД.КорАналитикаАктивовПассивов,
	|	ДД.НаправлениеДеятельности,
	|	ДД.КорНаправлениеДеятельности,
	|	ДД.ИдентификаторСтроки,
	|	ДД.ХозяйственнаяОперация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Дата КАК Период,
	|	ДД.ДокументДвижения КАК Регистратор,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.КорПодразделение КАК КорПодразделение,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельностиПолучатель,
	|	ДД.СтатьяРасходов КАК СтатьяРасходовПолучатель,
	|	ДД.КорАналитикаРасходов КАК АналитикаРасходовПолучатель,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ТранзитРасходовМеждуОВЗ) КАК ХозяйственнаяОперация,
	|	СУММА(ВЫБОР 
	|			КОГДА Операция.ДоляСтоимостиНаОВЗ = 0 ТОГДА 0 
	|			ИНАЧЕ ДД.ПриведенныйВес
	|			КОНЕЦ),
	|	СУММА(ВЫБОР 
	|			КОГДА Операция.ДоляСтоимостиНаОВЗ = 0 ТОГДА 0 
	|			ИНАЧЕ ДД.ПриведенныйВес
	|			КОНЕЦ),
	|	СУММА(ВЫБОР 
	|			КОГДА Операция.ДоляСтоимостиНаОВЗ = 0 ТОГДА 0 
	|			ИНАЧЕ ДД.ПриведенныйВесРегл
	|			КОНЕЦ),
	|	СУММА(ВЫБОР 
	|			КОГДА Операция.ДоляСтоимостиНаОВЗ = 0 ТОГДА 0 
	|			ИНАЧЕ ДД.ПриведенныйВес
	|			КОНЕЦ)
	|ИЗ
	|	ВтТранзитРасходовМеждуОВЗ КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДолиРаспределенияПрочихЗатрат КАК Операция
	|		ПО
	|			Операция.Документ = ДД.ДокументДвижения
	|
	|ГДЕ
	|	ДД.Организация В(&МассивОрганизаций)
	|	И НЕ (ДД.ПриведенныйВес = 0 И ДД.ПриведенныйВесРегл = 0)
	|	
	|СГРУППИРОВАТЬ ПО
	|	Операция.Дата,
	|	ДД.ДокументДвижения,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.КорПодразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	ДД.КорАналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ТранзитРасходовМеждуОВЗ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Дата КАК Период,
	|	Операция.Ссылка КАК Регистратор,
	|	Операция.Организация КАК Организация,
	|	Операция.Подразделение КАК Подразделение,
	|	СтатьиСписания.Подразделение КАК КорПодразделение,
	|	УзлыТранзита.СтатьяРасходов КАК СтатьяРасходов,
	|	Операция.АналитикаРасходов КАК АналитикаРасходов,
	|	УзлыТранзита.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СтатьиСписания.НаправлениеДеятельности КАК НаправлениеДеятельностиПолучатель,
	|	СтатьиСписания.СтатьяРасходов КАК СтатьяРасходовПолучатель,
	|	СтатьиСписания.АналитикаРасходов КАК АналитикаРасходовПолучатель,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов) КАК ХозяйственнаяОперация,
	|	СУММА(ВЫБОР КОГДА Операция.УправленческийУчет ТОГДА СтатьиСписания.ДоляСтоимости*УзлыТранзита.Вес ИНАЧЕ 0 КОНЕЦ),
	|	СУММА(ВЫБОР КОГДА Операция.УправленческийУчет ТОГДА СтатьиСписания.ДоляСтоимости*УзлыТранзита.Вес ИНАЧЕ 0 КОНЕЦ),
	|	СУММА(ВЫБОР КОГДА Операция.РегламентированныйУчет ТОГДА СтатьиСписания.ДоляСтоимости*УзлыТранзита.ВесРегл ИНАЧЕ 0 КОНЕЦ),
	|	СУММА(ВЫБОР КОГДА Операция.УправленческийУчет ТОГДА СтатьиСписания.ДоляСтоимости*УзлыТранзита.Вес ИНАЧЕ 0 КОНЕЦ)
	|ИЗ
	|	Документ.РаспределениеПрочихЗатрат.Списание КАК СтатьиСписания
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДолиРаспределенияПрочихЗатрат КАК Операция
	|		ПО
	|			СтатьиСписания.Ссылка = Операция.Документ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтИсходныеДанныеУзловТранзитаРасходовМеждуОВЗ КАК УзлыТранзита
	|		ПО
	|			УзлыТранзита.Организация = Операция.Организация
	|			И УзлыТранзита.Подразделение = Операция.Подразделение
	|			И УзлыТранзита.АналитикаРасходов = Операция.АналитикаРасходов
	|
	|ГДЕ
	|	Операция.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И Операция.РаспределятьНаСтатьи
	|	
	|СГРУППИРОВАТЬ ПО
	|	Операция.Дата,
	|	Операция.Ссылка,
	|	Операция.Организация,
	|	Операция.Подразделение,
	|	СтатьиСписания.Подразделение,
	|	УзлыТранзита.СтатьяРасходов,
	|	СтатьиСписания.СтатьяРасходов,
	|	Операция.АналитикаРасходов,
	|	УзлыТранзита.НаправлениеДеятельности,
	|	СтатьиСписания.НаправлениеДеятельности,
	|	СтатьиСписания.АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|";

	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьИдентификаторыВоВременнуюТаблицу(
		ПараметрыРасчета,
		ПараметрыРасчета.Движения[Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя],
		"ВтТаблицаКорректировки",
		"Организация, Подразделение, СтатьяРасходов, АналитикаРасходов");
	
	Запрос.Текст =
	"ВЫБРАТЬ 
	|	Статьи.Ссылка
	|ПОМЕСТИТЬ ВтСтатьиИсключенияДляСтоимостиБезНДС
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|ГДЕ
	|	Статьи.ВариантРаспределенияРасходовУпр В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы))
	|;
	|ВЫБРАТЬ
	|	ТаблицаКорректировки.Период,
	|	ТаблицаКорректировки.Регистратор КАК ДокументДвижения,
	|	ТаблицаКорректировки.Организация,
	|	ТаблицаКорректировки.Подразделение,
	|	ТаблицаКорректировки.КорПодразделение,
	|	ТаблицаКорректировки.СтатьяРасходов,
	|	ТаблицаКорректировки.АналитикаРасходов,
	|	ТаблицаКорректировки.НаправлениеДеятельности,
	|	ТаблицаКорректировки.НаправлениеДеятельностиПолучатель КАК КорНаправлениеДеятельности,
	|	ТаблицаКорректировки.СтатьяРасходовПолучатель,
	|	ТаблицаКорректировки.АналитикаРасходовПолучатель,
	|	ТаблицаКорректировки.СтатьяАктивовПассивов,
	|	ТаблицаКорректировки.АналитикаАктивовПассивов,
	|	ТаблицаКорректировки.ИдентификаторСтроки,
	|	ТаблицаКорректировки.ХозяйственнаяОперация,
	|	НастройкиХозОпераций.Ссылка КАК НастройкаХозяйственнойОперации,
	|	ТаблицаКорректировки.ИдентификаторФинЗаписи,
	|	НЕ СтатьиИсключения.Ссылка ЕСТЬ NULL КАК ИсключитьСтоимостьБезНДС,
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* (ЕСТЬNULL(Стоимости.Стоимость, 0)
	|				+ ЕСТЬNULL(Стоимости.ПостатейныеПостоянныеСНДС, 0)
	|				+ ЕСТЬNULL(Стоимости.ПостатейныеПеременныеСНДС, 0)
	|				+ ЕСТЬNULL(Стоимости.Трудозатраты, 0)) КАК ЧИСЛО(31,2)) КАК Стоимость,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоБезНДС
	|			* (ЕСТЬNULL(Стоимости.СтоимостьБезНДС, 0)
	|				+ ЕСТЬNULL(Стоимости.ПостатейныеПостоянныеБезНДС, 0)
	|				+ ЕСТЬNULL(Стоимости.ПостатейныеПеременныеБезНДС, 0)
	|				+ ЕСТЬNULL(Стоимости.ТрудозатратыБезНДС, 0)) КАК ЧИСЛО(31,2)) КАК СтоимостьБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.Количество
	|			* ЕСТЬNULL(Стоимости.СтоимостьДопРасходы, 0) КАК ЧИСЛО(31,2)) КАК ДопРасходы,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоБезНДС
	|			* ЕСТЬNULL(Стоимости.СтоимостьДопРасходыБезНДС, 0) КАК ЧИСЛО(31,2)) КАК ДопРасходыБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоРегл
	|			* ЕСТЬNULL(СтоимостиРегл.ПостояннаяРазница, 0) КАК ЧИСЛО(31,2)) КАК ПостояннаяРазница,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоРегл
	|			* ЕСТЬNULL(СтоимостиРегл.ВременнаяРазница, 0) КАК ЧИСЛО(31,2)) КАК ВременнаяРазница,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоРегл
	|			* (ЕСТЬNULL(СтоимостиРегл.СтоимостьРегл, 0)
	|				+ ЕСТЬNULL(СтоимостиРегл.ДопРасходыРегл, 0)
	|				+ ЕСТЬNULL(СтоимостиРегл.ПостатейныеПостоянныеРегл, 0)
	|				+ ЕСТЬNULL(СтоимостиРегл.ПостатейныеПеременныеРегл, 0)
	|				+ ЕСТЬNULL(СтоимостиРегл.ТрудозатратыРегл, 0)) КАК ЧИСЛО(31,2)) КАК СтоимостьРегл,
	|
	|	ВЫРАЗИТЬ(
	|		ТаблицаКорректировки.КоличествоУпр
	|			* (ЕСТЬNULL(СтоимостиРегл.СтоимостьУпр, 0)
	|				+ ЕСТЬNULL(СтоимостиРегл.ДопРасходыУпр, 0)
	|				+ ЕСТЬNULL(СтоимостиРегл.ПостатейныеПостоянныеУпр, 0)
	|				+ ЕСТЬNULL(СтоимостиРегл.ПостатейныеПеременныеУпр, 0)
	|				+ ЕСТЬNULL(СтоимостиРегл.ТрудозатратыУпр, 0)) КАК ЧИСЛО(31,2)) КАК СтоимостьУпр
	|ИЗ
	|	ВтТаблицаКорректировки КАК ТаблицаКорректировки
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтСтатьиИсключенияДляСтоимостиБезНДС КАК СтатьиИсключения
	|	ПО СтатьиИсключения.Ссылка = ТаблицаКорректировки.СтатьяРасходовПолучатель
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозОпераций
	|	ПО НастройкиХозОпераций.ХозяйственнаяОперация = ТаблицаКорректировки.ХозяйственнаяОперация
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтСтоимостиНезавершенногоПроизводства КАК Стоимости
	|	ПО 
	|		ТаблицаКорректировки.Организация = Стоимости.Организация
	|		И ТаблицаКорректировки.Подразделение = Стоимости.Подразделение
	|		И ТаблицаКорректировки.НаправлениеДеятельности = Стоимости.НаправлениеДеятельности
	|		И ТаблицаКорректировки.СтатьяРасходов = Стоимости.СтатьяРасходов
	|		И ТаблицаКорректировки.АналитикаРасходов = Стоимости.АналитикаРасходов
	|		И Стоимости.Партия = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтСтоимостиНезавершенногоПроизводстваРегл КАК СтоимостиРегл
	|	ПО 
	|		ТаблицаКорректировки.Организация = СтоимостиРегл.Организация
	|		И ТаблицаКорректировки.Подразделение = СтоимостиРегл.Подразделение
	|		И ТаблицаКорректировки.НаправлениеДеятельности = СтоимостиРегл.НаправлениеДеятельности
	|		И ТаблицаКорректировки.СтатьяРасходов = СтоимостиРегл.СтатьяРасходов
	|		И ТаблицаКорректировки.АналитикаРасходов = СтоимостиРегл.АналитикаРасходов
	|		И СтоимостиРегл.Партия = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|ГДЕ
	|	НЕ (ТаблицаКорректировки.Количество = 0
	|		И ТаблицаКорректировки.КоличествоБезНДС = 0
	|		И ТаблицаКорректировки.КоличествоРегл = 0
	|		И ТаблицаКорректировки.КоличествоУпр = 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаКорректировки.Организация,
	|	ТаблицаКорректировки.СтатьяРасходов,
	|	ТаблицаКорректировки.АналитикаРасходов,
	|	ТаблицаКорректировки.Подразделение,
	|	ТаблицаКорректировки.СтатьяРасходовПолучатель,
	|	ТаблицаКорректировки.АналитикаРасходовПолучатель,
	|	ТаблицаКорректировки.Период,
	|	ТаблицаКорректировки.Регистратор,
	|	ТаблицаКорректировки.ИдентификаторСтроки
	|";
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	// Формируются движения по регистрам:
	// - ПрочиеРасходы
	Пока Выборка.Следующий() Цикл
		
		СформироватьДвиженияПрочиеРасходыПрочееСписаниеНЗП(ПараметрыРасчета, Выборка);
		СформироватьДвиженияДоходыРасходыПрочиеАктивыПассивыПрочееСписаниеНЗП(ПараметрыРасчета, Выборка);
		
	КонецЦикла;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтТаблицаКорректировки, ВтСтатьиИсключенияДляСтоимостиБезНДС");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

//-- НЕ УТ

Процедура СкорректироватьСтоимостьДополнительныхРасходов(ПараметрыРасчета, Первичные) Экспорт
	
	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие
	 И НЕ ПараметрыРасчета.РаспределениеДопРасходовМеждуПартиямиИТоварами Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьДополнительныхРасходов");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Если Первичные Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
			|	Движения.Регистратор КАК Регистратор,
			|	Реквизиты.Дата КАК Период,
			|	Реквизиты.Организация КАК Организация,
			|	Реквизиты.Подразделение КАК Подразделение,
			|	Реквизиты.НаправлениеДеятельности КАК НаправлениеДеятельности,
			|	Реквизиты.СтатьяРасходов КАК СтатьяРасходов,
			|	Реквизиты.СтатьяРасходов.ПринятиеКНалоговомуУчету КАК ПринятиеКНалоговомуУчету,
			|	Реквизиты.АналитикаРасходов КАК АналитикаРасходов,
			|	Движения.КорОрганизация КАК КорОрганизация,
			|	Движения.КорРазделУчета КАК РазделУчета,
			|	Движения.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
			|	Движения.КорВидЗапасов КАК ВидЗапасов,
			|	Движения.КорПартия КАК Партия,
			|	Движения.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
			|	Движения.КорАналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
			|	Движения.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
			|	Движения.КорСтатьяРасходов КАК КорСтатьяРасходов,
			|	Движения.КорАналитикаРасходов КАК КорАналитикаРасходов,
			|	Движения.КорСтатьяАктивовПассивов КАК КорСтатьяАктивовПассивов,
			|	Движения.КорАналитикаАктивовПассивов КАК КорАналитикаАктивовПассивов,
			|	Движения.КорПодразделение КАК КорПодразделение,
			|	Движения.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
			|	Движения.ХозяйственнаяОперация,
			|	Движения.ТипЗаписи,
			|	Движения.ИсточникГФУНоменклатуры,
			|	Движения.АналитикаУчетаПоПартнерам,
			|	Движения.ЗаказКлиента,
			|	Движения.Менеджер,
			|	Движения.Склад,
			|	Движения.Соглашение,
			|	Движения.Договор,
			|	Движения.ТипЗапасов,
			|	Движения.ИсточникГФУРасчетов,
			|	
			|	ВЫРАЗИТЬ(Движения.ДоляСтоимости
			|		* ЕСТЬNULL(Стоимости.СтоимостьСНДС, 0) КАК ЧИСЛО(31, 2)) КАК ДопРасходы,
			|	ВЫРАЗИТЬ(Движения.ДоляСтоимостиБезНДС
			|		* ЕСТЬNULL(Стоимости.СтоимостьБезНДС, 0) КАК ЧИСЛО(31, 2)) КАК ДопРасходыБезНДС,
			|	ВЫРАЗИТЬ(Движения.ДоляСтоимостиРегл 
			|		* ЕСТЬNULL(Стоимости.СтоимостьРегл, 0) КАК ЧИСЛО(31, 2)) КАК ДопРасходыРегл,
			|	ВЫРАЗИТЬ(Движения.ДоляСтоимостиУпр 
			|		* ЕСТЬNULL(Стоимости.СтоимостьУпр, 0) КАК ЧИСЛО(31, 2)) КАК ДопРасходыУпр,
			|	0 КАК ПостатейныеПостоянныеСНДС,
			|	0 КАК ПостатейныеПеременныеСНДС,
			|	0 КАК ПостатейныеПостоянныеБезНДС,
			|	0 КАК ПостатейныеПеременныеБезНДС,
			|	0 КАК ПостатейныеПостоянныеРегл,
			|	0 КАК ПостатейныеПеременныеРегл,
			|	0 КАК ПостатейныеПостоянныеУпр,
			|	0 КАК ПостатейныеПеременныеУпр,
			|	0 КАК ПостояннаяРазница,
			|	0 КАК ВременнаяРазница
			|ПОМЕСТИТЬ ВтТаблицаКорректировкиВрем
			|ИЗ
			|	ДолиДополнительныхРасходов КАК Движения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
			|		ПО Движения.Регистратор = Реквизиты.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьДополнительныхРасходов КАК Стоимости
			|		ПО Реквизиты.Организация = Стоимости.Организация
			|			И Реквизиты.Подразделение = Стоимости.Подразделение
			|			И Реквизиты.НаправлениеДеятельности = Стоимости.НаправлениеДеятельности
			|			И Реквизиты.СтатьяРасходов = Стоимости.СтатьяРасходов
			|			И Реквизиты.АналитикаРасходов = Стоимости.АналитикаРасходов
			|ГДЕ
			|	Реквизиты.Организация В(&МассивОрганизаций)
			|ИНДЕКСИРОВАТЬ ПО
			|	Регистратор,
			|	Партия,
			|	РазделУчета,
			|	АналитикаУчетаНоменклатуры";
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
			|	Движения.Регистратор КАК Регистратор,
			|	Реквизиты.Дата КАК Период,
			|	Реквизиты.Организация КАК Организация,
			|	Реквизиты.Подразделение КАК Подразделение,
			|	Реквизиты.НаправлениеДеятельности КАК НаправлениеДеятельности,
			|	Реквизиты.СтатьяРасходов КАК СтатьяРасходов,
			|	Реквизиты.СтатьяРасходов.ПринятиеКНалоговомуУчету КАК ПринятиеКНалоговомуУчету,
			|	Реквизиты.АналитикаРасходов КАК АналитикаРасходов,
			|	Движения.КорОрганизация КАК КорОрганизация,
			|	Движения.КорРазделУчета КАК РазделУчета,
			|	Движения.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
			|	Движения.КорВидЗапасов КАК ВидЗапасов,
			|	Движения.КорПартия КАК Партия,
			|	Движения.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
			|	Движения.КорАналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
			|	Движения.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
			|	Движения.КорСтатьяРасходов КАК КорСтатьяРасходов,
			|	Движения.КорАналитикаРасходов КАК КорАналитикаРасходов,
			|	Движения.КорСтатьяАктивовПассивов КАК КорСтатьяАктивовПассивов,
			|	Движения.КорАналитикаАктивовПассивов КАК КорАналитикаАктивовПассивов,
			|	Движения.КорПодразделение КАК КорПодразделение,
			|	Движения.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
			|	Движения.ХозяйственнаяОперация,
			|	Движения.ТипЗаписи,
			|	Движения.ИсточникГФУНоменклатуры,
			|	Движения.АналитикаУчетаПоПартнерам,
			|	Движения.ЗаказКлиента,
			|	Движения.Менеджер,
			|	Движения.Склад,
			|	Движения.Соглашение,
			|	Движения.Договор,
			|	Движения.ТипЗапасов,
			|	Движения.ИсточникГФУРасчетов,
			|
			|	0 КАК ДопРасходы,
			|	0 КАК ДопРасходыБезНДС,
			|	0 КАК ДопРасходыРегл,
			|	0 КАК ДопРасходыУпр,
			|
			|	ВЫРАЗИТЬ(Движения.ДоляСтоимости
			|		* ЕСТЬNULL(Стоимости.ПостатейныеПостоянныеСНДС, 0) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПостоянныеСНДС,
			|	ВЫРАЗИТЬ(Движения.ДоляСтоимости
			|		* ЕСТЬNULL(Стоимости.ПостатейныеПеременныеСНДС, 0) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПеременныеСНДС,
			|	ВЫРАЗИТЬ(Движения.ДоляСтоимостиБезНДС
			|		* ЕСТЬNULL(Стоимости.ПостатейныеПостоянныеБезНДС, 0) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПостоянныеБезНДС,
			|	ВЫРАЗИТЬ(Движения.ДоляСтоимостиБезНДС
			|		* ЕСТЬNULL(Стоимости.ПостатейныеПеременныеБезНДС, 0) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПеременныеБезНДС,
			|	ВЫРАЗИТЬ(Движения.ДоляСтоимостиРегл 
			|		* ЕСТЬNULL(СтоимостиРегл.ПостатейныеПостоянныеРегл, 0) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПостоянныеРегл,
			|	ВЫРАЗИТЬ(Движения.ДоляСтоимостиРегл 
			|		* ЕСТЬNULL(СтоимостиРегл.ПостатейныеПеременныеРегл, 0) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПеременныеРегл,
			|	ВЫРАЗИТЬ(Движения.ДоляСтоимостиРегл 
			|		* ЕСТЬNULL(СтоимостиРегл.ПостояннаяРазница, 0) КАК ЧИСЛО(31, 2)) КАК ПостояннаяРазница,
			|	ВЫРАЗИТЬ(Движения.ДоляСтоимостиРегл 
			|		* ЕСТЬNULL(СтоимостиРегл.ВременнаяРазница, 0) КАК ЧИСЛО(31, 2)) КАК ВременнаяРазница,
			|	ВЫРАЗИТЬ(Движения.ДоляСтоимостиУпр 
			|		* ЕСТЬNULL(СтоимостиРегл.ПостатейныеПостоянныеУпр, 0) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПостоянныеУпр,
			|	ВЫРАЗИТЬ(Движения.ДоляСтоимостиУпр 
			|		* ЕСТЬNULL(СтоимостиРегл.ПостатейныеПеременныеУпр, 0) КАК ЧИСЛО(31, 2)) КАК ПостатейныеПеременныеУпр
			|ПОМЕСТИТЬ ВтТаблицаКорректировкиВрем
			|ИЗ
			|	ДолиДополнительныхРасходов КАК Движения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
			|		ПО Движения.Регистратор = Реквизиты.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСтоимостиДополнительныхРасходов КАК Стоимости
			|		ПО Реквизиты.Организация = Стоимости.Организация
			|			И Реквизиты.Подразделение = Стоимости.Подразделение
			|			И Реквизиты.НаправлениеДеятельности = Стоимости.НаправлениеДеятельности
			|			И Реквизиты.СтатьяРасходов = Стоимости.СтатьяРасходов
			|			И Реквизиты.АналитикаРасходов = Стоимости.АналитикаРасходов
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСтоимостиДополнительныхРасходовРегл КАК СтоимостиРегл
			|		ПО Реквизиты.Организация = СтоимостиРегл.Организация
			|			И Реквизиты.Подразделение = СтоимостиРегл.Подразделение
			|			И Реквизиты.НаправлениеДеятельности = СтоимостиРегл.НаправлениеДеятельности
			|			И Реквизиты.СтатьяРасходов = СтоимостиРегл.СтатьяРасходов
			|			И Реквизиты.АналитикаРасходов = СтоимостиРегл.АналитикаРасходов
			|ГДЕ
			|	Реквизиты.Организация В(&МассивОрганизаций)
			|ИНДЕКСИРОВАТЬ ПО
			|	Регистратор,
			|	Партия,
			|	РазделУчета,
			|	АналитикаУчетаНоменклатуры";
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период,
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидДеятельностиНДС,
	|	Т.Подразделение,
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	|	Т.СтатьяАктивовПассивов,
	|	Т.АналитикаАктивовПассивов,
	|	Т.КорНаправлениеДеятельности,
	|	Т.АналитикаУчетаПоПартнерам,
	|	Т.ХозяйственнаяОперация,
	|	Т.ТипЗаписи,
	|	МАКСИМУМ(Т.ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи
	|ПОМЕСТИТЬ ВТСтарыеИдентификаторыРасход
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК ДокументРаспределениеЗатрат
	|		ПО Т.Регистратор = ДокументРаспределениеЗатрат.Ссылка
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.Регистратор В (ВЫБРАТЬ РАЗЛИЧНЫЕ Отбор.Регистратор ИЗ ВтТаблицаКорректировкиВрем КАК Отбор)
	|	И Т.Активность
	|	И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.Период,
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидДеятельностиНДС,
	|	Т.Подразделение,
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	|	Т.СтатьяАктивовПассивов,
	|	Т.АналитикаАктивовПассивов,
	|	Т.КорНаправлениеДеятельности,
	|	Т.АналитикаУчетаПоПартнерам,
	|	Т.ХозяйственнаяОперация,
	|	Т.ТипЗаписи
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Партия,
	|	РазделУчета,
	|	АналитикаУчетаНоменклатуры
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период,
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидДеятельностиНДС,
	|	Т.Подразделение,
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	|	Т.ТипЗаписи,
	|	МАКСИМУМ(Т.ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи
	|ПОМЕСТИТЬ ВТСтарыеИдентификаторыПриход
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК ДокументРаспределениеЗатрат
	|		ПО Т.Регистратор = ДокументРаспределениеЗатрат.Ссылка
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.Регистратор В (ВЫБРАТЬ РАЗЛИЧНЫЕ Отбор.Регистратор ИЗ ВтТаблицаКорректировкиВрем КАК Отбор)
	|	И Т.Активность
	|	И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимость)
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.Период,
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидДеятельностиНДС,
	|	Т.Подразделение,
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	|	Т.ТипЗаписи
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Партия,
	|	РазделУчета,
	|	АналитикаУчетаНоменклатуры
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Движения.НомерЗаписи,
	|	Движения.ВидДвижения,
	|	Движения.Регистратор,
	|	Движения.Период,
	|	Движения.Организация,
	|	Движения.Подразделение,
	|	Движения.НаправлениеДеятельности,
	|	Движения.СтатьяРасходов,
	|	Движения.ПринятиеКНалоговомуУчету,
	|	Движения.АналитикаРасходов,
	|	Движения.РазделУчета,
	|	Движения.АналитикаУчетаНоменклатуры,
	|	Движения.ВидЗапасов,
	|	Движения.КорОрганизация,
	|	Движения.Партия,
	|	Движения.АналитикаУчетаПартий,
	|	Движения.АналитикаФинансовогоУчета,
	|	Движения.ВидДеятельностиНДС,
	|	Движения.КорСтатьяРасходов,
	|	Движения.КорАналитикаРасходов,
	|	Движения.КорСтатьяАктивовПассивов,
	|	Движения.КорАналитикаАктивовПассивов,
	|	Движения.КорПодразделение,
	|	Движения.КорНаправлениеДеятельности,
	|	Движения.ХозяйственнаяОперация,
	|	Движения.ТипЗаписи,
	|	Движения.ИсточникГФУНоменклатуры,
	|	Движения.АналитикаУчетаПоПартнерам,
	|	Движения.ЗаказКлиента,
	|	Движения.Менеджер,
	|	Движения.Склад,
	|	Движения.Соглашение,
	|	Движения.Договор,
	|	Движения.ТипЗапасов,
	|	Движения.ИсточникГФУРасчетов,
	|
	|	Движения.ДопРасходы,
	|	Движения.ДопРасходыБезНДС,
	|	Движения.ДопРасходыРегл,
	|	Движения.ДопРасходыУпр,
	|
	|	Движения.ПостатейныеПостоянныеСНДС,
	|	Движения.ПостатейныеПеременныеСНДС,
	|	Движения.ПостатейныеПостоянныеБезНДС,
	|	Движения.ПостатейныеПеременныеБезНДС,
	|	Движения.ПостатейныеПостоянныеРегл,
	|	Движения.ПостатейныеПеременныеРегл,
	|	Движения.ПостатейныеПостоянныеУпр,
	|	Движения.ПостатейныеПеременныеУпр,
	|	Движения.ПостояннаяРазница,
	|	Движения.ВременнаяРазница,
	|   ЕСТЬNULL(ИдентификаторыРасход.ИдентификаторФинЗаписи,
	|		ЕСТЬNULL(ИдентификаторыПриход.ИдентификаторФинЗаписи, """")) КАК ИдентификаторФинЗаписи
	|ПОМЕСТИТЬ ДвиженияТаблицаКорректировкиВрем
	|ИЗ
	|	ВтТаблицаКорректировкиВрем КАК Движения
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТСтарыеИдентификаторыРасход КАК ИдентификаторыРасход
	|		ПО Движения.Регистратор = ИдентификаторыРасход.Регистратор
	|		И Движения.Период = ИдентификаторыРасход.Период
	|		И Движения.Организация = ИдентификаторыРасход.Организация
	|		И Движения.РазделУчета = ИдентификаторыРасход.РазделУчета
	|		И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Движения.ВидЗапасов) = ТИП(Справочник.ВидыЗапасов)
	|			ТОГДА Движения.ВидЗапасов
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		  КОНЕЦ = ИдентификаторыРасход.ВидЗапасов
	|		И Движения.Партия = ИдентификаторыРасход.Партия
	|		И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Движения.АналитикаУчетаПартий) = ТИП(Справочник.КлючиАналитикиУчетаПартий)
	|			ТОГДА Движения.АналитикаУчетаПартий
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|		  КОНЕЦ = ИдентификаторыРасход.АналитикаУчетаПартий
	|		И Движения.АналитикаФинансовогоУчета = ИдентификаторыРасход.АналитикаФинансовогоУчета
	|		И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Движения.АналитикаУчетаНоменклатуры) = ТИП(Справочник.КлючиАналитикиУчетаНоменклатуры)
	|			ТОГДА Движения.АналитикаУчетаНоменклатуры
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		  КОНЕЦ = ИдентификаторыРасход.АналитикаУчетаНоменклатуры
	|		И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Движения.ВидДеятельностиНДС) = ТИП(Перечисление.ТипыНалогообложенияНДС)
	|			ТОГДА Движения.ВидДеятельностиНДС
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		  КОНЕЦ = ИдентификаторыРасход.ВидДеятельностиНДС
	|		И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Движения.КорПодразделение) = ТИП(Справочник.СтруктураПредприятия)
	|			ТОГДА Движения.КорПодразделение
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		  КОНЕЦ = ИдентификаторыРасход.Подразделение
	|		И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Движения.КорСтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА Движения.КорСтатьяРасходов
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		  КОНЕЦ = ИдентификаторыРасход.СтатьяРасходовСписания
	|		И Движения.КорАналитикаРасходов = ИдентификаторыРасход.АналитикаРасходов
	|		И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Движения.КорСтатьяАктивовПассивов) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|			ТОГДА Движения.КорСтатьяАктивовПассивов
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|		  КОНЕЦ = ИдентификаторыРасход.СтатьяАктивовПассивов
	|		И Движения.КорАналитикаАктивовПассивов = ИдентификаторыРасход.АналитикаАктивовПассивов
	|		И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Движения.КорНаправлениеДеятельности) = ТИП(Справочник.НаправленияДеятельности)
	|			ТОГДА Движения.КорНаправлениеДеятельности
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|		  КОНЕЦ = ИдентификаторыРасход.КорНаправлениеДеятельности
	|		И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Движения.АналитикаУчетаПоПартнерам) = ТИП(Справочник.КлючиАналитикиУчетаПоПартнерам)
	|			ТОГДА Движения.АналитикаУчетаПоПартнерам
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|		  КОНЕЦ = ИдентификаторыРасход.АналитикаУчетаПоПартнерам
	|		И Движения.ХозяйственнаяОперация = ИдентификаторыРасход.ХозяйственнаяОперация
	|		И Движения.ТипЗаписи = ИдентификаторыРасход.ТипЗаписи
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТСтарыеИдентификаторыПриход КАК ИдентификаторыПриход
	|		ПО Движения.Регистратор = ИдентификаторыПриход.Регистратор
	|		И Движения.Период = ИдентификаторыПриход.Период
	|		И Движения.Организация = ИдентификаторыПриход.Организация
	|		И Движения.РазделУчета = ИдентификаторыПриход.РазделУчета
	|		И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Движения.ВидЗапасов) = ТИП(Справочник.ВидыЗапасов)
	|			ТОГДА Движения.ВидЗапасов
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		  КОНЕЦ = ИдентификаторыПриход.ВидЗапасов
	|		И Движения.Партия = ИдентификаторыПриход.Партия
	|		И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Движения.АналитикаУчетаПартий) = ТИП(Справочник.КлючиАналитикиУчетаПартий)
	|			ТОГДА Движения.АналитикаУчетаПартий
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|		  КОНЕЦ = ИдентификаторыПриход.АналитикаУчетаПартий
	|		И Движения.АналитикаФинансовогоУчета = ИдентификаторыПриход.АналитикаФинансовогоУчета
	|		И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Движения.АналитикаУчетаНоменклатуры) = ТИП(Справочник.КлючиАналитикиУчетаНоменклатуры)
	|			ТОГДА Движения.АналитикаУчетаНоменклатуры
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		  КОНЕЦ = ИдентификаторыПриход.АналитикаУчетаНоменклатуры
	|		И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Движения.ВидДеятельностиНДС) = ТИП(Перечисление.ТипыНалогообложенияНДС)
	|			ТОГДА Движения.ВидДеятельностиНДС
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		  КОНЕЦ = ИдентификаторыПриход.ВидДеятельностиНДС
	|		И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Движения.Подразделение) = ТИП(Справочник.СтруктураПредприятия)
	|			ТОГДА Движения.Подразделение
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		  КОНЕЦ = ИдентификаторыПриход.Подразделение
	|		И ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Движения.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА Движения.СтатьяРасходов
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		  КОНЕЦ = ИдентификаторыПриход.СтатьяРасходовСписания
	|		И Движения.АналитикаРасходов = ИдентификаторыПриход.АналитикаРасходов
	|		И Движения.ТипЗаписи = ИдентификаторыПриход.ТипЗаписи
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерЗаписи
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Т.НомерЗаписи
	|ИЗ
	|	ДвиженияТаблицаКорректировкиВрем КАК Т
	|ГДЕ
	|	Т.ИдентификаторФинЗаписи = """"
	|";
	
	ТаблицаИдентификаторов = Новый ТаблицаЗначений;
	ТаблицаИдентификаторов.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТаблицаИдентификаторов.Колонки.Добавить("НомерЗаписи", ОбщегоНазначения.ОписаниеТипаЧисло(31));
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаИдентификаторов.Добавить();
		НоваяСтрока.Идентификатор = Новый УникальныйИдентификатор;
		НоваяСтрока.НомерЗаписи = Выборка.НомерЗаписи;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаИдентификаторов", ТаблицаИдентификаторов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИдентификаторов.Идентификатор КАК Идентификатор,
	|	ТаблицаИдентификаторов.НомерЗаписи КАК НомерЗаписи
	|ПОМЕСТИТЬ ТаблицаИдентификаторов
	|ИЗ
	|	&ТаблицаИдентификаторов КАК ТаблицаИдентификаторов
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерЗаписи
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Движения.ВидДвижения,
	|	Движения.Регистратор,
	|	Движения.Период,
	|	Движения.Организация,
	|	Движения.Подразделение,
	|	Движения.НаправлениеДеятельности,
	|	Движения.СтатьяРасходов,
	|	Движения.ПринятиеКНалоговомуУчету,
	|	Движения.АналитикаРасходов,
	|
	|	Движения.РазделУчета,
	|	Движения.АналитикаУчетаНоменклатуры,
	|	Движения.ВидЗапасов,
	|	Движения.КорОрганизация,
	|	Движения.Партия,
	|	Движения.АналитикаУчетаПартий,
	|	Движения.АналитикаФинансовогоУчета,
	|	Движения.ВидДеятельностиНДС,
	|
	|	Движения.КорСтатьяРасходов,
	|	Движения.КорАналитикаРасходов,
	|	Движения.КорСтатьяАктивовПассивов,
	|	Движения.КорАналитикаАктивовПассивов,
	|	Движения.КорПодразделение,
	|	Движения.КорНаправлениеДеятельности,
	|	Движения.ХозяйственнаяОперация,
	|	Движения.ТипЗаписи,
	|	Движения.ИсточникГФУНоменклатуры,
	|
	|	Движения.АналитикаУчетаПоПартнерам,
	|	Движения.ЗаказКлиента,
	|	Движения.Менеджер,
	|	Движения.Склад,
	|	Движения.Соглашение,
	|	Движения.Договор,
	|	Движения.ТипЗапасов,
	|	Движения.ИсточникГФУРасчетов,
	|
	|	Движения.ДопРасходы,
	|	Движения.ДопРасходыБезНДС,
	|	Движения.ДопРасходыРегл,
	|	Движения.ДопРасходыУпр,
	|
	|	Движения.ПостатейныеПостоянныеСНДС,
	|	Движения.ПостатейныеПеременныеСНДС,
	|	Движения.ПостатейныеПостоянныеБезНДС,
	|	Движения.ПостатейныеПеременныеБезНДС,
	|	Движения.ПостатейныеПостоянныеРегл,
	|	Движения.ПостатейныеПеременныеРегл,
	|	Движения.ПостатейныеПостоянныеУпр,
	|	Движения.ПостатейныеПеременныеУпр,
	|	Движения.ПостояннаяРазница,
	|	Движения.ВременнаяРазница,
	|
	|	НастройкиХозОпераций.Ссылка КАК НастройкаХозяйственнойОперации,
	|	ЕСТЬNULL(ТаблицаИдентификаторов.Идентификатор, Движения.ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи
	|
	|ПОМЕСТИТЬ ДвиженияТаблицаКорректировки
	|ИЗ
	|	ДвиженияТаблицаКорректировкиВрем КАК Движения
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИдентификаторов КАК ТаблицаИдентификаторов
	|		ПО ТаблицаИдентификаторов.НомерЗаписи = Движения.НомерЗаписи
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозОпераций
	|		ПО НастройкиХозОпераций.ХозяйственнаяОперация = Движения.ХозяйственнаяОперация
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВтТаблицаКорректировкиВрем, ДвиженияТаблицаКорректировкиВрем, ВТСтарыеИдентификаторыРасход, ВТСтарыеИдентификаторыПриход, ТаблицаИдентификаторов");
	
	СоответствиеВременныхТаблицДвижений = Новый Соответствие;
	
	// Формируются движения по регистрам:
	// - ПрочиеРасходы
	// - СебестоимостьТоваров
	
	Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходов Тогда
		СформироватьДвиженияПрочиеРасходыДопРасходыЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
		СформироватьДвиженияПрочиеРасходыДопРасходыЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений, Ложь);
		СформироватьДвиженияПрочиеАктивыПассивыДопРасходыЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	КонецЕсли;
	СформироватьДвиженияСебестоимостьТоваровДополнительныхРасходовЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений, Ложь);
	СформироватьДвиженияСебестоимостьТоваровДополнительныхРасходовЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений, Истина);
	
	СформироватьДвиженияНоменклатураДоходыДопРасходыЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	СформироватьДвиженияВыручкаИСебестоимостьДопРасходыЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвиженияИзВременныхТаблиц(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	
	МассивЛокальныхВременныхТаблиц = Новый Массив;
	МассивЛокальныхВременныхТаблиц.Добавить("ДвиженияТаблицаКорректировки");
	Для Каждого КлючЗначение Из СоответствиеВременныхТаблицДвижений Цикл
		МассивЛокальныхВременныхТаблиц.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, СтрСоединить(МассивЛокальныхВременныхТаблиц, ","));
	
КонецПроцедуры

//++ НЕ УТ
//++ Локализация
Процедура СписатьОстаткиМалоценныхМЦ(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СписатьОстаткиМалоценныхМЦ");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	СоответствиеВременныхТаблицДвижений = Новый Соответствие;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка 		КАК Регистратор,
	|	&КонецПериода								КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)		КАК ВидДвижения,
	|
	|	Себестоимость.Организация 					КАК Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета 					КАК РазделУчета,
	|	Себестоимость.ВидЗапасов 					КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар) 	КАК ТипЗапасов,
	|	Себестоимость.Партия                        КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	УчетнаяПолитика.СтатьяРасходовДляСписанияМалоценныхТМЦ КАК СтатьяРасходов,
	|	УчетнаяПолитика.СтатьяРасходовДляСписанияМалоценныхТМЦ КАК СтатьяРасходовСписания,
	|	УчетнаяПолитика.СтатьяРасходовДляСписанияМалоценныхТМЦ КАК СтатьяДоходовРасходов,
	|	УчетнаяПолитика.АналитикаСписанияМалоценныхТМЦ АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА АналитикаНоменклатуры.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(АналитикаНоменклатуры.МестоХранения КАК Справочник.Склады).Подразделение
	|		ИНАЧЕ АналитикаНоменклатуры.Назначение.Заказ.Подразделение
	|	КОНЕЦ 										КАК Подразделение,
	|	ВЫРАЗИТЬ(АналитикаНоменклатуры.МестоХранения КАК Справочник.Склады) КАК Склад,
	|	ЕСТЬNULL(АналитикаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(АналитикаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК КорНаправлениеДеятельности,
	|	ЕСТЬNULL(АналитикаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельностиСтатьи,
	|	ИСТИНА										КАК РасчетСебестоимости,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыМалоценныхТМЦВМесяцеПриобретения) КАК ХозяйственнаяОперация,
	|	НастройкиХозяйственныхОпераций.Ссылка  		КАК НастройкаХозяйственнойОперации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление) КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.СписаниеНаРасходыАктивы) КАК ОперацияУчетаСебестоимости,
	|	&РежимЗакрытияМесяца						КАК РежимЗакрытияМесяца,
	|	Себестоимость.ВидЗапасов 					КАК КорВидЗапасов,
	|	Себестоимость.ВидДеятельностиНДС         	КАК КорВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|			ТОГДА Себестоимость.ВидЗапасов
	|		ИНАЧЕ Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура
	|	КОНЕЦ КАК ИсточникГФУНоменклатуры,
	|	ЕСТЬNULL(АналитикаНоменклатуры.Назначение.НаправлениеДеятельности, 
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельностиНоменклатуры,
	|	ДокументыРасчетаСебестоимости.Ссылка		КАК ДокументДвижения,
	|	0 											КАК Стоимость,
	|	0 											КАК СтоимостьБезНДС,
	|	0 											КАК Сумма,
	|	0 											КАК СуммаБезНДС,
	|	0 											КАК ДопРасходы,
	|	0 											КАК ДопРасходыБезНДС,
	|	0         									КАК СтоимостьЗабалансовая,
	|	0       		    						КАК Трудозатраты,
	|	0     										КАК ПостатейныеПостоянныеСНДС,
	|	0   										КАК ПостатейныеПостоянныеБезНДС,
	|	0     										КАК ПостатейныеПеременныеСНДС,
	|	0   										КАК ПостатейныеПеременныеБезНДС,
	|	Себестоимость.СтоимостьРегл 				КАК СтоимостьРегл,
	|	Себестоимость.СтоимостьРегл
	|		+Себестоимость.ПостатейныеПостоянныеРегл
	|		+Себестоимость.ПостатейныеПеременныеРегл
	|		+Себестоимость.ТрудозатратыРегл
	|		+Себестоимость.ДопРасходыРегл 			КАК СуммаРегл,
	|	Себестоимость.ПостояннаяРазница 			КАК ПостояннаяРазница,
	|	Себестоимость.СтоимостьРегл
	|		+Себестоимость.ПостатейныеПостоянныеРегл
	|		+Себестоимость.ПостатейныеПеременныеРегл
	|		+Себестоимость.ТрудозатратыРегл
	|		+Себестоимость.ДопРасходыРегл
	|		-Себестоимость.ПостояннаяРазница 		КАК ВременнаяРазница,
	|	Себестоимость.СтоимостьЗабалансоваяРегл     КАК СтоимостьЗабалансоваяРегл,
	|	Себестоимость.ДопРасходыРегл                КАК ДопРасходыРегл,
	|	Себестоимость.ТрудозатратыРегл              КАК ТрудозатратыРегл,
	|	Себестоимость.ПостатейныеПостоянныеРегл     КАК ПостатейныеПостоянныеРегл,
	|	Себестоимость.ПостатейныеПеременныеРегл     КАК ПостатейныеПеременныеРегл,
	|	Себестоимость.РезервПодОбесценениеРегл      КАК РезервПодОбесценениеРегл,
	|	Себестоимость.СтоимостьУпр     				КАК СтоимостьУпр,
	|	Себестоимость.СтоимостьУпр
	|		+Себестоимость.ПостатейныеПостоянныеУпр
	|		+Себестоимость.ПостатейныеПеременныеУпр
	|		+Себестоимость.ТрудозатратыУпр
	|		+Себестоимость.ДопРасходыУпр			КАК СуммаУпр,
	|	Себестоимость.ДопРасходыУпр     			КАК ДопРасходыУпр,
	|	Себестоимость.ТрудозатратыУпр     			КАК ТрудозатратыУпр,
	|	Себестоимость.ПостатейныеПостоянныеУпр     	КАК ПостатейныеПостоянныеУпр,
	|	Себестоимость.ПостатейныеПеременныеУпр     	КАК ПостатейныеПеременныеУпр,
	|	Себестоимость.РезервПодОбесценениеУпр       КАК РезервПодОбесценениеУпр
	|ПОМЕСТИТЬ ВТОстаткиМалоценныхМЦ
	|ИЗ
	|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Себестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО Себестоимость.Организация = ДокументыРасчетаСебестоимости.Организация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаНоменклатуры
	|			ПО Себестоимость.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.КлючАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаБухУчета.СрезПоследних(&КонецПериода) КАК УчетнаяПолитика
	|			ПО Себестоимость.Организация.ГоловнаяОрганизация = УчетнаяПолитика.Организация
	|			И УчетнаяПолитика.СписыватьСтоимостьМалоценныхТМЦНаРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
	|			ПО НастройкиХозяйственныхОпераций.ХозяйственнаяОперация =
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыМалоценныхТМЦВМесяцеПриобретения)
	|ГДЕ
	|	ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК ПорядокОтраженияНаСчетахУчета
	|			ГДЕ (Себестоимость.Организация = ПорядокОтраженияНаСчетахУчета.Организация
	|				ИЛИ ПорядокОтраженияНаСчетахУчета.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|			И Себестоимость.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|			И АналитикаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета = ПорядокОтраженияНаСчетахУчета.АналитикаУчета
	|			И (АналитикаНоменклатуры.МестоХранения = ПорядокОтраженияНаСчетахУчета.МестоУчета
	|				ИЛИ ПорядокОтраженияНаСчетахУчета.МестоУчета = НЕОПРЕДЕЛЕНО)
	|			И ПорядокОтраженияНаСчетахУчета.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе)
	|			И ПорядокОтраженияНаСчетахУчета.ОтноситсяКМалоценнымТМЦ)";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	ИмяВременнойТаблицыИсточник = "ВТОстаткиМалоценныхМЦ";
		
#Область СебестоимостьТоваров
	
	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	ИмяВременнойТаблицы = "ВтДвиженияСебестоимостьТоваров";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьИдентификаторыВоВременнуюТаблицу(ПараметрыРасчета, ОписаниеПриемника, ИмяВременнойТаблицыИсточник);
	
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, ИмяВременнойТаблицыИсточник);
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, ИмяВременнойТаблицыИсточник, ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти
		
#Область ПрочиеРасходы
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	ИмяВременнойТаблицы = "ВтДвиженияПрочиеРасходы";
	
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, ИмяВременнойТаблицыИсточник);
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "ИСТИНА");
		
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, ИмяВременнойТаблицыИсточник, ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти
		
#Область ДвиженияНоменклатураДоходыРасходы
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	ИмяВременнойТаблицы = "ВтДвиженияНоменклатураДоходыРасходы";
	
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, ИмяВременнойТаблицыИсточник);
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, ИмяВременнойТаблицыИсточник, ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвиженияИзВременныхТаблиц(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	
КонецПроцедуры
//-- Локализация
//-- НЕ УТ

Процедура СформироватьДвиженияПрочиеРасходыДопРасходыЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений, РасходныеДвижения = Истина)

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля = "
	|Период, ВидДвижения, Регистратор, НастройкаХозяйственнойОперации, ИдентификаторФинЗаписи";

	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	СтруктураПараметров = Новый Структура();
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	УсловиеГде = "";
	// Заполним дополнительные свойства движения
	Если РасходныеДвижения Тогда
		
		ИмяВременнойТаблицы = "втПрочиеРасходыДополнительныеРасходыРасходныеДвижения";
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"СлужебноеВидДвиженияПриход", "ЛОЖЬ");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"Организация", "Организация");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"Подразделение", "Подразделение");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"НаправлениеДеятельности", "НаправлениеДеятельности");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"СтатьяРасходов", "СтатьяРасходов");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"АналитикаРасходов", "АналитикаРасходов");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"КорСтатьяРасходов", "КорСтатьяРасходов");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"КорАналитикаРасходов", "КорАналитикаРасходов");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"КорПодразделение", "КорПодразделение");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"КорНаправлениеДеятельности", "КорНаправлениеДеятельности");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"ХозяйственнаяОперация", "ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимость)");

	Иначе
		
		ИмяВременнойТаблицы = "втПрочиеРасходыДополнительныеРасходыПриходныеДвижения";
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"СлужебноеВидДвиженияПриход", "Истина");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"Организация", "КорОрганизация");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"Подразделение", "КорПодразделение");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"НаправлениеДеятельности", "КорНаправлениеДеятельности");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"СтатьяРасходов", "КорСтатьяРасходов");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"АналитикаРасходов", "КорАналитикаРасходов");
		
		УсловиеГде =
			"ТИПЗНАЧЕНИЯ(КорСтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
			|	И НЕ КорСтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)";
			
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
		"Сумма", "ПостатейныеПеременныеСНДС + ПостатейныеПостоянныеСНДС + ДопРасходы");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
		"СуммаБезНДС", "ПостатейныеПеременныеБезНДС + ПостатейныеПостоянныеБезНДС + ДопРасходыБезНДС");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаУпр", "
	|ВЫБОР
	|	КОГДА НЕ &УправленческийУчетОрганизаций ТОГДА
	|		0
	|	ИНАЧЕ
	|		ПостатейныеПеременныеУпр + ПостатейныеПостоянныеУпр + ДопРасходыУпр
	|КОНЕЦ");
	
	СтруктураПараметров.Вставить("УправленческийУчетОрганизаций", ПараметрыРасчета.УправленческийУчетОрганизаций);
	СтруктураПараметров.Вставить("ИспользоватьУчетПрочихДоходовРасходовРегл", ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходовРегл);
	
	// СуммаРегл
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаРегл", "
	|ВЫБОР
	|	КОГДА НЕ &ИспользоватьУчетПрочихДоходовРасходовРегл ТОГДА
	|		0
	|	ИНАЧЕ
	|		ПостатейныеПеременныеРегл + ПостатейныеПостоянныеРегл + ДопРасходыРегл
	|КОНЕЦ");
	
	// ПостояннаяРазница
	Если РасходныеДвижения Тогда
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостояннаяРазница", "
		|ВЫБОР
		|	КОГДА НЕ &ИспользоватьУчетПрочихДоходовРасходовРегл ТОГДА
		|		0
		|	ИНАЧЕ
		|		ПостояннаяРазница
		|КОНЕЦ");
	Иначе 
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостояннаяРазница", "
		|ВЫБОР
		|	КОГДА НЕ &ИспользоватьУчетПрочихДоходовРасходовРегл ТОГДА
		|		0
		|	КОГДА НЕ КорСтатьяРасходов.ПринятиеКНалоговомуУчету ТОГДА
		|		ПостояннаяРазница + ПостатейныеПеременныеРегл + ПостатейныеПостоянныеРегл + ДопРасходыРегл
		|	ИНАЧЕ
		|		ПостояннаяРазница
		|КОНЕЦ");
	КонецЕсли;
	
	// ВременнаяРазница
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВременнаяРазница", "
	|ВЫБОР
	|	КОГДА НЕ &ИспользоватьУчетПрочихДоходовРасходовРегл ТОГДА
	|		0
	|	ИНАЧЕ
	|		ВременнаяРазница
	|КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГде, СтруктураПараметров);
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

Процедура СформироватьДвиженияПрочиеАктивыПассивыДопРасходыЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений, РасходныеДвижения = Истина)

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя;
	
	КопируемыеПоля = "
	|Период, Регистратор";

	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	СтруктураПараметров = Новый Структура();
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	ИмяВременнойТаблицы = "втПрочиеАктивыПассивы";
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
		"Организация", "КорОрганизация");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
		"Подразделение", "КорПодразделение");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
		"НаправлениеДеятельности", "КорНаправлениеДеятельности");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
		"Статья", "КорСтатьяАктивовПассивов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
		"Аналитика", "КорАналитикаАктивовПассивов");
	
	УсловиеГде =
		"ТИПЗНАЧЕНИЯ(КорСтатьяАктивовПассивов) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
		|	И НЕ КорСтатьяАктивовПассивов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
		"Сумма", "ПостатейныеПеременныеСНДС + ПостатейныеПостоянныеСНДС + ДопРасходы");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГде, СтруктураПараметров);
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

Процедура СформироватьДвиженияСебестоимостьТоваровДополнительныхРасходовЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений, РасходныеДвижения = Ложь)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	Если РасходныеДвижения Тогда
		ИмяВременнойТаблицы = "ВтСебестоимостьТоваров_ДополнительныеРасходыРасход";
	Иначе
		ИмяВременнойТаблицы = "ВтСебестоимостьТоваров_ДополнительныеРасходыПриход";
	КонецЕсли;
	
	// Кор. стоимость не включается в список полей.
	КопируемыеПоля = "
	|Период, Регистратор, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация, ХозяйственнаяОперация,
	|НастройкаХозяйственнойОперации, ИдентификаторФинЗаписи, Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета,
	|ВидДеятельностиНДС, ТипЗаписи,
	|ПостояннаяРазница, ВременнаяРазница, ДопРасходы, ДопРасходыБезНДС, ДопРасходыРегл, ДопРасходыУпр,
	|ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, ПостатейныеПеременныеРегл, ПостатейныеПеременныеУпр,
	|ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС, ПостатейныеПостоянныеРегл, ПостатейныеПостоянныеУпр";
	
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	Если РасходныеДвижения Тогда
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "ЛОЖЬ");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Организация", "КорОрганизация");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтатьяРасходовСписания", "КорСтатьяРасходов");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаРасходов", "КорАналитикаРасходов");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтатьяАктивовПассивов", "КорСтатьяАктивовПассивов");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаАктивовПассивов", "КорАналитикаАктивовПассивов");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Подразделение", "КорПодразделение");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "КорНаправлениеДеятельности", "КорНаправлениеДеятельности");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ХозяйственнаяОперация", "ХозяйственнаяОперация");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаУчетаПоПартнерам", "АналитикаУчетаПоПартнерам");
	Иначе
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "ИСТИНА");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Организация", "КорОрганизация");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтатьяРасходовСписания", "СтатьяРасходов");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаРасходов", "АналитикаРасходов");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Подразделение", "Подразделение");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
			"ХозяйственнаяОперация", "ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимость)");
	КонецЕсли;
	
	УсловиеГДЕ = "НЕ АналитикаУчетаНоменклатуры = НЕОПРЕДЕЛЕНО";
	Если РасходныеДвижения Тогда
		УсловиеГДЕ = УсловиеГДЕ + 
			" И НЕ (КорСтатьяРасходов = НЕОПРЕДЕЛЕНО
			|	И КорСтатьяАктивовПассивов = НЕОПРЕДЕЛЕНО)";
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГДЕ);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

Процедура СформироватьДвиженияНоменклатураДоходыДопРасходыЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений)

	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя;
	
	КопируемыеПоля = "
	|Период, Регистратор, ХозяйственнаяОперация, АналитикаУчетаНоменклатуры, ВидЗапасов, ТипЗапасов,
	|ИсточникГФУНоменклатуры, ДопРасходы, ДопРасходыБезНДС, ДопРасходыУпр, ДопРасходыРегл,
	|ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС, ПостатейныеПостоянныеУпр, ПостатейныеПостоянныеРегл,
	|ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, ПостатейныеПеременныеУпр, ПостатейныеПеременныеРегл,
	|ПостояннаяРазница, ВременнаяРазница";

	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	СтруктураПараметров = Новый Структура();
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
		
	ИмяВременнойТаблицы = "втДвиженияНоменклатураДоходыРасходы";
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
		"Организация", "КорОрганизация");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Подразделение",
	"ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(КорСтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	| И НЕ КорСтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	ТОГДА КорПодразделение
	|	ИНАЧЕ Подразделение КОНЕЦ");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
		"НаправлениеДеятельностиНоменклатуры", 
			"ЕСТЬNULL(АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,
			|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
		"Склад", "АналитикаУчетаНоменклатуры.МестоХранения");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтатьяДоходовРасходов",
	"ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(КорСтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	| И НЕ КорСтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	ТОГДА КорСтатьяРасходов
	|	ИНАЧЕ СтатьяРасходов КОНЕЦ");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаРасходов",
	"ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(КорСтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	| И НЕ КорСтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	ТОГДА КорАналитикаРасходов
	|	ИНАЧЕ АналитикаРасходов КОНЕЦ");
		
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
		"ДокументДвижения", "Регистратор");
		
	УсловиеГде =
		"ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеНДСНалоговымАгентом)
		|И ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
		|И ХозяйственнаяОперация <> НЕОПРЕДЕЛЕНО
		|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГде, СтруктураПараметров);
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

Процедура СформироватьДвиженияВыручкаИСебестоимостьДопРасходыЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений)

	ИмяРегистра = Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя;
	
	КопируемыеПоля = "
	|Период, Регистратор, ХозяйственнаяОперация, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Партия,
	|АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС, АналитикаУчетаПоПартнерам, ЗаказКлиента,
	|Менеджер, Склад, Соглашение, Договор, ТипЗапасов, ИсточникГФУРасчетов, ИсточникГФУНоменклатуры,
	|НастройкаХозяйственнойОперации, ИдентификаторФинЗаписи,
	|ДопРасходы, ДопРасходыБезНДС, ДопРасходыУпр, ДопРасходыРегл,
	|ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС, ПостатейныеПостоянныеУпр, ПостатейныеПостоянныеРегл,
	|ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, ПостатейныеПеременныеУпр, ПостатейныеПеременныеРегл,
	|ПостояннаяРазница, ВременнаяРазница";

	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	СтруктураПараметров = Новый Структура();
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
		
	ИмяВременнойТаблицы = "втДвиженияВыручкаИСебестоимость";
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
		"Подразделение", "КорПодразделение");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей,
		"ДокументДвижения", "Регистратор");
		
	УсловиеГде =
		"ТИПЗНАЧЕНИЯ(АналитикаУчетаПоПартнерам) = ТИП(Справочник.КлючиАналитикиУчетаПоПартнерам)
		|	И НЕ АналитикаУчетаПоПартнерам = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГде, СтруктураПараметров);
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

Процедура СформироватьДвиженияПоОтклонениямВСтоимостиТоваров(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СформироватьДвиженияПоОтклонениямВСтоимостиТоваров");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
	СоответствиеВременныхТаблицДвижений = Новый Соответствие;

	#Область ОтклоненияВСтоимостиПрочиеДоходы
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	// Измерения
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяДоходов,
	|	ДД.АналитикаДоходов,
	// Ресурсы
	|	-(ДД.Стоимость
	|		+ ДД.ДопРасходы
	|		+ ДД.Трудозатраты
	|		+ ДД.ПостатейныеПостоянныеСНДС
	|		+ ДД.ПостатейныеПеременныеСНДС) КАК Сумма,
	|	-(ДД.СтоимостьРегл
	|		+ ДД.ДопРасходыРегл
	|		+ ДД.ТрудозатратыРегл
	|		+ ДД.ПостатейныеПостоянныеРегл
	|		+ ДД.ПостатейныеПеременныеРегл
	|		+ ДД.РезервПодОбесценениеРегл) КАК СуммаРегл,
	|	-(ДД.СтоимостьУпр
	|		+ ДД.ДопРасходыУпр
	|		+ ДД.ТрудозатратыУпр
	|		+ ДД.ПостатейныеПостоянныеУпр
	|		+ ДД.ПостатейныеПеременныеУпр
	|		+ ДД.РезервПодОбесценениеУпр) КАК СуммаУпр,
	// Реквизиты
	|	ДД.ХозяйственнаяОперация,
	|	ДД.ИдентификаторСтроки,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ДД.ИдентификаторФинЗаписи
	|
	|ПОМЕСТИТЬ ВтДвиженияПрочиеДоходы
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейпартий.ОтклонениеВСтоимостиНаПрочиеДоходы)
	|	И ДД.РасчетПартий
	|	И НЕ ДД.Сторно
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтПрочиеДоходыОтклоненияВСтоимости";
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеДоходы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияПрочиеДоходы");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияПрочиеДоходы", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
	#КонецОбласти
	
	#Область ОтклоненияВСтоимостиПрочиеРасходы
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	// Измерения
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяРасходовСписания КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	// Ресурсы
	|	(ДД.Стоимость
	|		+ ДД.ДопРасходы
	|		+ ДД.Трудозатраты
	|		+ ДД.ПостатейныеПостоянныеСНДС
	|		+ ДД.ПостатейныеПеременныеСНДС) КАК Сумма,
	|	(ДД.СтоимостьБезНДС
	|		+ ДД.ДопРасходыБезНДС
	|		+ ДД.Трудозатраты
	|		+ ДД.ПостатейныеПостоянныеБезНДС
	|		+ ДД.ПостатейныеПеременныеБезНДС) КАК СуммаБезНДС,
	|	(ДД.СтоимостьРегл
	|		+ ДД.ДопРасходыРегл
	|		+ ДД.ТрудозатратыРегл
	|		+ ДД.ПостатейныеПостоянныеРегл
	|		+ ДД.ПостатейныеПеременныеРегл
	|		+ ДД.РезервПодОбесценениеРегл) КАК СуммаРегл,
	|	ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	ДД.ВременнаяРазница КАК ВременнаяРазница,
	|	(ДД.СтоимостьУпр
	|		+ ДД.ДопРасходыУпр
	|		+ ДД.ТрудозатратыУпр
	|		+ ДД.ПостатейныеПостоянныеУпр
	|		+ ДД.ПостатейныеПеременныеУпр
	|		+ ДД.РезервПодОбесценениеУпр) КАК СуммаУпр,
	// Реквизиты
	|	ДД.ХозяйственнаяОперация,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ДокументДвижения,
	|	ДД.ИдентификаторСтроки,
	|	ДД.НастройкаХозяйственнойОперации,
	|	ДД.ИдентификаторФинЗаписи
	|
	|ПОМЕСТИТЬ ВтДвиженияПрочиеРасходы
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейпартий.ОтклонениеВСтоимостиНаПрочиеРасходы)
	|	И ДД.РасчетПартий
	|	И НЕ ДД.Сторно
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтПрочиеРасходыОтклоненияВСтоимости";
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияПрочиеРасходы");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияПрочиеРасходы", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
	#КонецОбласти
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвиженияИзВременныхТаблиц(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	
	// Уничтожим ненужные временные таблицы.
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета, СуществующиеВТ);
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);	
	
КонецПроцедуры

// Этап 3.17
Процедура СкорректироватьСтоимостьПродаж(ПараметрыРасчета) Экспорт

	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СкорректироватьСтоимостьПродаж");
	
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Продажи.Период                     КАК Период,
	|	Продажи.Регистратор                КАК Регистратор,
	|	ЕСТЬNULL(РегистраторыРасчета.Ссылка,
	|		ЗНАЧЕНИЕ(Документ.РегистраторРасчетаСебестоимости.ПустаяСсылка)) КАК ДокументРасчета,
	|	АналитикаПартнеров.Организация     КАК Организация,
	|	Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажи.ЗаказКлиента               КАК ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
	|	АналитикаПартнеров.Партнер         КАК Партнер,
	|	АналитикаПартнеров.Контрагент      КАК Контрагент,
	|	Продажи.Подразделение              КАК Подразделение,
	|	Продажи.ТипЗапасов                 КАК ТипЗапасов,
	|	Продажи.ВидЗапасов                 КАК ВидЗапасов,
	|	Продажи.Менеджер                   КАК Менеджер,
	|	Продажи.Склад                      КАК Склад,
	|	Продажи.Соглашение                 КАК Соглашение,
	|	Продажи.Договор                    КАК Договор,
	|	Продажи.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС         КАК НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов       КАК ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента            КАК ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры    КАК ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов        КАК ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	ВЫБОР КОГДА &ПартионныйУчетВерсии22 ТОГДА
	|		Продажи.РазделУчета
	|	КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|	КОГДА Продажи.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|	КОГДА Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|	КОГДА Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Организация) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|	КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ КАК РазделУчета,
	|	Продажи.Партия 					   КАК Партия,
	|	Продажи.АналитикаУчетаПартий 	   КАК АналитикаУчетаПартий,
	|	Продажи.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|	(ВЫБОР
	|		КОГДА &ПартионныйУчетВерсии22 ТОГДА Продажи.ВидДеятельностиНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КОНЕЦ) КАК ВидДеятельностиНДС,
	|	Продажи.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	Продажи.ИдентификаторФинЗаписи     КАК ИдентификаторФинЗаписи,
	|	Продажи.Сторно                     КАК Сторно,
	|	(ВЫБОР
	|		КОГДА Продажи.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализацииВозвратНаДругойСклад))
	|		 ИЛИ СУММА(Продажи.Количество) < 0
	|			ТОГДА -1
	|		ИНАЧЕ 1 КОНЕЦ) КАК Знак,
	|	СУММА(Продажи.Количество)          КАК Количество
	|ПОМЕСТИТЬ ВтТаблицаКорректировки
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО Аналитика.Ссылка = Продажи.АналитикаУчетаНоменклатуры
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|		ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|	ЛЕВОЕ СОЕДИНЕНИЕ РассчитанныеДокументы КАК РассчитанныеДокументы
	|		ПО РассчитанныеДокументы.Период = Продажи.Период
	|		И РассчитанныеДокументы.Регистратор = Продажи.Регистратор
	|		И &РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие)
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистраторыРасчетаСебестоимости КАК РегистраторыРасчета
	|		ПО РегистраторыРасчета.Организация = АналитикаПартнеров.Организация
	|ГДЕ
	|	Продажи.ХозяйственнаяОперация В (&МассивОперацийРеализации)
	// При предварительном расчете исключаем документы, для которых сохранены ранее рассчитанные движения
	|	И РассчитанныеДокументы.Регистратор ЕСТЬ NULL
	|	
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	ЕСТЬNULL(РегистраторыРасчета.Ссылка,
	|		ЗНАЧЕНИЕ(Документ.РегистраторРасчетаСебестоимости.ПустаяСсылка)), // ДокументРасчета
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам,
	|	АналитикаПартнеров.Партнер,
	|	АналитикаПартнеров.Контрагент,
	|	Продажи.Подразделение,
	|	Продажи.ТипЗапасов,
	|	Продажи.ВидЗапасов,
	|	Продажи.Менеджер,
	|	Продажи.Склад,
	|	Продажи.Соглашение,
	|	Продажи.Договор,
	|	Продажи.ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры,
	|	АналитикаПартнеров.Организация,
	|	ВЫБОР КОГДА &ПартионныйУчетВерсии22 ТОГДА
	|		Продажи.РазделУчета
	|	КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|	КОГДА Продажи.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|	КОГДА Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|	КОГДА Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Организация) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|	КОГДА Продажи.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ,
	|	Продажи.Партия,
	|	Продажи.АналитикаУчетаПартий,
	|	Продажи.АналитикаФинансовогоУчета,
	|	(ВЫБОР
	|		КОГДА &ПартионныйУчетВерсии22 ТОГДА Продажи.ВидДеятельностиНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КОНЕЦ),
	|	(ВЫБОР
	|		КОГДА Продажи.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализацииВозвратНаДругойСклад))
	|			ТОГДА -1
	|		ИНАЧЕ 1 КОНЕЦ), // Знак
	|	Продажи.НастройкаХозяйственнойОперации,
	|	Продажи.ИдентификаторФинЗаписи,
	|	Продажи.Сторно
	|
	|ИМЕЮЩИЕ
	|
	|	СУММА(Продажи.Количество) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	Организация,
	|	РазделУчета
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаКорректировки.Период,
	|	ТаблицаКорректировки.Регистратор КАК Регистратор,
	|	ТаблицаКорректировки.ДокументРасчета
	|
	|ПОМЕСТИТЬ ВтРегистраторыПродаж
	|ИЗ
	|	ВтТаблицаКорректировки КАК ТаблицаКорректировки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Себестоимость.Период,
	|	Себестоимость.Регистратор,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.ЗаказКлиента,
	|	Себестоимость.АналитикаУчетаПоПартнерам,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализацииВозвратНаДругойСклад))
	|		ИЛИ СУММА(Себестоимость.Количество) < 0
	|			ТОГДА -1
	|		ИНАЧЕ 1 КОНЕЦ) КАК Знак,
	|	Себестоимость.Сторно,
	|	СУММА(Себестоимость.Количество) КАК Количество,
	|	СУММА(Себестоимость.Стоимость) КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.ДопРасходы) КАК ДопРасходы,
	|	СУММА(Себестоимость.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
	|	СУММА(Себестоимость.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Себестоимость.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Себестоимость.ВременнаяРазница) КАК ВременнаяРазница,
	|	СУММА(Себестоимость.СтоимостьЗабалансовая) КАК СтоимостьЗабалансовая,
	|	СУММА(Себестоимость.Трудозатраты) КАК Трудозатраты,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеСНДС) КАК ПостатейныеПостоянныеСНДС,
	|	СУММА(Себестоимость.ПостатейныеПеременныеСНДС) КАК ПостатейныеПеременныеСНДС,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеБезНДС) КАК ПостатейныеПостоянныеБезНДС,
	|	СУММА(Себестоимость.ПостатейныеПеременныеБезНДС) КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(Себестоимость.СтоимостьЗабалансоваяРегл) КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(Себестоимость.ДопРасходыРегл) КАК ДопРасходыРегл,
	|	СУММА(Себестоимость.ТрудозатратыРегл) КАК ТрудозатратыРегл,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеРегл) КАК ПостатейныеПостоянныеРегл,
	|	СУММА(Себестоимость.ПостатейныеПеременныеРегл) КАК ПостатейныеПеременныеРегл,
	|	СУММА(Себестоимость.РезервПодОбесценениеРегл) КАК РезервПодОбесценениеРегл,
	|	СУММА(Себестоимость.РезервПодОбесценениеУпр) КАК РезервПодОбесценениеУпр,
	|	СУММА(Себестоимость.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(Себестоимость.ДопРасходыУпр) КАК ДопРасходыУпр,
	|	СУММА(Себестоимость.ТрудозатратыУпр) КАК ТрудозатратыУпр,
	|	СУММА(Себестоимость.ПостатейныеПостоянныеУпр) КАК ПостатейныеПостоянныеУпр,
	|	СУММА(Себестоимость.ПостатейныеПеременныеУпр) КАК ПостатейныеПеременныеУпр
	|ПОМЕСТИТЬ ВтСебестоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторыПродаж КАК РегистраторыПродаж
	|		ПО РегистраторыПродаж.Период = Себестоимость.Период
	|		И РегистраторыПродаж.Регистратор = Себестоимость.Регистратор
	|		И (РегистраторыПродаж.ДокументРасчета = Себестоимость.ДокументРасчета
	|			ИЛИ НЕ Себестоимость.РасчетСебестоимости) 
	|ГДЕ
	|	НЕ Себестоимость.СлужебноеВидДвиженияПриход
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Период,
	|	Себестоимость.Регистратор,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.ЗаказКлиента,
	|	Себестоимость.АналитикаУчетаПоПартнерам,
	|	Себестоимость.Сторно,
	|	Себестоимость.ХозяйственнаяОперация,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализацииВозвратНаДругойСклад))
	|			ТОГДА -1
	|		ИНАЧЕ 1 КОНЕЦ) // Знак
	|;";
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
#Область РаспределениеДанных
	
	// Инициализируем распределение
	ПоляСвязи = "Период, Регистратор, АналитикаУчетаНоменклатуры, ВидЗапасов, Организация, РазделУчета, Партия, АналитикаУчетаПартий,
		|АналитикаФинансовогоУчета, ВидДеятельностиНДС, ЗаказКлиента, АналитикаУчетаПоПартнерам, Знак, Сторно";
	ПараметрыРаспределения = РасчетСебестоимостиУниверсальныеАлгоритмы.ИнициализироватьПараметрыРаспределенияМетодомУменьшаемогоОстатка(
		"ВтСебестоимость",
		"ВтТаблицаКорректировки",
		ПоляСвязи);
	
	ОписаниеРегистра = ПараметрыРасчета.Движения[Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя]; // описание регистра
	
	РаспределяемыеРесурсы = РасчетСебестоимостиУниверсальныеАлгоритмы.УдалитьЭлементыИзСтрокиШаблона(
		ОписаниеРегистра.РесурсыРегистра,
		"%1Количество");
	
	РасчетСебестоимостиУниверсальныеАлгоритмы.ИнициализироватьЧисловыеПоляРаспределенияМетодомУменьшаемогоОстатка(
		ПараметрыРаспределения,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(РаспределяемыеРесурсы, ""));
		
	ПрочиеПоляБазы = "Партнер, Контрагент, Подразделение, ТипЗапасов, Менеджер, Склад, Соглашение, Договор, ХозяйственнаяОперация,
		|НалогообложениеНДС, ВалютаВзаиморасчетов, ВалютаДокумента, ИсточникГФУНоменклатуры, ИсточникГФУРасчетов,
		|НаправлениеДеятельностиКонтрагента, НаправлениеДеятельностиНоменклатуры,
		|НастройкаХозяйственнойОперации, ИдентификаторФинЗаписи, ДокументРасчета";
		
	РасчетСебестоимостиУниверсальныеАлгоритмы.ИнициализироватьПрочиеПоляРаспределенияМетодомУменьшаемогоОстатка(
		ПараметрыРаспределения,
		,
		ПрочиеПоляБазы);
		
	// Распределяем
	РасчетСебестоимостиУниверсальныеАлгоритмы.РаспределитьМетодомУменьшаемогоОстатка(Запрос.МенеджерВременныхТаблиц, ПараметрыРаспределения);
	
#КонецОбласти
	
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
	
	// Формируются движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	// - Закупки
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	СоответствиеВременныхТаблицДвижений = Новый Соответствие;
	
#Область ВыручкаИСебестоимостьПродаж
	
	ИмяВременнойТаблицы = "ВтДвиженияВыручкаИСебестоимостьПродаж";
	ИмяРегистра = Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВТРезультатРаспределения");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Количество", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ДокументДвижения", "Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РежимЗакрытияМесяца", "&РежимЗакрытияМесяца");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВременнаяРазница", "ВременнаяРазница + РезервПодОбесценениеРегл");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РезервПодОбесценениеРегл", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РезервПодОбесценениеУпр", 0);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВТРезультатРаспределения", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти

#Область ВыручкаИСебестоимостьПродаж_СписаниеРезервовПодОбесценениеЗапасов
	
	ИмяВременнойТаблицы = "ВтДвиженияВыручкаИСебестоимостьПродаж_СписаниеРезервов";
	ИмяРегистра = Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВТРезультатРаспределения");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Количество", "0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ДокументДвижения", "Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "РежимЗакрытияМесяца", "&РежимЗакрытияМесяца");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ХозяйственнаяОперация", 
		"ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРезервовПодОбесценениеЗапасов)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НастройкаХозяйственнойОперации", 
		"ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеРезервовПодОбесценениеЗапасов)");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Стоимость", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьБезНДС", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ДопРасходы", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ДопРасходыБезНДС", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьУпр", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьРегл", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьЗабалансовая", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьЗабалансоваяРегл", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостояннаяРазница", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ДопРасходыУпр", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ДопРасходыРегл", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостатейныеПостоянныеСНДС", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостатейныеПостоянныеБезНДС", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостатейныеПостоянныеУпр", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостатейныеПостоянныеРегл", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Трудозатраты", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ТрудозатратыУпр", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ТрудозатратыРегл", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостатейныеПеременныеСНДС", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостатейныеПеременныеБезНДС", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостатейныеПеременныеУпр", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостатейныеПеременныеРегл", 0);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВременнаяРазница", 0);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВТРезультатРаспределения", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти

#Область Закупки

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Т.Период,
	|	Т.Регистратор,
	// Измерения
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУДругойОрганизации) КАК ХозяйственнаяОперация,
	|	Т.Контрагент КАК Организация,
	|	Т.Подразделение,
	|	Т.Менеджер,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.Склад,
	|	Т.ТипЗапасов,
	|	Т.ВидЗапасов,
	|	Т.Партнер,
	|	Т.Организация КАК Контрагент,
	|	Т.Соглашение,
	|	Т.Договор,
	// Ресурсы
	|	Т.Стоимость + Т.ДопРасходы + Т.Трудозатраты + Т.ПостатейныеПостоянныеСНДС + Т.ПостатейныеПеременныеСНДС КАК Стоимость,
	|	Т.СтоимостьБезНДС + Т.ДопРасходыБезНДС + Т.Трудозатраты + Т.ПостатейныеПостоянныеБезНДС + Т.ПостатейныеПеременныеБезНДС КАК СтоимостьБезНДС,
	// Реквизиты
	|	Т.ВалютаДокумента,
	|	Т.ВалютаВзаиморасчетов,
	|	Т.Регистратор КАК ДокументДвижения,
	|	Т.ИсточникГФУНоменклатуры,
	|	Т.ИсточникГФУРасчетов,
	|	Т.Сторно
	|ПОМЕСТИТЬ ВтДвиженияТаблицаЗакупки
	|ИЗ
	|	ВТРезультатРаспределения КАК Т
	|ГДЕ
	|	Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|";
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);

	ИмяВременнойТаблицы = "ВтДвиженияЗакупки";
	ИмяРегистра = Метаданные.РегистрыНакопления.Закупки.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВтДвиженияТаблицаЗакупки");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВтДвиженияТаблицаЗакупки", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);

#КонецОбласти
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвиженияИзВременныхТаблиц(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);
	
	// Уничтожим ненужные временные таблицы.
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета, СуществующиеВТ);
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.19
Процедура СписатьОшибкиОкругленияРасчетаСебестоимости(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СписатьОшибкиОкругленияРасчетаСебестоимости");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	//++ НЕ УТ
	Запрос.Текст = РасчетСебестоимостиПрикладныеАлгоритмы.ТекстЗапросаЗавершенныеПартии();
	Запрос.Выполнить();
	//-- НЕ УТ
	
	// Списываем только те остатки, в которых все "суммовые" ресурсы имеют значения, укладывающиеся в пределы погрешности. 
	// Если хоть один "суммовой" ресурс превышает величину погрешности, то такой остаток ошибкой округления не считаем.
	// Для регистра ПрочиеРасходы подход отличается: для него проверка ведется остатка для каждого ресурса по-отдельности.
	// Если какой-то ресурс укладывается в пределы погрешности, то списываем только его.
	
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
	
	СоответствиеВременныхТаблицДвижений = Новый Соответствие;
	
#Область СебестоимостьТоваров

	// Списание ошибок округления в регистре СебестоимостьТоваров
	// Также создадим пустую временную таблицу ВТОкруглениеПрочиеРасходы для УТ - там не будет ошибок округления в регистре ПрочиеРасходы.
	Запрос.Текст = "
	//++ НЕ УТ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство) КАК РазделУчета
	|ПОМЕСТИТЬ ЭтоВозвратныеОтходыНЗП
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|	И ДД.Количество < 0
	|	И ТИПЗНАЧЕНИЯ(ДД.Регистратор) В (
	|		ТИП(Документ.РаспределениеВозвратныхОтходов),
	|		ТИП(Документ.ПроизводствоБезЗаказа)
	//++ НЕ УТКА
	|		,ТИП(Документ.ЭтапПроизводства2_2)
	//-- НЕ УТКА
	|		)
	|	И ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Активность
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//-- НЕ УТ
	|ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка 		КАК Регистратор,
	|	&КонецПериода								КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)		КАК ВидДвижения,
	|
	|	Себестоимость.Организация 					КАК Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета 					КАК РазделУчета,
	|	Себестоимость.ВидЗапасов 					КАК ВидЗапасов,
	|	Себестоимость.Партия                        КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА Аналитика.Подразделение
	|		ИНАЧЕ Аналитика.СкладскаяТерритория.Подразделение
	|	КОНЕЦ 										КАК Подразделение,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости)	КАК СтатьяРасходовСписания,
	|	Аналитика.Назначение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	(ВЫБОР
	|		КОГДА ЛОЖЬ ТОГДА НЕОПРЕДЕЛЕНО // Для удобства расстановки тегов
	//++ НЕ УТ
	|		КОГДА НЕ ЭтоВозвратныеОтходыНЗП.Организация ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеОшибокОкругленияВозвратныеОтходы)
	//-- НЕ УТ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеОшибокОкругления) КОНЕЦ) КАК ХозяйственнаяОперация,
	|	(ВЫБОР
	|		КОГДА ЛОЖЬ ТОГДА НЕОПРЕДЕЛЕНО // Для удобства расстановки тегов
	//++ НЕ УТ
	|		КОГДА НЕ ЭтоВозвратныеОтходыНЗП.Организация ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеОшибокОкругленияВозвратныеОтходы)
	//-- НЕ УТ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеОшибокОкругления) КОНЕЦ) КАК НастройкаХозяйственнойОперации,
	|	Себестоимость.Стоимость 					КАК Стоимость,
	|	Себестоимость.СтоимостьБезНДС 				КАК СтоимостьБезНДС,
	|	Себестоимость.ДопРасходы 					КАК ДопРасходы,
	|	Себестоимость.ДопРасходыБезНДС 				КАК ДопРасходыБезНДС,
	|	Себестоимость.СтоимостьРегл 				КАК СтоимостьРегл,
	|	Себестоимость.ПостояннаяРазница 			КАК ПостояннаяРазница,
	|	Себестоимость.ВременнаяРазница 				КАК ВременнаяРазница,
	|	Себестоимость.СтоимостьЗабалансовая         КАК СтоимостьЗабалансовая,
	|	Себестоимость.Трудозатраты       		    КАК Трудозатраты,
	|	Себестоимость.ПостатейныеПостоянныеСНДС     КАК ПостатейныеПостоянныеСНДС,
	|	Себестоимость.ПостатейныеПостоянныеБезНДС   КАК ПостатейныеПостоянныеБезНДС,
	|	Себестоимость.ПостатейныеПеременныеСНДС     КАК ПостатейныеПеременныеСНДС,
	|	Себестоимость.ПостатейныеПеременныеБезНДС   КАК ПостатейныеПеременныеБезНДС,
	|	Себестоимость.СтоимостьЗабалансоваяРегл     КАК СтоимостьЗабалансоваяРегл,
	|	Себестоимость.ДопРасходыРегл                КАК ДопРасходыРегл,
	|	Себестоимость.ТрудозатратыРегл              КАК ТрудозатратыРегл,
	|	Себестоимость.ПостатейныеПостоянныеРегл     КАК ПостатейныеПостоянныеРегл,
	|	Себестоимость.ПостатейныеПеременныеРегл     КАК ПостатейныеПеременныеРегл,
	|	Себестоимость.СтоимостьУпр     				КАК СтоимостьУпр,
	|	Себестоимость.ДопРасходыУпр     			КАК ДопРасходыУпр,
	|	Себестоимость.ТрудозатратыУпр     			КАК ТрудозатратыУпр,
	|	Себестоимость.ПостатейныеПостоянныеУпр     	КАК ПостатейныеПостоянныеУпр,
	|	Себестоимость.ПостатейныеПеременныеУпр     	КАК ПостатейныеПеременныеУпр
	|ПОМЕСТИТЬ ВТОкруглениеСебестоимостьТоваров
	|ИЗ
	|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Себестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО Себестоимость.Организация = ДокументыРасчетаСебестоимости.Организация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО Аналитика.Ссылка = Себестоимость.АналитикаУчетаНоменклатуры
	//++ НЕ УТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЭтоВозвратныеОтходыНЗП КАК ЭтоВозвратныеОтходыНЗП
	|		ПО ЭтоВозвратныеОтходыНЗП.Организация = Себестоимость.Организация
	|			И ЭтоВозвратныеОтходыНЗП.АналитикаУчетаНоменклатуры = Себестоимость.АналитикаУчетаНоменклатуры
	|			И ЭтоВозвратныеОтходыНЗП.ВидЗапасов = Себестоимость.ВидЗапасов
	|			И ЭтоВозвратныеОтходыНЗП.РазделУчета = Себестоимость.РазделУчета
	//-- НЕ УТ
	|ГДЕ
	|	Себестоимость.Количество = 0
	|	И (Себестоимость.Стоимость МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.СтоимостьБезНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ДопРасходы МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ДопРасходыБезНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.СтоимостьРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьРегл И &ЗначениеПогрешностиСебестоимостьРегл
	|		И Себестоимость.СтоимостьУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	//++ НЕ УТ
	|		И Себестоимость.ПостояннаяРазница МЕЖДУ -&ЗначениеПогрешностиСебестоимостьРегл И &ЗначениеПогрешностиСебестоимостьРегл
	|		И Себестоимость.ВременнаяРазница МЕЖДУ -&ЗначениеПогрешностиСебестоимостьРегл И &ЗначениеПогрешностиСебестоимостьРегл
	//-- НЕ УТ
	|		И Себестоимость.СтоимостьЗабалансовая МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.Трудозатраты МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ПостатейныеПостоянныеСНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ПостатейныеПостоянныеБезНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ПостатейныеПеременныеСНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ПостатейныеПеременныеБезНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.СтоимостьЗабалансоваяРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьРегл И &ЗначениеПогрешностиСебестоимостьРегл
	|		И Себестоимость.ДопРасходыРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьРегл И &ЗначениеПогрешностиСебестоимостьРегл
	|		И Себестоимость.ТрудозатратыРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьРегл И &ЗначениеПогрешностиСебестоимостьРегл
	|		И Себестоимость.ПостатейныеПостоянныеРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьРегл И &ЗначениеПогрешностиСебестоимостьРегл
	|		И Себестоимость.ПостатейныеПеременныеРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьРегл И &ЗначениеПогрешностиСебестоимостьРегл
	|		И Себестоимость.СтоимостьУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ДопРасходыУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ТрудозатратыУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ПостатейныеПостоянныеУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр
	|		И Себестоимость.ПостатейныеПеременныеУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И &ЗначениеПогрешностиСебестоимостьУпр)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка 		КАК ДокументДвижения,
	|	&КонецПериода								КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)		КАК ВидДвижения,
	|
	|	Себестоимость.Организация 					КАК Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета 					КАК РазделУчета,
	|	Себестоимость.ВидЗапасов 					КАК ВидЗапасов,
	|	Себестоимость.Партия                        КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА Аналитика.Подразделение
	|		ИНАЧЕ Аналитика.СкладскаяТерритория.Подразделение
	|	КОНЕЦ 										КАК Подразделение,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости)	КАК СтатьяРасходовСписания,
	|	Аналитика.Назначение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеОшибокОкругления) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеОшибокОкругления) КАК НастройкаХозяйственнойОперации,
	|	(ВЫБОР
	|		КОГДА Себестоимость.Стоимость МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.Стоимость
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК Стоимость,
	|	(ВЫБОР
	|		КОГДА Себестоимость.СтоимостьБезНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.СтоимостьБезНДС
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК СтоимостьБезНДС,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ДопРасходы МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.ДопРасходы
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК ДопРасходы,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ДопРасходыБезНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.ДопРасходыБезНДС
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК ДопРасходыБезНДС,
	|	(ВЫБОР
	|		КОГДА Себестоимость.СтоимостьРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.СтоимостьРегл
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК СтоимостьРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	(ВЫБОР
	|		КОГДА Себестоимость.СтоимостьЗабалансовая МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.СтоимостьЗабалансовая
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК СтоимостьЗабалансовая,
	|	(ВЫБОР
	|		КОГДА Себестоимость.Трудозатраты МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.Трудозатраты
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК Трудозатраты,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ПостатейныеПостоянныеСНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.ПостатейныеПостоянныеСНДС
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК ПостатейныеПостоянныеСНДС,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ПостатейныеПостоянныеБезНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.ПостатейныеПостоянныеБезНДС
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК ПостатейныеПостоянныеБезНДС,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ПостатейныеПеременныеСНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.ПостатейныеПеременныеСНДС
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК ПостатейныеПеременныеСНДС,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ПостатейныеПеременныеБезНДС МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.ПостатейныеПеременныеБезНДС
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК ПостатейныеПеременныеБезНДС,
	|	(ВЫБОР
	|		КОГДА Себестоимость.СтоимостьЗабалансоваяРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК СтоимостьЗабалансоваяРегл,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ДопРасходыРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.ДопРасходыРегл
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК ДопРасходыРегл,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ТрудозатратыРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.ТрудозатратыРегл
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК ТрудозатратыРегл,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ПостатейныеПостоянныеРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.ПостатейныеПостоянныеРегл
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК ПостатейныеПостоянныеРегл,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ПостатейныеПеременныеРегл МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.ПостатейныеПеременныеРегл
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК ПостатейныеПеременныеРегл,
	|	(ВЫБОР
	|		КОГДА Себестоимость.СтоимостьУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.СтоимостьУпр
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК СтоимостьУпр,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ДопРасходыУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.ДопРасходыУпр
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК ДопРасходыУпр,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ТрудозатратыУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.ТрудозатратыУпр
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК ТрудозатратыУпр,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ПостатейныеПостоянныеУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.ПостатейныеПостоянныеУпр
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК ПостатейныеПостоянныеУпр,
	|	(ВЫБОР
	|		КОГДА Себестоимость.ПостатейныеПеременныеУпр МЕЖДУ -&ЗначениеПогрешностиСебестоимостьУпр И 0 ТОГДА Себестоимость.ПостатейныеПеременныеУпр
	|		ИНАЧЕ 0 КОНЕЦ) 							КАК ПостатейныеПеременныеУпр
	|ИЗ
	|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Себестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО Себестоимость.Организация = ДокументыРасчетаСебестоимости.Организация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО Аналитика.Ссылка = Себестоимость.АналитикаУчетаНоменклатуры
	|
	|ГДЕ
	|	Себестоимость.Количество > 0
	|	И (
	|		(Себестоимость.Стоимость
	|		+ Себестоимость.ДопРасходы
	|		+ Себестоимость.Трудозатраты
	|		+ Себестоимость.ПостатейныеПостоянныеСНДС
	|		+ Себестоимость.ПостатейныеПеременныеСНДС) < 0
	|	ИЛИ (Себестоимость.СтоимостьБезНДС
	|		+ Себестоимость.ДопРасходыБезНДС
	|		+ Себестоимость.Трудозатраты
	|		+ Себестоимость.ПостатейныеПостоянныеБезНДС
	|		+ Себестоимость.ПостатейныеПеременныеБезНДС) < 0 
	|	ИЛИ (Себестоимость.СтоимостьРегл
	|		+ Себестоимость.ДопРасходыРегл
	|		+ Себестоимость.ТрудозатратыРегл
	|		+ Себестоимость.ПостатейныеПостоянныеРегл
	|		+ Себестоимость.ПостатейныеПеременныеРегл) < 0
	|	ИЛИ (Себестоимость.СтоимостьУпр
	|		+ Себестоимость.ДопРасходыУпр
	|		+ Себестоимость.ТрудозатратыУпр
	|		+ Себестоимость.ПостатейныеПостоянныеУпр
	|		+ Себестоимость.ПостатейныеПеременныеУпр) < 0
	|	)
	//++ НЕ УТ
	|	И НЕ Себестоимость.Партия В (
	|			ВЫБРАТЬ
	|				ЗавершенныеПартии.Партия КАК Партия
	|			ИЗ
	|				ЗавершенныеПартии КАК ЗавершенныеПартии)
	//-- НЕ УТ
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//++ НЕ УТ
	|
	|УНИЧТОЖИТЬ ЗавершенныеПартии
	|;
	|УНИЧТОЖИТЬ ПартииПроизводства
	|;
	//-- НЕ УТ
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	НЕОПРЕДЕЛЕНО КАК Период,
	|	ЛОЖЬ		 КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	0 			 КАК Сумма,
	|	0 			 КАК СуммаБезНДС,
	|	0 			 КАК СуммаРегл,
	|	0 			 КАК СуммаУпр,
	|	0 			 КАК ПостояннаяРазница,
	|	0 			 КАК ВременнаяРазница,
	|	""""         КАК ИдентификаторФинЗаписи
	|ПОМЕСТИТЬ ВТОкруглениеПрочиеРасходы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	НЕОПРЕДЕЛЕНО КАК Период,
	|	ЛОЖЬ         КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ПартияПроизводства,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказНаПроизводство,
	|	НЕОПРЕДЕЛЕНО КАК КодСтрокиПродукция,
	|	НЕОПРЕДЕЛЕНО КАК Этап,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяКалькуляции,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаПродукции,
	|	НЕОПРЕДЕЛЕНО КАК ПравилоОтнесенияНаВыпуск,
	|	0            КАК Стоимость,
	|	0            КАК СтоимостьБезНДС,
	|	0            КАК СтоимостьРегл,
	|	0            КАК СтоимостьУпр,
	|	0            КАК ПостояннаяРазница,
	|	0            КАК ВременнаяРазница,
	|	0            КАК ДоляСтоимости,
	|	""""         КАК ИдентификаторФинЗаписи
	|ПОМЕСТИТЬ ВТОкруглениеПрочиеРасходыНЗП
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	НЕОПРЕДЕЛЕНО КАК Период,
	|	ЛОЖЬ         КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ВидРезервов,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК ОбъектУчетаРезервов,
	|	0            КАК СуммаУпр,
	|	0            КАК СуммаРегл,
	|	""""         КАК ИдентификаторФинЗаписи
	|ПОМЕСТИТЬ ВТОкруглениеРезервыПредстоящихРасходов
	|;
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	ИмяВременнойТаблицы = "ВтПогрешностьСебестоимостьТоваров";
	ИмяВременнойТаблицыИсточник = "ВТОкруглениеСебестоимостьТоваров";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьИдентификаторыВоВременнуюТаблицу(ПараметрыРасчета, ОписаниеПриемника, ИмяВременнойТаблицыИсточник);
	
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, ИмяВременнойТаблицыИсточник);
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, ИмяВременнойТаблицыИсточник, ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);

#КонецОбласти

#Область ПрочиеРасходы

	// Списание ошибок округления в регистре ПрочиеРасходы
	Запрос.Текст =
	"УНИЧТОЖИТЬ ВТОкруглениеПрочиеРасходы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Обороты.Организация 					КАК Организация,
	|	Обороты.Подразделение 				КАК Подразделение,
	|	Обороты.СтатьяРасходов 				КАК СтатьяРасходов,
	|	Обороты.АналитикаРасходов 			КАК АналитикаРасходов,
	|	Обороты.НаправлениеДеятельности 		КАК НаправлениеДеятельности,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА РеквизитыРаспределения.Ссылка ЕСТЬ NULL
	//++ НЕ УТ
	|			И РеквизитыРезерва.Ссылка ЕСТЬ NULL
	//-- НЕ УТ
	|			ТОГДА ЛОЖЬ
	//++ НЕ УТ
	|		КОГДА Не РеквизитыРаспределения.Ссылка ЕСТЬ NULL
	|			И РеквизитыРаспределения.РегламентированныйУчет
	|			И РеквизитыРаспределения.ОставитьВНЗП
	|			ТОГДА ЛОЖЬ
	//-- НЕ УТ
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ) КАК СписыватьОстатокРегл,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА РеквизитыРаспределения.Ссылка ЕСТЬ NULL
	//++ НЕ УТ
	|			И РеквизитыРезерва.Ссылка ЕСТЬ NULL
	//-- НЕ УТ
	|			ТОГДА ЛОЖЬ
	//++ НЕ УТ
	|		КОГДА Не РеквизитыРаспределения.Ссылка ЕСТЬ NULL
	|			И РеквизитыРаспределения.УправленческийУчет
	|			И РеквизитыРаспределения.ОставитьВНЗП
	|			ТОГДА ЛОЖЬ
	//-- НЕ УТ
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ) КАК СписыватьОстатокУпр	
	|ПОМЕСТИТЬ АналитикиРасходныхДвиженийПрочихРасходов
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходы КАК Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК РеквизитыРаспределения
	|	    ПО Обороты.Регистратор = РеквизитыРаспределения.Ссылка
	//++ НЕ УТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеСписаниеРезервовПредстоящихРасходов КАК РеквизитыРезерва
	|	    ПО Обороты.Регистратор = РеквизитыРезерва.Ссылка
	//-- НЕ УТ
	|ГДЕ
	|	НЕ Обороты.СлужебноеВидДвиженияПриход
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.Организация,
	|	Обороты.Подразделение,
	|	Обороты.СтатьяРасходов,
	|	Обороты.АналитикаРасходов,
	|	Обороты.НаправлениеДеятельности
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка 		КАК Регистратор,
	|	&КонецПериода								КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)		КАК ВидДвижения,
	|
	|	ПрочиеРасходы.Организация 					КАК Организация,
	|	ПрочиеРасходы.Подразделение 				КАК Подразделение,
	|	ПрочиеРасходы.СтатьяРасходов 				КАК СтатьяРасходов,
	|	ПрочиеРасходы.АналитикаРасходов 			КАК АналитикаРасходов,
	|	ПрочиеРасходы.НаправлениеДеятельности 		КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеОшибокОкругления) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеОшибокОкругления) КАК НастройкаХозяйственнойОперации,
	|
	|	ВЫБОР КОГДА ПрочиеРасходы.Сумма МЕЖДУ -&ЗначениеПогрешностиРасходыУпр И &ЗначениеПогрешностиРасходыУпр
	|		И ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовУпр
	|			В (&ВариантыРаспределенияДляСписанияОшибокОкругления)
	|		И ЕСТЬNULL(Аналитики.СписыватьОстатокУпр, ЛОЖЬ)
	|		ТОГДА ПрочиеРасходы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ										КАК Сумма,
	|	ВЫБОР КОГДА ПрочиеРасходы.СуммаБезНДС МЕЖДУ -&ЗначениеПогрешностиРасходыУпр И &ЗначениеПогрешностиРасходыУпр
	|		И ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовУпр
	|			В (&ВариантыРаспределенияДляСписанияОшибокОкругления)
	|		И ЕСТЬNULL(Аналитики.СписыватьОстатокУпр, ЛОЖЬ)
	|		ТОГДА ПрочиеРасходы.СуммаБезНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ										КАК СуммаБезНДС,
	|	ВЫБОР КОГДА ПрочиеРасходы.СуммаРегл МЕЖДУ -&ЗначениеПогрешностиРасходыРегл И &ЗначениеПогрешностиРасходыРегл
	|		И ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовРегл
	|			В (&ВариантыРаспределенияДляСписанияОшибокОкругления)
	|		И ЕСТЬNULL(Аналитики.СписыватьОстатокРегл, ЛОЖЬ)
	|		ТОГДА ПрочиеРасходы.СуммаРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ										КАК СуммаРегл,
	|	ВЫБОР КОГДА ПрочиеРасходы.СуммаУпр МЕЖДУ -&ЗначениеПогрешностиРасходыУпр И &ЗначениеПогрешностиРасходыУпр
	|		И ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовУпр
	|			В (&ВариантыРаспределенияДляСписанияОшибокОкругления)
	|		И ЕСТЬNULL(Аналитики.СписыватьОстатокУпр, ЛОЖЬ)
	|		ТОГДА ПрочиеРасходы.СуммаУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ										КАК СуммаУпр,
	|	ВЫБОР КОГДА ПрочиеРасходы.ПостояннаяРазница МЕЖДУ -&ЗначениеПогрешностиРасходыРегл И &ЗначениеПогрешностиРасходыРегл
	|	 	И ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовРегл
	|			В (&ВариантыРаспределенияДляСписанияОшибокОкругления)
	|		И ЕСТЬNULL(Аналитики.СписыватьОстатокРегл, ЛОЖЬ)
	|		ТОГДА ПрочиеРасходы.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ										КАК ПостояннаяРазница,
	|	ВЫБОР КОГДА ПрочиеРасходы.ВременнаяРазница МЕЖДУ -&ЗначениеПогрешностиРасходыРегл И &ЗначениеПогрешностиРасходыРегл
	|		И ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовРегл
	|			В (&ВариантыРаспределенияДляСписанияОшибокОкругления)
	|		И НЕ ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|		И ЕСТЬNULL(Аналитики.СписыватьОстатокРегл, ЛОЖЬ)
	|		ТОГДА ПрочиеРасходы.ВременнаяРазница
	//++ Локализация
	|		КОГДА ПрочиеРасходы.СтатьяРасходов.КосвенныеЗатратыНУ
	|		 И ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовРегл
	|			= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|		И ЕСТЬNULL(Аналитики.СписыватьОстатокРегл, ЛОЖЬ)
	|		ТОГДА
	|			ВЫБОР
	|				КОГДА ПрочиеРасходы.СуммаРегл МЕЖДУ -&ЗначениеПогрешностиРасходыРегл И &ЗначениеПогрешностиРасходыРегл
	|					ТОГДА ПрочиеРасходы.СуммаРегл
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|			- ВЫБОР
	|				КОГДА ПрочиеРасходы.ПостояннаяРазница МЕЖДУ -&ЗначениеПогрешностиРасходыРегл И &ЗначениеПогрешностиРасходыРегл
	|					ТОГДА ПрочиеРасходы.ПостояннаяРазница
	|				ИНАЧЕ 0
	|			КОНЕЦ
	//-- Локализация
	|		ИНАЧЕ 0
	|	КОНЕЦ										КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВТОкруглениеПрочиеРасходы
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеРасходы КАК ПрочиеРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО ПрочиеРасходы.Организация = ДокументыРасчетаСебестоимости.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ АналитикиРасходныхДвиженийПрочихРасходов КАК Аналитики
	|		ПО ПрочиеРасходы.Организация = Аналитики.Организация
	|			И ПрочиеРасходы.Подразделение = Аналитики.Подразделение
	|			И ПрочиеРасходы.СтатьяРасходов = Аналитики.СтатьяРасходов
	|			И ПрочиеРасходы.АналитикаРасходов = Аналитики.АналитикаРасходов
	|			И ПрочиеРасходы.НаправлениеДеятельности = Аналитики.НаправлениеДеятельности
	|ГДЕ
	|	ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовУпр
	|		В (&ВариантыРаспределенияДляСписанияОшибокОкругления)
	|		И ЕСТЬNULL(Аналитики.СписыватьОстатокУпр, ЛОЖЬ)
	|		И (ПрочиеРасходы.Сумма МЕЖДУ -&ЗначениеПогрешностиРасходыУпр И &ЗначениеПогрешностиРасходыУпр
	|				И ПрочиеРасходы.Сумма <> 0
	|			ИЛИ ПрочиеРасходы.СуммаБезНДС МЕЖДУ -&ЗначениеПогрешностиРасходыУпр И &ЗначениеПогрешностиРасходыУпр
	|				И ПрочиеРасходы.СуммаБезНДС <> 0
	|			ИЛИ ПрочиеРасходы.СуммаУпр МЕЖДУ -&ЗначениеПогрешностиРасходыУпр И &ЗначениеПогрешностиРасходыУпр
	|				И ПрочиеРасходы.СуммаУпр <> 0)
	|	ИЛИ ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовРегл
	|		В (&ВариантыРаспределенияДляСписанияОшибокОкругления)
	|		И ЕСТЬNULL(Аналитики.СписыватьОстатокРегл, ЛОЖЬ)
	|		И (ПрочиеРасходы.СуммаРегл МЕЖДУ -&ЗначениеПогрешностиРасходыРегл И &ЗначениеПогрешностиРасходыРегл
	|				И ПрочиеРасходы.СуммаРегл <> 0
	|			ИЛИ ПрочиеРасходы.ПостояннаяРазница МЕЖДУ -&ЗначениеПогрешностиРасходыРегл И &ЗначениеПогрешностиРасходыРегл
	|				И ПрочиеРасходы.ПостояннаяРазница <> 0
	|			ИЛИ ПрочиеРасходы.ВременнаяРазница МЕЖДУ -&ЗначениеПогрешностиРасходыРегл И &ЗначениеПогрешностиРасходыРегл
	|				И ПрочиеРасходы.ВременнаяРазница <> 0)
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ АналитикиРасходныхДвиженийПрочихРасходов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|";

	ВариантыРаспределенияДляСписанияОшибокОкругления = Новый Массив();
	ВариантыРаспределенияДляСписанияОшибокОкругления.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров);
	ВариантыРаспределенияДляСписанияОшибокОкругления.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты);
	ВариантыРаспределенияДляСписанияОшибокОкругления.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства);
	ВариантыРаспределенияДляСписанияОшибокОкругления.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат);
	
	Запрос.Параметры.Вставить("ВариантыРаспределенияДляСписанияОшибокОкругления", ВариантыРаспределенияДляСписанияОшибокОкругления);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтПогрешностьПрочиеРасходы";
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	ИмяВременнойТаблицыИсточник = "ВТОкруглениеПрочиеРасходы";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьИдентификаторыВоВременнуюТаблицу(ПараметрыРасчета, ОписаниеПриемника, ИмяВременнойТаблицыИсточник);
	
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, ИмяВременнойТаблицыИсточник);
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, ИмяВременнойТаблицыИсточник, ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти

//++ НЕ УТ
#Область ПрочиеРасходыНезавершенногоПроизводства

	Если ПараметрыРасчета.РежимЗакрытияМесяца <> Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда

		// Списание ошибок округления в регистре ПрочиеРасходыНезавершенногоПроизводства
		Запрос.Текст =
		"УНИЧТОЖИТЬ ВТОкруглениеПрочиеРасходыНЗП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыРасчетаСебестоимости.Ссылка	КАК Регистратор,
		|	&КонецПериода							КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)	КАК ВидДвижения,
		|	ПрочиеРасходыНЗП.Организация			КАК Организация,
		|	ПрочиеРасходыНЗП.Подразделение			КАК Подразделение,
		|	ПрочиеРасходыНЗП.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ПрочиеРасходыНЗП.ПартияПроизводства		КАК ПартияПроизводства,
		|	ПрочиеРасходыНЗП.ЗаказНаПроизводство	КАК ЗаказНаПроизводство,
		|	ПрочиеРасходыНЗП.КодСтрокиПродукция		КАК КодСтрокиПродукция,
		|	ПрочиеРасходыНЗП.Этап					КАК Этап,
		|	ПрочиеРасходыНЗП.СтатьяКалькуляции		КАК СтатьяКалькуляции,
		|	ПрочиеРасходыНЗП.СтатьяРасходов			КАК СтатьяРасходов,
		|	ПрочиеРасходыНЗП.АналитикаРасходов		КАК АналитикаРасходов,
		|	ПрочиеРасходыНЗП.ГруппаПродукции		КАК ГруппаПродукции,
		|	ПрочиеРасходыНЗП.ПравилоОтнесенияНаВыпуск КАК ПравилоОтнесенияНаВыпуск,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеОшибокОкругления) КАК НастройкаХозяйственнойОперации,
		|	ПрочиеРасходыНЗП.Стоимость				КАК Стоимость,
		|	ПрочиеРасходыНЗП.СтоимостьБезНДС		КАК СтоимостьБезНДС,
		|	ПрочиеРасходыНЗП.СтоимостьРегл			КАК СтоимостьРегл,
		|	ПрочиеРасходыНЗП.СтоимостьУпр			КАК СтоимостьУпр,
		|	ПрочиеРасходыНЗП.ПостояннаяРазница		КАК ПостояннаяРазница,
		|	ПрочиеРасходыНЗП.ВременнаяРазница		КАК ВременнаяРазница,
		|	ПрочиеРасходыНЗП.ДоляСтоимости			КАК ДоляСтоимости
		|ПОМЕСТИТЬ ВТОкруглениеПрочиеРасходыНЗП
		|ИЗ
		|	ВТКэшРасчетныеОстаткиПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНЗП
		|		ЛЕВОЕ СОЕДИНЕНИЕ АналитикиРасходныхДвиженийПостатейныхРасходов КАК ОборотыРасходов
		|		ПО ПрочиеРасходыНЗП.Организация = ОборотыРасходов.Организация
		|			И ПрочиеРасходыНЗП.Подразделение = ОборотыРасходов.Подразделение
		|			И ПрочиеРасходыНЗП.СтатьяРасходов = ОборотыРасходов.СтатьяРасходов
		|			И ПрочиеРасходыНЗП.АналитикаРасходов = ОборотыРасходов.АналитикаРасходов
		|			И ПрочиеРасходыНЗП.НаправлениеДеятельности = ОборотыРасходов.НаправлениеДеятельности
		|			И ПрочиеРасходыНЗП.ПартияПроизводства = ОборотыРасходов.ПартияПроизводства
		|			И ПрочиеРасходыНЗП.ЗаказНаПроизводство = ОборотыРасходов.ЗаказНаПроизводство
		|			И ПрочиеРасходыНЗП.КодСтрокиПродукция = ОборотыРасходов.КодСтрокиПродукция
		|			И ПрочиеРасходыНЗП.Этап = ОборотыРасходов.Этап
		|			И ПрочиеРасходыНЗП.СтатьяКалькуляции = ОборотыРасходов.СтатьяКалькуляции
		|			И ПрочиеРасходыНЗП.ГруппаПродукции = ОборотыРасходов.ГруппаПродукции
		|			И ПрочиеРасходыНЗП.ПравилоОтнесенияНаВыпуск = ОборотыРасходов.ПравилоОтнесенияНаВыпуск
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
		|			ПО ПрочиеРасходыНЗП.Организация = ДокументыРасчетаСебестоимости.Организация
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиБазРаспределения КАК Материальные
		|		ПО ПрочиеРасходыНЗП.Подразделение = Материальные.Подразделение
		|			И ПрочиеРасходыНЗП.ПартияПроизводства = Материальные.ПартияПроизводства
		|			И ПрочиеРасходыНЗП.ЗаказНаПроизводство = Материальные.ЗаказНаПроизводство
		|			И ПрочиеРасходыНЗП.КодСтрокиПродукция = Материальные.КодСтрокиПродукция
		|			И (ВЫБОР
		|				КОГДА ПрочиеРасходыНЗП.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымЗатратам)
		|						ИЛИ ПрочиеРасходыНЗП.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымИТрудозатратам)
		|					ТОГДА Материальные.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымЗатратам)
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиБазРаспределения КАК Трудозатраты
		|		ПО ПрочиеРасходыНЗП.Подразделение = Трудозатраты.Подразделение
		|			И ПрочиеРасходыНЗП.ПартияПроизводства = Трудозатраты.ПартияПроизводства
		|			И ПрочиеРасходыНЗП.ЗаказНаПроизводство = Трудозатраты.ЗаказНаПроизводство
		|			И ПрочиеРасходыНЗП.КодСтрокиПродукция = Трудозатраты.КодСтрокиПродукция
		|			И (ВЫБОР
		|				КОГДА ПрочиеРасходыНЗП.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоТрудозатратам)
		|						ИЛИ ПрочиеРасходыНЗП.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоМатериальнымИТрудозатратам)
		|					ТОГДА Трудозатраты.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоТрудозатратам)
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)	
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиБазРаспределения КАК Продукция
		|		ПО Продукция.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|			И ПрочиеРасходыНЗП.ПартияПроизводства = Продукция.ПартияПроизводства
		|			И ПрочиеРасходыНЗП.ЗаказНаПроизводство = Продукция.ЗаказНаПроизводство
		|			И ПрочиеРасходыНЗП.КодСтрокиПродукция = Продукция.КодСтрокиПродукция
		|			И (ВЫБОР
		|					КОГДА ПрочиеРасходыНЗП.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПоПродукцииСУчетомБудущихВыпусков)
		|						ТОГДА Продукция.ПравилоОтнесенияНаВыпуск = ПрочиеРасходыНЗП.ПравилоОтнесенияНаВыпуск
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиБазРаспределения КАК Продукция21
		|		ПО Продукция21.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|			И ПрочиеРасходыНЗП.ПартияПроизводства = Продукция21.ПартияПроизводства
		|			И ПрочиеРасходыНЗП.ЗаказНаПроизводство = Продукция21.ЗаказНаПроизводство
		|			И ПрочиеРасходыНЗП.КодСтрокиПродукция = Продукция21.КодСтрокиПродукция
		|			И (ВЫБОР
		|					КОГДА ПрочиеРасходыНЗП.ПравилоОтнесенияНаВыпуск = ЗНАЧЕНИЕ(Перечисление.ПравилаОтнесенияНаВыпуск.ПустаяСсылка)
		|						ТОГДА Продукция21.ПравилоОтнесенияНаВыпуск = ПрочиеРасходыНЗП.ПравилоОтнесенияНаВыпуск
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ)
		|
		|ГДЕ
		|	ПрочиеРасходыНЗП.Стоимость МЕЖДУ -&ЗначениеПогрешностиРасходыУпр И &ЗначениеПогрешностиРасходыУпр
		|	И ПрочиеРасходыНЗП.СтоимостьБезНДС МЕЖДУ -&ЗначениеПогрешностиРасходыУпр И &ЗначениеПогрешностиРасходыУпр
		|	И ПрочиеРасходыНЗП.СтоимостьУпр МЕЖДУ -&ЗначениеПогрешностиРасходыУпр И &ЗначениеПогрешностиРасходыУпр
		|	И ПрочиеРасходыНЗП.СтоимостьРегл МЕЖДУ -&ЗначениеПогрешностиРасходыРегл И &ЗначениеПогрешностиРасходыРегл
		|	И ПрочиеРасходыНЗП.ПостояннаяРазница МЕЖДУ -&ЗначениеПогрешностиРасходыРегл И &ЗначениеПогрешностиРасходыРегл
		|	И ПрочиеРасходыНЗП.ВременнаяРазница МЕЖДУ -&ЗначениеПогрешностиРасходыРегл И &ЗначениеПогрешностиРасходыРегл
		|	И ПрочиеРасходыНЗП.ДоляСтоимости МЕЖДУ -&ЗначениеПогрешностиКоличество И &ЗначениеПогрешностиКоличество
		|	И (НЕ ОборотыРасходов.Организация ЕСТЬ NULL ИЛИ НЕ &ПартионныйУчетВерсии22)
		|	И ((НЕ &ПартионныйУчетВерсии22) 
		|		ИЛИ (ЕСТЬNULL(Материальные.Остаток, 0) + ЕСТЬNULL(Материальные.ОстатокБезНДС, 0) + ЕСТЬNULL(Материальные.ОстатокРегл, 0) + ЕСТЬNULL(Материальные.ОстатокУпр, 0)
		|			+ ЕСТЬNULL(Трудозатраты.Остаток, 0) + ЕСТЬNULL(Трудозатраты.ОстатокБезНДС, 0) + ЕСТЬNULL(Трудозатраты.ОстатокРегл, 0) + ЕСТЬNULL(Трудозатраты.ОстатокУпр, 0) 
		|			+ ЕСТЬNULL(Продукция.Остаток, 0) + ЕСТЬNULL(Продукция21.Остаток, 0)) = 0)
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ АналитикиРасходныхДвиженийПостатейныхРасходов
		|;
		|";
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
		
		ИмяВременнойТаблицы = "ВтПогрешностьПрочиеРасходыНЗП";
		ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходыНезавершенногоПроизводства.Имя;
		ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
		ИмяВременнойТаблицыИсточник = "ВТОкруглениеПрочиеРасходыНЗП";
	
		РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьИдентификаторыВоВременнуюТаблицу(ПараметрыРасчета, ОписаниеПриемника, ИмяВременнойТаблицыИсточник);
		
		КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, ИмяВременнойТаблицыИсточник);
		
		ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
		РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
			ИмяРегистра, ИмяВременнойТаблицыИсточник, ИмяВременнойТаблицы);
		
		СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
	КонецЕсли;
	
#КонецОбласти

#Область РезервыПредстоящихРасходов

	Если ПараметрыРасчета.РежимЗакрытияМесяца <> Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда

		// Списание ошибок округления в регистре РезервыПредстоящихРасходов
		Запрос.Текст =
		"УНИЧТОЖИТЬ ВТОкруглениеРезервыПредстоящихРасходов
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ДокументыРасчетаСебестоимости.Ссылка		КАК Регистратор,
		|	&КонецПериода								КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)		КАК ВидДвижения,
		|
		|	Резервы.Организация							КАК Организация,
		|	Резервы.ВидРезервов							КАК ВидРезервов,
		|	Резервы.НаправлениеДеятельности				КАК НаправлениеДеятельности,
		|	Резервы.ОбъектУчетаРезервов					КАК ОбъектУчетаРезервов,
		|	Резервы.ОбъектУчетаРезервов.ПодразделениеСписания КАК Подразделение,
		|
		|	ВЫБОР КОГДА Резервы.СуммаУпр МЕЖДУ 0 И &ЗначениеПогрешностиРасходыУпр
		|		ТОГДА - Резервы.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ										КАК СуммаУпр,
		|	ВЫБОР КОГДА Резервы.СуммаРегл МЕЖДУ 0 И &ЗначениеПогрешностиРасходыРегл
		|		ТОГДА - Резервы.СуммаРегл
		|		ИНАЧЕ 0
		|	КОНЕЦ										КАК СуммаРегл
		|ПОМЕСТИТЬ ВТОкруглениеРезервыПредстоящихРасходов
		|ИЗ
		|	ВТКэшРасчетныеОстаткиРезервыПредстоящихРасходов КАК Резервы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
		|			ПО Резервы.Организация = ДокументыРасчетаСебестоимости.Организация
		|
		|ГДЕ
		|	(Резервы.СуммаУпр МЕЖДУ 0 И &ЗначениеПогрешностиРасходыУпр
		|		ИЛИ Резервы.СуммаРегл МЕЖДУ 0 И &ЗначениеПогрешностиРасходыРегл)
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|";
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
		
		ИмяВременнойТаблицы = "ВтПогрешностьРезервыПредстоящихРасходов";
		ИмяРегистра = Метаданные.РегистрыНакопления.РезервыПредстоящихРасходов.Имя;
		ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
		ИмяВременнойТаблицыИсточник = "ВТОкруглениеРезервыПредстоящихРасходов";
	
		РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьИдентификаторыВоВременнуюТаблицу(ПараметрыРасчета, ОписаниеПриемника, ИмяВременнойТаблицыИсточник);
		
		КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, ИмяВременнойТаблицыИсточник);
		
		ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
		РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
			ИмяРегистра, ИмяВременнойТаблицыИсточник, ИмяВременнойТаблицы);
		
		СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
	КонецЕсли;
	
#КонецОбласти
//-- НЕ УТ

#Область ПрочиеРасходы_КорДвижения

	// Формирование кор. движений в регистре ПрочиеРасходы
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Регистратор 																	КАК Регистратор,
	|	&КонецПериода 																	КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 											КАК ВидДвижения,
	|	Т.Организация 																	КАК Организация,
	|	Т.Подразделение																	КАК Подразделение,
	|	Т.НаправлениеДеятельности														КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости) КАК СтатьяРасходов,
	|	Т.ИдентификаторФинЗаписи														КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеОшибокОкругления)			КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеОшибокОкругления)	КАК НастройкаХозяйственнойОперации,
	|	СУММА(Т.Сумма) 																	КАК Сумма,
	|	СУММА(Т.СуммаРегл) 																КАК СуммаРегл,
	|	СУММА(Т.ПостояннаяРазница)														КАК ПостояннаяРазница,
	|	СУММА(Т.ВременнаяРазница)														КАК ВременнаяРазница,
	|	СУММА(Т.СуммаУпр) 																КАК СуммаУпр
	|ПОМЕСТИТЬ ВТКорДвиженияПрочиеРасходы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Регистратор 				 	 КАК Регистратор,
	|		Т.Организация 					 КАК Организация,
	|		Т.Подразделение 				 КАК Подразделение,
	|		Т.НаправлениеДеятельности 		 КАК НаправлениеДеятельности,
	|		Т.ИдентификаторФинЗаписи		 КАК ИдентификаторФинЗаписи,
	|		Т.Стоимость
	|			+ Т.ДопРасходы
	|			+ Т.Трудозатраты
	|			+ Т.ПостатейныеПостоянныеСНДС
	|			+ Т.ПостатейныеПеременныеСНДС КАК Сумма,
	|		Т.СтоимостьРегл
	|			+ Т.ДопРасходыРегл
	|			+ Т.ТрудозатратыРегл
	|			+ Т.ПостатейныеПостоянныеРегл
	|			+ Т.ПостатейныеПеременныеРегл КАК СуммаРегл,
	|		Т.ПостояннаяРазница,
	|		Т.ВременнаяРазница,
	|		Т.СтоимостьУпр
	|			+ Т.ДопРасходыУпр
	|			+ Т.ТрудозатратыУпр
	|			+ Т.ПостатейныеПостоянныеУпр
	|			+ Т.ПостатейныеПеременныеУпр КАК СуммаУпр
	|	ИЗ
	|		ВТОкруглениеСебестоимостьТоваров КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Регистратор,
	|		Т.Организация,
	|		Т.Подразделение,
	|		Т.НаправлениеДеятельности,
	|		Т.ИдентификаторФинЗаписи,
	|		Т.Сумма,
	|		Т.СуммаРегл,
	|		Т.ПостояннаяРазница,
	|		Т.ВременнаяРазница,
	|		Т.СуммаУпр
	|	ИЗ
	|		ВТОкруглениеПрочиеРасходы КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Регистратор,
	|		Т.Организация,
	|		Т.Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	|		Т.ИдентификаторФинЗаписи,
	|		Т.Стоимость,
	|		Т.СтоимостьРегл,
	|		Т.ПостояннаяРазница,
	|		Т.ВременнаяРазница,
	|		Т.СтоимостьУпр
	|	ИЗ
	|		ВТОкруглениеПрочиеРасходыНЗП КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Регистратор,
	|		Т.Организация,
	|		Т.Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	|		Т.ИдентификаторФинЗаписи,
	|		Т.СуммаУпр,
	|		Т.СуммаРегл,
	|		0 КАК ПостояннаяРазница,
	|		0 КАК ВременнаяРазница,
	|		Т.СуммаУпр
	|	ИЗ
	|		ВТОкруглениеРезервыПредстоящихРасходов КАК Т) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.ИдентификаторФинЗаписи
	|
	|ИМЕЮЩИЕ
	|	СУММА(Т.Сумма) <> 0
	|	ИЛИ СУММА(Т.СуммаРегл) <> 0
	|	ИЛИ СУММА(Т.ПостояннаяРазница) <> 0
	|	ИЛИ СУММА(Т.ВременнаяРазница) <> 0
	|	ИЛИ СУММА(Т.СуммаУпр) <> 0
	|";
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	ИмяВременнойТаблицы = "ВтПогрешностьКорПрочиеРасходы";
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	КопируемыеПоля = РасчетСебестоимостиУниверсальныеАлгоритмы.ПолучитьИменаКолонокВременнойТаблицыСтрокой(ПараметрыРасчета, "ВТКорДвиженияПрочиеРасходы");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, 
		ИмяРегистра, "ВТКорДвиженияПрочиеРасходы", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
#КонецОбласти

	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвиженияИзВременныхТаблиц(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений);

#Область ОборотныеРегистрыУпрУчета
 
	// Корректировка движений по оборотным регистрам управленческого учета.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&КонецПериода 					КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакрытиеМесяца) КАК ХозяйственнаяОперация,
	|	Т.ДокументДвижения 				КАК ДокументДвижения,
	|	Т.Организация 					КАК Организация,
	|	Т.Подразделение 				КАК Подразделение,
	|	Т.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
	|	Т.НаправлениеДеятельности		КАК НаправлениеДеятельности,
	|	Т.НаправлениеДеятельности		КАК КорНаправлениеДеятельности,
	|	Т.Склад 						КАК Склад,
	|	Т.ТипЗапасов 					КАК ТипЗапасов,
	|	Т.ВидЗапасов 					КАК ВидЗапасов,
	|	Т.СтатьяРасходовСписания 		КАК СтатьяРасходовСписания,
	|	Т.АналитикаРасходов 			КАК АналитикаРасходов,
	|	Т.ИсточникГФУНоменклатуры		КАК ИсточникГФУНоменклатуры,
	|	СУММА(Т.Стоимость) 				КАК Стоимость,
	|	СУММА(Т.СтоимостьБезНДС) 		КАК СтоимостьБезНДС,
	|	СУММА(Т.СтоимостьРегл) 			КАК СтоимостьРегл,
	|	СУММА(Т.СтоимостьУпр) 			КАК СтоимостьУпр
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Регистратор	 											КАК ДокументДвижения,
	|		Т.Организация 												КАК Организация,
	|		НЕОПРЕДЕЛЕНО 												КАК Подразделение,
	|		Т.НаправлениеДеятельности									КАК НаправлениеДеятельности,
	|		Т.АналитикаУчетаНоменклатуры 								КАК АналитикаУчетаНоменклатуры,
	|		АналитикаНоменклатуры.МестоХранения							КАК Склад,
	|		Т.ВидЗапасов.ТипЗапасов 									КАК ТипЗапасов,
	|		Т.ВидЗапасов 												КАК ВидЗапасов,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости) КАК СтатьяРасходовСписания,
	|		НЕОПРЕДЕЛЕНО 												КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|				ТОГДА Т.ВидЗапасов
	|			ИНАЧЕ АналитикаНоменклатуры.Номенклатура
	|		КОНЕЦ 														КАК ИсточникГФУНоменклатуры,
	|		-(Т.Стоимость + Т.ДопРасходы)								КАК Стоимость,
	|		-(Т.СтоимостьБезНДС + Т.ДопРасходыБезНДС)					КАК СтоимостьБезНДС,
	|		-Т.СтоимостьРегл 											КАК СтоимостьРегл,
	|		-Т.СтоимостьУпр 											КАК СтоимостьУпр
	|	ИЗ
	|		ВТОкруглениеСебестоимостьТоваров КАК Т
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|			ПО Т.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Регистратор	 											КАК ДокументДвижения,
	|		Т.Организация 												КАК Организация,
	|		Т.Подразделение 											КАК Подразделение,
	|		Т.НаправлениеДеятельности									КАК НаправлениеДеятельности,
	|		НЕОПРЕДЕЛЕНО 												КАК АналитикаУчетаНоменклатуры,
	|		НЕОПРЕДЕЛЕНО 												КАК Склад,
	|		НЕОПРЕДЕЛЕНО 												КАК ТипЗапасов,
	|		НЕОПРЕДЕЛЕНО 												КАК ВидЗапасов,
	|		Т.СтатьяРасходов 											КАК СтатьяДоходовРасходов,
	|		Т.АналитикаРасходов 										КАК АналитикаРасходов,
	|		НЕОПРЕДЕЛЕНО 												КАК ИсточникГФУНоменклатуры,
	|		-Т.Сумма 													КАК Стоимость,
	|		-Т.СуммаБезНДС 												КАК СтоимостьБезНДС,
	|		-Т.СуммаРегл 												КАК СтоимостьРегл,
	|		-Т.СуммаУпр 												КАК СтоимостьУпр
	|	ИЗ
	|		ВТОкруглениеПрочиеРасходы КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Регистратор	 											КАК ДокументДвижения,
	|		Т.Организация 												КАК Организация,
	|		Т.Подразделение 											КАК Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)	КАК НаправлениеДеятельности,
	|		НЕОПРЕДЕЛЕНО 												КАК АналитикаУчетаНоменклатуры,
	|		НЕОПРЕДЕЛЕНО 												КАК Склад,
	|		НЕОПРЕДЕЛЕНО 												КАК ТипЗапасов,
	|		НЕОПРЕДЕЛЕНО 												КАК ВидЗапасов,
	|		Т.СтатьяРасходов 											КАК СтатьяДоходовРасходов,
	|		Т.АналитикаРасходов 										КАК АналитикаРасходов,
	|		НЕОПРЕДЕЛЕНО 												КАК ИсточникГФУНоменклатуры,
	|		-Т.Стоимость												КАК Стоимость,
	|		-Т.СтоимостьБезНДС											КАК СтоимостьБезНДС,
	|		-Т.СтоимостьРегл											КАК СтоимостьРегл,
	|		-Т.СтоимостьУпр												КАК СтоимостьУпр
	|	ИЗ
	|		ВТОкруглениеПрочиеРасходыНЗП КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Регистратор	 											КАК ДокументДвижения,
	|		Т.Организация 												КАК Организация,
	|		НЕОПРЕДЕЛЕНО 												КАК Подразделение,
	|		Т.НаправлениеДеятельности									КАК НаправлениеДеятельности,
	|		НЕОПРЕДЕЛЕНО 												КАК АналитикаУчетаНоменклатуры,
	|		НЕОПРЕДЕЛЕНО 												КАК Склад,
	|		НЕОПРЕДЕЛЕНО 												КАК ТипЗапасов,
	|		НЕОПРЕДЕЛЕНО 												КАК ВидЗапасов,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости) КАК СтатьяДоходовРасходов,
	|		НЕОПРЕДЕЛЕНО 												КАК АналитикаРасходов,
	|		НЕОПРЕДЕЛЕНО 												КАК ИсточникГФУНоменклатуры,
	|		Т.Сумма 													КАК Стоимость,
	|		0 															КАК СтоимостьБезНДС,
	|		0 															КАК СтоимостьРегл,
	|		0 															КАК СтоимостьУпр
	|	ИЗ
	|		ВТКорДвиженияПрочиеРасходы КАК Т) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.ДокументДвижения,
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.Склад,
	|	Т.ТипЗапасов,
	|	Т.ВидЗапасов,
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	|	Т.ИсточникГФУНоменклатуры
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Т.Стоимость) <> 0
	|		ИЛИ СУММА(Т.СтоимостьБезНДС) <> 0
	|		ИЛИ СУММА(Т.СтоимостьРегл) <> 0
	|		ИЛИ СУММА(Т.СтоимостьУпр) <> 0)";
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина,,, НСтр("ru = 'Регистры упр. учета';
																																	|en = 'Man. accounting ledgers'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	Пока Выборка.Следующий() Цикл
		СформироватьДвиженияПоОборотнымРегистрамУпрУчета(ПараметрыРасчета, Выборка);
	КонецЦикла;

#КонецОбласти
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
	// Уничтожим ненужные временные таблицы.
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета, СуществующиеВТ);
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
КонецПроцедуры


// Этап 4.1
// Процедура выполняет распределение выручки и себестоимости продаж по направлениям деятельности.
//
// Параметры:
// ПараметрыРасчета - см. РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьОбщиеПараметрыРасчета
//
Процедура РаспределитьВыручкуПоНаправлениямДеятельности(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределитьВыручкуПоНаправлениямДеятельности");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыручкаИСебестоимость.Подразделение             		 КАК Подразделение,
	|	АналитикаПоПартнерам.Организация                		 КАК Организация,
	|	АналитикаПоПартнерам.Партнер                    		 КАК Партнер,
	|	АналитикаПоПартнерам.НаправлениеДеятельности      		 КАК НаправлениеДеятельности,
	|	АналитикаНоменклатуры.Номенклатура              		 КАК Номенклатура,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ВыручкаОтПродаж) КАК СтатьяДоходов,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.СебестоимостьПродаж) КАК СтатьяРасходов,
	|	СУММА(ВыручкаИСебестоимость.СуммаВыручки)				 КАК СуммаВыручки,
	|	СУММА(ВыручкаИСебестоимость.Стоимость
	|		+ ВыручкаИСебестоимость.ДопРасходы
	|		+ ВыручкаИСебестоимость.ПостатейныеПостоянныеСНДС
	|		+ ВыручкаИСебестоимость.ПостатейныеПеременныеСНДС
	|		+ ВыручкаИСебестоимость.Трудозатраты
	|		+ ВыручкаИСебестоимость.РасходыНаПродажуСНДС) КАК Себестоимость
	|ПОМЕСТИТЬ ВТТаблицаВыручки
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПоПартнерам
	|			ПО ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|			ПО ВыручкаИСебестоимость.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|ГДЕ
	|	ВыручкаИСебестоимость.ТипЗапасов В
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар),
	|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.Подразделение,
	|	АналитикаПоПартнерам.Организация,
	|	АналитикаПоПартнерам.Партнер,
	|	АналитикаПоПартнерам.НаправлениеДеятельности,
	|	АналитикаНоменклатуры.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВыручкаИСебестоимость.СуммаВыручки) <> 0
	|	ИЛИ СУММА(ВыручкаИСебестоимость.Стоимость
	|		+ ВыручкаИСебестоимость.ДопРасходы
	|		+ ВыручкаИСебестоимость.ПостатейныеПостоянныеСНДС
	|		+ ВыручкаИСебестоимость.ПостатейныеПеременныеСНДС
	|		+ ВыручкаИСебестоимость.Трудозатраты
	|		+ ВыручкаИСебестоимость.РасходыНаПродажуСНДС) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрочаяВыручка.Подразделение                                  КАК Подразделение,
	|	ПрочаяВыручка.Организация                                    КАК Организация,
	|	ПрочаяВыручка.Партнер                                        КАК Партнер,
	|	ПрочаяВыручка.НаправлениеДеятельности                        КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                                                 КАК Номенклатура,
	|	ПрочаяВыручка.СтатьяДоходов                                  КАК СтатьяДоходов,
	|	НЕОПРЕДЕЛЕНО                                                 КАК СтатьяРасходов,
	|	СУММА(ПрочаяВыручка.ВыручкаБезНДСУпр + ПрочаяВыручка.НДСУпр) КАК СуммаВыручки,
	|	0                                                            КАК Себестоимость
	|ИЗ
	|	РегистрНакопления.ПрочаяВыручка КАК ПрочаяВыручка
	|ГДЕ
	|	ПрочаяВыручка.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПрочаяВыручка.Организация В (&МассивОрганизаций)
	|	И ПрочаяВыручка.Активность
	|СГРУППИРОВАТЬ ПО
	|	ПрочаяВыручка.Подразделение,
	|	ПрочаяВыручка.Организация,
	|	ПрочаяВыручка.Партнер,
	|	ПрочаяВыручка.НаправлениеДеятельности,
	|	ПрочаяВыручка.СтатьяДоходов
	|
	|ИМЕЮЩИЕ
	|	СУММА(ПрочаяВыручка.ВыручкаБезНДСУпр + ПрочаяВыручка.НДСУпр) <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаВыручки.Подразделение               КАК Подразделение,
	|	ТаблицаВыручки.Организация                 КАК Организация,
	|	ТаблицаВыручки.Номенклатура                КАК Номенклатура,
	|	ТаблицаВыручки.Партнер                     КАК Партнер,
	|	ТаблицаВыручки.НаправлениеДеятельности     КАК НаправлениеДеятельности,
	|	ТаблицаВыручки.СтатьяДоходов               КАК СтатьяДоходов,
	|	ТаблицаВыручки.СтатьяРасходов              КАК СтатьяРасходов,
	|	ТаблицаВыручки.СуммаВыручки                КАК СуммаВыручки,
	|	ТаблицаВыручки.Себестоимость               КАК Себестоимость,
	|	НастройкаРаспределения.СпособРаспределения КАК СпособРаспределения,
	|	ВЫБОР
	|		КОГДА ТаблицаВыручки.Партнер = НастройкаРаспределения.Партнер ТОГДА
	|			1000
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ТаблицаВыручки.Подразделение = НастройкаРаспределения.Подразделение ТОГДА
	|			100
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ТаблицаВыручки.Номенклатура = НастройкаРаспределения.Номенклатура ТОГДА
	|			10
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ТаблицаВыручки.Организация = НастройкаРаспределения.Организация ТОГДА
	|			1
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ                                      КАК Приоритет
	|ПОМЕСТИТЬ ВтТаблицаРаспределения
	|
	|ИЗ
	|	ВТТаблицаВыручки КАК ТаблицаВыручки
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.НастройкаРаспределенияПоНаправлениямДеятельности.СрезПоследних(
	|			&КонецПериода,
	|		) КАК НастройкаРаспределения
	|		ПО
	|			НастройкаРаспределения.Используется
	|			И ТаблицаВыручки.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			И (ТаблицаВыручки.Организация              = НастройкаРаспределения.Организация
	|				ИЛИ НастройкаРаспределения.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|			И (ТаблицаВыручки.Партнер              = НастройкаРаспределения.Партнер
	|				ИЛИ НастройкаРаспределения.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))
	|
	|			И (ТаблицаВыручки.Подразделение              = НастройкаРаспределения.Подразделение
	|				ИЛИ НастройкаРаспределения.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|
	|			И (ТаблицаВыручки.Номенклатура              = НастройкаРаспределения.Номенклатура
	|				ИЛИ НастройкаРаспределения.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Партнер,
	|	Подразделение,
	|	Номенклатура
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДокументыРасчетаСебестоимости.Ссылка 								 КАК ДокументДвижения,
	|	&КонецПериода                                                        КАК Период,
	|	ТаблицаФинансовыхРезультатов.Организация                             КАК Организация,
	|	ТаблицаФинансовыхРезультатов.Подразделение                           КАК Подразделение,
	|	ТаблицаФинансовыхРезультатов.СтатьяДоходов                           КАК СтатьяДоходов,
	|	ТаблицаФинансовыхРезультатов.СтатьяРасходов                          КАК СтатьяРасходов,
	|	ТаблицаФинансовыхРезультатов.СпособРаспределения                     КАК СпособРаспределения,
	|	СУММА(ТаблицаФинансовыхРезультатов.СуммаВыручки)                     КАК СуммаВыручки,
	|	СУММА(ТаблицаФинансовыхРезультатов.Себестоимость)                    КАК Себестоимость,
	|	ВЫБОР
	|		КОГДА ТаблицаФинансовыхРезультатов.СпособРаспределения ССЫЛКА Справочник.НаправленияДеятельности ТОГДА
	|			ТаблицаФинансовыхРезультатов.СпособРаспределения
	|		ИНАЧЕ
	|			СпособыРаспределения.НаправлениеДеятельности
	|	КОНЕЦ                                                                КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ТаблицаФинансовыхРезультатов.СпособРаспределения ССЫЛКА Справочник.НаправленияДеятельности ТОГДА
	|			1
	|		ИНАЧЕ
	|			ЕСТЬNULL(СпособыРаспределения.Коэффициент, 1)
	|	КОНЕЦ                                                                КАК КоэффициентРаспределения
	|
	|ИЗ (
	|	ВЫБРАТЬ
	|		ТаблицаРаспределения.Организация                   КАК Организация,
	|		ТаблицаРаспределения.Подразделение                 КАК Подразделение,
	|		ТаблицаРаспределения.СтатьяДоходов                 КАК СтатьяДоходов,
	|		ТаблицаРаспределения.СтатьяРасходов                КАК СтатьяРасходов,
	|		СУММА(ТаблицаРаспределения.СуммаВыручки)           КАК СуммаВыручки,
	|		СУММА(ТаблицаРаспределения.Себестоимость)          КАК Себестоимость,
	|		ЕСТЬNULL(ТаблицаРаспределения.СпособРаспределения, НЕОПРЕДЕЛЕНО) КАК СпособРаспределения
	|	ИЗ
	|		ВтТаблицаРаспределения КАК ТаблицаРаспределения
	|
	|	ГДЕ
	|		ТаблицаРаспределения.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|		И ТаблицаРаспределения.Приоритет В
	|				(ВЫБРАТЬ
	|					МАКСИМУМ(Таб.Приоритет) КАК Приоритет
	|				ИЗ
	|					ВтТаблицаРаспределения КАК Таб
	|				ГДЕ
	|					Таб.Организация        = ТаблицаРаспределения.Организация
	|					И Таб.Партнер            = ТаблицаРаспределения.Партнер
	|					И Таб.Подразделение      = ТаблицаРаспределения.Подразделение
	|					И Таб.Номенклатура         = ТаблицаРаспределения.Номенклатура)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаРаспределения.Организация,
	|		ТаблицаРаспределения.Подразделение,
	|		ТаблицаРаспределения.СтатьяДоходов,
	|		ТаблицаРаспределения.СтатьяРасходов,
	|		ЕСТЬNULL(ТаблицаРаспределения.СпособРаспределения, НЕОПРЕДЕЛЕНО)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТаблицаРаспределения.Организация                   КАК Организация,
	|		ТаблицаРаспределения.Подразделение                 КАК Подразделение,
	|		ТаблицаРаспределения.СтатьяДоходов                 КАК СтатьяДоходов,
	|		ТаблицаРаспределения.СтатьяРасходов                КАК СтатьяРасходов,
	|		СУММА(ТаблицаРаспределения.СуммаВыручки)           КАК СуммаВыручки,
	|		СУММА(ТаблицаРаспределения.Себестоимость)          КАК Себестоимость,
	|		ТаблицаРаспределения.НаправлениеДеятельности       КАК СпособРаспределения
	|	ИЗ
	|		ВтТаблицаРаспределения КАК ТаблицаРаспределения
	|
	|	ГДЕ
	|		ТаблицаРаспределения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаРаспределения.Организация,
	|		ТаблицаРаспределения.Подразделение,
	|		ТаблицаРаспределения.СтатьяДоходов,
	|		ТаблицаРаспределения.СтатьяРасходов,
	|		ТаблицаРаспределения.НаправлениеДеятельности
	|
	|	) КАК ТаблицаФинансовыхРезультатов
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.СпособыРаспределенияПоНаправлениямДеятельности.НаправленияДеятельности КАК СпособыРаспределения
	|		ПО ТаблицаФинансовыхРезультатов.СпособРаспределения = СпособыРаспределения.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|		ПО ТаблицаФинансовыхРезультатов.Организация = ДокументыРасчетаСебестоимости.Организация
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДокументыРасчетаСебестоимости.Ссылка,
	|	ТаблицаФинансовыхРезультатов.Организация,
	|	ТаблицаФинансовыхРезультатов.Подразделение,
	|	ТаблицаФинансовыхРезультатов.СтатьяДоходов,
	|	ТаблицаФинансовыхРезультатов.СтатьяРасходов,
	|	ТаблицаФинансовыхРезультатов.СпособРаспределения,
	|	ВЫБОР
	|		КОГДА ТаблицаФинансовыхРезультатов.СпособРаспределения ССЫЛКА Справочник.НаправленияДеятельности ТОГДА
	|			ТаблицаФинансовыхРезультатов.СпособРаспределения
	|		ИНАЧЕ
	|			СпособыРаспределения.НаправлениеДеятельности
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаФинансовыхРезультатов.СпособРаспределения ССЫЛКА Справочник.НаправленияДеятельности ТОГДА
	|			1
	|		ИНАЧЕ
	|			ЕСТЬNULL(СпособыРаспределения.Коэффициент, 1)
	|	КОНЕЦ
	|
	|ИТОГИ
	|	МАКСИМУМ(СуммаВыручки),
	|	МАКСИМУМ(Себестоимость),
	|	СУММА(КоэффициентРаспределения)
	|
	|ПО
	|	Организация,
	|	Подразделение,
	|	СпособРаспределения
	|";
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ФинансовыеРезультаты.Имя;
	
	РезультатЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,, Истина);
	ВыборкаОрганизация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
	
	Пока ВыборкаОрганизация.Следующий() Цикл
		
		ВыборкаПодразделение = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
		
		Пока ВыборкаПодразделение.Следующий() Цикл
			
			ВыборкаСпособыРаспределения = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СпособРаспределения");
			
			Пока ВыборкаСпособыРаспределения.Следующий() Цикл
				
				ВсегоДолей            = ВыборкаСпособыРаспределения.КоэффициентРаспределения;
				РасходыКРаспределению = ВыборкаСпособыРаспределения.Себестоимость;
				ДоходыКРаспределению  = ВыборкаСпособыРаспределения.СуммаВыручки;
				
				ВыборкаДетали = ВыборкаСпособыРаспределения.Выбрать(ОбходРезультатаЗапроса.Прямой);
				
				РасчетСебестоимостиПротоколРасчета.УвеличитьКоличествоОбработанныхДанныхДляЗамера(
					ПараметрыРасчета,
					ВыборкаДетали.Количество());
				
				Пока ВыборкаДетали.Следующий() Цикл

					Если ВсегоДолей <> 0 Тогда
						Расходы = Окр(РасходыКРаспределению * ВыборкаДетали.КоэффициентРаспределения / ВсегоДолей,
										2, РежимОкругления.Окр15как20);
					Иначе
						Расходы = 0;
					КонецЕсли;

					Если ВсегоДолей <> 0 Тогда
						Доходы = Окр(ДоходыКРаспределению * ВыборкаДетали.КоэффициентРаспределения / ВсегоДолей,
										2, РежимОкругления.Окр15как20);
					Иначе
						Доходы = 0;
					КонецЕсли;

					РасходыКРаспределению = РасходыКРаспределению - Расходы;
					ДоходыКРаспределению  = ДоходыКРаспределению  - Доходы;
					ВсегоДолей            = ВсегоДолей            - ВыборкаДетали.КоэффициентРаспределения;

					// Формирование движений по финансовому результату.
					ДанныеДвижения = Новый Структура(
						"Период, ДокументДвижения, Организация, Подразделение, НаправлениеДеятельности, СпособРаспределения");
					
					ЗаполнитьЗначенияСвойств(ДанныеДвижения, ВыборкаДетали);
					
					Если Доходы <> 0 Тогда
						ДанныеДвижения.Вставить("Доходы", 		 Доходы);
						ДанныеДвижения.Вставить("СтатьяДоходов", ВыборкаДетали.СтатьяДоходов);
					КонецЕсли;

					Если Расходы <> 0 Тогда
						ДанныеДвижения.Вставить("Расходы", 		  Расходы);
						ДанныеДвижения.Вставить("СтатьяРасходов", ВыборкаДетали.СтатьяРасходов);
					КонецЕсли;
					
					ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения);
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;

	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВТТаблицаВыручки, ВтТаблицаРаспределения");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);

КонецПроцедуры

// Этап 4.3
Процедура ОтразитьПрибылиИУбытки(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ОтразитьПрибылиИУбытки");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Организация				КАК Организация,
	|	ВыручкаИСебестоимость.Подразделение				КАК Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности 	КАК НаправлениеДеятельности,
	|	ВыручкаИСебестоимость.Сторно					КАК Сторно,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ПОМЕСТИТЬ ВТПромежуточнаяТаблица1
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 							КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период 								КАК Период,
	|		АналитикаПоПартнерам.Организация                			КАК Организация,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиКонтрагента 	КАК НаправлениеДеятельности,
	|		ВыручкаИСебестоимость.Подразделение							КАК Подразделение,
	|		ВыручкаИСебестоимость.Сторно								КАК Сторно,
	|		ВЫБОР КОГДА ВыручкаИСебестоимость.ТипЗапасов В (
	|			Значение(Перечисление.ТипыЗапасов.Товар),
	|			Значение(Перечисление.ТипыЗапасов.Услуга))
	|		ТОГДА
	|			ВыручкаИСебестоимость.СуммаВыручки
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ 														КАК Сумма
	|	ИЗ
	|		ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПоПартнерам
	|				ПО ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|	ГДЕ
	|		ТИПЗНАЧЕНИЯ(ВыручкаИСебестоимость.Регистратор) <> ТИП(Документ.ВводОстатковОПродажахЗаПрошлыеПериоды)
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Организация,
	|	ВыручкаИСебестоимость.Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности,
	|	ВыручкаИСебестоимость.Сторно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Организация				КАК Организация,
	|	ВыручкаИСебестоимость.Подразделение				КАК Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности 	КАК НаправлениеДеятельности,
	|	ВыручкаИСебестоимость.Сторно					КАК Сторно,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 						  КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период 							  КАК Период,
	|		АналитикаПоПартнерам.Организация 						  КАК Организация,
	|		ВыручкаИСебестоимость.Подразделение						  КАК Подразделение,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельности,
	|		ВыручкаИСебестоимость.Сторно							  КАК Сторно,
	|		ВЫБОР КОГДА ВыручкаИСебестоимость.ТипЗапасов В (
	|			Значение(Перечисление.ТипыЗапасов.Товар),
	|			Значение(Перечисление.ТипыЗапасов.Услуга))
	|		ТОГДА
	|			ВыручкаИСебестоимость.Стоимость
	|			+ ВыручкаИСебестоимость.ДопРасходы
	|			+ ВыручкаИСебестоимость.Трудозатраты
	|			+ ВыручкаИСебестоимость.ПостатейныеПостоянныеСНДС
	|			+ ВыручкаИСебестоимость.ПостатейныеПеременныеСНДС
	|			+ ВыручкаИСебестоимость.РасходыНаПродажуСНДС
	|		ИНАЧЕ
	|			ВыручкаИСебестоимость.ДопРасходы
	|			+ ВыручкаИСебестоимость.РасходыНаПродажуСНДС
	|		КОНЕЦ 													  КАК Сумма
	|	ИЗ
	|		ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПоПартнерам
	|				ПО ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|	ГДЕ
	|		ТИПЗНАЧЕНИЯ(ВыручкаИСебестоимость.Регистратор) <> ТИП(Документ.ВводОстатковОПродажахЗаПрошлыеПериоды)
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Организация,
	|	ВыручкаИСебестоимость.Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности,
	|	ВыручкаИСебестоимость.Сторно
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Контрагент				КАК Организация,
	|	ВыручкаИСебестоимость.Подразделение				КАК Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	ВыручкаИСебестоимость.Сторно					КАК Сторно,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ПОМЕСТИТЬ ВТПромежуточнаяТаблица2
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 							КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период					  			КАК Период,
	|		АналитикаПоПартнерам.Контрагент                				КАК Контрагент,
	|		ВыручкаИСебестоимость.Подразделение							КАК Подразделение,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиКонтрагента 	КАК НаправлениеДеятельности,
	|		ВыручкаИСебестоимость.Сторно								КАК Сторно,
	|		ВыручкаИСебестоимость.СуммаВыручки							КАК Сумма
	|	ИЗ
	|		ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ПО
	|				ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|				И АналитикаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|				И АналитикаПоПартнерам.Контрагент ССЫЛКА Справочник.Организации
	|				И АналитикаПоПартнерам.Контрагент <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|	ГДЕ
	|		ВыручкаИСебестоимость.ТипЗапасов В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|		И ВыручкаИСебестоимость.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры
	|			<> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|		И АналитикаПоПартнерам.Контрагент В (&МассивОрганизаций)
	|		И НЕ ВыручкаИСебестоимость.РасчетПартий
	|		И ВыручкаИСебестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|		И ТИПЗНАЧЕНИЯ(ВыручкаИСебестоимость.Регистратор) <> ТИП(Документ.ВводОстатковОПродажахЗаПрошлыеПериоды)
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Контрагент,
	|	ВыручкаИСебестоимость.Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности,
	|	ВыручкаИСебестоимость.Сторно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Контрагент				КАК Организация,
	|	ВыручкаИСебестоимость.Подразделение				КАК Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	ВыручкаИСебестоимость.Сторно					КАК Сторно,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 							КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период					  			КАК Период,
	|		АналитикаПоПартнерам.Контрагент                				КАК Контрагент,
	|		ВыручкаИСебестоимость.Подразделение							КАК Подразделение,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиНоменклатуры 	КАК НаправлениеДеятельности,
	|		ВыручкаИСебестоимость.Сторно								КАК Сторно,
	|		ВыручкаИСебестоимость.Стоимость
	|			+ ВыручкаИСебестоимость.ДопРасходы 
	|			+ ВыручкаИСебестоимость.Трудозатраты
	|			+ ВыручкаИСебестоимость.ПостатейныеПостоянныеСНДС
	|			+ ВыручкаИСебестоимость.ПостатейныеПеременныеСНДС
	|			+ ВыручкаИСебестоимость.РасходыНаПродажуСНДС КАК Сумма
	|	ИЗ
	|		ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ПО
	|				ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|				И АналитикаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|				И АналитикаПоПартнерам.Контрагент ССЫЛКА Справочник.Организации
	|				И АналитикаПоПартнерам.Контрагент <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|	ГДЕ
	|		ВыручкаИСебестоимость.ТипЗапасов В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|		И АналитикаПоПартнерам.Контрагент В (&МассивОрганизаций)
	|		И НЕ ВыручкаИСебестоимость.РасчетПартий
	|		И ВыручкаИСебестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|		И ТИПЗНАЧЕНИЯ(ВыручкаИСебестоимость.Регистратор) <> ТИП(Документ.ВводОстатковОПродажахЗаПрошлыеПериоды)
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Контрагент,
	|	ВыручкаИСебестоимость.Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности,
	|	ВыручкаИСебестоимость.Сторно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Контрагент				КАК Организация,
	|	ВыручкаИСебестоимость.Подразделение				КАК Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	ВыручкаИСебестоимость.Сторно					КАК Сторно,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 							КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период					  			КАК Период,
	|		АналитикаПоПартнерам.Контрагент                				КАК Контрагент,
	|		ВыручкаИСебестоимость.Подразделение							КАК Подразделение,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиКонтрагента 	КАК НаправлениеДеятельности,
	|		ВыручкаИСебестоимость.Сторно								КАК Сторно,
	|		ВыручкаИСебестоимость.СуммаВыручки							КАК Сумма
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ПО
	|				ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|				И АналитикаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|				И АналитикаПоПартнерам.Контрагент ССЫЛКА Справочник.Организации
	|				И АналитикаПоПартнерам.Контрагент <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|	ГДЕ
	|		ВыручкаИСебестоимость.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ВыручкаИСебестоимость.Активность
	|		И ВыручкаИСебестоимость.ТипЗапасов В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|		И ВыручкаИСебестоимость.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры
	|			<> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|		И АналитикаПоПартнерам.Контрагент В (&МассивОрганизаций)
	|		И НЕ АналитикаПоПартнерам.Организация В (&МассивОрганизаций)
	|		И НЕ ВыручкаИСебестоимость.РасчетПартий
	|		И ВыручкаИСебестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|		И ТИПЗНАЧЕНИЯ(ВыручкаИСебестоимость.Регистратор) <> ТИП(Документ.ВводОстатковОПродажахЗаПрошлыеПериоды)
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Контрагент,
	|	ВыручкаИСебестоимость.Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности,
	|	ВыручкаИСебестоимость.Сторно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 			КАК ВидДвижения,
	|	ВыручкаИСебестоимость.ДокументДвижения			КАК ДокументДвижения,
	|	ВыручкаИСебестоимость.Период					КАК Период,
	|	ВыручкаИСебестоимость.Контрагент				КАК Организация,
	|	ВыручкаИСебестоимость.Подразделение				КАК Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	ВыручкаИСебестоимость.Сторно					КАК Сторно,
	|	СУММА(ВыручкаИСебестоимость.Сумма)				КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыручкаИСебестоимость.Регистратор 							КАК ДокументДвижения,
	|		ВыручкаИСебестоимость.Период					  			КАК Период,
	|		АналитикаПоПартнерам.Контрагент                				КАК Контрагент,
	|		ВыручкаИСебестоимость.Подразделение							КАК Подразделение,
	|		ВыручкаИСебестоимость.НаправлениеДеятельностиНоменклатуры 	КАК НаправлениеДеятельности,
	|		ВыручкаИСебестоимость.Сторно								КАК Сторно,
	|		ВыручкаИСебестоимость.Стоимость
	|			+ ВыручкаИСебестоимость.ДопРасходы
	|			+ ВыручкаИСебестоимость.Трудозатраты
	|			+ ВыручкаИСебестоимость.ПостатейныеПостоянныеСНДС
	|			+ ВыручкаИСебестоимость.ПостатейныеПеременныеСНДС
	|			+ ВыручкаИСебестоимость.РасходыНаПродажуСНДС КАК Сумма
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ПО
	|				ВыручкаИСебестоимость.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
	|				И АналитикаПоПартнерам.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|				И АналитикаПоПартнерам.Контрагент ССЫЛКА Справочник.Организации
	|				И АналитикаПоПартнерам.Контрагент <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|	ГДЕ
	|		ВыручкаИСебестоимость.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ВыручкаИСебестоимость.Активность
	|		И ВыручкаИСебестоимость.ТипЗапасов В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|		И АналитикаПоПартнерам.Контрагент В (&МассивОрганизаций)
	|		И НЕ АналитикаПоПартнерам.Организация В (&МассивОрганизаций)
	|		И НЕ ВыручкаИСебестоимость.РасчетПартий
	|		И ВыручкаИСебестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
	|		И ТИПЗНАЧЕНИЯ(ВыручкаИСебестоимость.Регистратор) <> ТИП(Документ.ВводОстатковОПродажахЗаПрошлыеПериоды)
	|   ) КАК ВыручкаИСебестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыручкаИСебестоимость.ДокументДвижения,
	|	ВыручкаИСебестоимость.Период,
	|	ВыручкаИСебестоимость.Контрагент,
	|	ВыручкаИСебестоимость.Подразделение,
	|	ВыручкаИСебестоимость.НаправлениеДеятельности,
	|	ВыручкаИСебестоимость.Сторно
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)	 КАК ВидДвижения,
	|	ПрочиеДоходы.Регистратор				 КАК ДокументДвижения,
	|	ПрочиеДоходы.Период						 КАК Период,
	|	ПрочиеДоходы.Организация				 КАК Организация,
	|	ПрочиеДоходы.Подразделение				 КАК Подразделение,
	|	ПрочиеДоходы.НаправлениеДеятельности	 КАК НаправлениеДеятельности,
	|	ПрочиеДоходы.Сторно						 КАК Сторно,
	|	СУММА(ПрочиеДоходы.Сумма)				 КАК Сумма
	|ПОМЕСТИТЬ ВТПромежуточнаяТаблица3
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеДоходы КАК ПрочиеДоходы
	|ГДЕ
	|	НЕ &ФормироватьФинансовыйРезультат
	|	И ПрочиеДоходы.РасчетСебестоимости
	|	И НЕ ПрочиеДоходы.СлужебноеВидДвиженияПриход
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеДоходы.Регистратор,
	|	ПрочиеДоходы.Период,
	|	ПрочиеДоходы.Организация,
	|	ПрочиеДоходы.Подразделение,
	|	ПрочиеДоходы.НаправлениеДеятельности,
	|	ПрочиеДоходы.Сторно
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)	  КАК ВидДвижения,
	|	ПрочиеРасходы.Регистратор				  КАК ДокументДвижения,
	|	ПрочиеРасходы.Период					  КАК Период,
	|	ПрочиеРасходы.Организация				  КАК Организация,
	|	ПрочиеРасходы.Подразделение				  КАК Подразделение,
	|	ПрочиеРасходы.НаправлениеДеятельности	  КАК НаправлениеДеятельности,
	|	ПрочиеРасходы.Сторно					  КАК Сторно,
	|	СУММА(ПрочиеРасходы.Сумма) 			      КАК Сумма
	|ПОМЕСТИТЬ ВТПромежуточнаяТаблица4
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходы КАК ПрочиеРасходы
	|ГДЕ
	|	НЕ &ФормироватьФинансовыйРезультат
	|	И ПрочиеРасходы.РасчетСебестоимости
	|	И НЕ ПрочиеРасходы.СлужебноеВидДвиженияПриход
	|	И ПрочиеРасходы.СтатьяРасходов.ВариантРаспределенияРасходовУпр
	|		= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходы.Регистратор,
	|	ПрочиеРасходы.Период,
	|	ПрочиеРасходы.Организация,
	|	ПрочиеРасходы.Подразделение,
	|	ПрочиеРасходы.НаправлениеДеятельности,
	|	ПрочиеРасходы.Сторно
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)	  КАК ВидДвижения,
	|	ПрочаяВыручка.Регистратор				  КАК ДокументДвижения,
	|	ПрочаяВыручка.Период					  КАК Период,
	|	ПрочаяВыручка.Организация				  КАК Организация,
	|	ПрочаяВыручка.Подразделение				  КАК Подразделение,
	|	ПрочаяВыручка.НаправлениеДеятельности	  КАК НаправлениеДеятельности,
	|	ПрочаяВыручка.Сторно					  КАК Сторно,
	|	СУММА(ПрочаяВыручка.ВыручкаБезНДСУпр + ПрочаяВыручка.НДСУпр) КАК Сумма
	|ПОМЕСТИТЬ ВТПромежуточнаяТаблица5
	|ИЗ
	|	РегистрНакопления.ПрочаяВыручка КАК ПрочаяВыручка
	|ГДЕ
	|	ПрочаяВыручка.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПрочаяВыручка.Активность
	|	И ПрочаяВыручка.Организация В (&МассивОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочаяВыручка.Регистратор,
	|	ПрочаяВыручка.Период,
	|	ПрочаяВыручка.Организация,
	|	ПрочаяВыручка.Подразделение,
	|	ПрочаяВыручка.НаправлениеДеятельности,
	|	ПрочаяВыручка.Сторно
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДанныеДвижений.ДокументДвижения 	 								  КАК ДокументДвижения,
	|	ДанныеДвижений.Период				 								  КАК Период,
	|	ДанныеДвижений.Организация			 								  КАК Организация,
	|	ДанныеДвижений.Подразделение			 							  КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО			 											  КАК Аналитика,
	|	ДанныеДвижений.НаправлениеДеятельности			 					  КАК НаправлениеДеятельности,
	|	ДанныеДвижений.ВидДвижения			 								  КАК ВидДвижения,
	|	ДанныеДвижений.Сторно												  КАК Сторно,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПрибылиИУбытки) КАК Статья,
	|	СУММА(ДанныеДвижений.Сумма)			 								  КАК Сумма
	|ПОМЕСТИТЬ ВТДанныеДляФормированияДвижений
	|ИЗ
	|
	|	(ВЫБРАТЬ
	|		Т.ДокументДвижения						КАК ДокументДвижения,
	|		Т.Период								КАК Период,
	|		Т.ВидДвижения 							КАК ВидДвижения,
	|		Т.Организация							КАК Организация,
	|		Т.Подразделение							КАК Подразделение,
	|		Т.НаправлениеДеятельности				КАК НаправлениеДеятельности,
	|		Т.Сторно								КАК Сторно,
	|		Т.Сумма									КАК Сумма
	|	ИЗ
	|		ВТПромежуточнаяТаблица1 КАК Т
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения						КАК ДокументДвижения,
	|		Т.Период								КАК Период,
	|		Т.ВидДвижения 							КАК ВидДвижения,
	|		Т.Организация							КАК Организация,
	|		Т.Подразделение							КАК Подразделение,
	|		Т.НаправлениеДеятельности				КАК НаправлениеДеятельности,
	|		Т.Сторно								КАК Сторно,
	|		Т.Сумма									КАК Сумма
	|	ИЗ
	|		ВТПромежуточнаяТаблица2 КАК Т
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения						КАК ДокументДвижения,
	|		Т.Период								КАК Период,
	|		Т.ВидДвижения 							КАК ВидДвижения,
	|		Т.Организация							КАК Организация,
	|		Т.Подразделение							КАК Подразделение,
	|		Т.НаправлениеДеятельности				КАК НаправлениеДеятельности,
	|		Т.Сторно								КАК Сторно,
	|		Т.Сумма									КАК Сумма
	|	ИЗ
	|		ВТПромежуточнаяТаблица3 КАК Т
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения						КАК ДокументДвижения,
	|		Т.Период								КАК Период,
	|		Т.ВидДвижения 							КАК ВидДвижения,
	|		Т.Организация							КАК Организация,
	|		Т.Подразделение							КАК Подразделение,
	|		Т.НаправлениеДеятельности				КАК НаправлениеДеятельности,
	|		Т.Сторно								КАК Сторно,
	|		Т.Сумма									КАК Сумма
	|	ИЗ
	|		ВТПромежуточнаяТаблица4 КАК Т
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т.ДокументДвижения						КАК ДокументДвижения,
	|		Т.Период								КАК Период,
	|		Т.ВидДвижения 							КАК ВидДвижения,
	|		Т.Организация							КАК Организация,
	|		Т.Подразделение							КАК Подразделение,
	|		Т.НаправлениеДеятельности				КАК НаправлениеДеятельности,
	|		Т.Сторно								КАК Сторно,
	|		Т.Сумма									КАК Сумма
	|	ИЗ
	|		ВТПромежуточнаяТаблица5 КАК Т
	|
	|	) КАК ДанныеДвижений
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДвижений.ДокументДвижения,
	|	ДанныеДвижений.Период,
	|	ДанныеДвижений.Организация,
	|	ДанныеДвижений.Подразделение,
	|	ДанныеДвижений.НаправлениеДеятельности,
	|	ДанныеДвижений.ВидДвижения,
	|	ДанныеДвижений.Сторно
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеДвижений.Сумма) <> 0
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ВТДанныеДляФормированияДвижений");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьДвиженияПоРегиструПоДаннымВременнойТаблицы(
		ПараметрыРасчета,
		Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя,
		"ВТДанныеДляФормированияДвижений",
		Истина);
		
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВТПромежуточнаяТаблица1, ВТПромежуточнаяТаблица2, ВТПромежуточнаяТаблица3, ВТПромежуточнаяТаблица4");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 4.4
Процедура ОтразитьВУправленческомБалансе(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ОтразитьВУправленческомБалансе");
	
	// Дополним перечень измененных документов документами внеоборотных активов.
	// Для полученного перечня документов установим признак необходимости повторного отражения в учете.
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	#Область ТекстЗапросаУправленческогоБаланса
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыОрганизаций.АналитикаРасходов КАК Объект
	|ПОМЕСТИТЬ ВТВнеоборотныеАктивы
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
	|ГДЕ
	|	ТоварыОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТоварыОрганизаций.Активность
	|	И ТоварыОрганизаций.СтатьяРасходов.ВариантРаспределенияРасходовУпр
	|		= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	И ТоварыОрганизаций.Организация В(&МассивОрганизаций)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СебестоимостьТоваров.АналитикаРасходов
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СебестоимостьТоваров
	|ГДЕ
	|	СебестоимостьТоваров.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр
	|		= ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.КорВидЗапасов КАК КорВидЗапасов,
	|	Т.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.Стоимость КАК Стоимость,
	|	Т.ДопРасходы КАК ДопРасходы,
	|	Т.Трудозатраты КАК Трудозатраты,
	|	Т.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|	Т.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|	Т.РасчетСебестоимости КАК РасчетСебестоимости,
	|	Т.Сторно КАК Сторно
	|ПОМЕСТИТЬ ВТСебестоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
	|ГДЕ
	|	Т.Стоимость + Т.ДопРасходы + Т.Трудозатраты + Т.ПостатейныеПостоянныеСНДС + Т.ПостатейныеПеременныеСНДС <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидЗапасов,
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.РасчетСебестоимости КАК РасчетСебестоимости,
	|	Т.Сторно КАК Сторно,
	|	Т.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТПрочиеДоходы
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеДоходы КАК Т
	|ГДЕ
	|	Т.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.РасчетСебестоимости КАК РасчетСебестоимости,
	|	Т.Сторно КАК Сторно,
	|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Т.Сумма КАК Сумма,
	|	Т.СуммаУпр КАК СуммаУпр
	|ПОМЕСТИТЬ ВТПрочиеРасходы
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходы КАК Т
	|ГДЕ
	|	Т.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.Сторно КАК Сторно,
	|	Т.Стоимость КАК Стоимость
	|ПОМЕСТИТЬ ВТПартииПрочихРасходов
	|ИЗ
	|	ВТКэшРасчетныеОборотыПартииПрочихРасходов КАК Т
	|ГДЕ
	|	Т.Стоимость <> 0
	|;
	//++ НЕ УТ
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Т.ПартияПроизводства КАК ПартияПроизводства,
	|	Т.Сторно КАК Сторно,
	|	Т.Стоимость КАК Стоимость
	|ПОМЕСТИТЬ ВТТрудозатратыНЗП
	|ИЗ
	|	ВТКэшРасчетныеОборотыТрудозатратыНезавершенногоПроизводства КАК Т
	|ГДЕ
	|	Т.Стоимость <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Т.ПартияПроизводства КАК ПартияПроизводства,
	|	Т.АналитикаПартииВыпуска КАК АналитикаПартииВыпуска,
	|	Т.РасчетСебестоимости КАК РасчетСебестоимости,
	|	Т.Сторно КАК Сторно,
	|	Т.Стоимость КАК Стоимость
	|ПОМЕСТИТЬ ВТПрочиеРасходыНЗП
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК Т
	|ГДЕ
	|	Т.Стоимость <> 0
	|;
	//-- НЕ УТ
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.Статья КАК Статья,
	|	Т.Аналитика КАК Аналитика,
	|	Т.Сумма КАК Сумма,
	|	Т.ВидИсточника КАК ВидИсточника,
	|	Т.Источник КАК Источник,
	|	Т.РасчетСебестоимости КАК РасчетСебестоимости,
	|	Т.Сторно КАК Сторно
	|ПОМЕСТИТЬ ВТАктивыПассивы
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеАктивыПассивы КАК Т
	|ГДЕ
	|	Т.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыКОтражению.Ссылка КАК Регистратор
	|ПОМЕСТИТЬ ДокументыКОтражению
	|ИЗ
	|	(
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		СебестоимостьТоваров.Регистратор КАК Ссылка
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СебестоимостьТоваров
	|	ГДЕ
	|		НЕ(СебестоимостьТоваров.Регистратор ССЫЛКА Документ.РасчетСебестоимостиТоваров)
	//++ НЕ УТ
	//++ Локализация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеДокумента.Ссылка КАК Ссылка
	|	ИЗ
	|		ВТВнеоборотныеАктивы КАК ВнеоборотныеАктивы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС.ОС КАК ДанныеДокумента
	|			ПО ВнеоборотныеАктивы.Объект = ДанныеДокумента.ОсновноеСредство
	|	ГДЕ
	|		ДанныеДокумента.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДанныеДокумента.Ссылка.Проведен
	|		И ДанныеДокумента.Ссылка.Организация В(&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеДокумента.Ссылка
	|	ИЗ
	|		ВТВнеоборотныеАктивы КАК ВнеоборотныеАктивы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МодернизацияОС.ОС КАК ДанныеДокумента
	|			ПО ВнеоборотныеАктивы.Объект = ДанныеДокумента.ОсновноеСредство
	|	ГДЕ
	|		ДанныеДокумента.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДанныеДокумента.Ссылка.Проведен
	|		И ДанныеДокумента.Ссылка.Организация В(&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеДокумента.Ссылка
	|	ИЗ
	|		ВТВнеоборотныеАктивы КАК ВнеоборотныеАктивы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуНМА КАК ДанныеДокумента
	|			ПО ВнеоборотныеАктивы.Объект = ДанныеДокумента.НематериальныйАктив
	|	ГДЕ
	|		ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДанныеДокумента.Ссылка.Проведен
	|		И ДанныеДокумента.Ссылка.Организация В(&МассивОрганизаций)
	//-- Локализация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТрудозатратыНЗП.Регистратор
	|	ИЗ
	|		ВТКэшРасчетныеОборотыТрудозатратыНезавершенногоПроизводства КАК ТрудозатратыНЗП
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПрочиеРасходыНЗП.Регистратор
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНЗП
	//-- НЕ УТ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПартииПрочихРасходов.Регистратор
	|	ИЗ
	|		ВТКэшРасчетныеОборотыПартииПрочихРасходов КАК ПартииПрочихРасходов
	//++ Локализация
	|	ГДЕ
	|		ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.Регистратор) <> ТИП(Документ.СчетФактураНалоговыйАгент)
	//-- Локализация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПрочиеАктивыПассивы.Регистратор
	|	ИЗ
	|		ВТКэшПрочиеАктивыПассивы КАК ПрочиеАктивыПассивы
	|	ГДЕ
	|		ПрочиеАктивыПассивы.Организация В(&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПрочиеДоходы.Регистратор
	|	ИЗ
	|		ВТКэшПрочиеДоходы КАК ПрочиеДоходы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПрочиеРасходы.Регистратор
	|	ИЗ
	|		ВТКэшПрочиеРасходы КАК ПрочиеРасходы
	|
	|) КАК ДокументыКОтражению
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|";
	#КонецОбласти
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ДокументыКОтражению");
	
	Если РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ДокументыКОтражению") > 0 Тогда
		
		// Передадим временную таблицу ДокументыКОтражению
		ПараметрыДвижений = Новый Структура;
		ПараметрыДвижений.Вставить("ВидОтложенногоРасчета", Перечисления.ВидыИсточниковДвижений.РасчетСебестоимости);
		ПараметрыДвижений.Вставить("ДокументыКОтражению",   ПараметрыРасчета.МенеджерВременныхТаблиц);
		ПараметрыДвижений.Вставить("Период", ПараметрыРасчета.РасчетныйПериод.НачалоПериода);
		ПараметрыДвижений.Вставить("ИмяВременнойТаблицыРезультата", "ВТДвиженияАктивыПассивы");
		
		ЗапросДвижений = УправленческийУчетПроведениеСервер.ЗапросДвиженийАктивовПассивов(ПараметрыДвижений);
		
		#Область ВычтемОнлайновыеДвижения
		ТекстВычитания = 
		"ВЫБРАТЬ
		|	Т.ВидДвижения КАК ВидДвижения,
		|	Т.Регистратор КАК Регистратор,
		|	Т.Период КАК Период,
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	Т.Статья КАК Статья,
		|	Т.Аналитика КАК Аналитика,
		|	Т.Сумма КАК Сумма,
		|	Т.ВидИсточника КАК ВидИсточника,
		|	Т.Источник КАК Источник,
		|	Т.Сторно КАК Сторно,
		|	Т.РасчетСебестоимости КАК РасчетСебестоимости
		|ПОМЕСТИТЬ ВТГруппировкаАктивыПассивы
		|ИЗ
		|	ВТДвиженияАктивыПассивы КАК Т
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
		|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	Т.Регистратор КАК Регистратор,
		|	Т.Период КАК Период,
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	Т.Статья КАК Статья,
		|	Т.Аналитика КАК Аналитика,
		|	-Т.Сумма КАК Сумма,
		|	Т.ВидИсточника КАК ВидИсточника,
		|	Т.Источник КАК Источник,
		|	Т.Сторно КАК Сторно,
		|	Т.РасчетСебестоимости КАК РасчетСебестоимости
		|ИЗ
		|	ВТКэшРасчетныеОборотыПрочиеАктивыПассивы КАК Т
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКОтражению КАК ДокументыКОтражению
		|	ПО Т.Регистратор = ДокументыКОтражению.Регистратор
		|ГДЕ
		|	Т.Сумма <> 0
		|	И НЕ Т.РасчетСебестоимости
		|	И Т.ВидИсточника = ЗНАЧЕНИЕ(Перечисление.ВидыИсточниковДвижений.РасчетСебестоимости)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.ВидДвижения КАК ВидДвижения,
		|	Т.Регистратор КАК Регистратор,
		|	Т.Период КАК Период,
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	Т.Статья КАК Статья,
		|	Т.Аналитика КАК Аналитика,
		|	СУММА(Т.Сумма) КАК Сумма,
		|	Т.ВидИсточника КАК ВидИсточника,
		|	Т.Источник КАК Источник,
		|	Т.Сторно КАК Сторно,
		|	МИНИМУМ(Т.РасчетСебестоимости) КАК РасчетСебестоимости,
		|	Т.Регистратор КАК ДокументДвижения
		|ПОМЕСТИТЬ ВТДанныеДляФормированияДвижений
		|ИЗ
		|	ВТГруппировкаАктивыПассивы КАК Т
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.ВидДвижения,
		|	Т.Регистратор,
		|	Т.Период,
		|	Т.Организация,
		|	Т.Подразделение,
		|	Т.НаправлениеДеятельности,
		|	Т.Статья,
		|	Т.Аналитика,
		|	Т.ВидИсточника,
		|	Т.Источник,
		|	Т.Сторно
		|
		|ИМЕЮЩИЕ
		|	СУММА(Т.Сумма) <> 0";
		ЗапросДвижений.Текст = ЗапросДвижений.Текст + ТекстВычитания;
		#КонецОбласти
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросДвижений, Истина, "ВТДанныеДляФормированияДвижений");
		
		РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьДвиженияПоРегиструПоДаннымВременнойТаблицы(
			ПараметрыРасчета,
			Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя,
			"ВТДанныеДляФормированияДвижений",
			Истина);
		
		РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
			ЗапросДвижений.Параметры.ИменаВременныхТаблиц);
		
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ДокументыКОтражению, ВТВнеоборотныеАктивы, ВТСебестоимость, ВТПрочиеДоходы, ВТПрочиеРасходы, ВТПартииПрочихРасходов, "
		+ "ВТТрудозатратыНЗП, ВТПрочиеРасходыНЗП, ВТАктивыПассивы, ВТГруппировкаАктивыПассивы, ВТДвиженияАктивыПассивы");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросов

Функция УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ТекстЗапроса) Экспорт
	
	// В запросах, выполняющих расчеты во временных таблицах, установим максимально возможную разрядность.
	
	СтараяРазрядность 			  = 28;
	СтараяРазрядностьДробнойЧасти = 10;
	НоваяРазрядность 			  = ПараметрыРасчета.РешениеСЛУ.РазрядностьДляРасчетов;
	НоваяРазрядностьДробнойЧасти  = СтараяРазрядностьДробнойЧасти;
	ОписаниеДенежногоПоля 		  = ОбщегоНазначенияУТ.РазрядностьДенежногоПоля();
	
	Если ОписаниеДенежногоПоля.Разрядность - ОписаниеДенежногоПоля.РазрядностьДробнойЧасти > 13 Тогда
		
		// Уменьшим разрядность дробной части при расчете.
		// Общую разрядность, установленную в настройках, изменять не будем - чтобы не вызвать ошибку переполнения поля.
		ИзмерениеРазрядности = ОписаниеДенежногоПоля.Разрядность - ОписаниеДенежногоПоля.РазрядностьДробнойЧасти - 13;
		НоваяРазрядностьДробнойЧасти = Макс(НоваяРазрядностьДробнойЧасти - ИзмерениеРазрядности, 0);
		
	КонецЕсли;
	
	Если СтараяРазрядность <> НоваяРазрядность ИЛИ СтараяРазрядностьДробнойЧасти <> НоваяРазрядностьДробнойЧасти Тогда
		
		ТекстРазрядность = "(" + СокрЛП(НоваяРазрядность) + "," + СокрЛП(НоваяРазрядностьДробнойЧасти) + ")";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "(28,10)", ТекстРазрядность);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "(28, 10)", ТекстРазрядность); // с пробелом
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "(28,	10)", ТекстРазрядность); // с табуляцией
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ФормированиеДвижений

#Область ДвиженияНоменклатура

// Служебная, этап 2.1, 3.3, 3.14, 3.19
Процедура СформироватьДвиженияПоОборотнымРегистрамУпрУчета(ПараметрыРасчета, ДанныеДвижения) Экспорт
	
	ДанныеСумм = ПолучитьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеДвижения);
	
	Если ДанныеСумм.ЕстьНенулеваяПолнаяСумма Тогда
		
		// Формирование движений Номенклатура - Доходы\Расходы.
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваров
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
			//++ НЕ УТ
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВСоставОС
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВСоставНМА
			//-- НЕ УТ
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаПрочиеЦели
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакрытиеМесяца
			Или ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровУХранителя Тогда
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения, ДанныеСумм);
			
		КонецЕсли;
		
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы Тогда
			
			Если ПараметрыРасчета.Свойство("МетодОценки")
			 И ПараметрыРасчета.МетодОценки = Перечисления.МетодыОценкиСтоимостиТоваров.ФИФОСкользящаяОценка Тогда
				
				СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения, ДанныеСумм);
				
			Иначе
				
				СкорректированныеСуммы = СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеСумм, -1, -1, -1, -1, 0);
				
				СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения, СкорректированныеСуммы);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Формирование движений Номенклатура - Номенклатура.
		Если ((ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами
				ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами
				ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемПередачаРаботМеждуФилиалами)
				И ДанныеДвижения.ВидДвижения = ВидДвиженияНакопления.Расход)
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратИзПроизводства
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзКладовой
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтПереработчика
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратПоКомиссииМеждуОрганизациями
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыпускПродукции
			ИЛИ (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОтПереработчика
				И ДанныеДвижения.ВидДвижения = ВидДвиженияНакопления.Расход)
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзКладовой
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КорректировкаОбособленногоУчета
			ИЛИ ((ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров
				ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеПолуфабрикатов
				ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемПередачаРаботМеждуПодразделениями)
				И ДанныеДвижения.ВидДвижения = ВидДвиженияНакопления.Расход)
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВПроизводство
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВПроизводство
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПереработчику
			ИЛИ (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваров
				И ДанныеДвижения.ВидДвижения = ВидДвиженияНакопления.Расход)
			ИЛИ (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваров
				И ДанныеДвижения.ВидДвижения = ВидДвиженияНакопления.Расход)
			ИЛИ (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности
				И ДанныеДвижения.РазделУчета <> Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСНеотфактурованнаяПоставка
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСПоступлениеИзТоваровВПути
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуПоступлениеИзТоваровВПути
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаНеотфактурованнаяПоставка
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаПоступлениеИзТоваровВПути
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи
			ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтХранителя Тогда
			
			СформироватьДвиженияНоменклатураНоменклатура(ПараметрыРасчета, ДанныеДвижения, ДанныеСумм,
				?(ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности,
					Перечисления.ХозяйственныеОперации.ОтгрузкаБезПереходаПраваСобственности,
					Неопределено));
			
			Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами
				ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами Тогда
				СформироватьДвиженияНоменклатураНоменклатура(ПараметрыРасчета, ДанныеДвижения, ДанныеСумм,
					Перечисления.ХозяйственныеОперации.ВнутреннееПоступлениеТоваров);
			ИначеЕсли ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемПередачаРаботМеждуФилиалами Тогда
				СформироватьДвиженияНоменклатураНоменклатура(ПараметрыРасчета, ДанныеДвижения, ДанныеСумм,
					Перечисления.ХозяйственныеОперации.ВнутреннееПоступлениеРабот);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Формирование прочих доходов\расходов при пересортице.
	Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой Тогда

		Если ДанныеСумм.ПолнаяСуммаПереоценки > 0 Тогда 
			
			СкорректированныеСуммы = СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеСумм, 1, 1, 1, 1, 1);
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				СкорректированныеСуммы,
				Ложь,
				Перечисления.ХозяйственныеОперации.РасходыОтПереоценкиТоваров);
			
		ИначеЕсли ДанныеСумм.ПолнаяСуммаПереоценки < 0 Тогда
			
			СкорректированныеСуммы = СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеСумм, -1, 1, -1, -1, 1);
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				СкорректированныеСуммы,
				Истина,
				Перечисления.ХозяйственныеОперации.ДоходыОтПереоценкиТоваров);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Формирование прочих расходов при порче.
	Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой Тогда
		
		Если ДанныеСумм.ПолнаяСуммаПереоценки <> 0 Тогда
			
			СкорректированныеСуммы = СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеСумм, 1, 1, 1, 1, 1);
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				СкорректированныеСуммы,
				Ложь,
				Перечисления.ХозяйственныеОперации.РасходыОтПереоценкиТоваров);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Формирование прочих доходов/расходов возникших от переоценки товаров.
	Если (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику
			И ДанныеДвижения.КорСтоимость <> 0)
		ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияПереданнойВозвратнойТары
		ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями
		ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноПереданнойТарыВозвратНаДругойСклад
		ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноПереданнойТары Тогда
		
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями Тогда
			СкорректированныеСуммы = СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеСумм, 0, 0, 1, 1, 0);
		Иначе
			СкорректированныеСуммы = СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеСумм, 1, 1, 1, 1, 0);
		КонецЕсли;
		
		Если СкорректированныеСуммы.ПолнаяСуммаСНДС > 0
		 ИЛИ СкорректированныеСуммы.ПолнаяСуммаРегл > 0
		 ИЛИ СкорректированныеСуммы.ПолнаяСуммаУпр > 0 Тогда 

			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				СкорректированныеСуммы,
				Ложь,
				Перечисления.ХозяйственныеОперации.РасходыОтПереоценкиТоваров);
			
		ИначеЕсли СкорректированныеСуммы.ПолнаяСуммаСНДС < 0
		 ИЛИ СкорректированныеСуммы.ПолнаяСуммаРегл < 0
		 ИЛИ СкорректированныеСуммы.ПолнаяСуммаУпр < 0 Тогда 
			
			СкорректированныеСуммы = СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(СкорректированныеСуммы, -1, -1, -1, -1, 0);
			
			СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения,
				СкорректированныеСуммы,
				Истина,
				Перечисления.ХозяйственныеОперации.ДоходыОтПереоценкиТоваров);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Служебная, этап 2.1, 3.3, 3.14 (СформироватьДвиженияПоОборотнымРегистрамУпрУчета)
Процедура СформироватьДвиженияНоменклатураДоходыРасходы(ПараметрыРасчета, ДанныеДвижения, ДанныеСумм,
			ЭтоДоход = Ложь, ХозяйственнаяОперация = Неопределено)

	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя;
	
	КопируемыеПоля =
	"Период, ХозяйственнаяОперация, Организация, Подразделение,
	|АналитикаУчетаНоменклатуры,Склад,ТипЗапасов,ВидЗапасов,
	|ИсточникГФУНоменклатуры, ДокументДвижения";
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения.
	ЗаполнитьЗначенияСвойств(Запись, ДанныеСумм);
	
	Если ХозяйственнаяОперация <> Неопределено Тогда
		Запись.ХозяйственнаяОперация = ХозяйственнаяОперация;
	КонецЕсли;
	
	Если ЭтоДоход Тогда
		Запись.СтатьяДоходовРасходов = ДанныеДвижения.СтатьяДоходов;
		Запись.АналитикаДоходов 	 = ДанныеДвижения.АналитикаДоходов;
		Запись.НаправлениеДеятельностиНоменклатуры = ДанныеДвижения.НаправлениеДеятельности;
		Запись.НаправлениеДеятельностиСтатьи = ДанныеДвижения.КорНаправлениеДеятельности;
	Иначе
		Запись.СтатьяДоходовРасходов = ДанныеДвижения.СтатьяРасходовСписания;
		Запись.АналитикаРасходов 	 = ДанныеДвижения.АналитикаРасходов;
		Запись.НаправлениеДеятельностиНоменклатуры = ДанныеДвижения.НаправлениеДеятельности;
		Запись.НаправлениеДеятельностиСтатьи = ДанныеДвижения.КорНаправлениеДеятельности;
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
			И ДанныеДвижения.КорТипЗапасов = Перечисления.ТипыЗапасов.КомиссионныйТовар Тогда
			Запись.НаправлениеДеятельностиНоменклатуры = ДанныеДвижения.КорНаправлениеДеятельности;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Служебная, этап 2.1, 3.3, 3.14 (СформироватьДвиженияПоОборотнымРегистрамУпрУчета)
Процедура СформироватьДвиженияНоменклатураНоменклатура(ПараметрыРасчета, ДанныеДвижения, ДанныеСумм, ХозяйственнаяОперация)
	
	Если НЕ ЗначениеЗаполнено(ДанныеДвижения.КорАналитикаУчетаНоменклатуры)
	 И (ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров
		ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров
	 	ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураНоменклатура.Имя;
	
	КопируемыеПоля =
	"Период, ХозяйственнаяОперация, Организация, Подразделение,
	|АналитикаУчетаНоменклатуры,Склад,ТипЗапасов,ВидЗапасов,НаправлениеДеятельности,
	|КорАналитикаУчетаНоменклатуры,КорСклад,КорТипЗапасов,КорВидЗапасов,КорНаправлениеДеятельности,
	|ИсточникГФУНоменклатуры, КорИсточникГФУНоменклатуры, ДокументДвижения, КорОрганизация";

	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения.
	ЗаполнитьЗначенияСвойств(Запись, ДанныеСумм);
	
	Если ХозяйственнаяОперация <> Неопределено Тогда
		Запись.ХозяйственнаяОперация = ХозяйственнаяОперация;
		Если Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутреннееПоступлениеТоваров
			ИЛИ Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутреннееПоступлениеРабот Тогда
			Запись.Организация    = ДанныеДвижения.КорОрганизация;
			Запись.КорОрганизация = ДанныеДвижения.Организация;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеДвижения.Склад) = Тип("СправочникСсылка.Партнеры") Тогда
		Запись.Количество = ДанныеДвижения.Количество;
	КонецЕсли;
	
	Если Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
		Запись.КорНаправлениеДеятельности = ДанныеДвижения.НаправлениеДеятельности;
	КонецЕсли;
	
КонецПроцедуры

// Служебная, этап 2.1, 3.18
Процедура СформироватьДвиженияНоменклатураДоходыРасходыСписаниеНДС(ПараметрыРасчета) Экспорт
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя;
	
	КопируемыеПоля = "Период, ХозяйственнаяОперация, Организация,
	|НаправлениеДеятельностиНоменклатуры, НаправлениеДеятельностиСтатьи, АналитикаУчетаНоменклатуры,
	|Склад, Подразделение, СтатьяДоходовРасходов, АналитикаРасходов, ВидЗапасов, ТипЗапасов,
	|ИсточникГФУНоменклатуры, ДокументДвижения, СтоимостьРегл, СтоимостьУпр";
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партии.Период 														КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНДСПоПриобретеннымЦенностям) 	КАК ХозяйственнаяОперация,
	|	Партии.Организация 													КАК Организация,
	|	СпрНазначения.НаправлениеДеятельности 								КАК НаправлениеДеятельностиНоменклатуры,
	|	СпрНазначения.НаправлениеДеятельности 								КАК НаправлениеДеятельностиСтатьи,
	|	Партии.АналитикаУчетаНоменклатуры 									КАК АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.МестоХранения									КАК Склад,
	|	ВЫБОР
	|		КОГДА АналитикаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА АналитикаНоменклатуры.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СпрСклады.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ 																КАК Подразделение,
	|	Партии.СтатьяСписанияНДС 											КАК СтатьяДоходовРасходов,
	|	Партии.АналитикаСписанияНДС 										КАК АналитикаРасходов,
	|	Партии.ВидЗапасов													КАК ВидЗапасов,
	|	ВЫБОР КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	ИНАЧЕ
	|		ЕСТЬNULL(СпрВидыЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|	КОНЕЦ 																КАК ТипЗапасов,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|		ТОГДА Партии.ВидЗапасов
	|		ИНАЧЕ АналитикаНоменклатуры.Номенклатура
	|	КОНЕЦ 																КАК ИсточникГФУНоменклатуры,
	|	Партии.Регистратор 													КАК ДокументДвижения,
	|	СУММА(Партии.СписаниеНДС) 											КАК СтоимостьРегл,
	|	СУММА(Партии.СписаниеНДСУпр) 										КАК СтоимостьУпр
	|ИЗ
	|	ВтПартии КАК Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО Партии.ВидЗапасов = СпрВидыЗапасов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
	|			ПО АналитикаНоменклатуры.СкладскаяТерритория = СпрСклады.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО АналитикаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|		ПО Партии.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
	|		ПО СпрНазначения.Ссылка = АналитикаНоменклатуры.Назначение
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.МестоХранения,
	|	ВЫБОР
	|		КОГДА АналитикаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА АналитикаНоменклатуры.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СпрСклады.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ,
	|	СпрНазначения.НаправлениеДеятельности,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.ВидЗапасов,
	|	ВЫБОР КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	ИНАЧЕ
	|		ЕСТЬNULL(СпрВидыЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|	КОНЕЦ,
	|	Партии.Регистратор,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|		ТОГДА Партии.ВидЗапасов
	|		ИНАЧЕ АналитикаНоменклатуры.Номенклатура
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.СписаниеНДС) <> 0
	|	ИЛИ СУММА(Партии.СписаниеНДСУпр) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина,,, ИмяРегистра);
	
	Пока Выборка.Следующий() Цикл
		// Добавим движение и заполним его свойства.
		ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, Выборка, КопируемыеПоля);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеЗаполнения)
	
	ДанныеСумм = Новый Структура;
	ДанныеСумм.Вставить("Стоимость", 			  		0);
	ДанныеСумм.Вставить("СтоимостьБезНДС", 		  		0);
	ДанныеСумм.Вставить("ДопРасходы", 	  		  		0);
	ДанныеСумм.Вставить("ДопРасходыБезНДС", 	  		0);
	ДанныеСумм.Вставить("Трудозатраты", 		  		0);
	ДанныеСумм.Вставить("ПостатейныеПостоянныеСНДС", 	0);
	ДанныеСумм.Вставить("ПостатейныеПостоянныеБезНДС", 	0);
	ДанныеСумм.Вставить("ПостатейныеПеременныеСНДС", 	0);
	ДанныеСумм.Вставить("ПостатейныеПеременныеБезНДС", 	0);
	ДанныеСумм.Вставить("СтоимостьРегл", 		  		0);
	ДанныеСумм.Вставить("ДопРасходыРегл", 		  		0);
	ДанныеСумм.Вставить("ТрудозатратыРегл", 	  		0);
	ДанныеСумм.Вставить("ПостатейныеПостоянныеРегл", 	0);
	ДанныеСумм.Вставить("ПостатейныеПеременныеРегл", 	0);
	ДанныеСумм.Вставить("СтоимостьУпр", 		  		0);
	ДанныеСумм.Вставить("ДопРасходыУпр", 		  		0);
	ДанныеСумм.Вставить("ТрудозатратыУпр", 		  		0);
	ДанныеСумм.Вставить("ПостатейныеПостоянныеУпр", 	0);
	ДанныеСумм.Вставить("ПостатейныеПеременныеУпр", 	0);
	ДанныеСумм.Вставить("СтоимостьЗабалансовая", 		0);
	ДанныеСумм.Вставить("СтоимостьЗабалансоваяРегл", 	0);
	ДанныеСумм.Вставить("ПостояннаяРазница", 			0);
	ДанныеСумм.Вставить("ВременнаяРазница", 			0);
	ДанныеСумм.Вставить("НДСРегл", 			    		0);
	ДанныеСумм.Вставить("НДСУпр",	 			    	0);
	ДанныеСумм.Вставить("КорСтоимость", 			    0);
	
	ЗаполнитьЗначенияСвойств(ДанныеСумм, ДанныеЗаполнения);
	
	ЗаполнитьИтоговыеСуммовыеПоказателиДвижения(ДанныеСумм);
	
	ДанныеСумм.Вставить("ПолнаяСуммаПереоценки", ДанныеСумм.ПолнаяСуммаСНДС - ДанныеСумм.КорСтоимость);
		
	Возврат ДанныеСумм;
	
КонецФункции

Функция СкорректироватьСуммовыеПоказателиДвиженияНоменклатуры(ДанныеСумм,
			КоэффициентСуммыСНДС, КоэффициентСуммыБезНДС, КоэффициентСуммыРегл, КоэффициентСуммыУпр, КоэффициентКорСуммы)
	
	ИменаПолейСНДС   = Новый Структура("Стоимость, ДопРасходы, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС");
	ИменаПолейБезНДС = Новый Структура("СтоимостьБезНДС, ДопРасходыБезНДС, ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС");
	ИменаПолейРегл   = Новый Структура("СтоимостьРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл");
	ИменаПолейУпр 	 = Новый Структура("СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр");
	
	ИменаПолейУменьшаемойСтоимости = Новый Структура("Стоимость, СтоимостьБезНДС");
	
	СкорректированныеСуммы = Новый Структура;
	
	Для Каждого КлючИЗначение Из ДанныеСумм Цикл
		
		Если ИменаПолейСНДС.Свойство(КлючИЗначение.Ключ) Тогда
			
			Если ИменаПолейУменьшаемойСтоимости.Свойство(КлючИЗначение.Ключ) Тогда
				СкорректированныеСуммы.Вставить(КлючИЗначение.Ключ,
					(КлючИЗначение.Значение - ДанныеСумм.КорСтоимость * КоэффициентКорСуммы) * КоэффициентСуммыСНДС);
			Иначе
				СкорректированныеСуммы.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение * КоэффициентСуммыСНДС);
			КонецЕсли;
			
		ИначеЕсли ИменаПолейБезНДС.Свойство(КлючИЗначение.Ключ) Тогда
			
			Если ИменаПолейУменьшаемойСтоимости.Свойство(КлючИЗначение.Ключ) Тогда
				СкорректированныеСуммы.Вставить(КлючИЗначение.Ключ,
					(КлючИЗначение.Значение - ДанныеСумм.КорСтоимость * КоэффициентКорСуммы) * КоэффициентСуммыБезНДС);
			Иначе
				СкорректированныеСуммы.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение * КоэффициентСуммыБезНДС);
			КонецЕсли;
		
		ИначеЕсли ИменаПолейРегл.Свойство(КлючИЗначение.Ключ) Тогда
			
			СкорректированныеСуммы.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение * КоэффициентСуммыРегл);
		
		ИначеЕсли ИменаПолейУпр.Свойство(КлючИЗначение.Ключ) Тогда
			
			СкорректированныеСуммы.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение * КоэффициентСуммыУпр);
			
		Иначе
			
			СкорректированныеСуммы.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьИтоговыеСуммовыеПоказателиДвижения(СкорректированныеСуммы);
	
	Возврат СкорректированныеСуммы;
	
КонецФункции

Процедура ЗаполнитьИтоговыеСуммовыеПоказателиДвижения(ДанныеСумм)
	
	ДанныеСумм.Вставить("ПолнаяСуммаСНДС",
		ДанныеСумм.Стоимость + ДанныеСумм.ДопРасходы + ДанныеСумм.Трудозатраты
		+ ДанныеСумм.ПостатейныеПостоянныеСНДС + ДанныеСумм.ПостатейныеПеременныеСНДС);
	ДанныеСумм.Вставить("ПолнаяСуммаБезНДС",
		ДанныеСумм.СтоимостьБезНДС + ДанныеСумм.ДопРасходыБезНДС + ДанныеСумм.Трудозатраты
		+ ДанныеСумм.ПостатейныеПостоянныеБезНДС + ДанныеСумм.ПостатейныеПеременныеБезНДС);
	ДанныеСумм.Вставить("ПолнаяСуммаРегл",
		ДанныеСумм.СтоимостьРегл + ДанныеСумм.ДопРасходыРегл + ДанныеСумм.ТрудозатратыРегл
		+ ДанныеСумм.ПостатейныеПостоянныеРегл + ДанныеСумм.ПостатейныеПеременныеРегл);
	ДанныеСумм.Вставить("ПолнаяСуммаУпр",
		ДанныеСумм.СтоимостьУпр + ДанныеСумм.ДопРасходыУпр + ДанныеСумм.ТрудозатратыУпр
		+ ДанныеСумм.ПостатейныеПостоянныеУпр + ДанныеСумм.ПостатейныеПеременныеУпр);
	
	ДанныеСумм.Вставить("ЕстьНенулеваяПолнаяСумма",
		ДанныеСумм.ПолнаяСуммаСНДС <> 0
		ИЛИ ДанныеСумм.ПолнаяСуммаБезНДС <> 0
		ИЛИ ДанныеСумм.ПолнаяСуммаРегл <> 0
		ИЛИ ДанныеСумм.ПолнаяСуммаУпр <> 0);
	
КонецПроцедуры

#КонецОбласти

#Область ДвиженияСебестоимостьТоваров

// Служебная, этап 2.1, 3.1, 3.14
Процедура СформироватьКорДвиженияСебестоимостьТоваров(ПараметрыРасчета, ДанныеДвижения, ПромежуточнаяСебестоимость = Ложь) Экспорт
	
	Если ПромежуточнаяСебестоимость Тогда
		ТаблицаПриемник = "ВТПромежуточнаяСебестоимостьТоваров";
	Иначе
		ТаблицаПриемник = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	КонецЕсли;
	
	КопируемыеПоля = "
	|Период, ХозяйственнаяОперация, ДокументДвижения, ИдентификаторСтроки,
	|Подразделение, ГруппаПродукции,
	|Стоимость, СтоимостьЗабалансовая, СтоимостьБезНДС, ДопРасходы, ДопРасходыБезНДС,
	|СтоимостьРегл, СтоимостьЗабалансоваяРегл, ПостояннаяРазница, ВременнаяРазница,
	|СтатьяКалькуляции, ТипЗаписи, ДокументИсточник, ИдентификаторФинЗаписи, Сторно,
	|Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС,
	|ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл,
	|ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр, НДСУпр";
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ТаблицаПриемник, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения                = ВидДвиженияНакопления.Приход;
	Запись.АналитикаУчетаНоменклатуры = ДанныеДвижения.КорАналитикаУчетаНоменклатуры;
	Запись.РазделУчета                = ДанныеДвижения.КорРазделУчета;
	Запись.ВидЗапасов                 = ДанныеДвижения.КорВидЗапасов;
	Запись.Организация                = ?(ЗначениеЗаполнено(ДанныеДвижения.КорОрганизация), ДанныеДвижения.КорОрганизация, ДанныеДвижения.Организация);
	Запись.Количество 				  = 0;
	
	Запись.Партия                 	  = ДанныеДвижения.КорПартия;
	Если ЗначениеЗаполнено(ДанныеДвижения.КорПартия) Тогда
		Запись.АналитикаУчетаПартий   = ДанныеДвижения.КорАналитикаУчетаПартий;
	КонецЕсли;
	
	Если ПараметрыРасчета.ПартионныйУчетВерсии22 Тогда
		Запись.АналитикаФинансовогоУчета = ДанныеДвижения.КорАналитикаФинансовогоУчета;
		Запись.ВидДеятельностиНДС   	 = ДанныеДвижения.КорВидДеятельностиНДС;
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыпускПродукции Тогда
			Если ТипЗнч(ДанныеДвижения.АналитикаФинансовогоУчета) = Тип("СправочникСсылка.ГруппыАналитическогоУчетаНоменклатуры") Тогда
				Запись.КорАналитикаФинансовогоУчета = ДанныеДвижения.АналитикаФинансовогоУчета;
			Иначе
				Запись.КорАналитикаФинансовогоУчета = Справочники.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка();
			КонецЕсли;
			Запись.ГруппаПродукции = ДанныеДвижения.АналитикаФинансовогоУчета;
		КонецЕсли;
		//++ НЕ УТ
		Если ТипЗнч(ДанныеДвижения.ДокументДвижения) = Тип("ДокументСсылка.РаспределениеВозвратныхОтходов")
			И Запись.ВидДвижения = ВидДвиженияНакопления.Приход
			И Запись.РазделУчета = Перечисления.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство Тогда
			Запись.КорАналитикаУчетаНоменклатуры	= ДанныеДвижения.АналитикаУчетаНоменклатурыВО;
			Запись.КорАналитикаФинансовогоУчета		= ДанныеДвижения.АналитикаФинансовогоУчетаВО;
		КонецЕсли;
		//-- НЕ УТ
	КонецЕсли;
	Если Запись.РазделУчета = Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение Тогда
		Запись.КорВидЗапасов             = ДанныеДвижения.КорВидЗапасов;
	КонецЕсли;

	Если ДанныеДвижения.ЭтоПередачаМеждуОрганизациями Тогда
		
		Запись.СтоимостьРегл = 0;
		Запись.СтоимостьЗабалансоваяРегл = 0;
		Запись.ПостояннаяРазница = 0;
		Запись.ВременнаяРазница = 0;
		
		Запись.ДопРасходыРегл = 0;
		Запись.ТрудозатратыРегл = 0;
		Запись.ПостатейныеПостоянныеРегл = 0;
		Запись.ПостатейныеПеременныеРегл = 0;
		
		Запись.СтоимостьУпр = 0;
		Запись.ДопРасходыУпр = 0;
		Запись.ТрудозатратыУпр = 0;
		Запись.ПостатейныеПостоянныеУпр = 0;
		Запись.ПостатейныеПеременныеУпр = 0;
		
	ИначеЕсли ДанныеДвижения.НДСРегл <> 0 ИЛИ ДанныеДвижения.НДСУпр <> 0 Тогда // это не передача
		
		КопируемыеПоля = " Период, ХозяйственнаяОперация, ДокументДвижения, ИдентификаторСтроки, Подразделение, Организация,
			|СтатьяКалькуляции, ТипЗаписи, ДокументИсточник";
		
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ТаблицаПриемник, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.ВидДвижения 				  	 = ВидДвиженияНакопления.Приход;
		Запись.АналитикаУчетаНоменклатуры 	 = ДанныеДвижения.КорАналитикаУчетаНоменклатуры;
		Запись.РазделУчета 				  	 = ДанныеДвижения.КорРазделУчета;
		Запись.ВидЗапасов 				  	 = ДанныеДвижения.КорВидЗапасов;
		Запись.Организация                	 = ?(ЗначениеЗаполнено(ДанныеДвижения.КорОрганизация), ДанныеДвижения.КорОрганизация, ДанныеДвижения.Организация);
		
		Запись.Партия                 	     = ДанныеДвижения.КорПартия;
		Запись.АналитикаУчетаПартий   	     = ДанныеДвижения.КорАналитикаУчетаПартий;
		
		Если ПараметрыРасчета.ПартионныйУчетВерсии22 Тогда
			Запись.АналитикаФинансовогоУчета = ДанныеДвижения.КорАналитикаФинансовогоУчета;
			Запись.ВидДеятельностиНДС   	 = ДанныеДвижения.КорВидДеятельностиНДС;
			Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыпускПродукции Тогда
				Если ТипЗнч(ДанныеДвижения.АналитикаФинансовогоУчета) = Тип("СправочникСсылка.ГруппыАналитическогоУчетаНоменклатуры") Тогда
					Запись.КорАналитикаФинансовогоУчета = ДанныеДвижения.АналитикаФинансовогоУчета;
				Иначе
					Запись.КорАналитикаФинансовогоУчета = Справочники.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка();
				КонецЕсли;
				Запись.ГруппаПродукции = ДанныеДвижения.АналитикаФинансовогоУчета;
			КонецЕсли;
		КонецЕсли;
		
		Запись.СтоимостьРегл 			  	 = ДанныеДвижения.НДСРегл;
		Запись.СтоимостьУпр 			  	 = ДанныеДвижения.НДСУпр;
		
	КонецЕсли;

КонецПроцедуры

//++ НЕ УТ

// Служебная, этап 2.3, 3.15
Процедура СформироватьДвиженияСебестоимостьТоваровСписаниеНЗПЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений)

	ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя;
	ИмяВременнойТаблицы = "ВтСебестоимостьТоваровСписаниеНЗПДвижения";
	
	КопируемыеПоля = "
	|Период, Организация, РазделУчета, ВидЗапасов, Подразделение, ГруппаПродукции, ДокументДвижения, СтатьяКалькуляции";
	
	КопируемыеПоля = КопируемыеПоля + ",
	|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС, ИдентификаторФинЗаписи
	|";
	
	СуммовыеПоля = "
	|Стоимость, СтоимостьБезНДС, ДопРасходы, ДопРасходыБезНДС, СтоимостьРегл,
	|ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ТрудозатратыБезНДС, ПостатейныеСНДС, ПостатейныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеРегл, РезервРегл,
	|ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, 
	|ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, РезервУпр, ДоляСтоимости";
	
	КопируемыеПоля = КопируемыеПоля + ", " + СуммовыеПоля;

	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостояннаяРазница", "
	|ВЫБОР
	|	КОГДА ЛОЖЬ ТОГДА 0 // Для удобства расстановки тегов.
	//++ Локализация
	|	КОГДА СтатьяРасходов.КосвенныеЗатратыНУ И НЕ СтатьяРасходов.ПринятиеКНалоговомуУчету
	|		ТОГДА СуммаРегл - ВременнаяРазница
	//-- Локализация
	|		ИНАЧЕ ПостояннаяРазница
	|	КОНЕЦ");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВременнаяРазница", "
	|ВЫБОР
	|	КОГДА ЛОЖЬ ТОГДА 0 // Для удобства расстановки тегов.
	//++ Локализация
	|	КОГДА СтатьяРасходов.КосвенныеЗатратыНУ И СтатьяРасходов.ПринятиеКНалоговомуУчету
	|		ТОГДА СуммаРегл - ПостояннаяРазница
	//-- Локализация
	|		ИНАЧЕ ВременнаяРазница
	|	КОНЕЦ");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "ИСТИНА");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаУчетаНоменклатуры", "АналитикаУчетаПродукцииСебестоимость");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ХозяйственнаяОперация", "ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НастройкаХозяйственнойОперации", "ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВыпускПродукции)");
	
	УсловиеГДЕ = "ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ ЭтоКорректировка";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГДЕ);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);

КонецПроцедуры

Процедура СформироватьДвиженияНоменклатураНоменклатураСписаниеНЗПЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияНоменклатураНоменклатура.Имя;
	ИмяВременнойТаблицы = "ВтДвиженияНоменклатураНоменклатураСписаниеНЗП";
	
	КопируемыеПоля =
	"Период, ХозяйственнаяОперация, Организация, Подразделение, НаправлениеДеятельности, КорНаправлениеДеятельности,
	|ТипЗапасов, ВидЗапасов, ИсточникГФУНоменклатуры, ДокументДвижения";

	СуммовыеПоля = "
	|Стоимость, СтоимостьБезНДС, ДопРасходы, ДопРасходыБезНДС, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, 
	|СтоимостьРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр,
	|ПостояннаяРазница, ВременнаяРазница";
	
	КопируемыеПоля = КопируемыеПоля + ", " + СуммовыеПоля;

	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ХозяйственнаяОперация", "ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаУчетаНоменклатуры", "АналитикаУчетаПродукцииСебестоимость");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "КорАналитикаУчетаНоменклатуры", "АналитикаУчетаПродукцииСебестоимость");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Склад", "АналитикаУчетаПродукцииСебестоимость.МестоХранения");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "КорСклад", "АналитикаУчетаПродукцииСебестоимость.МестоХранения");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "КорТипЗапасов", "ТипЗапасов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "КорВидЗапасов", "ВидЗапасов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "КорИсточникГФУНоменклатуры", "ИсточникГФУНоменклатуры");
	
	УсловиеГДЕ = "ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ ЭтоКорректировка";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГДЕ);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

//-- НЕ УТ
#КонецОбласти

#Область ДвиженияПрочиеРасходы

// Служебная, этап 2.1, 3.18
Процедура СформироватьДвиженияПрочиеРасходыСписаниеНДС(ПараметрыРасчета) Экспорт
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля =
		"Период, ВидДвижения, ХозяйственнаяОперация, Организация, АналитикаУчетаНоменклатуры, НаправлениеДеятельности,
		|Подразделение, СтатьяРасходов, АналитикаРасходов, ДокументДвижения, ИдентификаторФинЗаписи, СуммаРегл, СуммаУпр";
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партии.Период 														КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 								КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНДСПоПриобретеннымЦенностям) 	КАК ХозяйственнаяОперация,
	|	Партии.Организация 													КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры 									КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) 					КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА АналитикаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА АналитикаНоменклатуры.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(Склады.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ 																КАК Подразделение,
	|	Партии.СтатьяСписанияНДС 											КАК СтатьяРасходов,
	|	Партии.АналитикаСписанияНДС 										КАК АналитикаРасходов,
	|	Партии.Регистратор 													КАК ДокументДвижения,
	|	&ИдентификаторНеиспользуемойФинЗаписи								КАК ИдентификаторФинЗаписи,
	|	СУММА(Партии.СписаниеНДС) 											КАК СуммаРегл,
	|	СУММА(Партии.СписаниеНДСУпр) 										КАК СуммаУпр
	|ИЗ
	|	ВтПартии КАК Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО Партии.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|		ПО АналитикаНоменклатуры.СкладскаяТерритория = Склады.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
	|		ПО СпрНазначения.Ссылка = АналитикаНоменклатуры.Назначение
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	ВЫБОР
	|		КОГДА АналитикаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА АналитикаНоменклатуры.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(Склады.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	КОНЕЦ,
	|	СпрНазначения.НаправлениеДеятельности,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.Регистратор
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.СписаниеНДС) <> 0
	|	ИЛИ СУММА(Партии.СписаниеНДСУпр) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина,,, ИмяРегистра);
	
	Пока Выборка.Следующий() Цикл
		// Добавим движение и заполним его свойства.
		ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, Выборка, КопируемыеПоля);
	КонецЦикла;
	
КонецПроцедуры

// Служебная, этап 2.1, 3.1, 3.3, 3.14
Процедура СформироватьДвиженияПрочиеРасходы(ПараметрыРасчета, ДанныеДвижения, СуммовыеПоказатели) Экспорт

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, Подразделение, АналитикаРасходов, ХозяйственнаяОперация,
	|АналитикаУчетаНоменклатуры, ГруппаПродукции, ДокументДвижения, ИдентификаторФинЗаписи";
	
	Сумма = СуммовыеПоказатели.СуммаСНДС;
	СуммаБезНДС = СуммовыеПоказатели.СуммаБезНДС;
	СуммаРегл = СуммовыеПоказатели.СуммаРегл;
	СуммаУпр = СуммовыеПоказатели.СуммаУпр;
	ПостояннаяРазница = СуммовыеПоказатели.ПостояннаяРазница;
	ВременнаяРазница = СуммовыеПоказатели.ВременнаяРазница;

	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы
	 И НачалоМесяца(ДанныеДвижения.ПериодПродажи) < НачалоМесяца(ДанныеДвижения.Период) Тогда
		Знак = -1;
	Иначе
		Знак = 1;
	КонецЕсли;
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения       = ВидДвиженияНакопления.Приход;
	Запись.Сумма             = Знак * Сумма;
	Запись.СтатьяРасходов    = ДанныеДвижения.СтатьяРасходовСписания;
	Запись.НаправлениеДеятельности = ДанныеДвижения.КорНаправлениеДеятельности;
	Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию Тогда
		Запись.Организация = ДанныеДвижения.КорОрганизация;
	КонецЕсли;
	Если ДанныеДвижения.ВариантРаспределенияРасходовУпр = Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты Тогда
		Запись.СуммаБезНДС = Знак * СуммаБезНДС;
	КонецЕсли;
	
	Если НЕ ДанныеДвижения.ВариантРаспределенияРасходовУпр = Перечисления.ВариантыРаспределенияРасходов.НаПрочиеАктивы Тогда
		Если НЕ ПараметрыРасчета.УправленческийУчетОрганизаций
		 ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию Тогда
			Запись.СуммаУпр = 0;
		ИначеЕсли ДанныеДвижения.ВариантРаспределенияРасходовУпр = Перечисления.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы
		 И НЕ ПараметрыРасчета.ИспользуетсяУправлениеВНА_2_4 Тогда
			Запись.СуммаУпр = 0;
		Иначе
			Запись.СуммаУпр = Знак * СуммаУпр;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходовРегл
	 ИЛИ ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию
	 ИЛИ ДанныеДвижения.ВариантРаспределенияРасходовРегл = Перечисления.ВариантыРаспределенияРасходов.НаПрочиеАктивы
	 ИЛИ (ДанныеДвижения.ВариантРаспределенияРасходовРегл = Перечисления.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы
	 	И НЕ ПараметрыРасчета.ИспользуетсяУправлениеВНА_2_4) Тогда
		Запись.СуммаРегл = 0;
		Запись.ПостояннаяРазница = 0;
		Запись.ВременнаяРазница = 0;
	Иначе
		Если ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию Тогда
			Запись.СуммаРегл = 0;
			//++ Локализация
			Запись.ПостояннаяРазница = ?(ДанныеДвижения.СписаниеПриПередачеНУ,
				?(НЕ ДанныеДвижения.ПринятиеКНалоговомуУчету, СуммаРегл - ВременнаяРазница - ПостояннаяРазница, 0), 0);
			Запись.ВременнаяРазница = ?(ДанныеДвижения.СписаниеПриПередачеНУ,
				?(НЕ ДанныеДвижения.ПринятиеКНалоговомуУчету, -(СуммаРегл - ВременнаяРазница - ПостояннаяРазница),
					-(СуммаРегл - ВременнаяРазница - ПостояннаяРазница)), 0);
			//-- Локализация
		ИначеЕсли ДанныеДвижения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатациюБУНУ Тогда
			Запись.СуммаРегл = 0;
			Запись.ПостояннаяРазница = 0;
			Запись.ВременнаяРазница = 0;
		Иначе
			Запись.СуммаРегл = Знак * СуммаРегл;
			Запись.ПостояннаяРазница = ?(НЕ ДанныеДвижения.ПринятиеКНалоговомуУчету, Знак * СуммаРегл - Знак * ВременнаяРазница, Знак * ПостояннаяРазница);
			Запись.ВременнаяРазница  = Знак * ВременнаяРазница;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДвижения.КорОрганизация)
	 И ДанныеДвижения.КорОрганизация <> ДанныеДвижения.Организация
	 И ДанныеДвижения.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию Тогда
	 
		ЗаписьУпр = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		ЗаписьУпр.СтатьяРасходов = ДанныеДвижения.СтатьяРасходовСписания;
		ЗаписьУпр.Сумма = -Запись.Сумма;
		ЗаписьУпр.СуммаУпр = -Запись.СуммаУпр;
		ЗаписьУпр.СуммаРегл = 0;
		ЗаписьУпр.ПостояннаяРазница = 0;
		ЗаписьУпр.ВременнаяРазница  = 0;
		ЗаписьУпр.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторнированиеРасходовУУ;
		
		ЗаписьУпр = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		ЗаписьУпр.Организация = ДанныеДвижения.КорОрганизация;
		ЗаписьУпр.СтатьяРасходов = ДанныеДвижения.СтатьяРасходовСписания;
		ЗаписьУпр.Сумма = Запись.Сумма;
		ЗаписьУпр.СуммаУпр = Запись.СуммаУпр;
		ЗаписьУпр.СуммаРегл = 0;
		ЗаписьУпр.ПостояннаяРазница = 0;
		ЗаписьУпр.ВременнаяРазница  = 0;
		ЗаписьУпр.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РегистрацияРасходовУУ;
		
		// Добавим движения по регистру "Активы и пассивы".
		ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя;
	
		КопируемыеПоля = "
		|Период, Организация, Подразделение, НаправлениеДеятельности";
		
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
		Запись.Статья      = ПланыВидовХарактеристик.СтатьиАктивовПассивов.ПрибылиИУбытки;
		Запись.Аналитика   = ДанныеДвижения.Организация;
		Запись.Сумма 	   = Знак * Сумма;
		
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
		Запись.Организация = ДанныеДвижения.КорОрганизация;
		Запись.Статья      = ПланыВидовХарактеристик.СтатьиАктивовПассивов.ПрибылиИУбытки;
		Запись.Аналитика   = ДанныеДвижения.КорОрганизация;
		Запись.Сумма 	   = Знак * Сумма;
	 
	КонецЕсли;
	
КонецПроцедуры

//++ НЕ УТ

Процедура СформироватьДвиженияПрочиеРасходыСписаниеНЗПЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений)

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	ИмяВременнойТаблицы = "ВтПрочиеРасходыСписаниеНЗПДвижения";
	
	КопируемыеПоля = "
	|Период, Организация, СтатьяРасходов, АналитикаРасходов, НаправлениеДеятельности, ДокументДвижения, КорПодразделение, КорНаправлениеДеятельности,
	|ИдентификаторФинЗаписи";
	
	СуммовыеПоля = "
	|Стоимость, СтоимостьБезНДС, ДопРасходы, ДопРасходыБезНДС, СтоимостьРегл,
	|ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ТрудозатратыБезНДС, ПостатейныеСНДС, ПостатейныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеРегл,
	|ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, 
	|ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ДоляСтоимости";
	
	КопируемыеПоля = КопируемыеПоля + ", " + СуммовыеПоля;

	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра);
	
	// Заполним дополнительные свойства движения
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВидДвижения", "ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СлужебноеВидДвиженияПриход", "ЛОЖЬ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ХозяйственнаяОперация", 
		"ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НастройкаХозяйственнойОперации", 
		"ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВыпускПродукции)");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Подразделение", "ИсходноеПодразделение");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Сумма", "СуммаСНДС");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаБезНДС", "СуммаБезНДС");
			
	Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходовРегл Тогда
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаРегл", "СуммаРегл");
			
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостояннаяРазница", "
		|ВЫБОР
		|	КОГДА ЛОЖЬ ТОГДА 0 // Для удобства расстановки тегов.
		//++ Локализация
		|	КОГДА СтатьяРасходов.КосвенныеЗатратыНУ И НЕ СтатьяРасходов.ПринятиеКНалоговомуУчету
		|		ТОГДА СуммаРегл - ВременнаяРазница
		//-- Локализация
		|		ИНАЧЕ ПостояннаяРазница
		|	КОНЕЦ");
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВременнаяРазница", "
		|ВЫБОР
		|	КОГДА ЛОЖЬ ТОГДА 0 // Для удобства расстановки тегов.
		//++ Локализация
		|	КОГДА СтатьяРасходов.КосвенныеЗатратыНУ И СтатьяРасходов.ПринятиеКНалоговомуУчету
		|		ТОГДА СуммаРегл - ПостояннаяРазница
		//-- Локализация
		|		ИНАЧЕ ВременнаяРазница
		|	КОНЕЦ");
		
	КонецЕсли;
	
	Если ПараметрыРасчета.УправленческийУчетОрганизаций Тогда
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СуммаУпр", "ДопРасходыУпр + ТрудозатратыУпр + ПостатейныеПостоянныеУпр + ПостатейныеПеременныеУпр");
		
	КонецЕсли;
	
	УсловиеГДЕ = "ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ ЭтоКорректировка";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы, УсловиеГДЕ);
		
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

// Служебная, этап 2.4, 3.16
Процедура СформироватьДвиженияПрочиеРасходыПрочееСписаниеНЗП(ПараметрыРасчета, ДанныеДвижения) Экспорт

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, Подразделение, СтатьяРасходов, АналитикаРасходов, НаправлениеДеятельности, 
	|ХозяйственнаяОперация, ДокументДвижения, ИдентификаторСтроки, НастройкаХозяйственнойОперации, ИдентификаторФинЗаписи";
	
	// Расход по исходной статье
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
	Запись.КорСтатьяРасходов = ДанныеДвижения.СтатьяРасходовПолучатель;
	Запись.КорПодразделение = ДанныеДвижения.КорПодразделение;
	Запись.КорАналитикаРасходов = ДанныеДвижения.АналитикаРасходовПолучатель;
	Запись.КорНаправлениеДеятельности 	 = ДанныеДвижения.КорНаправлениеДеятельности;
	
	Запись.Сумма 			 = ДанныеДвижения.Стоимость + ДанныеДвижения.ДопРасходы;
	Запись.СуммаБезНДС 		 = ДанныеДвижения.СтоимостьБезНДС + ДанныеДвижения.ДопРасходыБезНДС;
	Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходовРегл Тогда
		Запись.СуммаРегл 		 = ДанныеДвижения.СтоимостьРегл;
		Запись.ПостояннаяРазница = ДанныеДвижения.ПостояннаяРазница;
		Запись.ВременнаяРазница  = ДанныеДвижения.ВременнаяРазница;
	КонецЕсли;
	Если ПараметрыРасчета.УправленческийУчетОрганизаций Тогда
		Запись.СуммаУпр = ДанныеДвижения.СтоимостьУпр;
	КонецЕсли;
	
	// Приход по новой статье.
	Если ЗначениеЗаполнено(ДанныеДвижения.СтатьяРасходовПолучатель) Тогда
	
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.ВидДвижения 		 = ВидДвиженияНакопления.Приход;
		Запись.Подразделение	= ДанныеДвижения.КорПодразделение;
		Запись.НаправлениеДеятельности 	 = ДанныеДвижения.КорНаправлениеДеятельности;
		Запись.СтатьяРасходов 	 = ДанныеДвижения.СтатьяРасходовПолучатель;
		Запись.АналитикаРасходов = ДанныеДвижения.АналитикаРасходовПолучатель;
		Запись.КорСтатьяРасходов = ДанныеДвижения.СтатьяРасходов;
		Запись.КорПодразделение = ДанныеДвижения.Подразделение;
		Запись.КорАналитикаРасходов = ДанныеДвижения.АналитикаРасходов;
		Запись.КорНаправлениеДеятельности 	 = ДанныеДвижения.НаправлениеДеятельности;
		
		Запись.Сумма 			 = ДанныеДвижения.Стоимость + ДанныеДвижения.ДопРасходы;
		Запись.СуммаБезНДС 		 = ?(ДанныеДвижения.ИсключитьСтоимостьБезНДС, 0, 
			ДанныеДвижения.СтоимостьБезНДС + ДанныеДвижения.ДопРасходыБезНДС);
		Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходовРегл Тогда
			Запись.СуммаРегл 		 = ДанныеДвижения.СтоимостьРегл;
			Запись.ПостояннаяРазница = ДанныеДвижения.ПостояннаяРазница;
			Запись.ВременнаяРазница  = ДанныеДвижения.ВременнаяРазница;
		КонецЕсли;
		Если ПараметрыРасчета.УправленческийУчетОрганизаций Тогда
			Запись.СуммаУпр = ДанныеДвижения.СтоимостьУпр;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ДанныеДвижения.СтатьяАктивовПассивов) Тогда
		СформироватьДвиженияПрочиеАктивыПассивы(ПараметрыРасчета, ДанныеДвижения, ДанныеДвижения.Стоимость + ДанныеДвижения.ДопРасходы);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияДоходыРасходыПрочиеАктивыПассивыПрочееСписаниеНЗП(ПараметрыРасчета, ДанныеДвижения)

	ИмяРегистра = Метаданные.РегистрыНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы.Имя;
	
	КопируемыеПоля = "
	|Период, ХозяйственнаяОперация, Организация, Подразделение, НаправлениеДеятельности, АналитикаРасходов,
	|КорПодразделение, КорНаправлениеДеятельности, ДокументДвижения";
	
	// Расход по исходной статье
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.Статья = ДанныеДвижения.СтатьяРасходов;
	Если ЗначениеЗаполнено(ДанныеДвижения.СтатьяАктивовПассивов) Тогда
		Запись.КорСтатья = ДанныеДвижения.СтатьяАктивовПассивов;
	Иначе
		Запись.КорСтатья = ДанныеДвижения.СтатьяРасходовПолучатель;
	КонецЕсли;
	Запись.КорАналитикаРасходов = ДанныеДвижения.АналитикаРасходовПолучатель;
	Запись.КорАналитикаАктивовПассивов = ДанныеДвижения.АналитикаАктивовПассивов;
	
	Запись.Сумма = ДанныеДвижения.Стоимость + ДанныеДвижения.ДопРасходы;
	Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходовРегл Тогда
		Запись.СуммаРегл = ДанныеДвижения.СтоимостьРегл;
	КонецЕсли;
	Если ПараметрыРасчета.УправленческийУчетОрганизаций Тогда
		Запись.СуммаУпр = ДанныеДвижения.СтоимостьУпр;
	КонецЕсли;
	
КонецПроцедуры

//-- НЕ УТ
#КонецОбласти

#Область ДвиженияПрочиеДоходы

// Служебная, этап 2.1, 3.3, 3.14
Процедура СформироватьДвиженияПрочиеДоходы(ПараметрыРасчета, ДанныеДвижения,
			Сумма, СуммаРегл, СуммаУпр) Экспорт
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеДоходы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация, Подразделение, СтатьяДоходов, АналитикаДоходов, ХозяйственнаяОперация";

	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
	Запись.НаправлениеДеятельности = ДанныеДвижения.КорНаправлениеДеятельности;
	Запись.Сумма	   = Сумма;
	Запись.СуммаУпр	   = СуммаУпр;
	Если ПараметрыРасчета.ФО.ИспользоватьУчетПрочихДоходовРасходовРегл Тогда
		Запись.СуммаРегл = СуммаРегл;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДвиженияВыручкаИСебестоимостьПродаж

// Служебная, этап 2.2, 3.17, 3.18
Процедура СформироватьДвиженияВыручкаИСебестоимостьПродаж(ПараметрыРасчета, ДанныеДвижения) Экспорт
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя;
	
	КопируемыеПоля = "
	|Период, Подразделение, АналитикаУчетаНоменклатуры, Менеджер, РазделУчета,
	|АналитикаУчетаПоПартнерам, ТипЗапасов, ВидЗапасов, ЗаказКлиента, ХозяйственнаяОперация,
	|Склад, Соглашение, Договор, ВалютаВзаиморасчетов, ВалютаДокумента,
	|ИсточникГФУНоменклатуры, ИсточникГФУРасчетов, НаправлениеДеятельностиНоменклатуры,
	|НаправлениеДеятельностиКонтрагента, 
	|НалогообложениеНДС, ДокументДвижения, ИдентификаторФинЗаписи,
	|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС";
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	ПоляРесурсов = "
		|Стоимость, СтоимостьБезНДС, ПостояннаяРазница, ВременнаяРазница,
		|СтоимостьРегл, ДопРасходы, ДопРасходыБезНДС,
		|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС,
		|ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС,
		|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
		|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр";
	
	ЗаполнитьЗначенияСвойств(Запись, ДанныеДвижения, ПоляРесурсов);
	
	Если ДанныеДвижения.НДСРегл <> 0 Тогда
		
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.СтоимостьРегл = ДанныеДвижения.НДСРегл;
		
	КонецЕсли;
	
	Если ДанныеДвижения.НДСУпр <> 0 Тогда
		
		// Добавим движение и заполним его основные свойства
		Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения
		Запись.СтоимостьУпр = ДанныеДвижения.НДСУпр;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//++ НЕ УТ
#Область ДвиженияПрочиеРасходыНезавершенногоПроизводства

Процедура СформироватьДвиженияПрочиеРасходыНезавершенногоПроизводстваЗапросом(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений)
	
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходыНезавершенногоПроизводства.Имя;
	ИмяВременнойТаблицы = "ВтПрочиеРасходыНезавершенногоПроизводстваДвижения";
	
	КопируемыеПоля = "
	|Период, ВидДвижения, Организация, Подразделение, ЗаказНаПроизводство, КодСтрокиПродукция, Этап,
	|СтатьяКалькуляции, СтатьяРасходов, АналитикаРасходов, ГруппаПродукции,
	|Стоимость, СтоимостьБезНДС, СтоимостьРегл, ПостояннаяРазница, ВременнаяРазница,
	|Продукция, ХарактеристикаПродукции, АналитикаУчетаПродукции, КорАналитикаУчетаПартий,
	|РазделУчета, ВидЗапасов, ДокументДвижения, ДокументВыпуска,
	|НастройкаХозяйственнойОперации, ИдентификаторФинЗаписи,
	|АналитикаПартииВыпуска, ПравилоОтнесенияНаВыпуск";
	
	КопируемыеПоля = КопируемыеПоля
		+ ", ПартияПроизводства";
	
	СуммовыеПоля = "
	|Стоимость, СтоимостьБезНДС, ДопРасходы, ДопРасходыБезНДС, СтоимостьРегл,
	|ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ТрудозатратыБезНДС, ПостатейныеСНДС, ПостатейныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеРегл,
	|ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, 
	|ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ДоляСтоимости";
	
	КопируемыеПоля = КопируемыеПоля + ", " + СуммовыеПоля;

	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ИмяРегистра, Истина);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ДокументВыпуска", "
	|ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(ДокументВыпуска) В (" + РасчетСебестоимостиПрикладныеАлгоритмы.ДоступныеТипыДокумента(ИмяРегистра, "ДокументВыпуска") + ") ТОГДА
	|		ДокументВыпуска
	|	ИНАЧЕ
	|		Неопределено
	|КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НаправлениеДеятельности", "КорНаправлениеДеятельности");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ВременнаяРазница", "
	|ВЫБОР
	|	КОГДА ЛОЖЬ ТОГДА 0 // Для удобства расстановки тегов.
	//++ Локализация
	|	КОГДА СтатьяРасходов.КосвенныеЗатратыНУ И СтатьяРасходов.ПринятиеКНалоговомуУчету
	|		ТОГДА СуммаРегл	- ПостояннаяРазница
	//-- Локализация
	|		ИНАЧЕ ВременнаяРазница
	|	КОНЕЦ");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ПостояннаяРазница", "
	|ВЫБОР
	|	КОГДА ЛОЖЬ ТОГДА 0 // Для удобства расстановки тегов.
	//++ Локализация
	|	КОГДА СтатьяРасходов.КосвенныеЗатратыНУ И НЕ СтатьяРасходов.ПринятиеКНалоговомуУчету
	|		ТОГДА СуммаРегл	- ВременнаяРазница
	//-- Локализация
	|		ИНАЧЕ ПостояннаяРазница
	|	КОНЕЦ");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "Стоимость", "СуммаСНДС");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьБезНДС", "СуммаБезНДС");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьРегл", "СуммаРегл");
			
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьУпр", "СуммаУпр");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "ИдентификаторФинЗаписи", "
	|ВЫБОР
	|	КОГДА НЕ ЭтоКорректировка
	|		ТОГДА ИдентификаторФинЗаписи
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|КОНЕЦ");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(ПараметрыРасчета, ТаблицаОписанияПолей, ИмяРегистра,
		"ДвиженияТаблицаКорректировки", ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
КонецПроцедуры

#КонецОбласти
//-- НЕ УТ

#Область ДвиженияПрочиеАктивыПассивы

// Служебная, этап 2.1
Процедура СформироватьДвиженияПрочиеАктивыПассивы(ПараметрыРасчета, ДанныеДвижения, Сумма) Экспорт

	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы.Имя;
	
	КопируемыеПоля = "
	|Период, Организация";
	
	// Добавим движение и заполним его основные свойства
	Запись = ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения
	Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
	Запись.Сумма 	   = Сумма;
	Запись.Статья 	   = ДанныеДвижения.СтатьяАктивовПассивов;
	Запись.Аналитика   = ДанныеДвижения.АналитикаАктивовПассивов;
	Запись.НаправлениеДеятельности = ДанныеДвижения.КорНаправлениеДеятельности;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РаспределениеСтоимости

// Служебная, этап 2.1, 2.2, 3.1, 3.18
Процедура РаспределитьСтоимость(ЗаписьРаспределения, СтрокаОстатка, Выборка, Знач КоличествоКРаспределению) Экспорт
	
	СуммыОстатка 	= ПолучитьСуммовыеПоказателиРаспределения(СтрокаОстатка);
	СуммыКСписанию 	= ПолучитьСуммовыеПоказателиРаспределения();
	
	Если КоличествоКРаспределению >= СтрокаОстатка.Количество Тогда
		
		ЗаполнитьЗначенияСвойств(СуммыКСписанию, СуммыОстатка);
		
		КоличествоКРаспределению = КоличествоКРаспределению - СтрокаОстатка.Количество;
		КоличествоКСписанию	     = СтрокаОстатка.Количество;
		
		//++ НЕ УТ
		//++ Устарело_Производство21
		Если НЕ (ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ВыпускПродукции")
		 И Выборка.ВидДвижения = ВидДвиженияНакопления.Приход) Тогда
			СтрокаОстатка.Количество = 0;
		КонецЕсли;
		//-- Устарело_Производство21
		//-- НЕ УТ

	ИначеЕсли КоличествоКРаспределению < СтрокаОстатка.Количество Тогда
		
		Для Каждого КлючИЗначение Из СуммыОстатка Цикл
			
			СуммыКСписанию[КлючИЗначение.Ключ] =
				Окр((КоличествоКРаспределению * СуммыОстатка[КлючИЗначение.Ключ] / СтрокаОстатка.Количество), 2);
				
			СуммыОстатка[КлючИЗначение.Ключ] = СуммыОстатка[КлючИЗначение.Ключ] - СуммыКСписанию[КлючИЗначение.Ключ];
				
		КонецЦикла;
		
		КоличествоКСписанию		 = КоличествоКРаспределению;
		КоличествоКРаспределению = 0;
		СтрокаОстатка.Количество = СтрокаОстатка.Количество - КоличествоКСписанию;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
	
	Если Выборка.ИсходноеКоличество < 0 Тогда
		
		Для Каждого КлючИЗначение Из СуммыКСписанию Цикл
			
			СуммыКСписанию[КлючИЗначение.Ключ] = -СуммыКСписанию[КлючИЗначение.Ключ];
				
		КонецЦикла;
		
		ЗаписьРаспределения.Количество = -КоличествоКСписанию;
		
	Иначе
		
		СуммыВыборки = ПолучитьСуммовыеПоказателиРаспределения(Выборка);
		
		Для Каждого КлючИЗначение Из СуммыКСписанию Цикл
			
			СуммыКСписанию[КлючИЗначение.Ключ] = СуммыКСписанию[КлючИЗначение.Ключ] - СуммыВыборки[КлючИЗначение.Ключ];
				
		КонецЦикла;
		
		ЗаписьРаспределения.Количество = КоличествоКСписанию;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, СуммыКСписанию);
	ЗаполнитьЗначенияСвойств(СтрокаОстатка, СуммыОстатка);
	
КонецПроцедуры

// Служебная, этап 2.1, 3.1
Процедура ДополнитьСуммыРаспределения(ЗаписьРаспределения, СуммыРаспределения) Экспорт
	
	СуммыЗаписи 	= ПолучитьСуммовыеПоказателиРаспределения(ЗаписьРаспределения);
	СуммыДополнения = ПолучитьСуммовыеПоказателиРаспределения(СуммыРаспределения);
	
	Для Каждого КлючИЗначение Из СуммыЗаписи Цикл
		СуммыЗаписи[КлючИЗначение.Ключ] =
			СуммыЗаписи[КлючИЗначение.Ключ] + СуммыДополнения[КлючИЗначение.Ключ];
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, СуммыЗаписи);
	
КонецПроцедуры

Функция ПолучитьСуммовыеПоказателиРаспределения(ДанныеЗаполнения = Неопределено)
	
	ДанныеСумм = Новый Структура;
	ДанныеСумм.Вставить("Стоимость", 			  	0);
	ДанныеСумм.Вставить("СтоимостьБезНДС", 		  	0);
	ДанныеСумм.Вставить("СтоимостьЗабалансовая", 	0);
	ДанныеСумм.Вставить("ДопРасходы", 	  		  	0);
	ДанныеСумм.Вставить("ДопРасходыБезНДС", 	  	0);
	ДанныеСумм.Вставить("СтоимостьРегл", 		  	0);
	ДанныеСумм.Вставить("ДопРасходыРегл", 		  	0);
	ДанныеСумм.Вставить("СтоимостьЗабалансоваяРегл",0);
	ДанныеСумм.Вставить("НДСРегл", 			    	0);
	ДанныеСумм.Вставить("ПостояннаяРазница", 		0);
	ДанныеСумм.Вставить("ВременнаяРазница", 		0);
	ДанныеСумм.Вставить("СтоимостьУпр", 		  	0);
	ДанныеСумм.Вставить("ДопРасходыУпр",  		  	0);
	ДанныеСумм.Вставить("НДСУпр",	 			    0);
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСумм, ДанныеЗаполнения);
	КонецЕсли;
	
	Возврат ДанныеСумм;
	
КонецФункции

#КонецОбласти

#Область УниверсальныеПроцедурыРаботыСЗапросами

// Устанавливает общие параметры запроса из параметров расчета.
// Следует использовать для идентичности имен и значений параметров во всех запросах.
//
Процедура ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета, ИспользоватьОбщийМенеджерВТ = Истина) Экспорт
	
	// Общие параметры.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(
		Запрос,
		ПараметрыРасчета,
		ИспользоватьОбщийМенеджерВТ);
		
	// Параметр "СредняяЗаМесяц" используется в предыдущей версии расчета СЛУ в функциях формирования узлов корректировки. 
	СредняяЗаМесяц = ?(ПараметрыРасчета.Свойство("МетодОценки"),
		ПараметрыРасчета.МетодОценки = Перечисления.МетодыОценкиСтоимостиТоваров.СредняяЗаМесяц, Ложь);
	
	// Параметры, относящиеся только к расчету себестоимости.
	Запрос.УстановитьПараметр("ПредварительныйРасчет", 	  	   		  	ПараметрыРасчета.ПредварительныйРасчет);
	Запрос.УстановитьПараметр("СредняяЗаМесяц", 						СредняяЗаМесяц);
	
	Запрос.УстановитьПараметр("ЗначениеПогрешностиСебестоимостьРегл", 	ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиСебестоимостьРегл);
	Запрос.УстановитьПараметр("ЗначениеПогрешностиСебестоимостьУпр",  	ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиСебестоимостьУпр);
	Запрос.УстановитьПараметр("ЗначениеПогрешностиРасходыРегл",  	  	ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиРасходыРегл);
	Запрос.УстановитьПараметр("ЗначениеПогрешностиРасходыУпр",  	  	ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиРасходыУпр);
	Запрос.УстановитьПараметр("ЗначениеПогрешностиКоличество", 		  	ПараметрыРасчета.ПогрешностиРешенияСЛУ.ЗначениеПогрешностиКоличество);
	
	Запрос.УстановитьПараметр("ЗащитаОтПереполненияПоля", 	   		  	Pow(10, ПараметрыРасчета.РешениеСЛУ.ЗащитаОтПереполненияПоля) - 1);
	
	// Отборы по хозяйственным операциям.
	Запрос.УстановитьПараметр("МассивОперацийРеализации",				МассивОперацийРеализации());
	Запрос.УстановитьПараметр("МассивОперацийВозвратыПрошлыхПериодов",  МассивОперацийВозвратыПрошлыхПериодов());
	Запрос.УстановитьПараметр("МассивОперацийПередачи",                 МассивОперацийПередачиТоваров());
	Запрос.УстановитьПараметр("МассивОперацийПоступление",              МассивОперацийВнешнееПоступление());
	Запрос.УстановитьПараметр("МассивОперацийПоступлениеВнешнее",       МассивОперацийДляОценкиОстаткаТоваровПоФИФО());
	//++ НЕ УТ
	Запрос.УстановитьПараметр("ВидыРасходовНормируемые",       			Перечисления.ВидыРасходовНУ.НормируемыеРасходы());
	//-- НЕ УТ
	
КонецПроцедуры

#Область ОтборыПоХозяйственнымОперациям

Функция МассивОперацийРеализации()
	
	МассивОпераций = Новый Массив;
	
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКомиссионногоТовара);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.РеализацияВРозницу);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.СторноРеализации);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомиссионера);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациями);;
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ОтчетДавальцу);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДавальцу);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ВыкупТоваровХранителем);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция МассивОперацийПередачиТоваров()

	Массив = Новый Массив;
	
	Массив.Добавить(Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями);
	
	Возврат Массив;
	
КонецФункции

Функция МассивОперацийВозвратыПрошлыхПериодов()

	МассивОпераций = Новый Массив;
	
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы);
	МассивОпераций.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомиссионера);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция МассивОперацийВнешнееПоступление()

	// Формируется список всех хоз. операций, которые являются внешним поступлением (известна их стоимость).
	ХозОперации = Новый Массив;
	
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСНеотфактурованнаяПоставка);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаНеотфактурованнаяПоставка);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОприходованиеТоваров);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОприходованиеПоВозврату);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомитентуОСписании);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет); // сторнирование реализации регл. учета по управленческой организации
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОтПереработчикаФиксированнаяСтоимость);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОтчетДавальцу);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаВПроизводство);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчика);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВводОстатковЗатратПартийПроизводства);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.КорректировкаСтоимостиТМЦОприходованныхПриВыбытииОС);
	
	// Таможенная декларация (старые и новые хоз. операции).
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОформлениеГТДБрокером);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОформлениеГТДСамостоятельно);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ДополнительныеРасходыБезПартии);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ДополнительныеРасходыСПартией);
	
	// Возврат прошлого периода используется только для операций расчета по среднему,
	// т.к. оценивать остатки для ФИФО не корректно.
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.КорректировкаПриобретенияПрошлогоПериода);
	
	// Операции по комиссионным и давальческим товарам.
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПриемНаКомиссию);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОтДавальца);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию);
	
	// Операции по товарам на ответственном хранении.
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВыкупПринятыхНаХранениеТоваров);
	
	// Операции по агентской закупке товаров и услуг.
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПриемкаПодПринципала);
	
	// Пересортица партий.
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПересортицаПартийТоваров);
	
	Возврат ХозОперации;

КонецФункции

Функция МассивОперацийДляОценкиОстаткаТоваровПоФИФО()

	ХозОперации = Новый Массив;
	
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОприходованиеТоваров);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОприходованиеПоВозврату);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОтчетКомитентуОСписании);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет); // сторнирование реализации регл. учета по управленческой организации
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОтПереработчикаФиксированнаяСтоимость);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОтчетДавальцу);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаВПроизводство);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчика);
	
	// Таможенная декларация (старые и новые хоз. операции).
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОформлениеГТДБрокером);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ОформлениеГТДСамостоятельно);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ДополнительныеРасходыБезПартии);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ДополнительныеРасходыСПартией);
	
	// Операции по комиссионным и давальческим товарам.
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПриемНаКомиссию);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОтДавальца);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию);
	
	// Операции по товарам на ответственном хранении.
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи);
	ХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВыкупПринятыхНаХранениеТоваров);
	
	Возврат ХозОперации;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область УниверсальныеПроцедурыРаботыСДвижениями

// Добавляет новую строку в таблицу движений указанного регистра и заполняет служебные поля.
// Сделана экспортной для вызова из модуля универсальных механизмов расчетов.
//
// Возвращаемое значение:
//	СтрокаТаблицыЗначений - добавленная строка в таблицу движений
//
Функция ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ТаблицаПриемник, ДанныеДвижения,
			КопируемыеПоля = Неопределено, СлужебныеПоля = Неопределено) Экспорт
			
	Если ПараметрыРасчета.Движения.Свойство(ТаблицаПриемник) Тогда
		ОписаниеПриемника = ПараметрыРасчета.Движения[ТаблицаПриемник];
	Иначе
		ОписаниеПриемника = ПараметрыРасчета.ВспомогательныеВременныеТаблицы[ТаблицаПриемник];
	КонецЕсли;
	
	// Добавим запись универсальной процедурой, а потом дозаполним поля, относящиеся только к расчету себестоимости
	Запись = РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьЗаписьВТаблицуДвижений(
		ПараметрыРасчета,
		ОписаниеПриемника,
		ДанныеДвижения,
		КопируемыеПоля);
	
	// Заполним поле Регистратор из обязательного свойства ДокументДвижения источника ДанныеДвижения.
	Запись.Регистратор = ДанныеДвижения.ДокументДвижения;
	
	// Заполним пустой регистратор соответствующим документом расчета себестоимости
	Если ОписаниеПриемника.ЭтоОписаниеРегистра
	 И ПараметрыРасчета.Отладка.ИсправлятьПустойРегистратор И НЕ ЗначениеЗаполнено(Запись.Регистратор) Тогда
		
		Если ОписаниеПриемника.ЕстьОрганизация Тогда
			Запись.Регистратор = ПараметрыРасчета.ДокументыРасчетаПоОрганизациям.Получить(ДанныеДвижения.Организация);
		ИначеЕсли ОписаниеПриемника.ЕстьАналитикаПартнеров Тогда
			Запись.Регистратор = ПараметрыРасчета.ДокументыРасчетаПоОрганизациям.Получить(
				ПараметрыРасчета.ОрганизацияПоАналитикеПартнеров.Получить(ДанныеДвижения.АналитикаУчетаПоПартнерам));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись.Регистратор) Тогда
			ТекстОшибки = НСтр("ru = 'Документ %1 установлен регистратором движения регистра %2 вместо %3,
				|который не может иметь движений по данному регистру.';
				|en = 'Document %1 is assigned as recorder for register %2 instead of %3
				|which cannot have records in this register.'", ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				Запись.Регистратор,
				ТаблицаПриемник,
				ДанныеДвижения.ДокументДвижения);
			ЗаписьЖурналаРегистрации(
				РасчетСебестоимостиПрикладныеАлгоритмы.ИмяСобытияОшибкиДляЖурналаРегистрации(ПараметрыРасчета),
				УровеньЖурналаРегистрации.Предупреждение,
				,
				,
				ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
	// Если регистратор не заполнен, то запомним информацию об ошибке
	Если ОписаниеПриемника.ЭтоОписаниеРегистра И НЕ ЗначениеЗаполнено(Запись.Регистратор) Тогда
		
		Если НЕ ЗначениеЗаполнено(ДанныеДвижения.ДокументДвижения) Тогда
			// Ошибка в запросах - не заполнено обязательное поле ДокументДвижения.
			ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнено свойство %1 для движения по регистру ""%2""';
					|en = '%1 property for ""%2"" register record is not filled in'", ОбщегоНазначения.КодОсновногоЯзыка()),
				"ДокументДвижения",
				ТаблицаПриемник);
		Иначе
			// Ошибка в метаданных - документ не является регистратором для данного регистра.
			ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ ""%1"" не может иметь движений по регистру ""%2""';
					|en = 'The ""%1"" document cannot have records in the ""%2"" register'", ОбщегоНазначения.КодОсновногоЯзыка()),
				СокрЛП(ДанныеДвижения.ДокументДвижения),
				ТаблицаПриемник);
		КонецЕсли;
		
		РасчетСебестоимостиПротоколРасчета.ЗафиксироватьОшибкуРасчета(
			ПараметрыРасчета,
			Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаФормированияДвиженийПоРегистрам,
			ТекстДляПротокола);
		
		Если ОписаниеПриемника.ЕстьОрганизация Тогда
			ОрганизацияСПроблемой = ДанныеДвижения.Организация;
		ИначеЕсли ОписаниеПриемника.ЕстьАналитикаПартнеров Тогда
			ОрганизацияСПроблемой = ПараметрыРасчета.ОрганизацияПоАналитикеПартнеров.Получить(ДанныеДвижения.АналитикаУчетаПоПартнерам);
		Иначе
			ОрганизацияСПроблемой = Неопределено;
		КонецЕсли;
			
		РасчетСебестоимостиПрикладныеАлгоритмы.ЗарегистрироватьПроблемуВыполненияРасчета(
			ПараметрыРасчета,
			ОрганизацияСПроблемой,
			НСтр("ru = 'При формировании движений диагностированы ошибки';
				|en = 'Errors were found when generating the movements'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ТекстДляПротокола,
			ДанныеДвижения.ДокументДвижения);
		
		Для Каждого КлючИЗначение Из ПараметрыРасчета.ДокументыРасчетаПоОрганизациям Цикл
			// Заполним регистратор произвольным "первым" документом расчета себестоимости - чтобы движения можно было записать.
			// Расчет все равно в итоге будет завершен с ошибкой, но т.о. можно получить информацию о всех ошибочных регистраторах.
			Запись.Регистратор = КлючИЗначение.Ключ;
			Прервать;
		КонецЦикла;

	КонецЕсли;
	
	Возврат Запись;
	
КонецФункции

Процедура ДополнитьОписаниеПолейДляФормированияДвижений(ПараметрыРасчета, ТаблицаОписанияПолей, ОписаниеПриемника, КопируемыеПоля) Экспорт
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьРегистраторИДокументДвиженияВОписанииПолейЗапроса(ТаблицаОписанияПолей, ОписаниеПриемника.ИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#Область УниверсальныеПроцедурыОписанияДанныхМеханизма

// Возвращает перечень объектов метаданных, на основании данных которых выполняется расчет себестоимости.
// В перечень не включаются объекты, которые являются одновременно и исходящими данными механизмов расчета партий и себестоимости.
//
// Параметры:
//	ВходящиеДанные - Соответствие - уже инициализированное хранилище для описания входящих данных
//	ТолькоТребующиеПерерасчета - Булево - если установлен, то будет возвращен перечень только тех данных,
//		изменение которых влечет за собой необходимость перерасчета партий и себестоимости
//		При изменении этих данных должна создаваться запись в регистре сведений ЗаданияКРасчетуСебестоимости.
//
// Возвращаемое значение:
//	Соответствие - Ключ - ОбъектМетаданных
//
Функция ВходящиеДанныеМеханизма(ВходящиеДанные = Неопределено, ТолькоТребующиеПерерасчета = Ложь) Экспорт
	
	Если ВходящиеДанные = Неопределено Тогда
		ВходящиеДанные = Новый Соответствие;
	КонецЕсли;
	
	Если ТолькоТребующиеПерерасчета Тогда
		Значение = Истина; // чтобы можно было проверить вхождение объекта метаданных в это соответствие
	Иначе
		Значение = Неопределено;
	КонецЕсли;
	
	Если НЕ ТолькоТребующиеПерерасчета Тогда 
		
		ВходящиеДанные.Вставить(Метаданные.Документы.ВнутреннееПотреблениеТоваров, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ВозвратТоваровОтКлиента, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.КорректировкаРеализации, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ОтчетОРозничныхПродажах, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ОтчетПоКомиссииМеждуОрганизациями, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ПередачаТоваровМеждуОрганизациями, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ПеремещениеТоваров, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.ПриобретениеТоваровУслуг, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.РасчетСебестоимостиТоваров, Значение);
		ВходящиеДанные.Вставить(Метаданные.Документы.РеализацияТоваровУслуг, Значение);
		
		ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.АналитикаУчетаНоменклатуры, Значение);
		ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.АналитикаУчетаПоПартнерам, Значение);
		ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.НастройкаРаспределенияПоНаправлениямДеятельности, Значение);
		
		ВходящиеДанные.Вставить(Метаданные.Справочники.КлючиАналитикиУчетаНоменклатуры, Значение);
		ВходящиеДанные.Вставить(Метаданные.Справочники.Назначения, Значение);
		ВходящиеДанные.Вставить(Метаданные.Справочники.СпособыРаспределенияПоНаправлениямДеятельности, Значение);
		
		ВходящиеДанные.Вставить(Метаданные.ПланыВидовХарактеристик.СтатьиРасходов, Значение);
		
	КонецЕсли;

	//++ НЕ УТ
	ВходящиеДанные.Вставить(Метаданные.Документы.РаспределениеПрочихЗатрат, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ВыпускПродукции, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеРасходыНезавершенногоПроизводства, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ТрудозатратыНезавершенногоПроизводства, Значение);
	//-- НЕ УТ
	
	ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.СтоимостьТоваров, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииПрочихРасходов, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеДоходы, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеРасходы, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.СебестоимостьТоваров, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ТоварыОрганизаций, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ТоварыОрганизацийКПередаче, Значение);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.РезервыТоваровОрганизаций, Значение);
	
	РасчетСебестоимостиЛокализация.ВходящиеДанныеМеханизма(ВходящиеДанные, ТолькоТребующиеПерерасчета);
	
	Возврат ВходящиеДанные;
	
КонецФункции

// Возвращает перечень регистров, обслуживаемых механизмом расчета себестоимости.
//
// Возвращаемое значение:
//	Соответствие - Ключ - ОбъектМетаданных
//
Функция ИсходящиеДанныеМеханизма(ИсходящиеДанные = Неопределено) Экспорт
	
	// Перечень метаданных регистров, по которым формируются движения при расчете себестоимости.
	Если ИсходящиеДанные = Неопределено Тогда
		ИсходящиеДанные = Новый Соответствие;
	КонецЕсли;
	
	ИсходящиеДанные.Вставить(Метаданные.РегистрыСведений.СтоимостьТоваров, 							Истина);
	
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж, 			Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.СебестоимостьТоваров, 					Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.Закупки, 								Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы, Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы, 		Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДвиженияНоменклатураНоменклатура, 		Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеДоходы, 							Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеРасходы, 							Истина);
	//++ НЕ УТ
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеРасходыНезавершенногоПроизводства, Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.РезервыПредстоящихРасходов, 				Истина);
	//-- НЕ УТ
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы, 					Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ДвиженияПоПрочимАктивамПассивам, 		Истина);
	ИсходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ФинансовыеРезультаты, 					Истина);
	
	Возврат ИсходящиеДанные;
	
КонецФункции

// Возвращает перечень регистров, рассчитываемых механизмом партионного учета версии 2.2, и используемых при расчете себестоимости.
//
// Возвращаемое значение:
//	Соответствие - имена регистров, рассчитываемых механизмом партионного учета версии 2.2, и используемых при расчете себестоимости.
// 
Функция ИспользуемыеКэшиРегистровПартионногоУчета() Экспорт
	
	// Здесь перечислены регистры, которые (по И)
	// - рассчитываются механизмом партионного учета версии 2.2
	// - не рассчитываются механизмом расчета себестоимости
	// - являются входящими данными для механизма расчета себестоимости (используются кэши данных регистров)
	//
	// В случае, если выполняется отдельный запуск расчета себестоимости (не из партионного учета версии 2.2),
	// эти регистры не будут инициализированы - к их кэшам обращаться нельзя.
	//
	// Для этого делается следующее:
	// - перед началом расчета себестоимости "принудительно" инициализируются эти регистры (для того, чтобы сформировались их расчетные кэши)
	// - перед записью движений эти регистры удаляются из параметров расчета (записывать их не надо - движения по ним не формировались)
	
	ВходящиеДанные = Новый Соответствие;
	//++ НЕ УТ
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ТрудозатратыНезавершенногоПроизводства, Истина);
	//-- НЕ УТ
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.ПартииПрочихРасходов, 			  	  Истина);
	
	РасчетСебестоимостиЛокализация.ИспользуемыеКэшиРегистровПартионногоУчета(ВходящиеДанные);
	
	Возврат ВходящиеДанные;
	
КонецФункции

// Возвращает название данного механизма и его номер версии.
//
// Возвращаемое значение:
//	Строка - версия механизма
//
Функция ТекущаяВерсияМеханизма() Экспорт
	Возврат НСтр("ru = 'Расчет себестоимости, версия 2.2';
				|en = 'Cost calculation, version 2.2'", ОбщегоНазначения.КодОсновногоЯзыка());
КонецФункции

#КонецОбласти

#КонецОбласти
