#Область СлужебныеПроцедурыИФункции

// Метод предназначен для подключения команд рассылки документов.
// Подключение команд осуществляется заполнением таблицы Команды.
// 
// Параметры:
// 	Команды - ТаблицаЗначений - команды рассылки, см. РассылкаДокументов.НоваяТаблицаКомандРассылкиДокументов.
//
Процедура ПриОпределенииКомандРассылкиДокументов(Команды) Экспорт

	ЭлектронныеТрудовыеКнижкиРасширенный.ДобавитьКомандыРассылкиЗаявленияОПредоставленииСведенийОТрудовойДеятельности(Команды);
	Документы.Отпуск.ДобавитьКомандыРассылки(Команды);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КадровыйУчет.ДистанционнаяРабота") Тогда
		МодульДистанционнаяРабота = ОбщегоНазначения.ОбщийМодуль("ДистанционнаяРабота");
		МодульДистанционнаяРабота.ДобавитьКомандыРассылки(Команды);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
