
// Функция проверяет корректность типа Владельца (вида субконто)
// 
// Параметры:
//
// 	ЗначениеВыбора	(Тип: ПВХ.ВидСубконто) - Владельца
Функция ПроверитьВыборВидаСубконто(ЗначениеВыбора) Экспорт
	
	Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда
		
		Если ЗначениеВыбора.ТипЗначения.Типы()[0] <> ТипЗнч(Ссылка) Тогда
			
			#Если Клиент Тогда
				ПоказатьПредупреждение(, "Неправильно задан вид субконто (владелец).
				|
				|В справочник Субконто допускается ввод только значений, имеющих тип Справочник: Субконто"); 
			#КонецЕсли 
			
			Возврат Ложь; 
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Истина; 
	
КонецФункции


// Процедура - обработчик события объекта "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьВыборВидаСубконто(Владелец) Тогда
		Отказ = Истина;
	КонецЕсли;
			
КонецПроцедуры
