
Функция ллл_ПоЗаказуЕстьСозданныеЗаявкиБезПометкиУдаления(Заказ) экспорт
	// +++ 3L, Конилов Д.А. [01.06.2022] Задача ERP1C-90
	// Вспомогательные процедуры и функции
	// --- 3L, Конилов Д.А. [01.06.2022] Задача ERP1C-90

		Запрос=Новый Запрос();
		Запрос.Текст="ВЫБРАТЬ
		|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка КАК Ссылка
		| ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
		|ГДЕ
		|	ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование = &Заказ
		|	И ЗаявкаНаРасходованиеДенежныхСредств.ПометкаУдаления = ЛОЖЬ";
		Запрос.УстановитьПараметр("Заказ",Заказ);
	    Результат=Запрос.Выполнить();
		возврат(не Результат.Пустой());
	
	
КонецФункции
	
