
Процедура ллл_ОчисткаЭкземпляровПроцессовПоОстановленнымЗаявкам() Экспорт
	

УстановитьПривилегированныйРежим(истина);	
Запрос = Новый Запрос;

// Установка значений параметров
Запрос.УстановитьПараметр("Черновик", Перечисления.СостоянияСогласования.Черновик);
Запрос.УстановитьПараметр("Отклонен", Перечисления.СостоянияСогласования.Возвращена);

Запрос.Текст =
"ВЫБРАТЬ
|	ЭкземплярПроцесса.Ссылка КАК Экземпляр,
|	ЭкземплярПроцесса.КлючевойОбъектПроцесса КАК Заявка,
|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК СостояниеОбъекта
|ИЗ
|	Документ.ЭкземплярПроцесса КАК ЭкземплярПроцесса
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних КАК РегистрСостоянийОбъектовСрезПоследних
|		ПО (ЭкземплярПроцесса.КлючевойОбъектПроцесса = РегистрСостоянийОбъектовСрезПоследних.Объект)
|ГДЕ
|	ЭкземплярПроцесса.ПометкаУдаления = ЛОЖЬ
|	И (РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта = &Отклонен
|			ИЛИ РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта = &Черновик)";

Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
Пока Выборка.Следующий() Цикл
	
	ДокЭкземпляр=Выборка.Экземпляр.ПолучитьОбъект();
	ДокЭкземпляр.ПометкаУдаления=истина;
	ДокЭкземпляр.СостояниеВыполнения=Перечисления.СостоянияПроцесса.Остановлен;
	ДокЭкземпляр.Записать();
	
	
	
	
КонецЦикла;
	
	
	
	
	



УстановитьПривилегированныйРежим(ложь); 


КонецПроцедуры



Процедура ллл_ОчисткаЭкземпляровПроцессовПоЗаявке(Заявка) Экспорт
	

УстановитьПривилегированныйРежим(истина);	
Запрос = Новый Запрос;


Запрос.УстановитьПараметр("Заявка", Заявка);


Запрос.Текст =
"ВЫБРАТЬ
|	ЭкземплярПроцесса.Ссылка КАК Экземпляр,
|	ЭкземплярПроцесса.КлючевойОбъектПроцесса КАК Заявка,
|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК СостояниеОбъекта
|ИЗ
|	Документ.ЭкземплярПроцесса КАК ЭкземплярПроцесса
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних КАК РегистрСостоянийОбъектовСрезПоследних
|		ПО ЭкземплярПроцесса.КлючевойОбъектПроцесса = РегистрСостоянийОбъектовСрезПоследних.Объект
|ГДЕ
|	ЭкземплярПроцесса.ПометкаУдаления = ЛОЖЬ
|	И ЭкземплярПроцесса.КлючевойОбъектПроцесса = &Заявка";

Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
Пока Выборка.Следующий() Цикл
	
	ДокЭкземпляр=Выборка.Экземпляр.ПолучитьОбъект();
	ДокЭкземпляр.ПометкаУдаления=истина;
	ДокЭкземпляр.СостояниеВыполнения=Перечисления.СостоянияПроцесса.Остановлен;
	ДокЭкземпляр.Записать();

КонецЦикла;
	
	
	
	
	



УстановитьПривилегированныйРежим(ложь); 


КонецПроцедуры
