
#Область СлужебныйПрограммныйИнтерфейс

// Описание
// 
// Параметры:
// 	ИмяЭлемента - Строка - 
// 	Форма - ФормаКлиентскогоПриложения -  
// 	ДополнительныеПараметры - Неопределено - 
Процедура ПриИзмененииРеквизита(ИмяЭлемента, Форма, ДополнительныеПараметры = Неопределено) Экспорт

	ТребуетсяВызовСервера = Ложь;
	ПродолжитьИзменениеРеквизита = Истина;
	
	//++ Локализация
	
	Элементы = Форма.Элементы;

	Если ИмяЭлемента = Элементы.НачислятьАмортизациюБУФлаг.Имя 
		ИЛИ ИмяЭлемента = Элементы.НачислятьАмортизациюНУФлаг.Имя 
		ИЛИ ИмяЭлемента = Элементы.МетодНачисленияАмортизацииБУФлаг.Имя 
		ИЛИ ИмяЭлемента = Элементы.СрокИспользованияБУ.Имя 
		ИЛИ ИмяЭлемента = Элементы.СрокИспользованияБУФлаг.Имя 
		ИЛИ ИмяЭлемента = Элементы.СрокИспользованияНУ.Имя 
		ИЛИ ИмяЭлемента = Элементы.СрокИспользованияНУФлаг.Имя 
		ИЛИ ИмяЭлемента = Элементы.КоэффициентАмортизацииБУФлаг.Имя 
		ИЛИ ИмяЭлемента = Элементы.ОтражениеАмортизационнойПремииФлаг.Имя 
		ИЛИ ИмяЭлемента = Элементы.СпециальныйКоэффициентНУФлаг.Имя 
		ИЛИ ИмяЭлемента = Элементы.КоэффициентУскоренияБУФлаг.Имя 
		ИЛИ ИмяЭлемента = Элементы.АмортизационнаяГруппаФлаг.Имя 
		ИЛИ ИмяЭлемента = Элементы.НедвижимоеИмуществоФлаг.Имя 
		ИЛИ ИмяЭлемента = Элементы.ГрафикАмортизацииФлаг.Имя Тогда	
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Выполнить_НастроитьЗависимыеЭлементыФормы", ИмяЭлемента);
		
	КонецЕсли; 
	
	//-- Локализация
	
	Если ПродолжитьИзменениеРеквизита Тогда
		
		ОбщегоНазначенияУТКлиент.ПродолжитьИзменениеРеквизита(
			Форма, 
			ИмяЭлемента, 
			ТребуетсяВызовСервера,
			ДополнительныеПараметры);
			
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
