
&НаКлиенте
Процедура Ок(Команда)
	
	Оповестить("ИзмененаПроцедураПередЗаписьюОбъекта",ПроцедураПередЗаписью.ПолучитьТекст());
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьПроцедуру(ПроцедураПередЗаписью,ТаблицаАналитики)
	
	ДанныеОбъекта=ОбщегоНазначенияУХ.РазложитьСтрокуВМассивПодстрок(ТаблицаАналитики,".");
	
	НовыйОбъект=Справочники[ДанныеОбъекта[1]].СоздатьЭлемент();
	
	Попытка
		Выполнить(ПроцедураПередЗаписью);
		Возврат Истина;
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
		
КонецФункции // ПроверитьПроцедуру() 

&НаКлиенте
Процедура Проверить(Команда)
	
	РезультатПроверки=ПроверитьПроцедуру(ПроцедураПередЗаписью.ПолучитьТекст(),Параметры.ТаблицаАналитики);
	
	Если РезультатПроверки=Истина Тогда
		
		ТекстСообщения=Нстр("ru = 'Проверка успешно пройдена.'");
		
	Иначе
		
		ТекстСообщения=СтрШаблон(Нстр("ru = 'Обнаружены ошибки: %1'"), РезультатПроверки);
		
	КонецЕсли;
	
	ПоказатьПредупреждение(,ТекстСообщения);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроцедураПередЗаписью.УстановитьТекст(Параметры.ПроцедураПередЗаписью);
		
КонецПроцедуры
