////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интеграция с 1С:Документооборотом"
// Модуль ИнтеграцияС1СДокументооборотВызовСервераПереопределяемый: сервер, вызов сервера
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Создает правила интеграции для указанного типа объекта ИС.
//
// Параметры:
//   ИмяТипаОбъекта - Строка, ЛюбаяСсылка - полное имя типа объекта ИС, как в метаданных, или ссылка на объект ИС.
//   ПравилаИнтеграции - Массив из Структура:
//     * Ссылка - СправочникСсылка.ПравилаИнтеграцииС1СДокументооборотом
//     * ТипОбъектаИС - Строка
//     * ТипОбъектаДО - Строка
//     * ПредставлениеОбъектаИС - Строка
//     * ПредставлениеОбъектаДО - Строка
//     * ИдентификаторВидаДокумента - Строка
//     * ТипВидаДокумента - Строка
//
// Пример:

//   Если ИмяТипаОбъекта = "Документ.ПоступлениеТоваровУслуг" Тогда
//     // Создаем правила интеграции и добавляем в массив
//     ПравилаИнтеграции = НачатьАвтоматическуюНастройкуИнтеграцииПоступлениеТоваровУслуг();
//   ИначеЕсли ИмяТипаОбъекта = "Документ.ЗаявкаНаРасходованиеДенежныхСредств" Тогда
//     // Создаем правила интеграции и добавляем в массив
//     ПравилаИнтеграции = НачатьАвтоматическуюНастройкуИнтеграцииЗаявкаНаОперацию();
//   КонецЕсли;
//
Процедура ПриСозданииПравилИнтеграцииАвтоматически(Знач ИмяТипаОбъекта, ПравилаИнтеграции) Экспорт
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ИмяТипаОбъекта)) Тогда
		ИмяТипаОбъекта = ИмяТипаОбъекта.Метаданные().ПолноеИмя();
	КонецЕсли;
	
	РеквизитыПапки = ИнтеграцияС1СДокументооборот.СтруктураРеквизитовЗаполняемойПапкиВнутреннихДокументов();
	РеквизитыПапки.Описание = НСтр("ru = 'Создано автоматически из БИД';
									|en = 'Generated automatically from LID'");
	ПапкаВнутреннихДокументов = Неопределено;
	
	РеквизитыВидаДокумента = ИнтеграцияС1СДокументооборот.
		СтруктураРеквизитовЗаполняемогоВидаДокументовДО("DMInternalDocumentType");
	РеквизитыВидаДокумента.АвтоНумерация = Истина;
	ВидДокумента = Неопределено;
	
	Если ИмяТипаОбъекта = "Справочник.СоглашенияСКлиентами" Тогда
		РеквизитыПапки.Имя = НСтр("ru = 'Соглашения об условиях продаж';
									|en = 'Terms of sale'");
		
		РеквизитыВидаДокумента.Имя = НСтр("ru = 'Соглашение об условиях продаж';
											|en = 'Terms of sale'");
		РеквизитыВидаДокумента.ИспользоватьПодписание = Истина;
		РеквизитыВидаДокумента.ВестиУчетПоОрганизациям = Истина;
		РеквизитыВидаДокумента.ВестиУчетСторон = Истина;
		РеквизитыВидаДокумента.УчитыватьСрокДействия = Истина;
		РеквизитыВидаДокумента.УчитыватьСуммуДокумента = Истина;
		
	ИначеЕсли ИмяТипаОбъекта = "Справочник.ДоговорыКонтрагентов" Тогда
		РеквизитыПапки.Имя = НСтр("ru = 'Договоры';
									|en = 'Contracts'");
		
		РеквизитыВидаДокумента.Имя = НСтр("ru = 'Договор с контрагентом';
											|en = 'Contract'");
		РеквизитыВидаДокумента.ИспользоватьПодписание = Истина;
		РеквизитыВидаДокумента.ВестиУчетПоОрганизациям = Истина;
		РеквизитыВидаДокумента.ВестиУчетСторон = Истина;
		РеквизитыВидаДокумента.УчитыватьСрокДействия = Истина;
		РеквизитыВидаДокумента.УчитыватьСуммуДокумента = Истина;
		
	ИначеЕсли ИмяТипаОбъекта = "Документ.КоммерческоеПредложениеКлиенту" Тогда
		РеквизитыПапки.Имя = НСтр("ru = 'Коммерческие предложения клиентам';
									|en = 'Sales quotations for customers'");
		
		РеквизитыВидаДокумента.Имя = НСтр("ru = 'Коммерческое предложение клиенту';
											|en = 'Sales quotation for customer'");
		РеквизитыВидаДокумента.ИспользоватьСрокИсполнения = Истина;
		РеквизитыВидаДокумента.УчитыватьСуммуДокумента = Истина;
		РеквизитыВидаДокумента.ВестиУчетСторон = Истина;
		РеквизитыВидаДокумента.ВестиУчетПоОрганизациям = Истина;
		РеквизитыВидаДокумента.ВестиУчетТоваровИУслуг = Истина;
		РеквизитыВидаДокумента.ИспользоватьУтверждение = Истина;
		
	ИначеЕсли ИмяТипаОбъекта = "Документ.ЗаказКлиента" Тогда
		РеквизитыПапки.Имя = НСтр("ru = 'Заказы клиентов';
									|en = 'Sales orders'");
		
		РеквизитыВидаДокумента.Имя = НСтр("ru = 'Заказ клиента';
											|en = 'Sales order'");
		РеквизитыВидаДокумента.УчитыватьСуммуДокумента = Истина;
		РеквизитыВидаДокумента.ВестиУчетПоКонтрагентам = Истина;
		РеквизитыВидаДокумента.ВестиУчетПоОрганизациям = Истина;
		РеквизитыВидаДокумента.ВестиУчетТоваровИУслуг = Истина;
		РеквизитыВидаДокумента.ИспользоватьУтверждение = Истина;
		
	ИначеЕсли ИмяТипаОбъекта = "Документ.ЗаказПоставщику" Тогда
		РеквизитыПапки.Имя = НСтр("ru = 'Заказы поставщикам';
									|en = 'Purchase Orders'");
		
		РеквизитыВидаДокумента.Имя = НСтр("ru = 'Заказ поставщику';
											|en = 'Purchase order'");
		РеквизитыВидаДокумента.УчитыватьСуммуДокумента = Истина;
		РеквизитыВидаДокумента.ВестиУчетПоКонтрагентам = Истина;
		РеквизитыВидаДокумента.ВестиУчетПоОрганизациям = Истина;
		РеквизитыВидаДокумента.ВестиУчетТоваровИУслуг = Истина;
		РеквизитыВидаДокумента.ИспользоватьУтверждение = Истина;
		
	ИначеЕсли ИмяТипаОбъекта = "Документ.ЗаявкаНаВозвратТоваровОтКлиента" Тогда
		РеквизитыПапки.Имя = НСтр("ru = 'Заявки на возврат товаров от клиентов';
									|en = 'Goods return requests'");
		
		РеквизитыВидаДокумента.Имя = НСтр("ru = 'Заявка на возврат товаров от клиента';
											|en = 'Return request from customer'");
		РеквизитыВидаДокумента.ИспользоватьСрокИсполнения = Истина;
		РеквизитыВидаДокумента.УчитыватьСуммуДокумента = Истина;
		РеквизитыВидаДокумента.ВестиУчетПоКонтрагентам = Истина;
		РеквизитыВидаДокумента.ВестиУчетПоОрганизациям = Истина;
		РеквизитыВидаДокумента.ВестиУчетТоваровИУслуг = Истина;
		РеквизитыВидаДокумента.ИспользоватьУтверждение = Истина;
		
	ИначеЕсли ИмяТипаОбъекта = "Документ.ЗаявкаНаРасходованиеДенежныхСредств" Тогда
		РеквизитыПапки.Имя = НСтр("ru = 'Заявки на расходование ДС';
									|en = 'Payment requests'");
		
		РеквизитыВидаДокумента.Имя = НСтр("ru = 'Заявка на расходование денежных средств';
											|en = 'Payment request'");
		РеквизитыВидаДокумента.ИспользоватьСрокИсполнения = Истина;
		РеквизитыВидаДокумента.УчитыватьСуммуДокумента = Истина;
		РеквизитыВидаДокумента.ВестиУчетПоОрганизациям = Истина;
		РеквизитыВидаДокумента.ВестиУчетСторон = Истина;
		РеквизитыВидаДокумента.ЯвляетсяЗаявкойНаОплату = Истина;
		РеквизитыВидаДокумента.ВестиУчетТоваровИУслуг = Истина;
		РеквизитыВидаДокумента.ИспользоватьУтверждение = Истина;
		РеквизитыВидаДокумента.ВестиУчетПоСтатьямДДС = Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыПапки.Имя) И ЗначениеЗаполнено(РеквизитыВидаДокумента.Имя) Тогда
		ПапкаВнутреннихДокументов = ИнтеграцияС1СДокументооборот.НайтиСоздатьПапкуВнутреннихДокументовВДО(РеквизитыПапки);
		ВидДокумента = ИнтеграцияС1СДокументооборот.НайтиСоздатьВидДокументаВДО(РеквизитыВидаДокумента);
		
		// Создадим правило
		ПравилаИнтеграции.Добавить(
			ИнтеграцияС1СДокументооборотУП.СоздатьПравилоИнтеграции(
				ИмяТипаОбъекта,
				"DMInternalDocument",
				ВидДокумента,
				ПапкаВнутреннихДокументов));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти