//+++ ERP1C-225 Стрепков К. 03.08.2022
&Вместо("СформироватьЗапросТоварыДокументаПродажи2_5")
Процедура ллл_СформироватьЗапросТоварыДокументаПродажи2_5(ТекстЗапроса, ИмяТаблицы)
	
	ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	&ЭтоСоглашение                              КАК ЭтоСоглашение,
		|	ВременнаяТаблицаТовары.НомерСтроки          КАК НомерСтроки,
		|	ВременнаяТаблицаТовары.ЭтоНабор             КАК ЭтоНабор,
		|	ВременнаяТаблицаТовары.ЭтоКомплектующие     КАК ЭтоКомплектующие,
		|	ВременнаяТаблицаТовары.НоменклатураНабора   КАК НоменклатураНабора,
		|	ВременнаяТаблицаТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ВременнаяТаблицаТовары.Номенклатура         КАК Номенклатура,
		|	ВременнаяТаблицаТовары.Характеристика       КАК Характеристика,
		|	ВременнаяТаблицаТовары.Цена                 КАК Цена,
		|	ВЫБОР
		|		КОГДА
		|			(СоглашениеТовары.Номенклатура ЕСТЬ НЕ NULL)
		|		ТОГДА
		|			ВЫРАЗИТЬ(ЕСТЬNULL(СоглашениеТовары.Цена,0)
		|			/ ЕстьNULL(&ТекстЗапросаКоэффициентУпаковки1,1)
		|			* ВЫБОР
		|				КОГДА
		|					ВременнаяТаблицаТовары.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|				ТОГДА
		|					&ТекстЗапросаКоэффициентУпаковки2
		|				ИНАЧЕ
		|					1
		|			КОНЕЦ
		|			* ВЫБОР
		|				КОГДА
		|					СоглашениеШапка.Валюта <> ВременнаяТаблицаДокументПродажи.Валюта
		|				ТОГДА
		|					ВЫБОР
		|						КОГДА ЕСТЬNULL(КурсыВалютыДокументаПродажи.КурсЗнаменатель, 0) > 0
		|							И ЕСТЬNULL(КурсыВалютыДокументаПродажи.КурсЧислитель, 0) > 0
		|							И ЕСТЬNULL(КурсыВалютыСоглашения.КурсЗнаменатель, 0) > 0
		|							И ЕСТЬNULL(КурсыВалютыСоглашения.КурсЧислитель, 0) > 0
		|						ТОГДА
		|							(КурсыВалютыСоглашения.КурсЧислитель * КурсыВалютыДокументаПродажи.КурсЗнаменатель)
		|							/ (КурсыВалютыДокументаПродажи.КурсЧислитель * КурсыВалютыСоглашения.КурсЗнаменатель)
		|						ИНАЧЕ
		|							0
		|					КОНЕЦ
		|				ИНАЧЕ
		|					1
		|			КОНЕЦ КАК ЧИСЛО(31,2))
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ КАК ЦенаСоглашение,
		|
		|	ВЫБОР
		|
		 // ВИД ЦЕНЫ И ЦЕНА В СОГЛАШЕНИИ НЕ ОПРЕДЕЛЕНЫ
		|
		|		КОГДА
		|			СоглашениеШапка.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|			И ИндивидуальныйВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|			И (ВременнаяТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара) 
		|				ИЛИ (НЕ &ВозвратМногооборотнойТары 
		|					И ВременнаяТаблицаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)))
		|		ТОГДА
		|			ИСТИНА
		|
		|
		 // ВИД ЦЕН В ТЧ ДОКУМЕНТА ТОВАРЫ СРАВНИВАЕМ С ВИДОМ ЦЕН В ШАПКЕ СОГЛАШЕНИЯ
		|
		|		КОГДА НЕ (СоглашениеШапка.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|			И ВременнаяТаблицаТовары.ВидЦены = СоглашениеШапка.ВидЦен
		|			ИЛИ СоглашениеШапка.ИндивидуальныйВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|			И ВременнаяТаблицаТовары.ВидЦены = СоглашениеШапка.ИндивидуальныйВидЦены)
		|		ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|	КОНЕЦ КАК ЕстьОшибкиЗаполненияВидЦены,
		|
		|	ВЫБОР
		|
		 // СРОК ПОСТАВКИ НЕ ПРОВЕРЯЕТСЯ
		|		КОГДА
		|			НЕ ВременнаяТаблицаТовары.ПроверятьОшибкиЗаполненияСрокПоставки
		|		ТОГДА
		|			ЛОЖЬ
		|
		 // СРОК ПОСТАВКИ В СОГЛАШЕНИИ НЕ ОПРЕДЕЛЕН
		|
		|		КОГДА
		|			СоглашениеШапка.СрокПоставки = 0
		|			
		|		ТОГДА
		|			ЛОЖЬ
		|
		 // СРОК ПОСТАВКИ В ТЧ ДОКУМЕНТА ТОВАРЫ СРАВНИВАЕМ СО СРОКОМ ПОСТАВКИ В ШАПКЕ СОГЛАШЕНИЯ
		|
		|		КОГДА СоглашениеШапка.СрокПоставки <> 0
		|			И ВременнаяТаблицаТовары.СрокПоставки < СоглашениеШапка.СрокПоставки
		|		ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|	КОНЕЦ КАК ЕстьОшибкиЗаполненияСрокПоставки,
		|	СоглашениеШапка.СрокПоставки КАК СрокПоставкиСоглашение,
		|
		|	ВременнаяТаблицаТовары.ВидЦены КАК ВидЦены,
		|	ВЫБОР
		|		КОГДА СоглашениеТовары.ВидЦены ЕСТЬ NULL
		|		ТОГДА
		|			СоглашениеШапка.ВидЦен
		|		ИНАЧЕ
		|			СоглашениеТовары.ВидЦены 
		|		КОНЕЦ КАК ВидЦеныСоглашение,
		//|	ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС,
		//|		ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка))) КАК СтавкаНДСНоменклатура,
		|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДСНоменклатура,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СоглашениеТовары.Цена,0) = 0
		|			И ВременнаяТаблицаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара) 
		|			И &ВозвратМногооборотнойТары
		|		ТОГДА
		|			ЛОЖЬ
		|		КОГДА (СоглашениеТовары.Номенклатура ЕСТЬ НЕ NULL) И
		|		СоглашениеТовары.Цена > 0 И
		|		ВременнаяТаблицаТовары.Цена <
		|		ВЫРАЗИТЬ(ЕСТЬNULL(СоглашениеТовары.Цена,0)
		|		/ ЕстьNULL(&ТекстЗапросаКоэффициентУпаковки1,1)
		|			* ВЫБОР
		|				КОГДА
		|					ВременнаяТаблицаТовары.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|				ТОГДА
		|					&ТекстЗапросаКоэффициентУпаковки2
		|				ИНАЧЕ
		|					1
		|			КОНЕЦ
		|			* ВЫБОР
		|				КОГДА
		|					СоглашениеШапка.Валюта <> ВременнаяТаблицаДокументПродажи.Валюта
		|				ТОГДА
		|					ВЫБОР
		|						КОГДА ЕСТЬNULL(КурсыВалютыДокументаПродажи.КурсЗнаменатель, 0) > 0
		|							И ЕСТЬNULL(КурсыВалютыДокументаПродажи.КурсЧислитель, 0) > 0
		|							И ЕСТЬNULL(КурсыВалютыСоглашения.КурсЗнаменатель, 0) > 0
		|							И ЕСТЬNULL(КурсыВалютыСоглашения.КурсЧислитель, 0) > 0
		|						ТОГДА 
		|							(КурсыВалютыСоглашения.КурсЧислитель * КурсыВалютыДокументаПродажи.КурсЗнаменатель)
		|							/ (КурсыВалютыДокументаПродажи.КурсЧислитель * КурсыВалютыСоглашения.КурсЗнаменатель)
		|						ИНАЧЕ
		|							0
		|					КОНЕЦ
		|				ИНАЧЕ
		|					1
		|			КОНЕЦ КАК ЧИСЛО(31,2))
		|		ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|	КОНЕЦ КАК ЕстьОшибкиЗаполненияЦена
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ВременнаяТаблицаДокументПродажи КАК ВременнаяТаблицаДокументПродажи
		|ПО
		|	ИСТИНА
		|
		// СОЕДИНЕНИЯ С ТОРГОВЫМ СОГЛАШЕНИЕМ
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|			Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ПО ВидыНоменклатуры.Ссылка = ВременнаяТаблицаТовары.Номенклатура.ВидНоменклатуры
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|			Справочник.СоглашенияСКлиентами КАК СоглашениеШапка
		|		ПО
		|			ВременнаяТаблицаДокументПродажи.Соглашение = СоглашениеШапка.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|			РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(&Дата, (Номенклатура, ХарактеристикаЦО, СерияЦО, УпаковкаЦО) В 
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				Т.Номенклатура,
		|				Т.ХарактеристикаЦО,
		|				Т.СерияЦО,
		|				Т.УпаковкаЦО
		|			ИЗ ВременнаяТаблицаТовары КАК Т)) КАК СоглашениеТовары
		|		ПО
		|			СоглашениеШапка.ИндивидуальныйВидЦены = СоглашениеТовары.ВидЦены
		|			И ВременнаяТаблицаТовары.Номенклатура = СоглашениеТовары.Номенклатура
		|			И ВременнаяТаблицаТовары.ХарактеристикаЦО = СоглашениеТовары.ХарактеристикаЦО
		|			И ВременнаяТаблицаТовары.СерияЦО = СоглашениеТовары.СерияЦО
		|			И ВременнаяТаблицаТовары.УпаковкаЦО = СоглашениеТовары.УпаковкаЦО
		|
		|/////////////////////////////////////////////////////////////////////////////
		// СОЕДИНЕНИЯ СО СТАВКАМИ НДС
		|
		//|		ЛЕВОЕ СОЕДИНЕНИЕ
		//|			РегистрСведений.СтавкиНДСНоменклатуры.СрезПоследних(&Дата, Страна = &СтранаРегистрации) КАК СтавкиНДСНоменклатуры
		//|		ПО
		//|			ВременнаяТаблицаТовары.Номенклатура = СтавкиНДСНоменклатуры.Номенклатура
		|		
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСтавкиНДС.СрезПоследних(&Дата, Страна = &СтранаРегистрации) КАК ОсновныеСтавкиНДС
		//|		ПО
		//|			Истина
		|
		|/////////////////////////////////////////////////////////////////////////////
		// СОЕДИНЕНИЯ С КУРСАМИ ВАЛЮТ
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|			ВременнаяТаблицаКурсыВалют КАК КурсыВалютыДокументаПродажи
		|		ПО
		|			ВременнаяТаблицаДокументПродажи.Валюта = КурсыВалютыДокументаПродажи.Валюта
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|			ВременнаяТаблицаКурсыВалют КАК КурсыВалютыСоглашения
		|		ПО
		|			СоглашениеШапка.Валюта = КурсыВалютыСоглашения.Валюта
		|" + ?(ИмяТаблицы = "Документ.РеализацияТоваровУслуг"
				ИЛИ ИмяТаблицы = "Документ.ПередачаТоваровХранителю","
		|ГДЕ
		|	ВременнаяТаблицаТовары.КодСтроки = 0", "") + "
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки ВОЗР
		|;
		|";
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки1",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"СоглашениеТовары.Упаковка",
		"СоглашениеТовары.Номенклатура"));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки2",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ВременнаяТаблицаТовары.Упаковка",
		"ВременнаяТаблицаТовары.Номенклатура"));

	
КонецПроцедуры
//--- ERP1C-225 Стрепков К. 03.08.2022