
&НаКлиенте
Процедура ПеренестиВТома(Команда)
	
	ОткрытьФорму("Обработка.ПереносФайловВТомаУХ.Форма",Новый Структура("ХранимыйФайл",Объект.Ссылка));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И Константы.ХранитьФайлыВТомахНаДиске.Получить()
		И РаботаСФайлами.ЕстьТомаХраненияФайлов()
		И ХранимыеФайлыУХ.ЧислоВерсийВБазе(Объект.Ссылка)>0 Тогда
		
		Элементы.ПеренестиВТома.Видимость=Истина;
		
	Иначе
		
		Элементы.ПеренестиВТома.Видимость=Ложь;
		
	КонецЕсли;	
				
КонецПроцедуры
