Процедура ОбработатьАгентовИЗаводы()  экспорт
	Контрагенты=ПрочитаноИРаспознано.Выгрузить(,"Контрагент");	
	Контрагенты.Свернуть("Контрагент");
	Агентытз=ПрочитаноИРаспознано.Выгрузить(,"Агент");
	Агентытз.Свернуть("Агент");
	
	
	для каждого стр из КОнтрагенты цикл
		если ЗначениеЗаполнено(стр.Контрагент) тогда
			стр2=ЗаводыИзготовители.Добавить();
			стр2.КонтрагентExcel=стр.Контрагент;
		конецЕсли;
		
	КонецЦикла;	
		
	
	для каждого стр из Агентытз цикл
		если ЗначениеЗаполнено(стр.Агент) тогда
			стр2=Агенты.Добавить();
			стр2.АгентExcel=стр.Агент;
		конецЕсли;
		
	КонецЦикла;	
	
		
	
	
	
КонецПроцедуры


Процедура РаспознатьИнвойсыМодуль() экспорт
	для каждого стр из ЭтотОбъект.ПрочитаноИРаспознано цикл
		
		если ЗначениеЗаполнено(стр.ИнвойсРазделено) тогда
			Если не Значениезаполнено(стр.Агент) тогда
				стр.ИнвойсРаспознано=ллл_ПоискЗначений.НайтиПредзаказ(стр.ИнвойсРазделено,,ВернутьКонтрагентЗаводПоСтрокеExcelМодуль(стр.Контрагент));			
				
			иначе	
			    стр.ИнвойсРаспознано=ллл_ПоискЗначений.НайтиПредзаказ(стр.ИнвойсРазделено);
				
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;
	
	
	
КонецПроцедуры	



 Функция ВернутьКонтрагентЗаводПоСтрокеExcelМодуль(КонтрагентExcel)
	для каждого стр из ЭтотОбъект.ЗаводыИзготовители цикл
		если стр.КонтрагентExcel=КонтрагентExcel тогда
			возврат(стр.КонтрагентСопоставлено);	
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	возврат(Справочники.Контрагенты.ПустаяСсылка());
	
конецФункции


 Функция ВернутьАгентПоСтрокеExcelМодуль(АгентExcel)
	для каждого стр из ЭтотОбъект.Агенты цикл
		если стр.АгентExcel=АгентExcel тогда
			возврат(стр.АгентСопоставлено);	
		КонецЕсли;	
	КонецЦикла;	
	возврат(Справочники.Контрагенты.ПустаяСсылка());
конецФункции


Процедура РаспределитьСуммыМультинвойсныхПлатежейМодуль()   экспорт
	
	тз=ЭтотОбъект.ПрочитаноИРаспознано.Выгрузить(,"НомерСтрокиExcel,ИнвойсРаспознано,СуммаВUSD,СуммаВАльтернативнойВалюте,Валюта");
	Запрос=Новый Запрос();
	Запрос.Текст="ВЫБРАТЬ
	             |	тз.НомерСтрокиExcel КАК НомерСтрокиExcel,
	             |	тз.ИнвойсРаспознано КАК ИнвойсРаспознано,
	             |	тз.СуммаВUSD КАК СуммаВUSD,
	             |	тз.СуммаВАльтернативнойВалюте КАК СуммаВАльтернативнойВалюте
	             |ПОМЕСТИТЬ ВТ_ТЗ
	             |ИЗ
	             |	&тз КАК тз
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ_ТЗ.НомерСтрокиExcel КАК НомерСтрокиExcel,
	             |	КОЛИЧЕСТВО(ВТ_ТЗ.ИнвойсРаспознано) КАК КоличествоИнвойсов,
	             |	СУММА(ВТ_ТЗ.СуммаВUSD) КАК ОбщаяСуммаВUSD,
	             |	СУММА(ВТ_ТЗ.СуммаВАльтернативнойВалюте) КАК ОбщаяСуммаВАльтернативнойВалюте
	             |ПОМЕСТИТЬ СтрокиМультиИнвойсами
	             |ИЗ
	             |	ВТ_ТЗ КАК ВТ_ТЗ
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ВТ_ТЗ.НомерСтрокиExcel
	             |
	             |ИМЕЮЩИЕ
	             |	КОЛИЧЕСТВО(ВТ_ТЗ.ИнвойсРаспознано) > 1
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	СУММА(ллл_ПредварительныйЗаказЗаводуИзготовителюТовары.Сумма) КАК СуммаПредзаказа,
	             |	ллл_ПредварительныйЗаказЗаводуИзготовителюТовары.Ссылка КАК Предзаказ
	             |ПОМЕСТИТЬ ВТ_СуммыПредзаказов
	             |ИЗ
	             |	Документ.ллл_ПредварительныйЗаказЗаводуИзготовителю.Товары КАК ллл_ПредварительныйЗаказЗаводуИзготовителюТовары
	             |ГДЕ
	             |	ллл_ПредварительныйЗаказЗаводуИзготовителюТовары.Ссылка В
	             |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |				З.ИнвойсРаспознано
	             |			ИЗ
	             |				ВТ_ТЗ КАК З)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ллл_ПредварительныйЗаказЗаводуИзготовителюТовары.Ссылка
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ_ТЗ.НомерСтрокиExcel КАК НомерСтрокиExcel,
	             |	СУММА(ВТ_СуммыПредзаказов.СуммаПредзаказа) КАК СуммаПредзаказа
	             |ПОМЕСТИТЬ ВТ_СуммыПредзаказовПоСтрокеExcel
	             |ИЗ
	             |	ВТ_ТЗ КАК ВТ_ТЗ
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммыПредзаказов КАК ВТ_СуммыПредзаказов
	             |		ПО ВТ_ТЗ.ИнвойсРаспознано = ВТ_СуммыПредзаказов.Предзаказ
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ВТ_ТЗ.НомерСтрокиExcel
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	СтрокиМультиИнвойсами.НомерСтрокиExcel КАК НомерСтрокиExcel,
	             |	СтрокиМультиИнвойсами.КоличествоИнвойсов КАК КоличествоИнвойсов,
	             |	СтрокиМультиИнвойсами.ОбщаяСуммаВUSD КАК ОбщаяСуммаВUSD,
	             |	СтрокиМультиИнвойсами.ОбщаяСуммаВАльтернативнойВалюте КАК ОбщаяСуммаВАльтернативнойВалюте,
	             |	ЕСТЬNULL(ВТ_СуммыПредзаказовПоСтрокеExcel.СуммаПредзаказа, 0) КАК ОбщаяСуммаПредзаказов
	             |ПОМЕСТИТЬ ВТ_ИтоговыеПоказателиПоСтрокамExcel
	             |ИЗ
	             |	СтрокиМультиИнвойсами КАК СтрокиМультиИнвойсами
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммыПредзаказовПоСтрокеExcel КАК ВТ_СуммыПредзаказовПоСтрокеExcel
	             |		ПО СтрокиМультиИнвойсами.НомерСтрокиExcel = ВТ_СуммыПредзаказовПоСтрокеExcel.НомерСтрокиExcel
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ_ИтоговыеПоказателиПоСтрокамExcel.НомерСтрокиExcel КАК НомерСтрокиExcel,
	             |	ВТ_ИтоговыеПоказателиПоСтрокамExcel.КоличествоИнвойсов КАК КоличествоИнвойсов,
	             |	ВТ_ИтоговыеПоказателиПоСтрокамExcel.ОбщаяСуммаВUSD КАК ОбщаяСуммаВUSD,
	             |	ВТ_ИтоговыеПоказателиПоСтрокамExcel.ОбщаяСуммаВАльтернативнойВалюте КАК ОбщаяСуммаВАльтернативнойВалюте,
	             |	ВТ_ИтоговыеПоказателиПоСтрокамExcel.ОбщаяСуммаПредзаказов КАК ОбщаяСуммаПредзаказов,
	             |	ВТ_ТЗ.ИнвойсРаспознано КАК Предзаказ,
	             |	ЕСТЬNULL(ВТ_СуммыПредзаказов.СуммаПредзаказа, 0) КАК СуммаПредзаказа
	             |ПОМЕСТИТЬ ВТ_ПочтиГотово
	             |ИЗ
	             |	ВТ_ИтоговыеПоказателиПоСтрокамExcel КАК ВТ_ИтоговыеПоказателиПоСтрокамExcel
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТЗ КАК ВТ_ТЗ
	             |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммыПредзаказов КАК ВТ_СуммыПредзаказов
	             |			ПО ВТ_ТЗ.ИнвойсРаспознано = ВТ_СуммыПредзаказов.Предзаказ
	             |		ПО ВТ_ИтоговыеПоказателиПоСтрокамExcel.НомерСтрокиExcel = ВТ_ТЗ.НомерСтрокиExcel
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ_ПочтиГотово.НомерСтрокиExcel КАК НомерСтрокиExcel,
	             |	ВТ_ПочтиГотово.КоличествоИнвойсов КАК КоличествоИнвойсов,
	             |	ВТ_ПочтиГотово.ОбщаяСуммаВUSD КАК ОбщаяСуммаВUSD,
	             |	ВТ_ПочтиГотово.ОбщаяСуммаВАльтернативнойВалюте КАК ОбщаяСуммаВАльтернативнойВалюте,
	             |	ВТ_ПочтиГотово.ОбщаяСуммаПредзаказов КАК ОбщаяСуммаПредзаказов,
	             |	ВТ_ПочтиГотово.Предзаказ КАК Предзаказ,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(ВТ_ПочтиГотово.ОбщаяСуммаПредзаказов, 0) = 0
	             |			ТОГДА 0
	             |		ИНАЧЕ ВТ_ПочтиГотово.СуммаПредзаказа * ВТ_ПочтиГотово.ОбщаяСуммаВUSD / ВТ_ПочтиГотово.ОбщаяСуммаПредзаказов
	             |	КОНЕЦ КАК РаспределитьUSD,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(ВТ_ПочтиГотово.ОбщаяСуммаПредзаказов, 0) = 0
	             |			ТОГДА 0
	             |		ИНАЧЕ ВТ_ПочтиГотово.СуммаПредзаказа * ВТ_ПочтиГотово.ОбщаяСуммаВАльтернативнойВалюте / ВТ_ПочтиГотово.ОбщаяСуммаПредзаказов
	             |	КОНЕЦ КАК РаспределитьАльтВалюта
	             |ИЗ
	             |	ВТ_ПочтиГотово КАК ВТ_ПочтиГотово
	             |ИТОГИ ПО
	             |	НомерСтрокиExcel" ;
	
	
	Запрос.УстановитьПараметр("тз",тз);
	Результат=Запрос.Выполнить();
	
	
	
		ВЫборка=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		пока Выборка.Следующий() цикл 
			НомерСтроки=Выборка.НомерСтрокиExcel;
			Выборка2=Выборка.Выбрать();
			пока Выборка2.Следующий() цикл
				СтруктураОтбора=Новый Структура("НомерСтрокиExcel,ИнвойсРаспознано",НомерСтроки,Выборка2.Предзаказ);
				ОтобранныеСтроки=ЭтотОбъект.ПрочитаноИРаспознано.НайтиСтроки(СтруктураОтбора);
				Если ОтобранныеСтроки.КОличество()>0 тогда
					
					ОтобранныеСтроки[0].РаспределеннаяСуммаUSD=Выборка2.РаспределитьUSD;
					ОтобранныеСтроки[0].РаспределеннаяСуммаВАльтернативнойВалюте=Выборка2.РаспределитьАльтВалюта;
				
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;	
	
	

	
КонецПроцедуры	


Процедура ИтоговаяПроверкаМодуль() экспорт
	для каждого стр из ПрочитаноИРаспознано цикл   
		стр.ИтоговаяПроверка=истина;
		если не ЗначениеЗаполнено(стр.Валюта) тогда
			стр.ИтоговаяПроверка=ложь;
			стр.Комментарий="Не указана валюта платежа";
			продолжить;
		КонецЕсли;	

				
		Если не ЗначениеЗаполнено(ВернутьКонтрагентЗаводПоСтрокеExcelМодуль(стр.Контрагент)) тогда
			
			стр.ИтоговаяПроверка=ложь;
			стр.Комментарий="Не сопоставлен контрагент завод-изготовитель.";
			продолжить; 
			
		иначе
			для каждого стр2 из ЭтотОбъект.ЗаводыИзготовители цикл
				если стр2.КонтрагентExcel=стр.Контрагент тогда
					Если стр2.ПроверкаПройдена=ложь тогда
						стр.ИтоговаяПроверка=ложь;
						стр.Комментарий=стр2.РезультатПроверки;
						
					КонецЕсли;	
					прервать;
				КонецЕсли;	
				
				
			КонецЦикла;
			

						
		КонецеСЛИ;			
			
			
			
		Если не ЗначениеЗаполнено(стр.ИнвойсРаспознано) тогда
			стр.ИтоговаяПроверка=ложь;
			стр.Комментарий="Не найден инвойс"; 
			продолжить;
		КонецЕсли;
	
		
		Если значениеЗаполнено(стр.Агент) тогда
		
		_Агент=ВернутьАгентПоСтрокеExcelМодуль(стр.Агент);
		
				Если не ЗначениеЗаполнено(_Агент) тогда
					стр.ИтоговаяПроверка=ложь;
					стр.Комментарий="Не сопоставлен агент"; 
					продолжить;				              
				иначе
					
					для каждого стр2 из ЭтотОбъект.Агенты цикл
						если стр2.АгентExcel=стр.Агент тогда
							если стр2.ПроверкаПройдена=ложь тогда
								стр.ИтоговаяПроверка=ложь;
								стр.Комментарий=стр2.РезультатПроверки;
								продолжить;
								
							КонецЕсли;
							прервать;
							
						КонецЕсли;
					КонецЦикла;
						
				КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры
                            

Процедура СоздатьЗаказыМодуль() экспорт
	для каждого стр из ЭтотОбъект.ПрочитаноИРаспознано цикл
		Если стр.ИтоговаяПроверка и значениеЗаполнено(стр.ИнвойсРаспознано) тогда 
			
			Предзаказ=стр.ИнвойсРаспознано;
			КодРС=Предзаказ.ллл_КодРС;
			
			ПредзаказОбъект=Предзаказ.ПолучитьОбъект();
			ПредзаказОбъект.Комментарий=стр.КомментарийExcel;
			Если значениеЗаполнено(стр.Агент) тогда
				для каждого стрТовары из ПредзаказОбъект.Товары цикл	
					стрТовары.СуммаАгентуПоОплате=стрТовары.Сумма;	
				КонецЦикла;	
				
			КонецЕсли;
			
			ПредзаказОбъект.ОбменДанными.Загрузка=истина;
			ПредзаказОбъект.Записать();
			
			ЗаписатьДанныеОКазначейскихРеквизитах(кодРС,ВернутьАгентПоСтрокеExcelМодуль(стр.Агент),
			ВернутьКонтрагентЗаводПоСтрокеExcelМодуль(стр.Контрагент),Предзаказ.Товары.Итог("Сумма"),Предзаказ.ллл_НомерВерсии);
			
			//Если ЗначениеЗаполнено(стр.Агент) тогда
			//	//стр.Заказ=СоздатьЗаказНаАгента(стр);
			//	
			//иначе	
			//	//стр.Заказ=СоздатьЗаказБезАгента(стр);
			//
			//КонецЕсли;
			
			ЗаписатьДанныеОДенежныхСредствах(КодРС,стр.ДатаПолученияПоставщиком);
			
			заказ=ллл_ПоискЗначений.НайтиЗаказПоставщикуПоКодуРС(КодРС);
			
			Если ЗначениеЗаполнено(заказ) тогда	
				УжеОбработанЗаказ=ложь;
				для Счетчик=0 по ЭтотОбъект.ПрочитаноИРаспознано.Индекс(стр)-1 цикл
					стр2=ЭтотОбъект.ПрочитаноИРаспознано[Счетчик];
					если стр2.ИнвойсРаспознано=стр.ИнвойсРаспознано тогда
						УжеОбработанЗаказ=истина;
						прервать;
					КонецЕсли;	
				КонецЦикла;	
				
				
				Если УжеОбработанЗаказ=истина тогда
					стр.Заказ=заказ;
				иначе	
					ллл_МодульКазначействоОбщегоНазначения.ЗаполнитьНаОснованииПредЗаказа(Предзаказ,заказ,ложь);	
					стр.Заказ=заказ; 
					
					ЗаказОбъект=стр.Заказ.ПолучитьОбъект();
					ЗаказОбъект.Комментарий="Создано автоматически "+строка(стр.НомерСтрокиExcel);
					ЗаказОбъект.ОбменДанными.Загрузка=истина;
					ЗаказОбъект.Записать();

					
				КонецЕсли;	
				
					
			иначе
				Заказ=Документы.ЗаказПоставщику.СоздатьДокумент();
				ллл_МодульКазначействоОбщегоНазначения.ЗаполнитьНаОснованииПредЗаказа(Предзаказ,заказ,ложь);	
				стр.Заказ=Заказ.Ссылка;
				
				ЗаказОбъект=стр.Заказ.ПолучитьОбъект();
				ЗаказОбъект.Комментарий="Создано автоматически "+строка(стр.НомерСтрокиExcel);
				ЗаказОбъект.ОбменДанными.Загрузка=истина;
				ЗаказОбъект.Записать();
				
			КонецЕсли;	
			
			
			
			
		КонецЕсли;
	КонецЦикла;	

	
КонецПроцедуры 	


Процедура СоздатьСписанияМодуль() экспорт
	для каждого стр из ЭтотОбъект.ПрочитаноИРаспознано цикл
		Если стр.ИтоговаяПроверка и значениеЗаполнено(стр.Заказ) тогда 
			
			стр.списание1=СоздатьДокСписанияНАТП(стр.заказ,стр.ДатаОтправкиНАТП,стр.НомерСтрокиExcel,?(значениеЗаполнено(стр.РаспределеннаяСуммаUSD),стр.РаспределеннаяСуммаUSD,стр.СуммаВUSD),
				?(ЗначениеЗаполнено(стр.РаспределеннаяСуммаВАльтернативнойВалюте),стр.РаспределеннаяСуммаВАльтернативнойВалюте,стр.СуммаВАльтернативнойВалюте),
				стр.Валюта);
			если значениеЗаполнено(стр.Агент) тогда
				
				стр.списание2=СоздатьДокСписанияАгент(стр.ИнвойсРаспознано,
				ВернутьАгентПоСтрокеExcelМодуль(стр.Агент),
				ВернутьКонтрагентЗаводПоСтрокеExcelМодуль(стр.Контрагент),
				стр.ДатаПолученияПоставщиком,стр.НомерСтрокиExcel,?(значениеЗаполнено(стр.РаспределеннаяСуммаUSD),стр.РаспределеннаяСуммаUSD,стр.СуммаВUSD),
				?(ЗначениеЗаполнено(стр.РаспределеннаяСуммаВАльтернативнойВалюте),стр.РаспределеннаяСуммаВАльтернативнойВалюте,стр.СуммаВАльтернативнойВалюте),
				стр.Валюта);
			КонецЕсли;	
		
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры




Процедура ЗаписатьДанныеОКазначейскихРеквизитах(кодРС,Агент,Контрагент,СуммаЗаказа,НомерВерсии)
	мен=РегистрыСведений.ллл_РеквизитыКазначействаДляПредварительныхЗаказов.СоздатьМенеджерЗаписи();
	мен.КодРС=КодРС;
	мен.Прочитать();
	мен.ОбработаноРуководителемКазначейства=истина;
	мен.КодРС=КодРС;
	
	Если значениеЗаполнено(Агент) тогда
		мен.АгентПоОплате=Агент;
		мен.ДоговорАгентаПоОплате=ллл_ПоискЗначений.НайтиДоговор(Справочники.Организации.НайтиПоКоду("000000001"),
		Агент,Справочники.Валюты.НайтиПоНаименованию("USD"));
		мен.КроссДоговор=ллл_ПоискЗначений.НайтиДоговор(ллл_ПоискЗначений.НайтиОрганизациюПоИННиКПП(Агент.Инн,Агент.КПП),Контрагент,
		Справочники.Валюты.НайтиПоНаименованию("USD"));
		мен.СуммаАгентуПоОплате=СуммаЗаказа;
	КонецЕсли;	                            
	мен.ОбрабатывалсяНомерВерсии=НомерВерсии;
	мен.ДатаИзменения=ТекущаяДата();
	мен.Записать();	
	
	
	
КонецПроцедуры

Процедура ЗаписатьДанныеОДенежныхСредствах(КодРС,ДатаПолученияДС)
	 мен=РегистрыСведений.ллл_РеквизитыОтделаЗакупокДляПредварительныхЗаказов.СоздатьМенеджерЗаписи();
	 мен.КодРС=КодРС;
	 мен.Прочитать();
	 мен.КодРС=КодРС;
	 мен.ЗаводИзготовительПолучилДенежныеСредства=истина;
	 мен.ДатаПолученияДенежныхСредствЗаводомИзготовителем=ДатаПолученияДС;
	 мен.Записать();	 
КонецПРоцедуры	








Функция СоздатьДокСписанияНАТП(заказ,ДатаОплаты,СтрокаExcel,СуммаUSD,суммаАльтВалюта,альтВалюта)
	ДокСписание=Документы.СписаниеБезналичныхДенежныхСредств.СоздатьДокумент(); 
	ДокСписание.Видплатежа="электронно";
	ДокСписание.ТипПлатежногоДокумента=Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение;
	ДокСписание.Заполнить(заказ);
	ДокСписание.СтатьяДвиженияДенежныхСредств=Справочники.СтатьиДвиженияденежныхСредств.НайтипоНаименованию("21.01_Приобретение импортного товара");
	//ЗаполнитьЗначенияСвойств(ДокСписание,заказ.Ссылка,,"Дата,Номер");
	//ДокСписание.Организация=
	
	стрДокСписание=ДокСписание.РасшифровкаПлатежа[0];
	
	ВалютаUSD=Справочники.Валюты.НайтиПоНаименованию("USD");
	
	Если не ЗначениеЗаполнено(СуммаальтВалюта) тогда
		
		ДокСписание.БанковскийСчетКонтрагента=ллл_ПоискЗначений.НайтиБанковскийСчетКонтрагента(ДокСписание.Контрагент,ВалютаUSD);
		ДокСписание.БанковскийСчет=ллл_ПоискЗначений.НайтиБанковскийСчетОрганизации(ДокСписание.Организация,ВалютаUSD);
		стрДокСписание.ВалютаВзаиморасчетов=ВалютаUSD;
		//стрДокСписание.Валюта=ВалютаUSD;
		ДокСписание.Валюта=ВалютаUSD;
		ДокСписание.СуммаДокумента=СуммаUSD;
		стрДокСписание.СуммаВзаиморасчетов=СуммаUSD;
		стрДокСписание.Сумма=СуммаUSD;
		стрДокСписание.КурсЧислительВзаиморасчетов=1;
		стрДокСписание.КурсЗнаменательВзаиморасчетов=1; 
		
	иначе
		
		ДокСписание.БанковскийСчет=ллл_ПоискЗначений.НайтиБанковскийСчетОрганизации(ДокСписание.Организация,альтВалюта);	
		ДокСписание.БанковскийСчетКонтрагента=ллл_ПоискЗначений.НайтиБанковскийСчетКонтрагента(ДокСписание.Контрагент,альтВалюта);	
		
		стрДокСписание.ВалютаВзаиморасчетов=ВалютаUSD;
		//стрДокСписание.Валюта=альтВалюта;
		ДокСписание.Валюта=альтВалюта;
		ДокСписание.СуммаДокумента=СуммаальтВалюта;
		стрДокСписание.СуммаВзаиморасчетов=СуммаUSD;
		стрДокСписание.Сумма=СуммаальтВалюта;
		_КурсЗа1000долларов=СуммаUSD/суммаАльтВалюта*1000;		
				
		стрДокСписание.КурсЧислительВзаиморасчетов=_КурсЗа1000долларов;
		стрДокСписание.КурсЗнаменательВзаиморасчетов=1000;

		
		
		
	КонецЕсли;	
		
	стрДокСписание.ЭлементСтруктурыЗадолженности=Перечисления.ЭлементыСтруктурыЗадолженности.ОсновнойДолг;		
	
	
	
	
		
	
	
	
	//стрДокСписание.ЗаявкаНаРасходованиеДенежныхСредств=Заявка.Ссылка;
	стрДокСписание.ЦФО=ДокСписание.Организация;  
	стрДокСписание.СтатьяДвиженияДенежныхСредств  =ДокСписание.СтатьяДвиженияДенежныхСредств; 
	Если ЗначениеЗаполнено(ДатаОплаты) тогда
		ДокСписание.Дата=ДатаОплаты; 	
	иначе
		ДокСписание.Дата=ТекущаяДата(); 	
	КонецЕсли;
	
	
	ДокСписание.ОплатапоЗаявкам=ложь;  
	доксПИСАНИЕ.ОчередностьПлатежа=1;
	ДокСписание.УстановитьНовыйНомер(ДокСписание.Организация.Префикс);
	ДокСписание.ДокументОснование=заказ.Ссылка; 
	//ДокСписание.ЗаявкаНаРасходованиеДенежныхСредств=Заявка.Ссылка;
	ДокСПисание.Проведенобанком=истина;
	ДокСписание.ДатаПроведенияБанком=Датаоплаты;           
	ДокСписание.Комментарий="Создано автоматически "+строка(СтрокаExcel);
	
		
	
	

	
	
	ДокСписание.Записать(РежимЗаписиДокумента.Запись);
	
	

	
	попытка

		ДокСписание.Записать(РежимЗаписиДокумента.Проведение);
		
	
	исключение
	
	
	
	КонецПопытки;
	
	возврат(докСписание.Ссылка);
	
	конецФункции

	


Функция СоздатьДокСписанияАгент(Предзаказ,Агент,Контрагент,ДатаОплаты,СтрокаExcel,СуммаUSD,суммаАльтВалюта,альтВалюта)
	ДокСписание=Документы.СписаниеБезналичныхДенежныхСредств.СоздатьДокумент(); 
	ЗаполнитьЗначенияСвойств(ДокСписание,Предзаказ,,"Дата,Номер");
	ДокСписание.Видплатежа="электронно";
	ДокСписание.ТипПлатежногоДокумента=Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение;
	//ДокСписание.Заполнить(заказ);  
	
	ДокСписание.СтатьяДвиженияДенежныхСредств=Справочники.СтатьиДвиженияденежныхСредств.НайтипоНаименованию("21.01_Приобретение импортного товара");
	ДокСписание.организация=ллл_ПоискЗначений.НайтиОрганизациюПоИННиКПП(Агент.ИНН,Агент.КПП);
	ДокСПисание.Контрагент=Контрагент;
	ДокСписание.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ОплатаПоставщику;
	стрДокСписание=ДокСписание.РасшифровкаПлатежа.Добавить();
	стрДокСписание.Партнер=Предзаказ.Партнер;
	
	ВалютаUSD=Справочники.Валюты.НайтиПоНаименованию("USD");
	
	Если не ЗначениеЗаполнено(СуммаальтВалюта) тогда
		
		ДокСписание.БанковскийСчетКонтрагента=ллл_ПоискЗначений.НайтиБанковскийСчетКонтрагента(ДокСписание.Контрагент,ВалютаUSD);
		ДокСписание.БанковскийСчет=ллл_ПоискЗначений.НайтиБанковскийСчетОрганизации(ДокСписание.Организация,ВалютаUSD);
		стрДокСписание.ВалютаВзаиморасчетов=ВалютаUSD;
		
		ДокСписание.Валюта=ВалютаUSD;
		ДокСписание.СуммаДокумента=СуммаUSD;
		стрДокСписание.СуммаВзаиморасчетов=СуммаUSD;
		стрДокСписание.Сумма=СуммаUSD;
		стрДокСписание.КурсЧислительВзаиморасчетов=1;
		стрДокСписание.КурсЗнаменательВзаиморасчетов=1;
	иначе
		
		ДокСписание.БанковскийСчет=ллл_ПоискЗначений.НайтиБанковскийСчетОрганизации(ДокСписание.Организация,альтВалюта);	
		ДокСписание.БанковскийСчетКонтрагента=ллл_ПоискЗначений.НайтиБанковскийСчетКонтрагента(ДокСписание.Контрагент,альтВалюта);	
		
		стрДокСписание.ВалютаВзаиморасчетов=ВалютаUSD;
		
		ДокСписание.Валюта=альтВалюта;
		ДокСписание.СуммаДокумента=СуммаальтВалюта;
		стрДокСписание.СуммаВзаиморасчетов=СуммаUSD;
		стрДокСписание.Сумма=СуммаальтВалюта;
		
		_КурсЗа1000долларов=СуммаUSD/суммаАльтВалюта*1000;		
				
		стрДокСписание.КурсЧислительВзаиморасчетов=_КурсЗа1000долларов;
		стрДокСписание.КурсЗнаменательВзаиморасчетов=1000;


	КонецЕсли;	
		
	
	стрДокСписание.ЭлементСтруктурыЗадолженности=Перечисления.ЭлементыСтруктурыЗадолженности.ОсновнойДолг;	
	
	
	
	
		
	
	
	
	//стрДокСписание.ЗаявкаНаРасходованиеДенежныхСредств=Заявка.Ссылка;
	стрДокСписание.ЦФО=ДокСписание.Организация;  
	стрДокСписание.СтатьяДвиженияДенежныхСредств  =ДокСписание.СтатьяДвиженияДенежныхСредств; 
	Если ЗначениеЗаполнено(ДатаОплаты) тогда
		ДокСписание.Дата=ДатаОплаты; 
		ДокСПисание.Проведенобанком=истина;
		ДокСписание.ДатаПроведенияБанком=Датаоплаты;  
	иначе
		ДокСписание.Дата=ТекущаяДата(); 	
	КонецЕсли;
	
	
	ДокСписание.ОплатапоЗаявкам=ложь;  
	доксПИСАНИЕ.ОчередностьПлатежа=1;
	ДокСписание.УстановитьНовыйНомер(ДокСписание.Организация.Префикс);
	ДокСписание.ДокументОснование=Предзаказ; 
	//ДокСписание.ЗаявкаНаРасходованиеДенежныхСредств=Заявка.Ссылка;
         
	ДокСписание.Комментарий="Создано автоматически "+строка(СтрокаExcel);
	
		
	
	

	
	
	ДокСписание.Записать(РежимЗаписиДокумента.Запись);
	
	

	//
	//попытка

	//	ДокСписание.Записать(РежимЗаписиДокумента.Проведение);
	//	
	//
	//исключение
	//
	//
	//
	//КонецПопытки;
	
	возврат(докСписание.Ссылка);
	
	конецФункции
	