
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Нтип = ТипыМетаданных.Добавить();
	Нтип.Представление = "Булево";
	Нтип = ТипыМетаданных.Добавить();
	Нтип.Представление = "Дата";
	Нтип = ТипыМетаданных.Добавить();
	Нтип.Представление = "Число";
	Нтип = ТипыМетаданных.Добавить();
	Нтип.Представление = "Строка";
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СправочникиБД.Синоним КАК Синоним,
	|	1 КАК ТипМетаданных,
	|	СправочникиБД.Наименование КАК Наименование,
	|	СправочникиБД.Ссылка
	|ИЗ
	|	Справочник.СправочникиБД КАК СправочникиБД
	|ГДЕ
	|	СправочникиБД.Владелец = &Владелец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыБД.Синоним,
	|	2,
	|	ДокументыБД.Наименование,
	|	ДокументыБД.Ссылка
	|ИЗ
	|	Справочник.ДокументыБД КАК ДокументыБД
	|ГДЕ
	|	ДокументыБД.Владелец = &Владелец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПланыСчетовБД.Наименование,
	|	3,
	|	ПланыСчетовБД.Наименование,
	|	ПланыСчетовБД.Ссылка
	|ИЗ
	|	Справочник.ПланыСчетовБД КАК ПланыСчетовБД
	|ГДЕ
	|	ПланыСчетовБД.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипМетаданных,
	|	Наименование";
	
	Запрос.УстановитьПараметр("Владелец",Справочники.ТипыБазДанных.ТекущаяИБ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Нтип = ТипыМетаданных.Добавить();
		Нтип.Представление = Выборка.Синоним;
		Нтип.ЗначениеСсылка = Выборка.Ссылка;
		Нтип.Наименование = Выборка.Наименование;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыМетаданныхПриАктивизацииСтроки(Элемент)
	
	 Элементы.ГруппаПараметрыЧисла.Видимость = Элемент.ТекущиеДанные.Представление = "Число";
	 Элементы.ГруппаПараметрыСтроки.Видимость = Элемент.ТекущиеДанные.Представление = "Строка";
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыМетаданныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтруктураПараметровВозврата = Новый Структура;
	СтруктураПараметровВозврата.Вставить("Представление",Элемент.ТекущиеДанные.Представление);
	СтруктураПараметровВозврата.Вставить("Наименование",Элемент.ТекущиеДанные.Наименование);

	Если Элемент.ТекущиеДанные.ЗначениеСсылка = Неопределено Тогда
		СтруктураПараметровВозврата.Вставить("ЭтоПростойТип",Истина);	
		Если Элемент.ТекущиеДанные.Представление = "Число" Тогда
			 СтруктураПараметровВозврата.Вставить("ЧислоДлина",Элемент.ТекущиеДанные.ЧислоДлина);
			 СтруктураПараметровВозврата.Вставить("ЧислоТочность",Элемент.ТекущиеДанные.ЧислоТочность);
		КонецЕсли;
	Иначе	
		СтруктураПараметровВозврата.Вставить("ЭтоПростойТип",Ложь);	
	КонецЕсли;	
	
	СтруктураПараметровВозврата.Вставить("ЗначениеССылка",Элемент.ТекущиеДанные.ЗначениеСсылка);
	ОповеститьОВыборе(СтруктураПараметровВозврата);
	
КонецПроцедуры
