////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Подписки
	
Процедура ОбработкаПолученияДанныхВыбораОрганизацииОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	Если Параметры.Отбор.Свойство("ВалютаЛимитирования") 
		И Параметры.Отбор.Свойство("СпособОпределенияВалютыЛимитирования")
		И Параметры.Отбор.СпособОпределенияВалютыЛимитирования = ПредопределенноеЗначение("Перечисление.СпособыОпределенияВалютыЛимитирования.ВалютаЛимитированияЦФО") Тогда
		
		СтандартнаяОбработка = Ложь;
		ЦФО = ВстраиваниеОПКВызовСервераПереопределяемый.ЦФОПоВалютеЛимитирования(Параметры.Отбор.ВалютаЛимитирования, Параметры.СтрокаПоиска, Параметры.СпособПоискаСтроки);
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(ЦФО);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОМ_КомпоновкаДанныхКлиентСервер

Процедура СкопироватьЭлементы(ПриемникЗначения, ИсточникЗначения, ОчищатьПриемник = Истина) Экспорт
	КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(ПриемникЗначения, ИсточникЗначения, ОчищатьПриемник);
КонецПроцедуры

Процедура ЗаполнитьЭлементы(ПриемникЗначения, ИсточникЗначения, ПервыйУровень = Неопределено) Экспорт
	КомпоновкаДанныхКлиентСервер.ЗаполнитьЭлементы(ПриемникЗначения, ИсточникЗначения, ПервыйУровень);
КонецПроцедуры

Функция ДобавитьОформляемоеПоле(КоллекцияОформляемыхПолей, ИмяПоля) Экспорт
	Возврат КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(КоллекцияОформляемыхПолей, ИмяПоля);
КонецФункции

Функция ДобавитьГруппуОтбора(КоллекцияЭлементовОтбора, ТипГруппы) Экспорт
	Возврат КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(КоллекцияЭлементовОтбора, ТипГруппы);
КонецФункции

#КонецОбласти

#Область ОМ_ДвиженияБюджетированиеКлиентСерверУХ

Функция СтруктураПараметровРасчетаКурса() Экспорт
	Возврат ДвиженияБюджетированиеКлиентСерверУХ.СтруктураПараметровРасчетаКурса();
КонецФункции

Функция ЭтоБДДС(ВидБюджета) Экспорт
	Возврат ДвиженияБюджетированиеКлиентСерверУХ.ЭтоБДДС(ВидБюджета);
КонецФункции

Функция ЭтоБДР(ВидБюджета) Экспорт
	Возврат ДвиженияБюджетированиеКлиентСерверУХ.ЭтоБДР(ВидБюджета);
КонецФункции

Функция ЭтоБюджетДвиженияРесурсов(ВидБюджета) Экспорт
	Возврат ДвиженияБюджетированиеКлиентСерверУХ.ЭтоБюджетДвиженияРесурсов(ВидБюджета);
КонецФункции

Функция ПараметрыБюджета(ВидБюджета) Экспорт
	Возврат ДвиженияБюджетированиеКлиентСерверУХ.ПараметрыБюджета(ВидБюджета);
КонецФункции

Функция КодВидаБюджета(ВидБюджета) Экспорт
	Возврат ДвиженияБюджетированиеКлиентСерверУХ.КодВидаБюджета(ВидБюджета);
КонецФункции

Функция ИмяТаблицыБюджета(ВидБюджета) Экспорт	
	Возврат ДвиженияБюджетированиеКлиентСерверУХ.ИмяТаблицыБюджета(ВидБюджета);
КонецФункции

#КонецОбласти 

#Область ОМ_УправлениеДоговорамиУХКлиентСерверПовтИсп
Функция ОпределитьВидДоговораПоВидуОперации(ВидОперации = Неопределено) Экспорт
	Возврат УправлениеДоговорамиУХКлиентСерверПовтИсп.ОпределитьВидДоговораПоВидуОперации(ВидОперации);
КонецФункции

Функция ЭтоДоговорСПоставщиком(ВидДоговораУХ) Экспорт
	Возврат УправлениеДоговорамиУХКлиентСерверПовтИсп.ЭтоДоговорСПоставщиком(ВидДоговораУХ);
КонецФункции

Функция ЭтоДоговорСПокупателем(ВидДоговораУХ) Экспорт
	Возврат УправлениеДоговорамиУХКлиентСерверПовтИсп.ЭтоДоговорСПокупателем(ВидДоговораУХ);
КонецФункции

#КонецОбласти 


#Область ОМ_УправлениеПроцессамиСогласованияУХКлиентСервер

Процедура ДобавитьОшибкуУстановкиСтатусаОбъекта(ПротоколОшибок, Ссылка, ТекстОшибки, Поле = "") Экспорт
	УправлениеПроцессамиСогласованияУХКлиентСервер.ДобавитьОшибкуУстановкиСтатусаОбъекта(ПротоколОшибок, Ссылка, ТекстОшибки, Поле);
КонецПроцедуры
	
#КонецОбласти 

#Область ОМ_УправлениеЗаявкамиНаОперацииУХКлиентСервер

Функция ЭтоПеремещениеВнутриОрганизации(ВидОперацииУХ) Экспорт
	Возврат ВидыОперацийУХКлиентСерверПовтИсп.ЭтоПеремещениеВнутриОрганизации(ВидОперацииУХ);
КонецФункции

#КонецОбласти 

#Область ОМ_УчетНДСКлиентСервер

Функция РассчитатьСуммуНДС(Сумма, СуммаВключаетНДС, СтавкаНДС) Экспорт
	Возврат УчетНДСКлиентСервер.РассчитатьСуммуНДС(Сумма, СуммаВключаетНДС, СтавкаНДС);
КонецФункции

#КонецОбласти 

#Область ОМ_РаботаСДоговорамиКонтрагентовУХКлиентСервер
	
Функция ВидыДоговоровСПоставщиком() Экспорт
	Возврат РаботаСДоговорамиКонтрагентовУХКлиентСервер.ВидыДоговоровСПоставщиком();
КонецФункции

Функция ВидыДоговоровСПокупателем() Экспорт
	Возврат РаботаСДоговорамиКонтрагентовУХКлиентСервер.ВидыДоговоровСПокупателем();
КонецФункции

#КонецОбласти 

#Область ОМ_РаботаСКурсамиВалютКлиентСерверУХ
	
// Следует использовать функцию ПересчитатьПоКурсу.
//
// Пересчитывает сумму из валюты ВалютаНач по курсу ПоКурсуНач 
// в валюту ВалютаКон по курсу ПоКурсуКон.
//
// Параметры:
//   Сумма          - Число - Сумма, которую следует пересчитать.
//   ВалютаНач      - СправочникСсылка.Валюты - Валюта, из которой надо пересчитать.
//   ВалютаКон      - СправочникСсылка.Валюты - Валюта, в  которую надо пересчитать.
//   ПоКурсуНач     - Число - Курс, из которого надо пересчитать.
//   ПоКурсуКон     - Число - Курс, в  который  надо пересчитать.
//   ПоКратностьНач - Число - Кратность, из которой надо пересчитать (по умолчанию = 1).
//   ПоКратностьКон - Число - Кратность, в  которую надо пересчитать (по умолчанию = 1).
//
// Возвращаемое значение: 
//   Число - Сумма, пересчитанная в другую валюту.
//
Функция ПересчитатьИзВалютыВВалюту(Сумма, ВалютаНач, ВалютаКон, ПоКурсуНач, ПоКурсуКон, 
	               ПоКратностьНач =1, ПоКратностьКон = 1 ) Экспорт
	
	ПараметрыТекущегоКурса = Новый Структура("Валюта, Курс, Кратность", ВалютаНач, ПоКурсуНач, ПоКратностьНач);
	ПараметрыНовогоКурса   = Новый Структура("Валюта, Курс, Кратность", ВалютаКон, ПоКурсуКон, ПоКратностьКон);
	
	Возврат РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Сумма, ПараметрыТекущегоКурса, ПараметрыНовогоКурса);

КонецФункции //ПересчитатьИзВалютыВВалюту()

#КонецОбласти 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
#КонецОбласти

