
&НаКлиенте
Процедура Применить(Команда)
	
	ПрименитьСервер();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок = "Параметры этапа: "+Параметры.Этап;
	Новстр = ТабУточненияПериодов.Добавить();
	Новстр.ДатаНачала = Параметры.ДатаНачала;
	Новстр.ДатаОкончания = Параметры.ДатаОкончания;
	Новстр.Длительность = (Новстр.ДатаОкончания-Новстр.ДатаНачала)/(3600*24);
	
	ПериодСценария = Параметры.ПериодСценария;
	Сценарий = Параметры.Сценарий;
	Этап = Параметры.Этап;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьСервер()
	
	ДвиженияСостоянияВыполненияПроцессов = ПодготовитьТаблицуЗначенийЗаполнения();
	
	НаборЗаписей = РегистрыСведений.СостоянияВыполненияПроцессов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПериодСценария.Установить(ПериодСценария);
	НаборЗаписей.Отбор.Сценарий.Установить(Сценарий);
	НаборЗаписей.Отбор.ЭтапПроцесса.Установить(Этап);
	НаборЗаписей.Загрузить(ДвиженияСостоянияВыполненияПроцессов);
	НаборЗаписей.Записать(Истина);

	
КонецПроцедуры	

Функция ПодготовитьТаблицуЗначенийЗаполнения()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ЭтапПроцесса", Этап);
	Запрос.УстановитьПараметр("ПериодСценария", ПериодСценария);
    Запрос.УстановитьПараметр("Сценарий", Сценарий);
	Запрос.УстановитьПараметр("ДатаНачала", ТабУточненияПериодов[0].ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ТабУточненияПериодов[0].ДатаОкончания);
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияВыполненияПроцессов.Период,
	|	СостоянияВыполненияПроцессов.Сценарий,
	|	СостоянияВыполненияПроцессов.ПериодСценария,
	|	СостоянияВыполненияПроцессов.Организация,
	|	СостоянияВыполненияПроцессов.ЭтапПроцесса,
	|	СостоянияВыполненияПроцессов.СостояниеЭтапа,
	|	&ДатаНачала КАК ДатаНачала,
	|	&ДатаОкончания КАК ДатаОкончания,
	|	СостоянияВыполненияПроцессов.ОтветственныйЗаЭтап,
	|	СостоянияВыполненияПроцессов.Комментарий
	|ИЗ
	|	РегистрСведений.СостоянияВыполненияПроцессов КАК СостоянияВыполненияПроцессов
	|ГДЕ
	|	СостоянияВыполненияПроцессов.Сценарий = &Сценарий
	|	И СостоянияВыполненияПроцессов.ПериодСценария = &ПериодСценария
	|	И СостоянияВыполненияПроцессов.ЭтапПроцесса = &ЭтапПроцесса";
	
	Возврат Запрос.Выполнить().Выгрузить();

	
КонецФункции

&НаКлиенте
Процедура ТабДатДатаНачалаПриИзменении(Элемент)
	
	Тстр = ТабУточненияПериодов[0];
	Тстр.Длительность = (Тстр.ДатаОкончания-Тстр.ДатаНачала)/(3600*24);

КонецПроцедуры

&НаКлиенте
Процедура ТабДатДатаОкончанияПриИзменении(Элемент)
	
	Тстр = ТабУточненияПериодов[0];
	Тстр.Длительность = (Тстр.ДатаОкончания-Тстр.ДатаНачала)/(3600*24);

КонецПроцедуры



