#Область СлужебныеПроцедурыИФункции

Функция КонтекстОтправкиПодтвержденияПолучения(Знач МассивСсылок) Экспорт
	СЭДОФСС.ПроверитьНаличиеПраваОбмена();
	УправлениеДоступом.ПроверитьИзменениеРазрешено(МассивСсылок[0]);
	
	ЗначенияРеквизитовОбъектов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		МассивСсылок,
		"Ссылка, Страхователь, ИдентификаторСообщения",
		Истина);
	
	Страхователи = Новый Массив;
	ИдентификаторыСообщенийСтрахователей = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из ЗначенияРеквизитовОбъектов Цикл
		ЗначенияРеквизитов = КлючИЗначение.Значение;
		Идентификаторы = ИдентификаторыСообщенийСтрахователей[ЗначенияРеквизитов.Страхователь];
		Если Идентификаторы = Неопределено Тогда
			Идентификаторы = Новый Массив;
			ИдентификаторыСообщенийСтрахователей.Вставить(ЗначенияРеквизитов.Страхователь, Идентификаторы);
			Страхователи.Добавить(ЗначенияРеквизитов.Страхователь);
		КонецЕсли;
		Идентификаторы.Добавить(ЗначенияРеквизитов.ИдентификаторСообщения);
	КонецЦикла;
	
	Контекст = Новый Структура;
	Контекст.Вставить("Страхователи", Страхователи);
	Контекст.Вставить("ИдентификаторыСообщенийСтрахователей", ИдентификаторыСообщенийСтрахователей);
	
	Возврат Контекст;
КонецФункции

Функция КонтекстПросмотраXMLИсходящихДокументов(Знач МассивСсылок) Экспорт
	Возврат СЭДОФСС.КонтекстЭкспортаИсходящихДокументов(МассивСсылок, Истина);
КонецФункции

Функция КонтекстСохраненияФайловИсходящихДокументов(Знач МассивСсылок) Экспорт
	Возврат СЭДОФСС.КонтекстЭкспортаИсходящихДокументов(МассивСсылок, Ложь);
КонецФункции

Функция СтрахователиОрганизаций(Знач Организации) Экспорт
	Если Не ЗначениеЗаполнено(Организации) Тогда
		Организации = ЭлектронныйДокументооборотСФСС.ОрганизацииИспользующиеОбменФСС();
	КонецЕсли;
	Возврат СЭДОФСС.СтрахователиОрганизаций(Организации);
КонецФункции

Функция ТекстXML(Знач Идентификатор) Экспорт
	Возврат СЭДОФСС.ТекстXML(Идентификатор);
КонецФункции

#КонецОбласти
