&НаСервере
Процедура ОбновитьРеквизитыПоМетаданным()
	
	СправочникОбъект=РеквизитФормыВЗначение("Объект");
	СправочникОбъект.ЗаполнитьРеквизитыОбъекта();
	ЗначениеВРеквизитФормы(СправочникОбъект,"Объект");
	
КонецПроцедуры // ОбновитьРеквизитыПоМетаданным() 

&НаКлиенте
Процедура ОбновитьРеквизиты(Команда)
	
	ОбновитьРеквизитыПоМетаданным();
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Видимость надписи Отсутствует в конфигурации.
	Элементы.ОтсутствуетВКонфигурацииНадпись.Видимость = Объект.ОтсутствуетВКонфигурации;
КонецПроцедуры
