
#Область ОбработчикиСобытийФормы
 
&НаСервере
Процедура ОбновитьЭлементыНастройкиПрав()
	
	ГруппыВидовОтчетовТек=Константы.ИспользоватьГруппыДоступаКВидамОтчетов.Получить();
	ГруппыОрганизацийТек=Константы.ИспользоватьГруппыДоступаОрганизацииВидыОтчетов.Получить();
	ГруппыПользователейТек=Константы.ИспользоватьГруппыДоступаПользователиВидыОтчетов.Получить();
	
	ПоГруппамВидовОтчетов=?(ГруппыВидовОтчетовТек,1,0);
	ПоГруппамОрганизаций=?(ГруппыОрганизацийТек,1,0);
	ПоГруппамПользователей=?(ГруппыПользователейТек,1,0);
	
КонецПроцедуры // ОбновитьЭлементыНастройкиПрав()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	ГруппыВидовОтчетовТек=Константы.ИспользоватьГруппыДоступаКВидамОтчетов.Получить();
	ГруппыОрганизацийТек=Константы.ИспользоватьГруппыДоступаОрганизацииВидыОтчетов.Получить();
	ГруппыПользователейТек=Константы.ИспользоватьГруппыДоступаПользователиВидыОтчетов.Получить();
	
	ПоГруппамВидовОтчетов=?(ГруппыВидовОтчетовТек,1,0);
	ПоГруппамОрганизаций=?(ГруппыОрганизацийТек,1,0);
	ПоГруппамПользователей=?(ГруппыПользователейТек,1,0);
	
	УстановитьВидимость();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ФоновыйПересчетЗависимыхПоказателей.Доступность=НаборКонстант.АвтоматическийПересчетЗависимыхПоказателей;
	Элементы.КоличествоПараллельныхПотоков.Доступность=НаборКонстант.АвтоматическийПересчетЗависимыхПоказателей;
		
КонецПроцедуры // УстановитьВидимость() 

&НаКлиенте
Процедура АвтоматическийПересчетЗависимыхПоказателейПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГруппыДоступаВидыОтчетов(Команда)
	
	ИмяФормыДляОткрытия="Справочник.ГруппыДоступаКВидамОтчетов.ФормаСписка";
	
	Если НЕ НаборКонстант.ИспользоватьГруппыДоступаКВидамОтчетов=ГруппыВидовОтчетовТек Тогда
		
		ДополнительныеПараметры=Новый Структура("ИмяФормыДляОткрытия",ИмяФормыДляОткрытия);
		
		ОписаниеОповещения=Новый ОписаниеОповещения("ПодтверждениеЗаписиЗавершение",ЭтотОбъект,ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения,НСтр("ru = 'Параметры настройки прав еще не записаны. Записать?'"),РежимДиалогаВопрос.ДаНет,60,КодВозвратаДиалога.Да);
		
	Иначе
		
		ОткрытьФорму(ИмяФормыДляОткрытия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеЗаписиЗавершение(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат=КодВозвратаДиалога.Да Тогда
		
		Записать();	
		ОткрытьФорму(ДополнительныеПараметры.ИмяФормыДляОткрытия);
		
	КонецЕсли;
		
КонецПроцедуры // ПодтверждениеЗаписиЗавершение() 

&НаКлиенте
Процедура ПоГруппамВидовОтчетовПриИзменении(Элемент)
	
	НаборКонстант.ИспользоватьГруппыДоступаКВидамОтчетов=(ПоГруппамВидовОтчетов=1);
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоГруппамОрганизацийПриИзменении(Элемент)
	
	НаборКонстант.ИспользоватьГруппыДоступаОрганизацииВидыОтчетов=(ПоГруппамОрганизаций=1);
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоГруппамПользователейПриИзменении(Элемент)
	
	НаборКонстант.ИспользоватьГруппыДоступаПользователиВидыОтчетов=(ПоГруппамПользователей=1);
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();	
	ОбновитьЭлементыНастройкиПрав();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГруппыДоступаОрганизации(Команда)
	
	ИмяФормыДляОткрытия="Справочник.ГруппыДоступаОрганизацииВидыОтчетов.ФормаСписка";
	
	Если НЕ НаборКонстант.ИспользоватьГруппыДоступаОрганизацииВидыОтчетов=ГруппыОрганизацийТек Тогда
		
		ДополнительныеПараметры=Новый Структура("ИмяФормыДляОткрытия",ИмяФормыДляОткрытия);
		
		ОписаниеОповещения=Новый ОписаниеОповещения("ПодтверждениеЗаписиЗавершение",ЭтотОбъект,ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения,НСтр("ru = 'Параметры настройки прав еще не записаны. Записать?'"),РежимДиалогаВопрос.ДаНет,60,КодВозвратаДиалога.Да);
		
	Иначе
		
		ОткрытьФорму(ИмяФормыДляОткрытия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГруппыДоступаПользователи(Команда)
	
	ИмяФормыДляОткрытия="Справочник.ГруппыДоступаПользователиВидыОтчетов.ФормаСписка";
	
	Если НЕ НаборКонстант.ИспользоватьГруппыДоступаПользователиВидыОтчетов=ГруппыПользователейТек Тогда
		
		ДополнительныеПараметры=Новый Структура("ИмяФормыДляОткрытия",ИмяФормыДляОткрытия);
		
		ОписаниеОповещения=Новый ОписаниеОповещения("ПодтверждениеЗаписиЗавершение",ЭтотОбъект,ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения,НСтр("ru = 'Параметры настройки прав еще не записаны. Записать?'"),РежимДиалогаВопрос.ДаНет,60,КодВозвратаДиалога.Да);
		
	Иначе
		
		ОткрытьФорму(ИмяФормыДляОткрытия);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМатрицуНастроекПрав(Команда)
	
	ИмяФормыДляОткрытия="Обработка.МатрицаПравДоступаВидыОтчетов.Форма";
	
	Если НЕ (НаборКонстант.ИспользоватьГруппыДоступаПользователиВидыОтчетов=ГруппыПользователейТек
		И НаборКонстант.ИспользоватьГруппыДоступаОрганизацииВидыОтчетов=ГруппыОрганизацийТек
		И НаборКонстант.ИспользоватьГруппыДоступаКВидамОтчетов=ГруппыВидовОтчетовТек) Тогда
		
		ДополнительныеПараметры=Новый Структура("ИмяФормыДляОткрытия",ИмяФормыДляОткрытия);
		
		ОписаниеОповещения=Новый ОписаниеОповещения("ПодтверждениеЗаписиЗавершение",ЭтотОбъект,ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения,НСтр("ru = 'Параметры настройки прав еще не записаны. Записать?'"),РежимДиалогаВопрос.ДаНет,60,КодВозвратаДиалога.Да);
		
	Иначе
		
		ОткрытьФорму(ИмяФормыДляОткрытия);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти










