
&НаКлиенте
Процедура ШаблонПроцессаПриИзменении(Элемент)
	
	ОбновитьОтборПоШаблону();

КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборПоШаблону()
	
	ОбщегоНазначенияКлиентСерверУХ.УстановитьЭлементОтбора(Список.Отбор,"Владелец",ШаблонПроцесса,ВидСравненияКомпоновкиДанных.Равно,,Истина);
			
КонецПроцедуры // ОбновитьОтборПоВладельцу() 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗапретитьИзменениеШаблона = Параметры.ЗапретитьИзменениеШаблона;
	
	Если ЗапретитьИзменениеШаблона Тогда
		Элементы.ШаблонПроцесса.ТолькоПросмотр = Истина;
	Иначе	
		// Не блокируем изменение шаблона.
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.НазначениеПроцесса) Тогда
		
		НазначениеПроцесса=Параметры.НазначениеПроцесса;
		
		СвязиПараметровВыбора = Новый Массив;
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.НазначениеПроцесса", "НазначениеПроцесса"));
		Элементы.ШаблонПроцесса.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШаблоныУниверсальныхПроцессов.Ссылка
		|ИЗ
		|	Справочник.ШаблоныУниверсальныхПроцессов КАК ШаблоныУниверсальныхПроцессов
		|ГДЕ
		|	ШаблоныУниверсальныхПроцессов.НазначениеПроцесса = &НазначениеПроцесса";
		
		Запрос.УстановитьПараметр("НазначениеПроцесса",НазначениеПроцесса);
		
		Результат=Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			
			ШаблонПроцесса=Результат.Ссылка;
			
		КонецЕсли;
		
		ОбновитьОтборПоШаблону();
		
	КонецЕсли;
	
КонецПроцедуры
