
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодготовитьФорму(ЭтаФорма);
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СпособОценкиРезерваПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(ЭтаФорма)
	ЭтаФорма.Элементы.НормативнаяОборачиваемость.Видимость = ПолучитьДоступностьОборачиваемости(ЭтаФорма.Объект.СпособОценкиРезерва);	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДоступностьОборачиваемости(СпособОценкиРезерва)

	Если (СпособОценкиРезерва = ПредопределенноеЗначение("Перечисление.СпособыОценкиРезервовПоЗапасамМСФО.ПоОборачиваемости"))
		ИЛИ (СпособОценкиРезерва = ПредопределенноеЗначение("Перечисление.СпособыОценкиРезервовПоЗапасамМСФО.ПоЧистойСтоимостиРеализацииИлиОборачиваемости")) Тогда
	
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
	
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Процедура ПодготовитьФорму(Форма)

	Форма.КэшируемыеЗначения = Новый Структура;	
	Форма.КэшируемыеЗначения.Вставить("ИменаСубконто", 		Справочники.ПараметрыРасчетаРезервовПоЗапасам.ПолучитьИменаСубконто());
	Форма.КэшируемыеЗначения.Вставить("КлючевыеСубконто", 	ВстраиваниеУХКлиентСервер.ПолучитьКлючевыеСубконтоМПЗ());
	
	ПланСчетовБД = МСФОКлиентСерверУХ.ПланСчетовПараметровУчета(Форма.Объект.СчетРасхода);
		
	ПараметрыВыбораИсточник = Новый Массив;
	ПараметрыВыбораИсточник.Добавить(Новый ПараметрВыбора("Владелец", ПланСчетовБД));
	ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораИсточник);	
	
	Для каждого ИмяСчета Из Форма.КэшируемыеЗначения.ИменаСубконто Цикл
		Форма.Элементы[ИмяСчета.Ключ].ПараметрыВыбора = ПараметрыВыбора;
		МСФОКлиентСерверУХ.ОбновитьСубконтоСчета(Форма, ИмяСчета.Ключ);
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура СчетРасходаПриИзменении(Элемент)
	МСФОКлиентСерверУХ.ОбновитьСубконтоСчета(ЭтаФорма, Элемент.Имя);
КонецПроцедуры

