
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтруктураПараметров=Новый Структура;
	СтруктураПараметров.Вставить("ИмяОбъектаМетаданных","ТрансформационнаяКорректировка");
	СтруктураПараметров.Вставить("Ключ",Объект.Ссылка);
	СтруктураПараметров.Вставить("ШаблонКорректировки",Объект.ШаблонКорректировки);
	
	ОткрытьФорму("Обработка.КорректировкиЗначенийПоказателей.Форма.ФормаДокумента",СтруктураПараметров,,Новый УникальныйИдентификатор);
	
	Отказ=Истина;

	
КонецПроцедуры
