#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Область");
	Поля.Добавить("Организация");
	Поля.Добавить("Проект");
	Поля.Добавить("Сценарий");

	Поля.Добавить("ПредставлениеПериода");
		
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Данные.Организация) тогда
		
		СтрокаШаблона = Нстр("ru = '%1; по сценарию: %2 по организационной единице %3 за %4'");
		
		Представление = "";
		Если Не ПустаяСтрока(СтрокаШаблона) тогда								
			Представление = СтрШаблон(СтрокаШаблона, 
				Данные.Область.Наименование,
				Данные.Сценарий,
				Данные.Организация, 
				Данные.ПредставлениеПериода);
		КонецЕсли;
				
	Иначе
		
		СтрокаШаблона = Нстр("ru = '%1; по сценарию: %2 за %3'");
		
		Представление = "";
		Если Не ПустаяСтрока(СтрокаШаблона) тогда								
			Представление = СтрШаблон(СтрокаШаблона, 
				Данные.Область.Наименование,
				Данные.Сценарий,
				Данные.ПредставлениеПериода);
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
		
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Не Параметры.Свойство("Ключ") Тогда
			СтандартнаяОбработка = Истина;
			Возврат;
		КонецЕсли;	
	
		Если ЗначениеЗаполнено(Параметры.Ключ.Область.БланкОтображения) Тогда
			
			ВыбраннаяФорма = "Обработка.АналитическийБланкСводнаяТаблица.Форма";
			Параметры.Вставить("РежимыДоступаКФункциямСводнойТаблицы",ПредопределенноеЗначение("Перечисление.РежимыДоступаКФункциямСводнойТаблицы.РаботаСДанными"));
			Параметры.Вставить("Бланк",Параметры.Ключ.Область.БланкОтображения);
			Параметры.Вставить("Сценарий",Параметры.Ключ.Сценарий);							
			Параметры.Вставить("Организация",Параметры.Ключ.Организация);		
			Параметры.Вставить("Проект",Параметры.Ключ.Проект);
			МассивПодчиненныхПериодов = Новый Массив();
			МассивПериодичностей = Новый Массив;
			МассивПериодичностей.Добавить(Параметры.Ключ.Периодичность);	
			МассивПодчиненныхПериодов = ПериодыУХ.ПолучитьПодчиненныеПериоды(Параметры.Ключ.ПериодНачалоДата,Параметры.Ключ.ПериодОкончаниеДата,Параметры.Ключ.Периодичность);	
			Параметры.Вставить("ПериодС",МассивПодчиненныхПериодов[0]);
			Параметры.Вставить("ПериодПо",МассивПодчиненныхПериодов[МассивПодчиненныхПериодов.Количество()-1]);
			
		Иначе	
			
			ВыбраннаяФорма = "Обработка.АналитическийБланкСводнаяТаблица.Форма";
			СоответствиеНастроек = УправлениеОтчетамиУХ.ПолучитьСоответствияПараметровОтчета(Параметры.Ключ.Область.Владелец);
			Параметры.Вставить("РежимыДоступаКФункциямСводнойТаблицы",ПредопределенноеЗначение("Перечисление.РежимыДоступаКФункциямСводнойТаблицы.РаботаСДанными"));
			Параметры.Вставить("Бланк",СоответствиеНастроек.БланкСводнойТаблицы);
			Параметры.Вставить("Сценарий",Параметры.Ключ.Сценарий);							
			Параметры.Вставить("Организация",Параметры.Ключ.Организация);		
			Параметры.Вставить("Проект",Параметры.Ключ.Проект);
			МассивПодчиненныхПериодов = Новый Массив();
			МассивПериодичностей = Новый Массив;
			МассивПериодичностей.Добавить(Параметры.Ключ.Периодичность);	
			МассивПодчиненныхПериодов = ПериодыУХ.ПолучитьПодчиненныеПериоды(Параметры.Ключ.ПериодНачалоДата,Параметры.Ключ.ПериодОкончаниеДата,Параметры.Ключ.Периодичность);	
			Параметры.Вставить("ПериодС",МассивПодчиненныхПериодов[0]);
			Параметры.Вставить("ПериодПо",МассивПодчиненныхПериодов[МассивПодчиненныхПериодов.Количество()-1]);
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
