
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("ВладелецЭЦПИНН", ВладелецЭЦПИНН);
	Параметры.Свойство("ВладелецЭЦПФИО", ВладелецЭЦПФИО);
	Параметры.Свойство("ВладелецЭЦПСНИЛС", ВладелецЭЦПСНИЛС);
	
	ВладелецЭЦПСНИЛС = ОбработкаЗаявленийАбонентаКлиентСервер.СНИЛСБезРазделителей(ВладелецЭЦПСНИЛС);
	
	ЕстьИНН = Параметры.Свойство("ИНН", ИНН);
	Элементы.ИНН.Видимость = ЕстьИНН;
	
	СсылкаНаОрганизацию = ОбработкаЗаявленийАбонентаКлиентСервер.СсылкаНаОрганизацию(Организация);
	
	Элементы.Пояснение.Заголовок = Новый ФорматированнаяСтрока(
		НСтр("ru = 'Не найдено ни одного сертификата организации ';
			|en = 'Не найдено ни одного сертификата организации '"),
		СсылкаНаОрганизацию,
		НСтр("ru = ' по данным:';
			|en = ' по данным:'"));
		
	Элементы.ВсеСертификаты.Заголовок = ОбработкаЗаявленийАбонентаКлиентСервер.СсылкаНаВсеСертификаты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти