////////////////////////////////////////////////////////////////////////////////
// Подсистема "Электронная подпись в модели сервиса".
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область ПрограммныйИнтерфейс

Процедура ПодключитьОбработчикПроверкиЗаявлений(Интервал = Неопределено) Экспорт
	
	ОтключитьОбработчикПроверкиЗаявлений();
	
	// Подключаем однократно.
	// Внутри процедуры по результату проверки будет принято решение, включить ли его еще раз или нет.
	Интервал = ИнтервалПроверкиЗаявлений(Интервал);
	ПодключитьОбработчикОжидания("СообщитьОбОдобренныхЗаявленияхАбонента", Интервал, Истина);
	
КонецПроцедуры

Процедура ОтключитьОбработчикПроверкиЗаявлений() Экспорт
	
	ОтключитьОбработчикОжидания("СообщитьОбОдобренныхЗаявленияхАбонента");
	
КонецПроцедуры

Процедура ВключитьАвтоматическуюПроверкуСтатуса(ДокументЗаявление) Экспорт
	
	// Запускаем на сервере регламентное задание 
	ОбработкаЗаявленийАбонентаВызовСервера.ВключитьОтслеживаниеИзмененияСтатусаЗаявления(ДокументЗаявление);
	// Отслеживаем, вдруг у заявления изменился статус - тогда надо показать сообщение пользователю.
	ПодключитьОбработчикПроверкиЗаявлений();
	
КонецПроцедуры

Процедура СообщитьОбОдобренныхЗаявленияхАбонента_ПослеПолученияКонтекста(Результат, ВходящийКонтекст) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	
	Если КонтекстЭДОКлиент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстЭДОКлиент.СообщитьОбОдобренныхЗаявленияхАбонента_Контейнер(Неопределено, Неопределено);
	
КонецПроцедуры

Процедура ПодсказкаКСертификатуОбработкаНавигационнойСсылки(Форма, НавигационнаяСсылка, СтандартнаяОбработка) Экспорт
	
	Если НавигационнаяСсылка = "Подробнее" Тогда
		
		СтандартнаяОбработка = Ложь;
		Текст = ОбработкаЗаявленийАбонентаКлиентСервер.ПодробнаяПодсказкаПриВыбореСертификатаФНС(Форма.ЭтоЮридическоеЛицо);
		ПоказатьПредупреждение(, Текст);
		
	КонецЕсли;
	
КонецПроцедуры

#Область ДляБП3

Процедура Открыть1СОтчетностьНаЗакладкеОтчеты() Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Раздел", ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Отчеты"));
	
	ОткрытьФорму("ОбщаяФорма.РегламентированнаяОтчетность",
		ПараметрыФормы,
		,
		"1С-Отчетность");
	
	Оповестить("Открытие формы 1С-Отчетность", ПараметрыФормы);
	
КонецПроцедуры

Процедура ОткрытьЗаявлениеНаПодключение(ЗаявлениеНаПодключение) Экспорт
	
	ПоказатьЗначение(, ЗаявлениеНаПодключение);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнтервалПроверкиЗаявлений(Знач Интервал) Экспорт
	
	Если Интервал = Неопределено Тогда
		
		ИспользуетсяРежимТестирования = ДокументооборотСКОКлиент.ИспользуетсяРежимТестирования();
			
		Если ИспользуетсяРежимТестирования Тогда
			Интервал = 15;
		Иначе
			Интервал = 600;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Интервал;
	
КонецФункции

#КонецОбласти

