////////////////////////////////////////////////////////////////////////////////
//
// ЗатратыСервер: Распределение производственных затрат и затрат незавершенного производства.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура проверяет дату документа на соответствие дате перехода на партионный учет версии 2.2.
// Проверка выполняется для документов нового производства.
//
// Параметры:
//	Объект - ДокументОбъект.ЭтапПроизводства2_2, ДокументОбъект.ДвижениеПродукцииИМатериалов - проверяемый документ,
//	Дата - Дата - дата, на которую выполняется проверка,
//	Отказ - Булево - устанавливается в ИСТИНА, если дата перехода на новый партионный учет больше переданной даты.
//
Процедура ПроверитьИспользованиеПартионногоУчета22(Объект, Дата, Отказ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПереходаНаПартионныйУчетВерсии22 = РасчетСебестоимостиПовтИсп.ДатаПереходаНаПартионныйУчетВерсии22();
	
	ТекстОшибки = Неопределено;
	
	Если НЕ РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22() Тогда
		
		ТекстОшибки = НСтр("ru = 'Для операций, доступных с версии 2.2, требуется установить соответствующий режим партионного учета.';
							|en = 'For operations available from version 2.2, set a corresponding lot accounting mode.'");
		
	ИначеЕсли ДатаПереходаНаПартионныйУчетВерсии22 > НачалоМесяца(Дата) Тогда
		
		ТекстОшибки = НСтр("ru = 'Регистрация операций, доступных с версии 2.2, раньше даты перехода на партионный учет версии 2.2 недоступна.
								|Требуется изменить дату операции (%1) или дату перехода на партионный учет 2.2 (%2).';
								|en = 'Cannot register transactions available from version 2.2 earlier than date of transfer to lot accounting of version 2.2.
								|Change transaction date (%1) or date of migration to lot accounting 2.2 (%2).'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстОшибки,
			Формат(Дата, "ДЛФ=D"),
			Формат(ДатаПереходаНаПартионныйУчетВерсии22, "ДЛФ=D"));
			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

//++ НЕ УТ

// Устанавливает параметры выбора для правила распределения в зависимости от способа учета производственных затрат.
//
// Параметры:
//	Подразделение - СправочникСсылка.СтруктураПредприятия - подразделение, в котором выполняется распределение
//	ВариантРаспределения - ПеречислениеСсылка.СпособыРаспределенияСтатейРасходов - вариант распределения
//	ЭлементПравилоРаспределения - ПолеФормы - Поле для ввода правила распределения
//	Назначение - СправочникСсылка.Назначения - Назначение расхода.
//
Процедура НастроитьПараметрыВыбораПравилРаспределения(Подразделение, ВариантРаспределения, ЭлементПравилоРаспределения, Назначение) Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.НазначениеПравила", Назначение));
	
	Если ЗначениеЗаполнено(Подразделение)
		И (ВариантРаспределения = Перечисления.СпособыРаспределенияСтатейРасходов.ПоЭтапамПоПравилуВДанномПодразделении Или ВариантРаспределения = Неопределено) Тогда
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подразделение, "ПроизводствоПоЗаказам, ИспользуетсяСписаниеЗатратНаВыпуск");
		
		Если Не Реквизиты.ПроизводствоПоЗаказам И Не Реквизиты.ИспользуетсяСписаниеЗатратНаВыпуск Тогда
			
			МассивБазРаспределения = Новый Массив;
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.КоличествоПродукции);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.ВесПродукции);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.ОбъемПродукции);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.ПлановаяСтоимостьПродукции);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.КоличествоУказанныхМатериалов);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.ВесУказанныхМатериалов);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.ОбъемУказанныхМатериалов);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.НормативРасходаМатериала);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.КоличествоРаботУказанныхВидов);
			
			МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.БазаРаспределения", Новый ФиксированныйМассив(МассивБазРаспределения)));
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭлементПравилоРаспределения.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры

// Функция формирует таблицу выполненных этапов производства.
//
// Параметры:
//	Параметры - Структура - Структура передаваемых параметров.
//		* НачалоПериода - Дата - начало периода анализа этапов производства.
//		* ОкончаниеПериода - Дата - конец периода анализа этапов производства.
//		* Подразделение - СправочникСсылка.СтруктураПредприятия - отбор по подразделению.
//		* Назначение - СправочникСсылка.Назначения - отбор по назначению.
//		* ГруппаПродукции - СправочникСсылка.ГруппыАналитическогоУчетаНоменклатуры - отбор по группе продукции.
//		* ТолькоТекущийМесяц - Булево - признак получения этапов, выполнявшихся только в передеанном периоде.
//		* Заказ - ДокументСсылка.ЗаказНаПроизводство2_2 - отбор по заказу на производство.
//		* ИсключатьПроизводствоНаСтороне - Булево - не показывать этапы, выполняющиеся на стороне.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица этапов производства.
//
Функция ЭтапыПроизводстваДляРаспределенияЗатрат(Параметры) Экспорт
	
	Запрос = Новый Запрос("
	//++ НЕ УТКА
	//++ Устарело_Производство21
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Распоряжение КАК Распоряжение,
	|	ДД.КодСтрокиПродукция КАК КодСтрокиПродукция
	|ПОМЕСТИТЬ втВыполненныеЗаказы
	|ИЗ
	|	РегистрНакопления.ЭтапыПроизводства.Обороты КАК ДД
	|ГДЕ
	|	ЕСТЬNULL(ДД.ЗапланированоЗаказомОборот, 0) = ЕСТЬNULL(ДД.ВыполненоОборот, 0) + ЕСТЬNULL(ДД.БракОборот, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Распоряжение КАК Распоряжение,
	|	ДД.КодСтрокиПродукция КАК КодСтрокиПродукция
	|ПОМЕСТИТЬ втДатыЗавершения
	|ИЗ
	|	РегистрНакопления.ЭтапыПроизводства КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВыполненныеЗаказы КАК втВыполненныеЗаказы
	|		ПО ДД.Распоряжение = втВыполненныеЗаказы.Распоряжение
	|		И ДД.КодСтрокиПродукция = втВыполненныеЗаказы.КодСтрокиПродукция
	|ГДЕ
	|	ДД.Регистратор Ссылка Документ.МаршрутныйЛистПроизводства
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Распоряжение,
	|	ДД.КодСтрокиПродукция
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(КОНЕЦПЕРИОДА(ДД.ОкончаниеЗавершающегоБуфера, МЕСЯЦ)) < &ПериодНачало
	|
	|;
	//-- Устарело_Производство21
	//-- НЕ УТКА
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Распоряжение.Распоряжение КАК ЗаказНаПроизводство,
	|	ДД.Распоряжение.КодСтроки КАК КодСтроки
	|ПОМЕСТИТЬ втВыпускиПродукции
	|ИЗ
	|	РегистрНакопления.ВыпускПродукции.Обороты(&ПериодНачало, &ПериодОкончание) КАК ДД
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|;
	|
	|ВЫБРАТЬ
	|	Заказы.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Заказы.Номенклатура КАК Номенклатура,
	|	Заказы.КодСтроки КАК КодСтроки,
	|	Заказы.КОформлениюНачальныйОстаток КАК НачальныйОстаток,
	|	Заказы.КОформлениюПриход КАК Приход
	|ПОМЕСТИТЬ ВТВТЗаказыПереработчикамВрем
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.ОстаткиИОбороты(&ПериодНачало,
	|									   &ПериодОкончание, , ,
	|									   ЗаказПоставщику ССЫЛКА Документ.ЗаказПереработчику
	|									   И (ЗаказПоставщику = &Заказ ИЛИ &ПоВсемЗаказам)) КАК Заказы
	|ГДЕ
	|	НЕ &ПартионныйУчетВерсии22
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказы.ЗаказПоставщику
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.ЗаказПоставщику,
	|	Таб.КодСтроки
	|
	|ПОМЕСТИТЬ ВТЗаказыПереработчикам
	|
	|ИЗ ВТВТЗаказыПереработчикамВрем КАК Таб
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПереработчику КАК ДокЗаказ
	|	ПО Таб.ЗаказПоставщику = ДокЗаказ.Ссылка
	|		И ДокЗаказ.Организация = &Организация
	|		И (ДокЗаказ.Подразделение = &Подразделение ИЛИ &ПоВсемПодразделениям)
	|		И (ДокЗаказ.Назначение = &Назначение ИЛИ &ПоВсемНазначениям)
	|		И (ДокЗаказ.Назначение.НаправлениеДеятельности = &НаправлениеДеятельности ИЛИ &ПоВсемНаправлениямДеятельности)
	|		И (&НеТолькоТекущийМесяц ИЛИ Таб.НачальныйОстаток = 0)
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|	ПО Таб.Номенклатура = СпрНоменклатура.Ссылка
	|		И (&ПоВсемГруппамПродукции ИЛИ СпрНоменклатура.ГруппаАналитическогоУчета = &ГруппаПродукции)
	|ГДЕ
	|	НЕ &ПартионныйУчетВерсии22
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таб.ЗаказПоставщику,
	|	Таб.КодСтроки
	|
	|;
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заказы.ЗаказПоставщику КАК ЗаказНаПроизводство,
	|	Заказы.КодСтроки КАК КодСтрокиПродукция,
	|	НЕОПРЕДЕЛЕНО КАК Этап,
	|	НЕОПРЕДЕЛЕНО КАК Спецификация,
	|	СУММА(ВЫБОР 
	|				КОГДА Заказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА Заказы.КОформлению
	|				ИНАЧЕ 0
	|			   КОНЕЦ) КАК ЗапланированоЗаказом,
	|	СУММА(ВЫБОР 
	|				КОГДА Заказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Заказы.КОформлению
	|				ИНАЧЕ 0
	|			   КОНЕЦ) КАК Выполнено
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам КАК Заказы
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказыПереработчикам КАК ВТЗаказы
	|	ПО Заказы.ЗаказПоставщику = ВТЗаказы.ЗаказПоставщику
	|		И Заказы.КодСтроки = ВТЗаказы.КодСтроки
	|		И (Заказы.Период >= &ПериодНачало)
	|		И (&НеТолькоТекущийМесяц
	|			ИЛИ Заказы.Период МЕЖДУ &ПериодНачало И &ПериодОкончание)
	|		И Заказы.Активность
	|ГДЕ
	|	НЕ &ПартионныйУчетВерсии22
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	Заказы.ЗаказПоставщику,
	|	Заказы.КодСтроки
	|
	//++ НЕ УТКА
	//++ Устарело_Производство21
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Записи.Распоряжение КАК ЗаказНаПроизводство,
	|	Записи.КодСтрокиПродукция КАК КодСтрокиПродукция,
	|	Записи.Этап КАК Этап,
	|	Записи.Этап.Владелец КАК Спецификация,
	|	СУММА(Записи.ЗапланированоЗаказом) КАК ЗапланированоЗаказом,
	|	СУММА(Записи.Выполнено + Записи.Брак) КАК Выполнено
	|
	|ИЗ
	|	РегистрНакопления.ЭтапыПроизводства КАК Записи
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|	ПО Записи.Распоряжение = ЗаказНаПроизводство.Ссылка
	|		И ЗаказНаПроизводство.Организация = &Организация
	|		И (ЗаказНаПроизводство.Ссылка = &Заказ ИЛИ &ПоВсемЗаказам)
	|		И (Записи.Подразделение = &Подразделение ИЛИ &ПоВсемПодразделениям)
	|		И (Записи.ОкончаниеЗавершающегоБуфера >= &ПериодНачало)
	|		И (&НеТолькоТекущийМесяц ИЛИ Записи.ОкончаниеЗавершающегоБуфера МЕЖДУ &ПериодНачало И &ПериодОкончание)
	|		И (&НеТолькоТекущийМесяц ИЛИ Записи.НачалоПредварительногоБуфера МЕЖДУ &ПериодНачало И &ПериодОкончание)
	|		И Записи.Активность
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство.Продукция КАК ТЧПродукция
	|	ПО ЗаказНаПроизводство.Ссылка = ТЧПродукция.Ссылка
	|		И Записи.КодСтрокиПродукция = ТЧПродукция.КодСтроки
	|		И (ТЧПродукция.Назначение = &Назначение ИЛИ &ПоВсемНазначениям)
	|		И (ТЧПродукция.Назначение.НаправлениеДеятельности = &НаправлениеДеятельности ИЛИ &ПоВсемНаправлениямДеятельности)
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|	ПО ТЧПродукция.Номенклатура = СпрНоменклатура.Ссылка
	|		И (&ПоВсемГруппамПродукции ИЛИ СпрНоменклатура.ГруппаАналитическогоУчета = &ГруппаПродукции)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ втВыпускиПродукции КАК ВыпускПродукции
	|	ПО (ТЧПродукция.Ссылка = ВыпускПродукции.ЗаказНаПроизводство
	|		И ТЧПродукция.КодСтроки = ВыпускПродукции.КодСтроки)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ втДатыЗавершения КАК втДатыЗавершения
	|	ПО Записи.Распоряжение = втДатыЗавершения.Распоряжение
	|		И Записи.КодСтрокиПродукция = втДатыЗавершения.КодСтрокиПродукция
	|
	|ГДЕ
	|	(НЕ &ПартионныйУчетВерсии22 ИЛИ НЕ ВыпускПродукции.ЗаказНаПроизводство ЕСТЬ NULL)
	|	И втДатыЗавершения.Распоряжение ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	Записи.Распоряжение,
	|	Записи.КодСтрокиПродукция,
	|	Записи.Этап,
	|	ТЧПродукция.Номенклатура,
	|	ТЧПродукция.Характеристика,
	|	ТЧПродукция.Спецификация,
	|	ТЧПродукция.Назначение
	//-- Устарело_Производство21
	//-- НЕ УТКА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказНаПроизводство");
	
	Назначение = Неопределено;
	НаправлениеДеятельности = Неопределено;
	Подразделение = Неопределено;
	ГруппаПродукции = Неопределено;
	Заказ = Неопределено;
	Параметры.Свойство("Назначение", Назначение);
	Параметры.Свойство("НаправлениеДеятельности", НаправлениеДеятельности);
	Параметры.Свойство("Подразделение", Подразделение);
	Параметры.Свойство("ГруппаПродукции", ГруппаПродукции);
	Параметры.Свойство("Заказ", Заказ);
	
	Запрос.УстановитьПараметр("ПериодНачало",	 Параметры.ПериодНачало);
	Запрос.УстановитьПараметр("ПериодОкончание", Параметры.ПериодОкончание);
	Запрос.УстановитьПараметр("Организация",     Параметры.Организация);
	Запрос.УстановитьПараметр("Назначение",       Назначение);
	Запрос.УстановитьПараметр("ПоВсемНазначениям", Не ЗначениеЗаполнено(Назначение));
	Запрос.УстановитьПараметр("НаправлениеДеятельности",        НаправлениеДеятельности);
	Запрос.УстановитьПараметр("ПоВсемНаправлениямДеятельности", Не ЗначениеЗаполнено(НаправлениеДеятельности));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ПоВсемПодразделениям", Не ЗначениеЗаполнено(Подразделение));
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("ПоВсемЗаказам", Не ЗначениеЗаполнено(Заказ));
	Запрос.УстановитьПараметр("ГруппаПродукции", ГруппаПродукции);
	Запрос.УстановитьПараметр("ПоВсемГруппамПродукции", Не ЗначениеЗаполнено(ГруппаПродукции));
	Запрос.УстановитьПараметр("НеТолькоТекущийМесяц", НЕ Параметры.ТолькоТекущийМесяц);
	Запрос.УстановитьПараметр("ПартионныйУчетВерсии22", Параметры.ПартионныйУчетВерсии22);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//++ Устарело_Производство21

// Процедура используется для выполнения регламентного задания по формированию документов
// "Списание затрат на выпуск".
Процедура СписатьЗатратыНаВыпуск() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.СписаниеЗатратНаВыпуск);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство") Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(НСтр("ru = 'Списание затрат на выпуск без заказов';
															|en = 'Write off release costs without orders'"));
	
	Документы.СписаниеЗатратНаВыпуск.ДокументыПоПараметрам(Новый Структура, , Истина);
	
КонецПроцедуры
//-- Устарело_Производство21

// Функция формирует таблицу партий производства.
//
// Параметры:
//	Отборы - Структура - Структура передаваемых параметров.
//		* НачалоПериода - Дата - начало периода анализа этапов производства.
//		* ОкончаниеПериода - Дата - конец периода анализа этапов производства.
//		* Организация - СправочникСсылка.Организации - отбор по организации.
//		* НаправлениеДеятельности - СправочникСсылка.НаправленияДеятельности - отбор по направлению деятельности. Может отсутствовать.
//		* Подразделение - СправочникСсылка.СтруктураПредприятия - отбор по подразделению. Может отсутствовать.
//		* Назначение - СправочникСсылка.Назначения - отбор по назначению. Может отсутствовать.
//		* ТолькоТекущийМесяц - Булево - признак получения этапов, выполнявшихся только в передеанном периоде.
//		* ДетализироватьПоЭтапам - Булево - детализировать по промежуточным этапам или по продукции. Может отсутствовать.
//		* ЗаказНаПроизводство - ДокументСсылка.ЗаказНаПроизводство2_2 - отбор по заказу на производство. Может отсутствовать.
//		* ИсключатьПроизводствоНаСтороне - Булево - не показывать этапы, выполняющиеся на стороне. Может отсутствовать.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица партий производства.
//
Функция ПартииПроизводстваДляРаспределенияЗатрат(Отборы) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
//++ НЕ УТКА
	ПараметрыЗапроса = ОписаниеПараметровПолученияАктивныхПартий();
	ПараметрыЗапроса.НачалоПериода = Отборы.НачалоПериода;
	ПараметрыЗапроса.ОкончаниеПериода = Отборы.ОкончаниеПериода;
	ПараметрыЗапроса.Организации = ОбщегоНазначенияУТКлиентСервер.Массив(Отборы.Организация);
	
	ПоместитьАктивныеПартииБезСпецификаций(ПараметрыЗапроса, МенеджерВременныхТаблиц);
//-- НЕ УТКА
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"
//++ НЕ УТКА
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	Реквизиты.ПартияПроизводства	КАК ПартияПроизводства,
	|	ИСТИНА							КАК ЕстьВыпускПродукции
	|ПОМЕСТИТЬ ЭтапыСВыпуском
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК Изделия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК Реквизиты
	|			ПО Изделия.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	Реквизиты.Организация = &Организация
	|	И Реквизиты.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен))
	|	И Реквизиты.Проведен
	|	И Изделия.Произведено
	|	И НЕ Изделия.Отменено
	|	И Изделия.ДатаПроизводства МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Реквизиты.ПартияПроизводства	КАК ПартияПроизводства,
	|	ИСТИНА							КАК ЕстьВыпускПродукции
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ПобочныеИзделия КАК Изделия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК Реквизиты
	|			ПО Изделия.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	Реквизиты.Организация = &Организация
	|	И Реквизиты.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен))
	|	И Реквизиты.Проведен
	|	И Изделия.Произведено
	|	И НЕ Изделия.Отменено
	|	И Изделия.ДатаПроизводства МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РеквизитыЭтапа.ПартияПроизводства	КАК ПартияПроизводства,
	|	ИСТИНА								КАК ЕстьВыпускПродукции
	|ИЗ
	|	Документ.ОтчетПереработчика.Продукция КАК Изделия
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК РеквизитыЭтапа
	|			ПО РеквизитыЭтапа.Ссылка = Изделия.ЭтапПроизводства
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика КАК Реквизиты
	|			ПО Изделия.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	Реквизиты.Организация = &Организация
	|	И Реквизиты.Проведен
	|	И Реквизиты.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И Реквизиты.ГруппировкаЗатрат = ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПартияПроизводства
	|
	|;
	|
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Этап,
	|	Реквизиты.Подразделение КАК Подразделение,
	|	Реквизиты.ПартияПроизводства КАК ПартияПроизводства,
	|	Реквизиты.ТипПроизводственногоПроцесса
	|ПОМЕСТИТЬ ЭтапыТекущегоПериода
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Организация = &Организация
	|	И Реквизиты.Проведен
	|	И Реквизиты.ФактическоеНачалоЭтапа <= &ОкончаниеПериода
	|	И (Реквизиты.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат)
	|		ИЛИ Реквизиты.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен)
	|			И Реквизиты.ФактическоеОкончаниеЭтапа >= &НачалоПериода)
	|;
	|
//-- НЕ УТКА
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпрПартииПроизводства.Ссылка							КАК ПартияПроизводства,
	|	ДанныеДокумента.Подразделение							КАК Подразделение,
	|	ДанныеДокумента.Ссылка									КАК Этап,
	|	СпрПартииПроизводства.ОсновноеИзделиеНоменклатура		КАК Номенклатура,
	|	СпрПартииПроизводства.ОсновноеИзделиеХарактеристика	КАК Характеристика,
	|	СпрПартииПроизводства.Спецификация						КАК Спецификация,
	|	СпрПартииПроизводства.Назначение						КАК Назначение,
	|	СпрПартииПроизводства.НаправлениеДеятельности			КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО											КАК ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ													КАК ЭтапТекущегоМесяца,
	|	ИСТИНА													КАК ЕстьВыпускПродукции,
	|	ЛОЖЬ													КАК ПроизводствоНаСтороне
	|ПОМЕСТИТЬ ВтЭтапы
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ТаблицаВыходныеИзделия
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = ТаблицаВыходныеИзделия.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = ТаблицаВыходныеИзделия.Ссылка
	|		И СпрПартииПроизводства.Код = ТаблицаВыходныеИзделия.НомерГруппыЗатрат
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|
	// Исключаем документы по которым введена корректировка или сторнирование в текущем периоде
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Реестр.СторнируемыйДокумент = ДанныеДокумента.Ссылка
	|		И Реестр.СторноИсправление
	|		И Реестр.ДатаДокументаИБ <= КОНЕЦПЕРИОДА(ДанныеДокумента.Дата, МЕСЯЦ)
	|		И Реестр.Проведен
	|ГДЕ
	|	ДанныеДокумента.Организация = &Организация
	|	И ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И КОНЕЦПЕРИОДА(ДобавитьКДате(&ОкончаниеПериода, МЕСЯЦ, 1), МЕСЯЦ)
	// Исключаем документы по которым введена корректировка или сторнирование в текущем периоде
	|	И Реестр.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	СпрПартииПроизводства.Ссылка,
	|	СпрПартииПроизводства.Номенклатура,
	|	СпрПартииПроизводства.Характеристика,
	|	СпрПартииПроизводства.Спецификация,
	|	СпрПартииПроизводства.Назначение,
	|	СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктивныеПартии.ПартияПроизводства 			КАК ПартияПроизводства,
	|	ЕСТЬNULL(Этапы.Подразделение,
	|		ЗаказНаПроизводство.Подразделение) 		КАК Подразделение,
	|	ЕСТЬNULL(Этапы.Этап, 
	|		НЕОПРЕДЕЛЕНО)							КАК Этап,
	|	РеквизитыПП.ОсновноеИзделиеНоменклатура		КАК Номенклатура,
	|	РеквизитыПП.ОсновноеИзделиеХарактеристика	КАК Характеристика,
	|	РеквизитыПП.Спецификация					КАК Спецификация,
	|	РеквизитыПП.Назначение						КАК Назначение,
	|	РеквизитыПП.НаправлениеДеятельности			КАК НаправлениеДеятельности,
	|	ЗаказНаПроизводство.Ссылка 					КАК ЗаказНаПроизводство,
	|	ИСТИНА										КАК ЭтапТекущегоМесяца,
	|	ЛОЖЬ										КАК ЕстьВыпускПродукции,
	|	ЛОЖЬ										КАК ПроизводствоНаСтороне
	|ИЗ
	|	АктивныеПартии КАК АктивныеПартии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство
	|		ПО АктивныеПартии.ПартияПроизводства = ЗаказНаПроизводство.ПартияПроизводства
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК РеквизитыПП
	|		ПО РеквизитыПП.Ссылка = АктивныеПартии.ПартияПроизводства
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыТекущегоПериода КАК Этапы
	|		ПО АктивныеПартии.ПартияПроизводства = Этапы.ПартияПроизводства
	|			И Этапы.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.БезСпецификаций)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеквизитыПП.Ссылка							КАК ПартияПроизводства,
	|	Реквизиты.Подразделение						КАК Подразделение,
	|	ВЫБОР
	|		КОГДА &ДетализироватьПоЭтапам
	|			ТОГДА Реквизиты.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ										КАК Этап,
	|	РеквизитыПП.ОсновноеИзделиеНоменклатура		КАК Номенклатура,
	|	РеквизитыПП.ОсновноеИзделиеХарактеристика	КАК Характеристика,
	|	РеквизитыПП.Спецификация					КАК Спецификация,
	|	РеквизитыПП.Назначение						КАК Назначение,
	|	РеквизитыПП.НаправлениеДеятельности			КАК НаправлениеДеятельности,
	|	Реквизиты.Распоряжение						КАК ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА &НачалоПериода МЕЖДУ Реквизиты.ФактическоеНачалоЭтапа И Реквизиты.ФактическоеОкончаниеЭтапа
	|				ИЛИ &НачалоПериода >= Реквизиты.ФактическоеНачалоЭтапа
	|					И Реквизиты.ФактическоеОкончаниеЭтапа = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ &ОкончаниеПериода МЕЖДУ Реквизиты.ФактическоеНачалоЭтапа И Реквизиты.ФактическоеОкончаниеЭтапа
	|				ИЛИ &ОкончаниеПериода >= Реквизиты.ФактическоеНачалоЭтапа
	|					И Реквизиты.ФактическоеОкончаниеЭтапа = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ &НачалоПериода <= Реквизиты.ФактическоеНачалоЭтапа
	|					И &ОкончаниеПериода >= Реквизиты.ФактическоеОкончаниеЭтапа
	|				ИЛИ Реквизиты.ПроизводствоНаСтороне И ЕСТЬNULL(ЭтапыСВыпуском.ЕстьВыпускПродукции, ИСТИНА)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ												КАК ЭтапТекущегоМесяца,
	|	ЕСТЬNULL(ЭтапыСВыпуском.ЕстьВыпускПродукции, ЛОЖЬ)	КАК ЕстьВыпускПродукции,
	|	Реквизиты.ПроизводствоНаСтороне						КАК ПроизводствоНаСтороне
	|ИЗ
	|	ЭтапыТекущегоПериода КАК ЭтапыТекущегоПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК Реквизиты
	|		ПО ЭтапыТекущегоПериода.Этап = Реквизиты.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК РеквизитыПП
	|		ПО РеквизитыПП.Ссылка = Реквизиты.ПартияПроизводства

	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыСВыпуском КАК ЭтапыСВыпуском
	|		ПО ЭтапыСВыпуском.ПартияПроизводства = Реквизиты.ПартияПроизводства
	|ГДЕ
	|	НЕ ЭтапыТекущегоПериода.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.БезСпецификаций)
//-- НЕ УТКА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СпрПартииПроизводства.Ссылка						КАК ПартияПроизводства,
	|	Реквизиты.Подразделение								КАК Подразделение,
	|	Реквизиты.Ссылка									КАК Этап,
	|	СпрПартииПроизводства.ОсновноеИзделиеНоменклатура	КАК Номенклатура,
	|	СпрПартииПроизводства.ОсновноеИзделиеХарактеристика	КАК Характеристика,
	|	СпрПартииПроизводства.Спецификация					КАК Спецификация,
	|	СпрПартииПроизводства.Назначение					КАК Назначение,
	|	СпрПартииПроизводства.НаправлениеДеятельности		КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО										КАК ЗаказНаПроизводство,
	|	ИСТИНА												КАК ЭтапТекущегоМесяца,
	|	ИСТИНА												КАК ЕстьВыпускПродукции,
	|	ИСТИНА												КАК ПроизводствоНаСтороне
	|ИЗ
	|	Документ.ОтчетПереработчика КАК Реквизиты
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика.Продукция КАК ТаблицаТовары
	|		ПО Реквизиты.Ссылка = ТаблицаТовары.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = ТаблицаТовары.Ссылка
	|		И СпрПартииПроизводства.Код = ТаблицаТовары.НомерГруппыЗатрат
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|ГДЕ
	|	Реквизиты.Организация = &Организация
	|	И Реквизиты.Проведен
	|	И Реквизиты.ГруппировкаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства)
	|	И Реквизиты.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	Реквизиты.Ссылка,
	|	СпрПартииПроизводства.Ссылка,
	|	СпрПартииПроизводства.Номенклатура,
	|	СпрПартииПроизводства.Характеристика,
	|	СпрПартииПроизводства.Спецификация,
	|	СпрПартииПроизводства.Назначение,
	|	СпрПартииПроизводства.НаправлениеДеятельности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЭтапТекущегоМесяца,
	|	Подразделение,
	|	Назначение,
	|	НаправлениеДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтЭтапы.ПартияПроизводства,
	|	ВтЭтапы.Подразделение,
	|	ВтЭтапы.Этап,
	|	ВтЭтапы.Номенклатура,
	|	ВтЭтапы.Характеристика,
	|	ВтЭтапы.Спецификация,
	|	ВтЭтапы.Назначение,
	|	ВтЭтапы.НаправлениеДеятельности,
	|	ВтЭтапы.ЗаказНаПроизводство,
	|	ВтЭтапы.ЭтапТекущегоМесяца
	|ИЗ
	|	ВтЭтапы КАК ВтЭтапы
	|ГДЕ
	|	(ВтЭтапы.ЭтапТекущегоМесяца
	|			ИЛИ &ЭтапыЗаВесьПериод)
	|	И (ВтЭтапы.Подразделение = &Подразделение
	|			ИЛИ &ВсеПодразделения)
	|	И (ВтЭтапы.ЗаказНаПроизводство = &ЗаказНаПроизводство
	|			ИЛИ &ВсеЗаказыНаПроизводство)
	|	И (ВтЭтапы.Назначение = &Назначение
	|			ИЛИ &ВсеНазначения)
	|	И (ВтЭтапы.НаправлениеДеятельности = &НаправлениеДеятельности
	|			ИЛИ &ВсеНаправленияДеятельности)
	|	И (ВтЭтапы.ЕстьВыпускПродукции
	|			ИЛИ НЕ &ТолькоЭтапыСВыпуском)
	|	И (НЕ ВтЭтапы.ПроизводствоНаСтороне
	|			ИЛИ НЕ &ИсключатьПроизводствоНаСтороне)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтЭтапы.Характеристика,
	|	ВтЭтапы.ПартияПроизводства,
	|	ВтЭтапы.Этап,
	|	ВтЭтапы.ЭтапТекущегоМесяца,
	|	ВтЭтапы.Спецификация,
	|	ВтЭтапы.Номенклатура,
	|	ВтЭтапы.Назначение,
	|	ВтЭтапы.НаправлениеДеятельности,
	|	ВтЭтапы.ЗаказНаПроизводство,
	|	ВтЭтапы.Подразделение";
	
	Подразделение	= Неопределено;
	Назначение		= Неопределено;
	ЗаказНаПроизводство = Неопределено;

	НаправлениеДеятельности = Неопределено;
	ТолькоЭтапыСВыпуском = Отборы.Свойство("ТолькоЭтапыСВыпуском") И Отборы.ТолькоЭтапыСВыпуском;
	ИсключатьПроизводствоНаСтороне = Отборы.Свойство("ИсключатьПроизводствоНаСтороне") И Отборы.ИсключатьПроизводствоНаСтороне;
	
	Отборы.Свойство("Подразделение",           Подразделение);
	Отборы.Свойство("Назначение",              Назначение);

	Отборы.Свойство("ЗаказНаПроизводство",     ЗаказНаПроизводство);
	Отборы.Свойство("НаправлениеДеятельности", НаправлениеДеятельности);
	
	Запрос.УстановитьПараметр("НачалоПериода",                Отборы.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода",             Отборы.ОкончаниеПериода);
	
	Запрос.УстановитьПараметр("Организация",                  Отборы.Организация);
	Запрос.УстановитьПараметр("ДетализироватьПоЭтапам",       Отборы.ДетализироватьПоЭтапам);
	Запрос.УстановитьПараметр("ЭтапыЗаВесьПериод",            НЕ Отборы.ТолькоТекущийМесяц);
	
	Запрос.УстановитьПараметр("Подразделение",                Подразделение);
	Запрос.УстановитьПараметр("ВсеПодразделения",             Не ЗначениеЗаполнено(Подразделение));
	
	Запрос.УстановитьПараметр("Назначение",                   Назначение);
	Запрос.УстановитьПараметр("ВсеНазначения",                Не ЗначениеЗаполнено(Назначение));

	Запрос.УстановитьПараметр("ЗаказНаПроизводство",          ЗаказНаПроизводство);
	Запрос.УстановитьПараметр("ВсеЗаказыНаПроизводство",      Не ЗначениеЗаполнено(ЗаказНаПроизводство));
	
	Запрос.УстановитьПараметр("НаправлениеДеятельности",      НаправлениеДеятельности);
	Запрос.УстановитьПараметр("ВсеНаправленияДеятельности",   Не ЗначениеЗаполнено(НаправлениеДеятельности));
	
	Запрос.УстановитьПараметр("ТолькоЭтапыСВыпуском",           ТолькоЭтапыСВыпуском);
	Запрос.УстановитьПараметр("ИсключатьПроизводствоНаСтороне", ИсключатьПроизводствоНаСтороне);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//++ НЕ УТКА

// Формирует временную таблицы партий производства с типом производственного процесса "Без спецификаций",
//	по которым выполняется производство в заданном интервале.
//
// Параметры:
//	ПараметрыЗапроса - Структура - см. ЗатратыСервер.ОписаниеПараметровПолученияАктивныхПартий().
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц.
//	ОбновитьПартии - Булево - получить заново партии.
Процедура ПоместитьАктивныеПартииБезСпецификаций(ПараметрыЗапроса, МенеджерВременныхТаблиц, ОбновитьПартии = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если РасчетСебестоимостиПрикладныеАлгоритмы.ВременнаяТаблицаСуществует(МенеджерВременныхТаблиц, "АктивныеПартии") Тогда
		
		Если Не ОбновитьПартии Тогда
			Возврат;
		КонецЕсли;
		
		Запрос.Текст =
			"УНИЧТОЖИТЬ АктивныеПартии";
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ПоВсемОрганизациями", Не ПараметрыЗапроса.Организации.Количество());
	
	Запрос.Текст = "
		// Партии производства для заказов, по которым еще не введены этапы производства
		// или этапы производства введены в следующих периодах.
		|ВЫБРАТЬ
		|	ЗаказНаПроизводство.ПартияПроизводства КАК ПартияПроизводства
		|ПОМЕСТИТЬ АктивныеПартии
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства
		|		ПО ЗаказНаПроизводство.ПартияПроизводства = ЭтапПроизводства.ПартияПроизводства
		|		И ЭтапПроизводства.Проведен
		|		И ЭтапПроизводства.ФактическоеНачалоЭтапа <= &ОкончаниеПериода
		|		И ЭтапПроизводства.Статус В (
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат),
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен))
		|ГДЕ
		|	ЗаказНаПроизводство.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаПроизводство2_2.КПроизводству)
		|	И ЗаказНаПроизводство.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.БезСпецификаций)
		|	И ЗаказНаПроизводство.Проведен
		|	И ЗаказНаПроизводство.Дата <= &ОкончаниеПериода
		|	И (&ПоВсемОрганизациями ИЛИ ЗаказНаПроизводство.Организация В (&Организации))
		|	И ЭтапПроизводства.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Партии производства для заказов, по которым введены этапы производства.
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказНаПроизводство.ПартияПроизводства
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства
		|		ПО ЗаказНаПроизводство.ПартияПроизводства = ЭтапПроизводства.ПартияПроизводства
		|ГДЕ
		|	(ЗаказНаПроизводство.Статус В (
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаПроизводство2_2.КПроизводству),
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаПроизводство2_2.Закрыт))
		|		И ЗаказНаПроизводство.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.БезСпецификаций)
		|		И ЗаказНаПроизводство.Проведен
		|		И (&ПоВсемОрганизациями ИЛИ ЗаказНаПроизводство.Организация В (&Организации)))
		|	И ЭтапПроизводства.Проведен
		|	И ЭтапПроизводства.ФактическоеНачалоЭтапа <= &ОкончаниеПериода
		|	И (ЭтапПроизводства.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат)
		|		ИЛИ ЭтапПроизводства.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен)
		|		И ЭтапПроизводства.ФактическоеОкончаниеЭтапа >= &НачалоПериода)
		|";
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Описание параметров получения активных партий производства
//	с типом производственного процесса "Без спецификаций".
//
// Возвращаемое значение:
//	Структура - параметры запроса ЗатратыСервер.ПоместитьАктивныеПартииБезСпецификаций().
//
Функция ОписаниеПараметровПолученияАктивныхПартий() Экспорт
	
	ОписаниеПараметров = Новый Структура;
	ОписаниеПараметров.Вставить("НачалоПериода", Дата(1, 1, 1));
	ОписаниеПараметров.Вставить("ОкончаниеПериода", Дата(1, 1, 1));
	ОписаниеПараметров.Вставить("Организации", Новый Массив); // тип значения элемента - СправочникСсылка.Организации.
	
	Возврат ОписаниеПараметров;
	
КонецФункции

//-- НЕ УТКА

// Процедура заполняет характеристики основного изделия в коллекции для партии производства.
//
// Параметры:
//	Коллекция - ТаблицаЗначений - Таблица, в которой необходимо заполнить характеристики основного изделия.
//
Процедура ЗаполнитьХарактеристикиИзделийПоПартииПроизводства(Коллекция) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Коллекция.НомерСтроки,
	|	Коллекция.ПартияПроизводства
	|ПОМЕСТИТЬ Коллекция
	|ИЗ
	|	&Коллекция КАК Коллекция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Коллекция.НомерСтроки									КАК Индекс,
	|	СпрПартииПроизводства.ОсновноеИзделиеНоменклатура		КАК Номенклатура,
	|	СпрПартииПроизводства.ОсновноеИзделиеХарактеристика		КАК Характеристика,
	|	СпрПартииПроизводства.Спецификация						КАК Спецификация,
	|	СпрПартииПроизводства.Назначение						КАК Назначение
	|ИЗ
	|	Коллекция КАК Коллекция
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = Коллекция.ПартияПроизводства
	|
	|УПОРЯДОЧИТЬ ПО
	|	Индекс");
	
	Запрос.УстановитьПараметр("Коллекция",	Коллекция.Выгрузить(, "НомерСтроки, ПартияПроизводства"));
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Номер = 0 По Коллекция.Количество() - 1 Цикл
		Выборка.Следующий(); // Количество строк в выборке по запросу всегда равно количеству строк в ТЧ
		ЗаполнитьЗначенияСвойств(Коллекция[Номер], Выборка);
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаПроизводственныеЗатратыТМЦ() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ДД.Склад КАК Склад,
	|	ДД.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ СкладыПодразделения
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Ссылка КАК Склад,
	|		Т.Подразделение КАК Подразделение
	|	ИЗ
	|		Справочник.Склады КАК Т
	|	ГДЕ
	|		Т.ЦеховаяКладовая
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		Т.Ссылка
	|	ИЗ
	|		Справочник.СтруктураПредприятия КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДД.АналитикаУчетаНоменклатуры.Партнер,
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(
	|			&НачалоПериода, 
	|			&ОкончаниеПериода, , , 
	|			АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер)
	|			{Организация КАК Организация}
	|		) КАК ДД
	|	ГДЕ
	|		(ДД.КоличествоНачальныйОстаток <> 0
	|			ИЛИ ДД.КоличествоКонечныйОстаток <> 0
	|			ИЛИ ДД.КоличествоПриход <> 0
	|			ИЛИ ДД.КоличествоРасход <> 0)) КАК ДД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Материалы											   КАК Таблица,
	|	ДД.Содержание                                          КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	ДД.Подразделение                                       КАК Подразделение,
	|	ДД.Отправитель                                         КАК Отправитель,
	|	ДД.Получатель                                          КАК Получатель,
	|	ДД.СкладПодразделение                                  КАК СкладПодразделение,
	|	ДД.Регистратор                                         КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры                          КАК АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов                                          КАК ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета                           КАК АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий                                КАК АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС                                  КАК ВидДеятельностиНДС,
	|	ДД.Номенклатура                                        КАК Номенклатура,
	|	ДД.Характеристика                                      КАК Характеристика,
	|	ДД.Серия                                               КАК Серия,
	|	ДД.Назначение                                          КАК Назначение,
	|	ДД.НаправлениеДеятельности                             КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции                                   КАК СтатьяКалькуляции,
	|	ДД.Партия                                              КАК Партия,
	|	ДД.ПартияПроизводства                                  КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                                 КАК ЗаказНаПроизводство,
	
	|	СУММА(ДД.аНачальныйОстатокКоличество)                  КАК аНачальныйОстатокКоличество,
	|	СУММА(ДД.аНачальныйОстатокСтоимость)                   КАК аНачальныйОстатокСтоимость,
	|	СУММА(ДД.аНачальныйОстатокПР)                          КАК аНачальныйОстатокПР,
	|	СУММА(ДД.аНачальныйОстатокВР)                          КАК аНачальныйОстатокВР,
	|	СУММА(ДД.аНачальныйОстатокЗабалансовая)                КАК аНачальныйОстатокЗабалансовая,
	
	|	СУММА(ДД.бПоступилоКоличество) КАК бПоступилоКоличество,
	|	СУММА(ДД.бПоступилоСтоимость) КАК бПоступилоСтоимость,
	|	СУММА(ДД.бПоступилоПР) КАК бПоступилоПР,
	|	СУММА(ДД.бПоступилоВР) КАК бПоступилоВР,
	|	СУММА(ДД.бПоступилоЗабалансовая) КАК бПоступилоЗабалансовая,
	
	|	СУММА(ДД.ПриобретеноКоличество) КАК ПриобретеноКоличество,
	|	СУММА(ДД.ПриобретеноСтоимость) КАК ПриобретеноСтоимость,
	|	СУММА(ДД.ПриобретеноПР) КАК ПриобретеноПР,
	|	СУММА(ДД.ПриобретеноВР) КАК ПриобретеноВР,
	|	СУММА(ДД.ПриобретеноЗабалансовая) КАК ПриобретеноЗабалансовая,
	
	|	СУММА(ДД.вПеремещенияКоличество) КАК вПеремещенияКоличество,
	|	СУММА(ДД.вПеремещенияСтоимость) КАК вПеремещенияСтоимость,
	|	СУММА(ДД.вПеремещенияПР) КАК вПеремещенияПР,
	|	СУММА(ДД.вПеремещенияВР) КАК вПеремещенияВР,
	|	СУММА(ДД.вПеремещенияЗабалансовая) КАК вПеремещенияЗабалансовая,
	
	|	СУММА(ДД.гИзрасходованоНаПроизводствоКоличество) КАК гИзрасходованоНаПроизводствоКоличество,
	|	СУММА(ДД.гИзрасходованоНаПроизводствоСтоимость) КАК гИзрасходованоНаПроизводствоСтоимость,
	|	СУММА(ДД.гИзрасходованоНаПроизводствоПР) КАК гИзрасходованоНаПроизводствоПР,
	|	СУММА(ДД.гИзрасходованоНаПроизводствоВР) КАК гИзрасходованоНаПроизводствоВР,
	|	СУММА(ДД.гИзрасходованоНаПроизводствоЗабалансовая) КАК гИзрасходованоНаПроизводствоЗабалансовая,
	
	|	СУММА(ДД.дСписаноКоличество) КАК дСписаноКоличество,
	|	СУММА(ДД.дСписаноСтоимость) КАК дСписаноСтоимость,
	|	СУММА(ДД.дСписаноПР) КАК дСписаноПР,
	|	СУММА(ДД.дСписаноВР) КАК дСписаноВР,
	|	СУММА(ДД.дСписаноЗабалансовая) КАК дСписаноЗабалансовая,
	
	|	СУММА(ДД.еКонечныйОстатокКоличество) КАК еКонечныйОстатокКоличество,
	|	СУММА(ДД.еКонечныйОстатокСтоимость) КАК еКонечныйОстатокСтоимость,
	|	СУММА(ДД.еКонечныйОстатокПР) КАК еКонечныйОстатокПР,
	|	СУММА(ДД.еКонечныйОстатокВР) КАК еКонечныйОстатокВР,
	|	СУММА(ДД.еКонечныйОстатокЗабалансовая) КАК еКонечныйОстатокЗабалансовая,
	
	|	СУММА(ДД.жПереданоКоличество) КАК жПереданоКоличество,
	|	СУММА(ДД.жПереданоСтоимость) КАК жПереданоСтоимость,
	|	СУММА(ДД.жПереданоПР) КАК жПереданоПР,
	|	СУММА(ДД.жПереданоВР) КАК жПереданоВР,
	|	СУММА(ДД.жПереданоЗабалансовая) КАК жПереданоЗабалансовая,
	
	|	СУММА(ДД.зПроизведеноКоличество) КАК зПроизведеноКоличество,
	|	СУММА(ДД.зПроизведеноСтоимость) КАК зПроизведеноСтоимость,
	|	СУММА(ДД.зПроизведеноПР) КАК зПроизведеноПР,
	|	СУММА(ДД.зПроизведеноВР) КАК зПроизведеноВР,
	|	СУММА(ДД.зПроизведеноЗабалансовая) КАК зПроизведеноЗабалансовая
	|{ВЫБРАТЬ
	|Таблица,
	|Содержание,
	|Организация.*,
	|Подразделение.*,
	|Отправитель.*,
	|Получатель.*,
	|СкладПодразделение.*,
	|Регистратор.*,
	|АналитикаУчетаНоменклатуры.*,
	|ВидЗапасов.*,
	|АналитикаФинансовогоУчета.*,
	|АналитикаУчетаПартий.*,
	|ВидДеятельностиНДС.*,
	|Номенклатура.*,
	|Характеристика.*,
	|Серия.*,
	|Назначение.*,
	|НаправлениеДеятельности.*,
	|СтатьяКалькуляции.*,
	|Партия.*,
	|ПартияПроизводства.*,
	|ЗаказНаПроизводство.*,
	|аНачальныйОстатокКоличество,
	|аНачальныйОстатокСтоимость,
	|аНачальныйОстатокПР,
	|аНачальныйОстатокВР,
	|аНачальныйОстатокЗабалансовая,
	|бПоступилоКоличество,
	|бПоступилоСтоимость,
	|бПоступилоПР,
	|бПоступилоВР,
	|бПоступилоЗабалансовая,
	|ПриобретеноКоличество,
	|ПриобретеноСтоимость,
	|ПриобретеноПР,
	|ПриобретеноВР,
	|ПриобретеноЗабалансовая,
	|вПеремещенияКоличество,
	|вПеремещенияСтоимость,
	|вПеремещенияПР,
	|вПеремещенияВР,
	|вПеремещенияЗабалансовая,
	|гИзрасходованоНаПроизводствоКоличество,
	|гИзрасходованоНаПроизводствоСтоимость,
	|гИзрасходованоНаПроизводствоПР,
	|гИзрасходованоНаПроизводствоВР,
	|гИзрасходованоНаПроизводствоЗабалансовая,
	|дСписаноКоличество,
	|дСписаноСтоимость,
	|дСписаноПР,
	|дСписаноВР,
	|дСписаноЗабалансовая,
	|еКонечныйОстатокКоличество,
	|еКонечныйОстатокСтоимость,
	|еКонечныйОстатокПР,
	|еКонечныйОстатокВР,
	|еКонечныйОстатокЗабалансовая,
	|жПереданоКоличество,
	|жПереданоСтоимость,
	|жПереданоПР,
	|жПереданоВР,
	|жПереданоЗабалансовая,
	|зПроизведеноКоличество,
	|зПроизведеноСтоимость,
	|зПроизведеноПР,
	|зПроизведеноВР,
	|зПроизведеноЗабалансовая}
	|ИЗ
	|
	|(ВЫБРАТЬ
	|	&НачальныйОстаток                                      КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	СкладыПодразделения.Подразделение                      КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО                                           КАК Отправитель,
	|	НЕОПРЕДЕЛЕНО                                           КАК Получатель,
	|	Аналитика.МестоХранения                                КАК СкладПодразделение,
	|	НЕОПРЕДЕЛЕНО                                           КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры                          КАК АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов                                          КАК ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета                           КАК АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий                                КАК АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС                                  КАК ВидДеятельностиНДС,
	|	Аналитика.Номенклатура                                 КАК Номенклатура,
	|	Аналитика.Характеристика                               КАК Характеристика,
	|	Аналитика.Серия                                        КАК Серия,
	|	Аналитика.Назначение                                   КАК Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности           КАК НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции                            КАК СтатьяКалькуляции,
	|	ДД.Партия                                              КАК Партия,
	|	ВЫБОР
//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.Назначение.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(Аналитика.Назначение.Заказ КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства
//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                                  КАК ПартияПроизводства,
	|	ВЫБОР
//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.Назначение.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(Аналитика.Назначение.Заказ КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                                  КАК ЗаказНаПроизводство,
	|	ДД.КоличествоОстаток                                   КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ                                                  КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток                            КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток                             КАК аНачальныйОстатокВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ                                                  КАК аНачальныйОстатокЗабалансовая,
	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	
	|	0 КАК ПриобретеноКоличество,
	|	0 КАК ПриобретеноСтоимость,
	|	0 КАК ПриобретеноПР,
	|	0 КАК ПриобретеноВР,
	|	0 КАК ПриобретеноЗабалансовая,
	
	|	0 КАК вПеремещенияКоличество,
	|	0 КАК вПеремещенияСтоимость,
	|	0 КАК вПеремещенияПР,
	|	0 КАК вПеремещенияВР,
	|	0 КАК вПеремещенияЗабалансовая,
	
	|	0 КАК гИзрасходованоНаПроизводствоКоличество,
	|	0 КАК гИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК гИзрасходованоНаПроизводствоПР,
	|	0 КАК гИзрасходованоНаПроизводствоВР,
	|	0 КАК гИзрасходованоНаПроизводствоЗабалансовая,
	
	|	0 КАК дСписаноКоличество,
	|	0 КАК дСписаноСтоимость,
	|	0 КАК дСписаноПР,
	|	0 КАК дСписаноВР,
	|	0 КАК дСписаноЗабалансовая,
	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая,
	
	|	0 КАК жПереданоКоличество,
	|	0 КАК жПереданоСтоимость,
	|	0 КАК жПереданоПР,
	|	0 КАК жПереданоВР,
	|	0 КАК жПереданоЗабалансовая,
	
	|	0 КАК зПроизведеноКоличество,
	|	0 КАК зПроизведеноСтоимость,
	|	0 КАК зПроизведеноПР,
	|	0 КАК зПроизведеноВР,
	|	0 КАК зПроизведеноЗабалансовая
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&НачалоПериода)},
	|			НЕ &БезОтбораПоПериоду
	|				И ((АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|					И АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая)
	|					ИЛИ АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|					ИЛИ АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер))
	|					И НЕ РазделУчета В (
	|						ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
	|						ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|					)
	|					И АналитикаУчетаНоменклатуры.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|			{(Организация) КАК Организация}) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.МестоХранения = СкладыПодразделения.Склад)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПоступилоСоСклада КАК Содержание,
	|	ДД.Организация,
	|	КорСкладыПодразделения.Подразделение,
	|	Аналитика.МестоХранения,
	|	КорАналитика.МестоХранения,
	|	КорАналитика.МестоХранения,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорВидЗапасов,
	|	ДД.КорАналитикаФинансовогоУчета,
	|	ДД.КорАналитикаУчетаПартий,
	|	ДД.КорВидДеятельностиНДС,
	|	КорАналитика.Номенклатура,
	|	КорАналитика.Характеристика,
	|	КорАналитика.Серия,
	|	КорАналитика.Назначение,
	|	КорАналитика.Назначение.НаправлениеДеятельности,
	|	КорАналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(КорАналитика.Назначение.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(КорАналитика.Назначение.Заказ КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства
//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(КорАналитика.Назначение.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(КорАналитика.Назначение.Заказ КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	
	// Начальный остаток	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// Поступление	
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ СкладыПодразделения.Подразделение ЕСТЬ NULL
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ СкладыПодразделения.Подразделение ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|					ИНАЧЕ	
	|						ВЫБОР КОГДА &ПоПредприятию
	|							ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|						ИНАЧЕ
	|							ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ СкладыПодразделения.Подразделение ЕСТЬ NULL
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ СкладыПодразделения.Подразделение ЕСТЬ NULL
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ СкладыПодразделения.Подразделение ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|						ТОГДА СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	
	// Приобретено	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,

	// Перемещение	
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|					ИНАЧЕ	
	|						ВЫБОР КОГДА &ПоПредприятию
	|							ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|						ИНАЧЕ
	|							ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|			И &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|			И &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	// Израсходовано на производство	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Списано	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Конечный остаток	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Передано	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Произведено	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК КорСкладыПодразделения
	|		ПО (КорАналитика.МестоХранения = КорСкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.МестоХранения = СкладыПодразделения.Склад)
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И КорАналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И (КорАналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|		И КорАналитика.СкладскаяТерритория.ЦеховаяКладовая
	|		ИЛИ КорАналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение))
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|{ГДЕ 
	|	(ДД.Организация) КАК Организация}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПоступилоВНЗП КАК Содержание,
	|	ДД.Организация,
	|	КорСкладыПодразделения.Подразделение,
	|	Аналитика.МестоХранения,
	|	КорАналитика.МестоХранения,
	|	КорАналитика.МестоХранения,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорВидЗапасов,
	|	ДД.КорАналитикаФинансовогоУчета,
	|	ДД.КорАналитикаУчетаПартий,
	|	ДД.КорВидДеятельностиНДС,
	|	КорАналитика.Номенклатура,
	|	КорАналитика.Характеристика,
	|	КорАналитика.Серия,
	|	КорАналитика.Назначение,
	|	КорАналитика.Назначение.НаправлениеДеятельности,
	|	КорАналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(КорАналитика.Назначение.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(КорАналитика.Назначение.Заказ КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства
//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(КорАналитика.Назначение.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(КорАналитика.Назначение.Заказ КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	
	// Начальный остаток	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// Поступление	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	
	// Приобретено	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,

	// Перемещение	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Израсходовано на производство	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	// Списано	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Конечный остаток	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Передано	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Произведено	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК КорСкладыПодразделения
	|		ПО (КорАналитика.МестоХранения = КорСкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.МестоХранения = СкладыПодразделения.Склад)
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И НЕ КорАналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И НЕ Аналитика.СкладскаяТерритория.ЦеховаяКладовая
	|	И Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|{ГДЕ 
	|	(ДД.Организация) КАК Организация}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Расходы КАК Содержание,
	|	ДД.Организация,
	|	СкладыПодразделения.Подразделение,
	|	Аналитика.МестоХранения,
	|	КорАналитика.МестоХранения,
	|	Аналитика.МестоХранения,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ДД.КорПартия
//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(КорАналитика.Назначение.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(КорАналитика.Назначение.Заказ КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.Назначение.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(Аналитика.Назначение.Заказ КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства
//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(КорАналитика.Назначение.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(КорАналитика.Назначение.Заказ КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.Назначение.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(Аналитика.Назначение.Заказ КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	
	// начальный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// поступило
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// Приобретено	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// перемещения
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 0
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|				И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
	|			ТОГДА -1 * ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 0
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|				И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
	|			ТОГДА -1 * ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|					ИНАЧЕ	
	|						ВЫБОР КОГДА &ПоПредприятию
	|							ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|						ИНАЧЕ
	|							ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 0
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|				И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
	|			ТОГДА -1 * ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 0
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|				И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
	|			ТОГДА -1 * ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 0
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|				И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
	|			ТОГДА -1 * ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	
	// Израсходовано на производство
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|		И ((Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|			И Аналитика.СкладскаяТерритория.ЦеховаяКладовая)
	|			ИЛИ Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ИЛИ Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер))
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|		И ((Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|			И Аналитика.СкладскаяТерритория.ЦеховаяКладовая)
	|			ИЛИ Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ИЛИ Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер))
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|					ИНАЧЕ	
	|						ВЫБОР КОГДА &ПоПредприятию
	|							ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|						ИНАЧЕ
	|							ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|		И ((Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|			И Аналитика.СкладскаяТерритория.ЦеховаяКладовая)
	|			ИЛИ Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ИЛИ Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер))
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|		И ((Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|			И Аналитика.СкладскаяТерритория.ЦеховаяКладовая)
	|			ИЛИ Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ИЛИ Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер))
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	
	// списание
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// конечный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// передача на склад
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ИЛИ КорСкладыПодразделения.Подразделение ЕСТЬ NULL)
	|					И ДД.ХозяйственнаяОперация НЕ В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР 
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ИЛИ КорСкладыПодразделения.Подразделение ЕСТЬ NULL)
	|					И ДД.ХозяйственнаяОперация НЕ В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|					ИНАЧЕ	
	|						ВЫБОР КОГДА &ПоПредприятию
	|							ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|						ИНАЧЕ
	|							ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР 
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ИЛИ КорСкладыПодразделения.Подразделение ЕСТЬ NULL)
	|					И ДД.ХозяйственнаяОперация НЕ В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР 
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ИЛИ КорСкладыПодразделения.Подразделение ЕСТЬ NULL)
	|					И ДД.ХозяйственнаяОперация НЕ В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР 
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ИЛИ КорСкладыПодразделения.Подразделение ЕСТЬ NULL)
	|					И ДД.ХозяйственнаяОперация НЕ В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР 
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	
	// Произведено	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК КорСкладыПодразделения
	|		ПО (КорАналитика.МестоХранения = КорСкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.МестоХранения = СкладыПодразделения.Склад)
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И (Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|		И Аналитика.СкладскаяТерритория.ЦеховаяКладовая
	|		ИЛИ Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение))
	|	И (ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИЛИ ТИПЗНАЧЕНИЯ(ДД.Регистратор) = ТИП(Документ.КорректировкаРеализации))
	|	И НЕ (ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|		ИЛИ ДД.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости))
	|{ГДЕ 
	|	(ДД.Организация) КАК Организация}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&СписанияНаРасходы КАК Содержание,
	|	ДД.Организация,
	|	СкладыПодразделения.Подразделение,
	|	Аналитика.МестоХранения,
	|	ДД.СтатьяРасходовСписания,
	|	Аналитика.МестоХранения,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.Назначение.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(Аналитика.Назначение.Заказ КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства
//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.Назначение.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(Аналитика.Назначение.Заказ КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	
	// начальный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// поступило
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// Приобретено	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// перемещения
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// Израсходовано на производство
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// списание
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	
	// конечный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// передача на склад
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// Произведено	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК КорСкладыПодразделения
	|		ПО (КорАналитика.МестоХранения = КорСкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.МестоХранения = СкладыПодразделения.Склад)
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ((Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|			И Аналитика.СкладскаяТерритория.ЦеховаяКладовая)
	|			ИЛИ Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение))
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|		ИЛИ ДД.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости))
	|{ГДЕ 
	|	(ДД.Организация) КАК Организация}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПриходыОтПостащиков КАК Содержание,
	|	ДД.Организация,
	|	СкладыПодразделения.Подразделение,
	|	ЕСТЬNULL(РеквизитыПроизводстваБезЗаказа.Подразделение, ЕСТЬNULL(РеквизитыОтчетов.Подразделение, СкладыПодразделения.Подразделение)),
	|	Аналитика.МестоХранения,
	|	Аналитика.МестоХранения,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА ДД.Партия
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			И ПродукцияОтчета.ЭтапПроизводства.Распоряжение ЕСТЬ НЕ NULL
	|			ТОГДА ПродукцияОтчета.ЭтапПроизводства.Распоряжение
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			И ОтходыОтчета.ЭтапПроизводства.Распоряжение ЕСТЬ НЕ NULL
	|			ТОГДА ОтходыОтчета.ЭтапПроизводства.Распоряжение
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			И ТИПЗНАЧЕНИЯ(ДД.Партия) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ДД.Партия.Распоряжение
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,

	// начальный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// поступило
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// Приобретено	
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ДД.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ,
	
	// перемещения
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// Израсходовано на производство
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// списание
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// конечный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// передача на склад
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// Произведено	
	|	ВЫБОР
	|		КОГДА НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ДД.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.МестоХранения = СкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК РеквизитыПроизводстваБезЗаказа
	|		ПО ДД.Регистратор = РеквизитыПроизводстваБезЗаказа.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика КАК РеквизитыОтчетов
	|		ПО ДД.Регистратор = РеквизитыОтчетов.Ссылка
	//++ НЕ УТКА
	// заказ на производство по отчетам переработчика по этапам выбираем из этапов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика.Продукция КАК ПродукцияОтчета
	|		ПО ДД.Регистратор = ПродукцияОтчета.Ссылка
	|			И ДД.АналитикаУчетаПартий.КодСтроки = ПродукцияОтчета.КодСтроки
	|			И ПродукцияОтчета.Ссылка.ГруппировкаЗатрат = ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика.ВозвратныеОтходы КАК ОтходыОтчета
	|		ПО ДД.Регистратор = ОтходыОтчета.Ссылка
	|			И ДД.АналитикаУчетаПартий.КодСтроки = ОтходыОтчета.КодСтроки
	|			И ОтходыОтчета.Ссылка.ГруппировкаЗатрат = ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства)
	//-- НЕ УТКА	
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ((Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|		И Аналитика.СкладскаяТерритория.ЦеховаяКладовая)
	|			ИЛИ Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ИЛИ Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер))
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость),
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика),
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтДавальца))
	|{ГДЕ 
	|	(ДД.Организация) КАК Организация}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&КонечныйОстаток КАК Содержание,
	|	ДД.Организация,
	|	СкладыПодразделения.Подразделение,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	Аналитика.МестоХранения,
	|	НЕОПРЕДЕЛЕНО,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.Назначение.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(Аналитика.Назначение.Заказ КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства
//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.Назначение.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(Аналитика.Назначение.Заказ КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,

	// начальный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// поступило
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// Приобретено	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// перемещения
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// Израсходовано на производство
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// списание
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// конечный остаток
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ,
	
	// передача на склад
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// Произведено	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			((АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|				И АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая)
	|					ИЛИ АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|					ИЛИ АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер))
	|					И НЕ РазделУчета В (
	|						ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
	|						ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|					)
	|					И АналитикаУчетаНоменклатуры.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|			{(Организация) КАК Организация}) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.МестоХранения = СкладыПодразделения.Склад)
	|) КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	ДД.Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Отправитель,
	|	ДД.Получатель,
	|	ДД.СкладПодразделение,
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.Номенклатура,
	|	ДД.Характеристика,
	|	ДД.Серия,
	|	ДД.Назначение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство
	|";
	
	Ресурсы = Новый Массив;
	
	Ресурсы.Добавить("аНачальныйОстатокКоличество");
	Ресурсы.Добавить("аНачальныйОстатокСтоимость");
	Ресурсы.Добавить("аНачальныйОстатокПР");
	Ресурсы.Добавить("аНачальныйОстатокВР");
	Ресурсы.Добавить("аНачальныйОстатокЗабалансовая");
	
	Ресурсы.Добавить("бПоступилоКоличество");
	Ресурсы.Добавить("бПоступилоСтоимость");
	Ресурсы.Добавить("бПоступилоПР");
	Ресурсы.Добавить("бПоступилоВР");
	Ресурсы.Добавить("бПоступилоЗабалансовая");
	
	Ресурсы.Добавить("ПриобретеноКоличество");
	Ресурсы.Добавить("ПриобретеноСтоимость");
	Ресурсы.Добавить("ПриобретеноПР");
	Ресурсы.Добавить("ПриобретеноВР");
	Ресурсы.Добавить("ПриобретеноЗабалансовая");
	
	Ресурсы.Добавить("вПеремещенияКоличество");
	Ресурсы.Добавить("вПеремещенияСтоимость");
	Ресурсы.Добавить("вПеремещенияПР");
	Ресурсы.Добавить("вПеремещенияВР");
	Ресурсы.Добавить("вПеремещенияЗабалансовая");
	
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоКоличество");
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоСтоимость");
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоПР");
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоВР");
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоЗабалансовая");
	
	Ресурсы.Добавить("дСписаноКоличество");
	Ресурсы.Добавить("дСписаноСтоимость");
	Ресурсы.Добавить("дСписаноПР");
	Ресурсы.Добавить("дСписаноВР");
	Ресурсы.Добавить("дСписаноЗабалансовая");
	
	Ресурсы.Добавить("еКонечныйОстатокКоличество");
	Ресурсы.Добавить("еКонечныйОстатокСтоимость");
	Ресурсы.Добавить("еКонечныйОстатокПР");
	Ресурсы.Добавить("еКонечныйОстатокВР");
	Ресурсы.Добавить("еКонечныйОстатокЗабалансовая");
	
	Ресурсы.Добавить("жПереданоКоличество");
	Ресурсы.Добавить("жПереданоСтоимость");
	Ресурсы.Добавить("жПереданоПР");
	Ресурсы.Добавить("жПереданоВР");
	Ресурсы.Добавить("жПереданоЗабалансовая");
	
	Ресурсы.Добавить("зПроизведеноКоличество");
	Ресурсы.Добавить("зПроизведеноСтоимость");
	Ресурсы.Добавить("зПроизведеноПР");
	Ресурсы.Добавить("зПроизведеноВР");
	Ресурсы.Добавить("зПроизведеноЗабалансовая");
	
	Возврат Новый Структура("ТекстЗапроса, Ресурсы", ТекстЗапроса, Ресурсы);
	
КонецФункции

Функция ТекстЗапросаПроизводственныеЗатратыПостатейные() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДД.Таблица                                             КАК Таблица,
	|	ДД.Содержание                                          КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	ДД.Подразделение                                       КАК Подразделение,
	|	ДД.Отправитель                                         КАК Отправитель,
	|	ДД.Получатель                                          КАК Получатель,
	|	ДД.Регистратор                                         КАК Регистратор,
	|	ДД.СтатьяРасходов                                      КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                   КАК АналитикаРасходов,
	|	ДД.НаправлениеДеятельности                             КАК НаправлениеДеятельности,
	|	ДД.ПартияПроизводства                                  КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                                 КАК ЗаказНаПроизводство,
	
	|	СУММА(ДД.аНачальныйОстатокСтоимость)                   КАК аНачальныйОстатокСтоимость,
	|	СУММА(ДД.аНачальныйОстатокПР)                          КАК аНачальныйОстатокПР,
	|	СУММА(ДД.аНачальныйОстатокВР)                          КАК аНачальныйОстатокВР,
	
	|	СУММА(ДД.бПоступилоСтоимость)                          КАК бПоступилоСтоимость,
	|	СУММА(ДД.бПоступилоПР)                                 КАК бПоступилоПР,
	|	СУММА(ДД.бПоступилоВР)                                 КАК бПоступилоВР,
	
	|	СУММА(ДД.гИзрасходованоНаПроизводствоСтоимость)        КАК гИзрасходованоНаПроизводствоСтоимость,
	|	СУММА(ДД.гИзрасходованоНаПроизводствоПР)               КАК гИзрасходованоНаПроизводствоПР,
	|	СУММА(ДД.гИзрасходованоНаПроизводствоВР)               КАК гИзрасходованоНаПроизводствоВР,
	
	|	СУММА(ДД.ПрочееСписаниеСтоимость)               	   КАК ПрочееСписаниеСтоимость,
	|	СУММА(ДД.ПрочееСписаниеПР)               	           КАК ПрочееСписаниеПР,
	|	СУММА(ДД.ПрочееСписаниеВР)               	           КАК ПрочееСписаниеВР,
	
	|	СУММА(ДД.ТранзитМеждуОВЗСтоимость)               	   КАК ТранзитМеждуОВЗСтоимость,
	|	СУММА(ДД.ТранзитМеждуОВЗПР)               	           КАК ТранзитМеждуОВЗПР,
	|	СУММА(ДД.ТранзитМеждуОВЗВР)               	           КАК ТранзитМеждуОВЗВР,
	
	|	СУММА(ДД.еКонечныйОстатокСтоимость)                    КАК еКонечныйОстатокСтоимость,
	|	СУММА(ДД.еКонечныйОстатокПР)                           КАК еКонечныйОстатокПР,
	|	СУММА(ДД.еКонечныйОстатокВР)                           КАК еКонечныйОстатокВР
	|{ВЫБРАТЬ
	|Таблица,
	|Содержание,
	|Организация.*,
	|Подразделение.*,
	|Отправитель.*,
	|Получатель.*,
	|Регистратор.*,
	|СтатьяРасходов.*,
	|АналитикаРасходов.*,
	|НаправлениеДеятельности.*,
	|ПартияПроизводства.*,
	|ЗаказНаПроизводство.*,
	|аНачальныйОстатокСтоимость,
	|аНачальныйОстатокПР,
	|аНачальныйОстатокВР,
	|бПоступилоСтоимость,
	|бПоступилоПР,
	|бПоступилоВР,
	|гИзрасходованоНаПроизводствоСтоимость,
	|гИзрасходованоНаПроизводствоПР,
	|гИзрасходованоНаПроизводствоВР,
	|ПрочееСписаниеСтоимость,
	|ПрочееСписаниеПР,
	|ПрочееСписаниеВР,
	|ТранзитМеждуОВЗСтоимость,
	|ТранзитМеждуОВЗПР,
	|ТранзитМеждуОВЗВР,
	|еКонечныйОстатокСтоимость,
	|еКонечныйОстатокПР,
	|еКонечныйОстатокВР}
	|	
	|ИЗ
	|
	|(ВЫБРАТЬ
	|	&Постатейные                                           КАК Таблица,
	|	&НачальныйОстаток                                      КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	ДД.Подразделение                                       КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Отправитель,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Получатель,
	|	ВЫБОР
//++ НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)
//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                                  КАК Регистратор,
	|	ДД.СтатьяРасходов                                      КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                   КАК АналитикаРасходов,
	|	ДД.НаправлениеДеятельности                             КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                                           КАК ПартияПроизводства,
	|	НЕОПРЕДЕЛЕНО                                           КАК ЗаказНаПроизводство,
	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СуммаОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СуммаРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СуммаБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СуммаУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ                                                  КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток                            КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток                             КАК аНачальныйОстатокВР,
	
	|	0                                                      КАК бПоступилоСтоимость,
	|	0                                                      КАК бПоступилоПР,
	|	0                                                      КАК бПоступилоВР,
	
	|	0                                                      КАК гИзрасходованоНаПроизводствоСтоимость,
	|	0                                                      КАК гИзрасходованоНаПроизводствоПР,
	|	0                                                      КАК гИзрасходованоНаПроизводствоВР,
	
	|	0                                                      КАК ПрочееСписаниеСтоимость,
	|	0                                                      КАК ПрочееСписаниеПР,
	|	0                                                      КАК ПрочееСписаниеВР,
	
	|	0                                                      КАК ТранзитМеждуОВЗСтоимость,
	|	0                                                      КАК ТранзитМеждуОВЗПР,
	|	0                                                      КАК ТранзитМеждуОВЗВР,
	
	|	0                                                      КАК еКонечныйОстатокСтоимость,
	|	0                                                      КАК еКонечныйОстатокПР,
	|	0                                                      КАК еКонечныйОстатокВР
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы.Остатки(
	|		{(&НачалоПериода)},
	|		НЕ &БезОтбораПоПериодуНачало
	|		И (СтатьяРасходов В (
	|			ВЫБРАТЬ Ссылка 
	|			ИЗ ПланВидовХарактеристик.СтатьиРасходов КАК Настройка
	|			ГДЕ 
	|				Настройка.ВариантРаспределенияРасходовРегл 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|				ИЛИ Настройка.ВариантРаспределенияРасходовУпр 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			)
	|		ИЛИ АналитикаРасходов В (
	|			ВЫБРАТЬ Ссылка 
	|			ИЗ Справочник.ОбъектыВозникновенияЗатрат КАК Настройка
	|			ГДЕ 
	|				Настройка.ВариантРаспределенияРасходовРегл 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|				ИЛИ Настройка.ВариантРаспределенияРасходовУпр 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			)
	|		)
	|	) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Постатейные КАК Таблица,
	|	&Регистрация КАК Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	
	|	0,
	|	0,
	|	0,
	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Сумма
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СуммаРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СуммаБезНДС
	|			ИНАЧЕ
	|				ДД.СуммаУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыВозникновенияЗатрат КАК ОВЗ
	|		ПО ДД.АналитикаРасходов = ОВЗ.Ссылка
	|ГДЕ
	|	(&БезОтбораПоПериоду ИЛИ (&БезОтбораПоПериодуНачало ИЛИ ДД.Период >= &НачалоПериода) И ДД.Период <= &ОкончаниеПериода)
	|	И	(ЕСТЬNULL(ОВЗ.ВариантРаспределенияРасходовРегл, ДД.СтатьяРасходов.ВариантРаспределенияРасходовРегл) 
	|			В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|		ИЛИ ЕСТЬNULL(ОВЗ.ВариантРаспределенияРасходовУпр, ДД.СтатьяРасходов.ВариантРаспределенияРасходовУпр) 
	|			В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|		)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Постатейные КАК Таблица,
	|	&РаспределениеНаПроизводство КАК Содержание,
	|	ДД.Организация,
	|	Реквизиты.Подразделение,
	|	Реквизиты.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	Реквизиты.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ ДД.ЗаказНаПроизводство
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
	|		ПО ДД.Регистратор = Реквизиты.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ГДЕ
	|	(&БезОтбораПоПериоду ИЛИ (&БезОтбораПоПериодуНачало ИЛИ ДД.Период >= &НачалоПериода) И ДД.Период <= &ОкончаниеПериода)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Постатейные КАК Таблица,
	|	&Выбытие КАК Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.КорСтатьяРасходов,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Сумма
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СуммаРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СуммаБезНДС
	|			ИНАЧЕ
	|				ДД.СуммаУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыВозникновенияЗатрат КАК ОВЗ
	|		ПО ДД.АналитикаРасходов = ОВЗ.Ссылка
	|ГДЕ
	|	(&БезОтбораПоПериоду ИЛИ (&БезОтбораПоПериодуНачало ИЛИ ДД.Период >= &НачалоПериода) И ДД.Период <= &ОкончаниеПериода)
	|	И	(ЕСТЬNULL(ОВЗ.ВариантРаспределенияРасходовРегл, ДД.СтатьяРасходов.ВариантРаспределенияРасходовРегл) 
	|			В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат))
	|		ИЛИ ЕСТЬNULL(ОВЗ.ВариантРаспределенияРасходовУпр, ДД.СтатьяРасходов.ВариантРаспределенияРасходовУпр) 
	|			В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат))
	|		)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ТранзитРасходовМеждуОВЗ))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Постатейные КАК Таблица,
	|	&Перенос КАК Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.АналитикаРасходов,
	|	ДД.КорАналитикаРасходов,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Сумма
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СуммаРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СуммаБезНДС
	|			ИНАЧЕ
	|				ДД.СуммаУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыВозникновенияЗатрат КАК ОВЗ
	|		ПО ДД.АналитикаРасходов = ОВЗ.Ссылка
	|ГДЕ
	|	(&БезОтбораПоПериоду ИЛИ (&БезОтбораПоПериодуНачало ИЛИ ДД.Период >= &НачалоПериода) И ДД.Период <= &ОкончаниеПериода)
	|	И (ЕСТЬNULL(ОВЗ.ВариантРаспределенияРасходовРегл, ДД.СтатьяРасходов.ВариантРаспределенияРасходовРегл) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат)
	|					ИЛИ ЕСТЬNULL(ОВЗ.ВариантРаспределенияРасходовУпр, ДД.СтатьяРасходов.ВариантРаспределенияРасходовУпр) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат))
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ТранзитРасходовМеждуОВЗ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Постатейные КАК Таблица,
	|	&КонечныйОстаток КАК Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СуммаОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СуммаРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СуммаБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СуммаУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы.Остатки(
	|		{(&ОкончаниеПериодаГраница)},
	|		СтатьяРасходов В (
	|			ВЫБРАТЬ Ссылка 
	|			ИЗ ПланВидовХарактеристик.СтатьиРасходов КАК Настройка
	|			ГДЕ 
	|				Настройка.ВариантРаспределенияРасходовРегл 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|				ИЛИ Настройка.ВариантРаспределенияРасходовУпр 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			)
	|		ИЛИ АналитикаРасходов В (
	|			ВЫБРАТЬ Ссылка 
	|			ИЗ Справочник.ОбъектыВозникновенияЗатрат КАК Настройка
	|			ГДЕ 
	|				Настройка.ВариантРаспределенияРасходовРегл 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|				ИЛИ Настройка.ВариантРаспределенияРасходовУпр 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			)
	|	) КАК ДД
	|) КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	ДД.Таблица,
	|	ДД.Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Отправитель,
	|	ДД.Получатель,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство";
	
	Ресурсы = Новый Массив;
	Ресурсы.Добавить("аНачальныйОстатокСтоимость");
	Ресурсы.Добавить("аНачальныйОстатокПР");
	Ресурсы.Добавить("аНачальныйОстатокВР");
	
	Ресурсы.Добавить("бПоступилоСтоимость");
	Ресурсы.Добавить("бПоступилоПР");
	Ресурсы.Добавить("бПоступилоВР");
	
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоСтоимость");
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоПР");
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоВР");
	
	Ресурсы.Добавить("ПрочееСписаниеСтоимость");
	Ресурсы.Добавить("ПрочееСписаниеПР");
	Ресурсы.Добавить("ПрочееСписаниеВР");
	
	Ресурсы.Добавить("ТранзитМеждуОВЗСтоимость");
	Ресурсы.Добавить("ТранзитМеждуОВЗПР");
	Ресурсы.Добавить("ТранзитМеждуОВЗВР");
	
	Ресурсы.Добавить("еКонечныйОстатокСтоимость");
	Ресурсы.Добавить("еКонечныйОстатокПР");
	Ресурсы.Добавить("еКонечныйОстатокВР");
	
	Возврат Новый Структура("ТекстЗапроса, Ресурсы", ТекстЗапроса, Ресурсы);
	
КонецФункции

Функция ТекстЗапросаПроизводственныеЗатратыПоПартиямПроизводства() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДД.Таблица                                КАК Таблица,
	|	ДД.Содержание                             КАК Содержание,
	|	ДД.ТипЗатрат                              КАК ТипЗатрат,
	|	ДД.ВидЗатрат                              КАК ВидЗатрат,
	|	ДД.Организация                            КАК Организация,
	|	ДД.Подразделение                          КАК Подразделение,
	|	ДД.ПодразделениеОтправитель               КАК ПодразделениеОтправитель,
	|	ДД.Регистратор                            КАК Регистратор,
	|	ДД.НаправлениеДеятельности                КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции                      КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры             КАК АналитикаУчетаНоменклатуры,
	|	ДД.Номенклатура                           КАК Номенклатура,
	|	ДД.Характеристика                         КАК Характеристика,
	|	ДД.Серия                                  КАК Серия,
	|	ДД.Назначение                             КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот                               КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов                         КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                      КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции                КАК АналитикаУчетаПродукции,
	|	ДД.Продукция                              КАК Продукция,
	|	ДД.ХарактеристикаПродукции                КАК ХарактеристикаПродукции,
	|	ДД.СерияПродукции                         КАК СерияПродукции,
	|	ДД.НазначениеПродукции                    КАК НазначениеПродукции,
	|	
	|	ДД.ПартияПроизводства                     КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                    КАК ЗаказНаПроизводство,
	
	|	СУММА(ДД.аНачальныйОстатокКоличество)     КАК аНачальныйОстатокКоличество,
	|	СУММА(ДД.аНачальныйОстатокСтоимость)      КАК аНачальныйОстатокСтоимость,
	|	СУММА(ДД.аНачальныйОстатокПР)             КАК аНачальныйОстатокПР,
	|	СУММА(ДД.аНачальныйОстатокВР)             КАК аНачальныйОстатокВР,
	|	СУММА(ДД.аНачальныйОстатокЗабалансовая)   КАК аНачальныйОстатокЗабалансовая,
	|	
	|	СУММА(ДД.гИзрасходованоНаПроизводствоКоличество) КАК гИзрасходованоНаПроизводствоКоличество,
	|	СУММА(ДД.гИзрасходованоНаПроизводствоСтоимость)  КАК гИзрасходованоНаПроизводствоСтоимость,
	|	СУММА(ДД.гИзрасходованоНаПроизводствоПР)         КАК гИзрасходованоНаПроизводствоПР,
	|	СУММА(ДД.гИзрасходованоНаПроизводствоВР)         КАК гИзрасходованоНаПроизводствоВР,
	|	СУММА(ДД.гИзрасходованоНаПроизводствоЗабалансовая) КАК гИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	СУММА(ДД.гРасходНаПроизводствоКоличество) КАК гРасходНаПроизводствоКоличество,
	|	СУММА(ДД.гРасходНаПроизводствоСтоимость)  КАК гРасходНаПроизводствоСтоимость,
	|	СУММА(ДД.гРасходНаПроизводствоПР)         КАК гРасходНаПроизводствоПР,
	|	СУММА(ДД.гРасходНаПроизводствоВР)         КАК гРасходНаПроизводствоВР,
	|	СУММА(ДД.гРасходНаПроизводствоЗабалансовая)КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	СУММА(ДД.еКонечныйОстатокКоличество)      КАК еКонечныйОстатокКоличество,
	|	СУММА(ДД.еКонечныйОстатокСтоимость)       КАК еКонечныйОстатокСтоимость,
	|	СУММА(ДД.еКонечныйОстатокПР)              КАК еКонечныйОстатокПР,
	|	СУММА(ДД.еКонечныйОстатокВР)              КАК еКонечныйОстатокВР,
	|	СУММА(ДД.еКонечныйОстатокЗабалансовая)    КАК еКонечныйОстатокЗабалансовая
	|{ВЫБРАТЬ
	|Таблица,
	|Содержание,
	|ТипЗатрат.*,
	|ВидЗатрат,
	|Организация.*,
	|Подразделение.*,
	|ПодразделениеОтправитель.*,
	|Регистратор.*,
	|НаправлениеДеятельности.*,
	|СтатьяКалькуляции.*,
	|АналитикаУчетаНоменклатуры.*,
	|Номенклатура.*,
	|Характеристика.*,
	|Серия.*,
	|Назначение.*,
	|ВидРабот.*,
	|СтатьяРасходов.*,
	|АналитикаРасходов.*,
	|АналитикаУчетаПродукции.*,
	|Продукция.*,
	|ХарактеристикаПродукции.*,
	|СерияПродукции.*,
	|НазначениеПродукции.*,
	|ПартияПроизводства.*,
	|ЗаказНаПроизводство.*,
	|аНачальныйОстатокКоличество,
	|аНачальныйОстатокСтоимость,
	|аНачальныйОстатокПР,
	|аНачальныйОстатокВР,
	|аНачальныйОстатокЗабалансовая,
	|гИзрасходованоНаПроизводствоКоличество,
	|гИзрасходованоНаПроизводствоСтоимость,
	|гИзрасходованоНаПроизводствоПР,
	|гИзрасходованоНаПроизводствоВР,
	|гИзрасходованоНаПроизводствоЗабалансовая,
	|гРасходНаПроизводствоКоличество,
	|гРасходНаПроизводствоСтоимость,
	|гРасходНаПроизводствоПР,
	|гРасходНаПроизводствоВР,
	|гРасходНаПроизводствоЗабалансовая,
	|еКонечныйОстатокКоличество,
	|еКонечныйОстатокСтоимость,
	|еКонечныйОстатокПР,
	|еКонечныйОстатокВР,
	|еКонечныйОстатокЗабалансовая}
	|ИЗ
	// материалы
	|(ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&НачальныйОстаток КАК Содержание,
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	ВЫБОР 
	|		КОГДА Аналитика.СтатьяКалькуляции.ТипЗатрат В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.Материальные),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы))
	|			ТОГДА &Материальные
	|		ИНАЧЕ
	|			&Услуги
	|	КОНЕЦ КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	Аналитика.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика,
	|	Аналитика.Серия КАК Серия,
	|	Аналитика.Назначение КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|	
	|	ДД.Партия КАК ПартияПроизводства,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	ДД.КоличествоОстаток        КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ                       КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток  КАК аНачальныйОстатокВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ                       КАК аНачальныйОстатокЗабалансовая,
	|	
	|	0 КАК гИзрасходованоНаПроизводствоКоличество,
	|	0 КАК гИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК гИзрасходованоНаПроизводствоПР,
	|	0 КАК гИзрасходованоНаПроизводствоВР,
	|	0 КАК гИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&НачалоПериода)},
	|			НЕ &БезОтбораПоПериоду
	|				И АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|				И (АналитикаУчетаНоменклатуры.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	//++ НЕ УТКА
	//++ Устарело_Производство21
	|						ИЛИ Партия Ссылка Документ.ЗаказНаПроизводство
	//-- Устарело_Производство21
	//-- НЕ УТКА
	|			)) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоМатериалы22 КАК Содержание,
	|	КорАналитика.СтатьяКалькуляции.ТипЗатрат,
	|	&Материальные КАК ВидЗатрат,
	|	ДД.Организация,
	|	КорАналитика.МестоХранения,
	|	Аналитика.МестоХранения,
	|	ДД.Регистратор,
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		КорАналитика.Назначение.НаправлениеДеятельности),
	|	КорАналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	КорАналитика.Номенклатура,
	|	КорАналитика.Характеристика,
	|	КорАналитика.Серия,
	|	КорАналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.КорПартия,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.КорПартия
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|	И КорАналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоМатериалы21 КАК Содержание,
	|	КорАналитика.СтатьяКалькуляции.ТипЗатрат,
	|	&Материальные КАК ВидЗатрат,
	|	ДД.Организация,
	|	КорАналитика.МестоХранения,
	|	Аналитика.МестоХранения,
	|	ДД.Регистратор,
	|	КорАналитика.Назначение.НаправлениеДеятельности,
	|	КорАналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	КорАналитика.Номенклатура,
	|	КорАналитика.Характеристика,
	|	КорАналитика.Серия,
	|	КорАналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.КорПартия,
	|	ДД.КорПартия,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (
	|		(ДД.Регистратор Ссылка Документ.РаспределениеПроизводственныхЗатрат И НЕ ВЫРАЗИТЬ(ДД.Регистратор КАК Документ.РаспределениеПроизводственныхЗатрат).НовоеПроизводство)
	//++ Устарело_Производство21
	|		ИЛИ  (ДД.Регистратор Ссылка Документ.ВыпускПродукции И НЕ ВЫРАЗИТЬ(ДД.Регистратор КАК Документ.ВыпускПродукции).ВыпускПоРаспоряжениям)
	//++ НЕ УТКА
	|		ИЛИ ДД.Регистратор Ссылка Документ.МаршрутныйЛистПроизводства
	//-- НЕ УТКА
	//-- Устарело_Производство21
	|		)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоОтходы КАК Содержание,
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат,
	|	&Материальные КАК ВидЗатрат,
	|	ДД.Организация,
	|	Аналитика.МестоХранения,
	|	КорАналитика.МестоХранения,
	|	ДД.Регистратор,
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности),
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.Партия,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоУслуги22 КАК Содержание,
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат,
	|	&Услуги КАК ВидЗатрат,
	|	ДД.Организация,
	|	Аналитика.МестоХранения,
	|	Аналитика.МестоХранения,
	|	ДД.Регистратор,
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности),
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.Партия,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
	|	И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) 
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&Расход22 КАК Содержание,
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат,
	|	&Материальные КАК ВидЗатрат,
	|	ДД.Организация,
	|	Аналитика.МестоХранения,
	|	Аналитика.МестоХранения,
	|	ДД.Регистратор,
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности),
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|	
	|	ДД.Партия,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = АналитикаПродукции.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//++ Устарело_Производство21
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&Расход21 КАК Содержание,
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат,
	|	&Материальные КАК ВидЗатрат,
	|	ДД.Организация,
	|	Аналитика.МестоХранения,
	|	Аналитика.МестоХранения,
	|	ДД.Регистратор,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|	
	|	ДД.Партия,
	|	ДД.Партия,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДД.Регистратор Ссылка Документ.ВыпускПродукции
	//-- Устарело_Производство21
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&КонечныйОстаток КАК Содержание,
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат,
	|	ВЫБОР 
	|		КОГДА Аналитика.СтатьяКалькуляции.ТипЗатрат В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.Материальные),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы))
	|			ТОГДА &Материальные
	|		ИНАЧЕ
	|			&Услуги
	|	КОНЕЦ КАК ВидЗатрат,
	|	ДД.Организация,
	|	Аналитика.МестоХранения,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности),
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.Партия,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|				И (АналитикаУчетаНоменклатуры.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	//++ НЕ УТКА
	//++ Устарело_Производство21
	|						ИЛИ Партия Ссылка Документ.ЗаказНаПроизводство
	//-- Устарело_Производство21
	//-- НЕ УТКА
	|			)) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	// трудозатраты
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&НачальныйОстатокТрудозатраты22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	ДД.КоличествоОстаток КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			(ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|				ИЛИ УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)
	|			И НЕ &БезОтбораПоПериоду) КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&НачальныйОстатокТрудозатраты21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство КАК Партия,
	|	ДД.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	
	|	ДД.КоличествоОстаток КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			И УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО
	|			И НЕ &БезОтбораПоПериоду) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоТрудозатраты22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|		ИЛИ ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоТрудозатраты21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ВЫБОР
	//++ НЕ УТКА
	//++ Устарело_Производство21
	|		КОГДА ДД.ЗаказНаПроизводство Ссылка Документ.ЗаказНаПроизводство
	|			ТОГДА ДД.ЗаказНаПроизводство.НаправлениеДеятельности
	//-- Устарело_Производство21
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ДД.ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|	И ДД.УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&РасходТрудозатраты22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.КорАналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|		ИЛИ ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&РасходТрудозатраты21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ВЫБОР
	//++ НЕ УТКА
	//++ Устарело_Производство21
	|		КОГДА ДД.ЗаказНаПроизводство Ссылка Документ.ЗаказНаПроизводство
	|			ТОГДА ДД.ЗаказНаПроизводство.НаправлениеДеятельности
	//-- Устарело_Производство21
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ВЫБОР
	//++ НЕ УТКА
	//++ Устарело_Производство21
	|		КОГДА ДД.ЗаказНаПроизводство <> ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|			ТОГДА ДД.ЗаказНаПроизводство
	//-- Устарело_Производство21
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА ДД.ДокументВыпуска
	|	КОНЕЦ КАК Партия,
	|	ДД.ЗаказНаПроизводство,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО ДД.КорАналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|	И ДД.УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблицы,
	|	&КонечныйОстатокТрудозатраты22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|				ИЛИ УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО) КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&КонечныйОстатокТрудозатраты21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ДД.ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			И УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО) КАК ДД
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	// постатейные
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&НачальныйОстатокПостатейные22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0                            КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток  КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток   КАК аНачальныйОстатокВР,
	|	0                            КАК аНачальныйОстатокЗабалансовая,
	|	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			(ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|				ИЛИ УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)
	|			И НЕ &БезОтбораПоПериоду) КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&НачальныйОстатокПостатейные21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ДД.ЗаказНаПроизводство,
	|	
	|	0                            КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток  КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток   КАК аНачальныйОстатокВР,
	|	0                            КАК аНачальныйОстатокЗабалансовая,
	|	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			И УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО
	|			И НЕ &БезОтбораПоПериоду) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоПостатейные22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	Реквизиты.Подразделение,
	|	ДД.Регистратор,
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
	|		ПО ДД.Регистратор = Реквизиты.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|		ИЛИ ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоПостатейные21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	Реквизиты.Подразделение,
	|	ДД.Регистратор,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ВЫБОР
	//++ НЕ УТКА
	//++ Устарело_Производство21
	|		КОГДА ДД.ЗаказНаПроизводство Ссылка Документ.ЗаказНаПроизводство
	|			ТОГДА ДД.ЗаказНаПроизводство
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	//-- Устарело_Производство21
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
	|		ПО ДД.Регистратор = Реквизиты.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|	И ДД.УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&РасходПостатейные22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.АналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|		ИЛИ ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&РасходПостатейные21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ВЫБОР
	//++ НЕ УТКА
	//++ Устарело_Производство21
	|		КОГДА ДД.ЗаказНаПроизводство Ссылка Документ.ЗаказНаПроизводство
	|			ТОГДА ДД.ЗаказНаПроизводство
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	//-- Устарело_Производство21
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО ДД.АналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|	И ДД.УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&КонечныйОстатокПостатейные22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА СпрПартииПроизводства.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА СпрПартииПроизводства.НаправлениеДеятельности
	//++ НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ЭтапПроизводства2_2)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	//-- НЕ УТКА
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ПроизводствоБезЗаказа)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ТИПЗНАЧЕНИЯ(ДД.УдалитьПартияПроизводства) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА ВЫРАЗИТЬ(ДД.УдалитьПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		КОГДА ДД.УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.УдалитьПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	//++ НЕ УТКА
	|		КОГДА СпрПартииПроизводства.Документ ЕСТЬ НЕ NULL
	|			И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ЗаказНаПроизводство2_2)
	|			ТОГДА СпрПартииПроизводства.Документ
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|				ИЛИ УдалитьПартияПроизводства <> НЕОПРЕДЕЛЕНО) КАК ДД
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&КонечныйОстатокПостатейные21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ВЫБОР
	//++ НЕ УТКА
	//++ Устарело_Производство21
	|		КОГДА ДД.ЗаказНаПроизводство Ссылка Документ.ЗаказНаПроизводство
	|			ТОГДА ДД.ЗаказНаПроизводство
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	//-- Устарело_Производство21
	//-- НЕ УТКА
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			И УдалитьПартияПроизводства = НЕОПРЕДЕЛЕНО) КАК ДД
	|) КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	ДД.Таблица,
	|	ДД.Содержание,
	|	ДД.ТипЗатрат,
	|	ДД.ВидЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.ПодразделениеОтправитель,
	|	ДД.Регистратор,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.Номенклатура,
	|	ДД.Характеристика,
	|	ДД.Серия,
	|	ДД.Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции,
	|	ДД.Продукция,
	|	ДД.ХарактеристикаПродукции,
	|	ДД.СерияПродукции,
	|	ДД.НазначениеПродукции,
	|	
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство
	|";
	
	Ресурсы = Новый Массив;
	
	Ресурсы.Добавить("аНачальныйОстатокКоличество");
	Ресурсы.Добавить("аНачальныйОстатокСтоимость");
	Ресурсы.Добавить("аНачальныйОстатокПР");
	Ресурсы.Добавить("аНачальныйОстатокВР");
	Ресурсы.Добавить("аНачальныйОстатокЗабалансовая");
	
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоКоличество");
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоСтоимость");
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоПР");
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоВР");
	Ресурсы.Добавить("гИзрасходованоНаПроизводствоЗабалансовая");

	Ресурсы.Добавить("гРасходНаПроизводствоКоличество");
	Ресурсы.Добавить("гРасходНаПроизводствоСтоимость");
	Ресурсы.Добавить("гРасходНаПроизводствоПР");
	Ресурсы.Добавить("гРасходНаПроизводствоВР");
	Ресурсы.Добавить("гРасходНаПроизводствоЗабалансовая");

	Ресурсы.Добавить("еКонечныйОстатокКоличество");
	Ресурсы.Добавить("еКонечныйОстатокСтоимость");
	Ресурсы.Добавить("еКонечныйОстатокПР");
	Ресурсы.Добавить("еКонечныйОстатокВР");
	Ресурсы.Добавить("еКонечныйОстатокЗабалансовая");
	
	Возврат Новый Структура("ТекстЗапроса, Ресурсы", ТекстЗапроса, Ресурсы);

КонецФункции

//-- НЕ УТ

// Добавляет отбор в набор данных схемы компоновки данных по переданным ресурсам.
// 
// Параметры:
// 	Ресурсы - Массив из Строка - имена ресурсов, на которые необходимо наложить отбор на "<> 0".
// 	НаборДанных - НаборДанныхЗапросМакетаКомпоновкиДанных  - корректируемый набор данных. 
Процедура ДобавитьОтборПоВыбраннымРесурсам(Ресурсы, НаборДанных) Экспорт
	
	Если СтрНайти(НаборДанных.Запрос, "ИМЕЮЩИЕ") > 0 Тогда
		// в запросе уже есть отбор
		Возврат;
	КонецЕсли;
	
	НачалоЗапроса = "
	|ИМЕЮЩИЕ
	|	СУММА(%1) <> 0";
	
	ШаблонРесурса = "
	|	ИЛИ СУММА(%1) <> 0";
	
	ТекстОтбора = "";

	Для Каждого ОписаниеПоля Из НаборДанных.Поля Цикл
		Если Ресурсы.Найти(ОписаниеПоля.Имя) <> Неопределено Тогда
			
			Если ТекстОтбора = "" Тогда
				ТекстОтбора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НачалоЗапроса, ОписаниеПоля.Имя);
			Иначе
				ТекстОтбора = ТекстОтбора + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонРесурса, ОписаниеПоля.Имя);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	ПозицияУпорядочить = СтрНайти(НаборДанных.Запрос, "УПОРЯДОЧИТЬ", НаправлениеПоиска.СКонца);
	Если ПозицияУпорядочить > 0 Тогда
		НаборДанных.Запрос = Лев(НаборДанных.Запрос, ПозицияУпорядочить - 1) + ТекстОтбора + Символы.ПС + Сред(НаборДанных.Запрос, ПозицияУпорядочить);
	Иначе
		НаборДанных.Запрос = НаборДанных.Запрос + ТекстОтбора;
	КонецЕсли;
		
КонецПроцедуры

// Обрабатывает объекты Справочник.ПравилаРаспределенияРасходов и Документ.РаспределениеПрочихЗатрат при обновлении ИБ.
// Параметры:
//	Объект - СправочникОбъект.ПравилаРаспределенияРасходов, ДокументОбъект.РаспределениеПрочихЗатрат - объект для обновления.
//	МакетыБазРаспределений - Соответствие - макеты баз распределения по имена базы распределения.
//		* Ключ - Строка - упрощенное имя базы распределения (материалы, продукция и т.д.).
//		* Значение - СхемаКомпоновкиДанных - схема на основании которой будут заполняться настройки.
Процедура ОбработатьЗаполнениеНастроекКомпоновки(Объект, МакетыБазРаспределений) Экспорт

	Если Объект.НастройкиНаправленияРаспределенияИзменены ИЛИ Объект.НастройкиБазыРаспределенияПоПартиямИзменены Тогда
		// Объекты уже обработаны
		Возврат;
	КонецЕсли;

	ТабличныеЧастиКОбработке = Новый Соответствие;
	ТабличныеЧастиКОбработке.Вставить("ОтборПоГруппамПродукции", "ГруппаПродукции");
	ТабличныеЧастиКОбработке.Вставить("ОтборПоМатериалам", "Материал");
	ТабличныеЧастиКОбработке.Вставить("ОтборПоВидамРабот", "ВидРабот");
	ТабличныеЧастиКОбработке.Вставить("ОтборПоПродукции", "Продукция");

	РеквизитНазначения = "НазначениеНастройкиРаспределения";
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ПравилаРаспределенияРасходов") Тогда
		РеквизитНазначения = "НазначениеПравила";
	КонецЕсли;
	
	Если Объект[РеквизитНазначения]= Перечисления.НазначениеПравилРаспределенияРасходов.РаспределениеСтатейРасходовПоЭтапамПроизводства
		И Не Объект.НаправлениеРаспределения = Перечисления.НаправлениеРаспределенияПоПодразделениям.ПустаяСсылка() Тогда
		
		НастройкиПоУмолчанию = МакетыБазРаспределений["НаправлениеРаспределения"].НастройкиПоУмолчанию; // НастройкиКомпоновкиДанных
		НастройкиПоУмолчанию.Отбор.Элементы.Очистить();
		
		ОтборПоПодразделению = НастройкиПоУмолчанию.Отбор.Элементы.Добавить(
			Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоПодразделению.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение");
		
		Если Объект.НаправлениеРаспределения = Перечисления.НаправлениеРаспределенияПоПодразделениям.Текущее
			И ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РаспределениеПрочихЗатрат") Тогда
			
			ОтборПоПодразделению.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ПараметрыДанных.ТекущееПодразделение");
			ОтборПоПодразделению.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			Объект.НастройкиНаправленияРаспределенияИзменены = Истина;
				
		ИначеЕсли Объект.НаправлениеРаспределения = Перечисления.НаправлениеРаспределенияПоПодразделениям.Вышестоящее
			И ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РаспределениеПрочихЗатрат") Тогда
			
			ОтборПоПодразделению.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ПараметрыДанных.ВышестоящееПодразделение");
			ОтборПоПодразделению.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			Объект.НастройкиНаправленияРаспределенияИзменены = Истина;
				
		ИначеЕсли Объект.НаправлениеРаспределения = Перечисления.НаправлениеРаспределенияПоПодразделениям.Нижестоящие
			И ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РаспределениеПрочихЗатрат") Тогда
			
			ОтборПоПодразделению.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ПараметрыДанных.ТекущееПодразделение");
			ОтборПоПодразделению.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
			
			ОтборПоПодразделениюНеРавно = НастройкиПоУмолчанию.Отбор.Элементы.Добавить(
				Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоПодразделениюНеРавно.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение");
			ОтборПоПодразделениюНеРавно.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
			ОтборПоПодразделениюНеРавно.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ПараметрыДанных.ТекущееПодразделение");
			
			Объект.НастройкиНаправленияРаспределенияИзменены = Истина;
			
		ИначеЕсли Объект.НаправлениеРаспределения = Перечисления.НаправлениеРаспределенияПоПодразделениям.Указанные Тогда
			
			СписокПодразделений = Новый СписокЗначений();
			СписокПодразделений.ЗагрузитьЗначения(
				Объект.ОтборПоПодразделениям.ВыгрузитьКолонку("Подразделение"));
			ОтборПоПодразделению.ПравоеЗначение = СписокПодразделений;
			ОтборПоПодразделению.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Объект.НастройкиНаправленияРаспределенияИзменены = Истина;

		КонецЕсли;

		Если Объект.НастройкиНаправленияРаспределенияИзменены Тогда
			ОтборПоПодразделению.Использование = Истина;
			Объект.НастройкиНаправленияРаспределения = Новый ХранилищеЗначения(НастройкиПоУмолчанию);
		КонецЕсли;
	
	КонецЕсли;

	ИмяСхемы = Перечисления.ТипыБазыРаспределенияРасходов.ИмяСхемыБазыРаспределения(Объект.БазаРаспределенияПоПартиям);
	Если ПустаяСтрока(ИмяСхемы) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиПоУмолчанию = МакетыБазРаспределений[ИмяСхемы].НастройкиПоУмолчанию; // НастройкиКомпоновкиДанных
	НастройкиПоУмолчанию.Отбор.Элементы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.Ссылка КАК Материал,
		|	Т.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Справочник.Номенклатура КАК Т
		|ГДЕ
		|	Т.Ссылка В (&СписокМатериалов)";
	Запрос.УстановитьПараметр("СписокМатериалов", Объект.ОтборПоМатериалам.ВыгрузитьКолонку("Материал"));
	
	Для Каждого КлючИЗначение Из ТабличныеЧастиКОбработке Цикл
		
		Если Объект[КлючИЗначение.Ключ].Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Объект.НастройкиБазыРаспределенияПоПартиямИзменены = Истина;
		
		ЭлементыОтбора = Новый СписокЗначений;
		ГруппыОтбора = Новый СписокЗначений;
		
		Если КлючИЗначение.Ключ = "ОтборПоМатериалам" Тогда
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.ЭтоГруппа Тогда
					ГруппыОтбора.Добавить(Выборка.Материал);
				Иначе
					ЭлементыОтбора.Добавить(Выборка.Материал);
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			ЭлементыОтбора.ЗагрузитьЗначения(Объект[КлючИЗначение.Ключ].ВыгрузитьКолонку(КлючИЗначение.Значение));
		КонецЕсли;
		
		Отбор = Неопределено;
		Если ГруппыОтбора.Количество() = 0 Тогда
			
			Отбор = НастройкиПоУмолчанию.Отбор.Элементы.Добавить(
				Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(КлючИЗначение.Значение);
			Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Отбор.ПравоеЗначение = ЭлементыОтбора;
		
		Иначе
			
			ГруппаЭлементовОтбора = НастройкиПоУмолчанию.Отбор.Элементы.Добавить(
					Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			
			ЭлементОтбораДляГрупп = ГруппаЭлементовОтбора.Элементы.Добавить(
				Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораДляГрупп.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(КлючИЗначение.Значение);
			ЭлементОтбораДляГрупп.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
			ЭлементОтбораДляГрупп.ПравоеЗначение = ГруппыОтбора;
				
			ЭлементОтбораДляЭлементов = ГруппаЭлементовОтбора.Элементы.Добавить(
				Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораДляЭлементов.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(КлючИЗначение.Значение);
			ЭлементОтбораДляЭлементов.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбораДляЭлементов.ПравоеЗначение = ЭлементыОтбора;
			
		КонецЕсли;
		
	КонецЦикла;

	Если Объект.НастройкиБазыРаспределенияПоПартиямИзменены Тогда
		Объект.НастройкиБазыРаспределенияПоПартиям = Новый ХранилищеЗначения(НастройкиПоУмолчанию);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиЭтаповЗакрытияМесяца

//++ НЕ УТ

#Область ИсправлениеОшибокВИсходныхДанных

Процедура ПроверкаКорректностиУказанияПартийПроизводства(ПараметрыПроверки) Экспорт
	
	ТекстЗапроса = " 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Распределение.Ссылка.Организация КАК Организация,
	|	Распределение.Ссылка КАК ДокументРаспределения,
	|	Распределение.ПартияПроизводства.Документ КАК ПроизводствоБезЗаказа
	|
	|ПОМЕСТИТЬ ДокументыРаспределенияСНеактуальнымиПартиями
	|ИЗ
	|	Документ.РаспределениеПрочихЗатрат.ПартииПроизводства КАК Распределение
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = Распределение.ПартияПроизводства.Документ
	|		
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сторно КАК ДокументСторно
	|		ПО ДокументСторно.СторнируемыйДокумент = ПроизводствоБезЗаказа.Ссылка
	|		И ДокументСторно.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ)
	|		И ДокументСторно.Проведен
	|ГДЕ
	|	Распределение.Ссылка.Проведен
	|	И Распределение.Ссылка.Организация В(&МассивОрганизаций)
	|	И Распределение.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Распределение.Ссылка.Организация КАК Организация,
	|	Распределение.Ссылка КАК ДокументРаспределения,
	|	Распределение.ПартияПроизводства.Документ КАК ПроизводствоБезЗаказа
	|ИЗ
	|	Документ.РаспределениеПроизводственныхЗатрат.ПартииПроизводства КАК Распределение
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = Распределение.ПартияПроизводства.Документ
	|		
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сторно КАК ДокументСторно
	|		ПО ДокументСторно.СторнируемыйДокумент = ПроизводствоБезЗаказа.Ссылка
	|		И ДокументСторно.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ)
	|		И ДокументСторно.Проведен
	|ГДЕ
	|	Распределение.Ссылка.Проведен
	|	И Распределение.Ссылка.Организация В(&МассивОрганизаций)
	|	И Распределение.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Распределение.Ссылка.Организация КАК Организация,
	|	Распределение.Ссылка КАК ДокументРаспределения,
	|	Распределение.ПартияПроизводства.Документ КАК ПроизводствоБезЗаказа
	|ИЗ
	|	Документ.РаспределениеВозвратныхОтходов.ПартииПроизводства КАК Распределение
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = Распределение.ПартияПроизводства.Документ
	|		
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сторно КАК ДокументСторно
	|		ПО ДокументСторно.СторнируемыйДокумент = ПроизводствоБезЗаказа.Ссылка
	|		И ДокументСторно.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ)
	|		И ДокументСторно.Проведен
	|ГДЕ
	|	Распределение.Ссылка.Проведен
	|	И Распределение.Ссылка.Организация В(&МассивОрганизаций)
	|	И Распределение.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	//++ НЕ УТКА
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабличнаяЧасть.Ссылка.Организация КАК Организация,
	|	ТабличнаяЧасть.Ссылка КАК ДокументРаспределения,
	|	ТабличнаяЧасть.ПартияПроизводства.Документ КАК ПроизводствоБезЗаказа
	|ИЗ
	|	Документ.НачальныеОстаткиНЗППоПартиямПроизводства.МатериалыИРаботы КАК ТабличнаяЧасть
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = ТабличнаяЧасть.ПартияПроизводства.Документ
	|		
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сторно КАК ДокументСторно
	|		ПО ДокументСторно.СторнируемыйДокумент = ПроизводствоБезЗаказа.Ссылка
	|		И ДокументСторно.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ)
	|		И ДокументСторно.Проведен
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка.Проведен
	|	И ТабличнаяЧасть.Ссылка.Организация В(&МассивОрганизаций)
	|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабличнаяЧасть.Ссылка.Организация КАК Организация,
	|	ТабличнаяЧасть.Ссылка КАК ДокументРаспределения,
	|	ТабличнаяЧасть.ПартияПроизводства.Документ КАК ПроизводствоБезЗаказа
	|ИЗ
	|	Документ.НачальныеОстаткиНЗППоПартиямПроизводства.Трудозатраты КАК ТабличнаяЧасть
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = ТабличнаяЧасть.ПартияПроизводства.Документ
	|		
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сторно КАК ДокументСторно
	|		ПО ДокументСторно.СторнируемыйДокумент = ПроизводствоБезЗаказа.Ссылка
	|		И ДокументСторно.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ)
	|		И ДокументСторно.Проведен
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка.Проведен
	|	И ТабличнаяЧасть.Ссылка.Организация В(&МассивОрганизаций)
	|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабличнаяЧасть.Ссылка.Организация КАК Организация,
	|	ТабличнаяЧасть.Ссылка КАК ДокументРаспределения,
	|	ТабличнаяЧасть.ПартияПроизводства.Документ КАК ПроизводствоБезЗаказа
	|ИЗ
	|	Документ.НачальныеОстаткиНЗППоПартиямПроизводства.ПрочиеРасходы КАК ТабличнаяЧасть
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = ТабличнаяЧасть.ПартияПроизводства.Документ
	|		
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сторно КАК ДокументСторно
	|		ПО ДокументСторно.СторнируемыйДокумент = ПроизводствоБезЗаказа.Ссылка
	|		И ДокументСторно.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ)
	|		И ДокументСторно.Проведен
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка.Проведен
	|	И ТабличнаяЧасть.Ссылка.Организация В(&МассивОрганизаций)
	|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	//-- НЕ УТКА
	|";
	
	ИмяПоляОбъекта = "ДокументРаспределения";
	
	ИмяВременнойТаблицы = "ДокументыРаспределенияСНеактуальнымиПартиями";
	ШаблонТекстаОшибки  = НСтр("ru = 'Обнаружены документы распределения расходов, в которых указаны сторнированные документы производства без заказов, по организации ""%1"" за период %2';
								|en = 'Cost allocation documents were found, in which reversed backflush production document were specified, for company ""%1"" in the period %2'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация",  НСтр("ru = 'Организация';
												|en = 'Company'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить(ИмяПоляОбъекта, НСтр("ru = 'Документ распределения';
												|en = 'Allocation document'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ПроизводствоБезЗаказа", НСтр("ru = 'Партия производства';
														|en = 'Production lot'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(ИмяВременнойТаблицы,
		ШаблонТекстаОшибки,
		СписокПолей,
		ИмяПоляОбъекта);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(ПараметрыПроверки, ПараметрыРегистрации, ТекстЗапроса);
	
КонецПроцедуры

Процедура ПроверкаАктуальностиУказанныхПартийПроизводства(ПараметрыПроверки) Экспорт
	
	ТекстЗапроса = " 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Распределение.Ссылка.Организация КАК Организация,
	|	Распределение.Ссылка КАК ДокументРаспределения,
	|	Распределение.ПартияПроизводства КАК ПартияПроизводства
	|
	|ПОМЕСТИТЬ ДокументыРаспределенияСНеактуальнымиПартиями
	|ИЗ
	|	Документ.РаспределениеПрочихЗатрат.ПартииПроизводства КАК Распределение
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = Распределение.ПартияПроизводства
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = СпрПартииПроизводства.Документ
	|		И ПроизводствоБезЗаказа.НомерГруппыЗатрат = СпрПартииПроизводства.Код
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|ГДЕ
	|	Распределение.Ссылка.Проведен
	|	И Распределение.Ссылка.Организация В(&МассивОрганизаций)
	|	И Распределение.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ПроизводствоБезЗаказа)
	|	И ПроизводствоБезЗаказа.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Распределение.Ссылка.Организация КАК Организация,
	|	Распределение.Ссылка КАК ДокументРаспределения,
	|	Распределение.ПартияПроизводства КАК ПартияПроизводства
	|ИЗ
	|	Документ.РаспределениеПроизводственныхЗатрат.ПартииПроизводства КАК Распределение
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = Распределение.ПартияПроизводства
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = СпрПартииПроизводства.Документ
	|		И ПроизводствоБезЗаказа.НомерГруппыЗатрат = СпрПартииПроизводства.Код
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|ГДЕ
	|	Распределение.Ссылка.Проведен
	|	И Распределение.Ссылка.Организация В(&МассивОрганизаций)
	|	И Распределение.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ПроизводствоБезЗаказа)
	|	И ПроизводствоБезЗаказа.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Распределение.Ссылка.Организация КАК Организация,
	|	Распределение.Ссылка КАК ДокументРаспределения,
	|	Распределение.ПартияПроизводства КАК ПартияПроизводства
	|ИЗ
	|	Документ.РаспределениеВозвратныхОтходов.ПартииПроизводства КАК Распределение
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = Распределение.ПартияПроизводства
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = СпрПартииПроизводства.Документ
	|		И ПроизводствоБезЗаказа.НомерГруппыЗатрат = СпрПартииПроизводства.Код
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|ГДЕ
	|	Распределение.Ссылка.Проведен
	|	И Распределение.Ссылка.Организация В(&МассивОрганизаций)
	|	И Распределение.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ПроизводствоБезЗаказа)
	|	И ПроизводствоБезЗаказа.Ссылка ЕСТЬ NULL
	|
	//++ НЕ УТКА
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабличнаяЧасть.Ссылка.Организация КАК Организация,
	|	ТабличнаяЧасть.Ссылка КАК ДокументРаспределения,
	|	ТабличнаяЧасть.ПартияПроизводства КАК ПартияПроизводства
	|ИЗ
	|	Документ.НачальныеОстаткиНЗППоПартиямПроизводства.МатериалыИРаботы КАК ТабличнаяЧасть
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ТабличнаяЧасть.ПартияПроизводства
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = СпрПартииПроизводства.Документ
	|		И ПроизводствоБезЗаказа.НомерГруппыЗатрат = СпрПартииПроизводства.Код
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка.Проведен
	|	И ТабличнаяЧасть.Ссылка.Организация В(&МассивОрганизаций)
	|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ПроизводствоБезЗаказа)
	|	И ПроизводствоБезЗаказа.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабличнаяЧасть.Ссылка.Организация КАК Организация,
	|	ТабличнаяЧасть.Ссылка КАК ДокументРаспределения,
	|	ТабличнаяЧасть.ПартияПроизводства КАК ПартияПроизводства
	|ИЗ
	|	Документ.НачальныеОстаткиНЗППоПартиямПроизводства.Трудозатраты КАК ТабличнаяЧасть
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ТабличнаяЧасть.ПартияПроизводства
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = СпрПартииПроизводства.Документ
	|		И ПроизводствоБезЗаказа.НомерГруппыЗатрат = СпрПартииПроизводства.Код
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка.Проведен
	|	И ТабличнаяЧасть.Ссылка.Организация В(&МассивОрганизаций)
	|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ПроизводствоБезЗаказа)
	|	И ПроизводствоБезЗаказа.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабличнаяЧасть.Ссылка.Организация КАК Организация,
	|	ТабличнаяЧасть.Ссылка КАК ДокументРаспределения,
	|	ТабличнаяЧасть.ПартияПроизводства КАК ПартияПроизводства
	|ИЗ
	|	Документ.НачальныеОстаткиНЗППоПартиямПроизводства.ПрочиеРасходы КАК ТабличнаяЧасть
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ТабличнаяЧасть.ПартияПроизводства
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = СпрПартииПроизводства.Документ
	|		И ПроизводствоБезЗаказа.НомерГруппыЗатрат = СпрПартииПроизводства.Код
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка.Проведен
	|	И ТабличнаяЧасть.Ссылка.Организация В(&МассивОрганизаций)
	|	И ТабличнаяЧасть.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ПроизводствоБезЗаказа)
	|	И ПроизводствоБезЗаказа.Ссылка ЕСТЬ NULL
	//-- НЕ УТКА
	|";
	
	ИмяПоляОбъекта = "ДокументРаспределения";
	
	ИмяВременнойТаблицы = "ДокументыРаспределенияСНеактуальнымиПартиями";
	ШаблонТекстаОшибки  = НСтр("ru = 'Обнаружены документы, в которых указаны неактуальные партии производства, по организации ""%1"" за период %2';
								|en = 'Documents with irrelevant production lots for ""%1"" company for the %2 period are found'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация",  НСтр("ru = 'Организация';
												|en = 'Company'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить(ИмяПоляОбъекта, НСтр("ru = 'Документ';
												|en = 'Document'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ПартияПроизводства", НСтр("ru = 'Партия производства';
													|en = 'Production lot'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(ИмяВременнойТаблицы,
		ШаблонТекстаОшибки,
		СписокПолей,
		ИмяПоляОбъекта);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(ПараметрыПроверки, ПараметрыРегистрации, ТекстЗапроса);
	
КонецПроцедуры

Процедура ПроверкаПравильностиУказанияСтатейКалькуляцийДляПобочногоВыхода(ПараметрыПроверки) Экспорт
	
	ТекстЗапроса = " 
	|ВЫБРАТЬ
	|	Движения.Организация КАК Организация,
	|	Движения.Регистратор КАК ДокументВыпуска,
	|	Движения.АналитикаУчетаНоменклатуры.СтатьяКалькуляции КАК СтатьяКалькуляции
	|
	|ПОМЕСТИТЬ ДокументыСНеправильнымиСтатьямиКалькуляции
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Движения
	|ГДЕ
	|	Движения.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Движения.Организация В(&МассивОрганизаций)
	|	И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|	И Движения.Количество <> 0
	|	И Движения.АналитикаУчетаНоменклатуры.СтатьяКалькуляции <>
	|		ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПолуфабрикатыПроизводимыеВПроцессе)
	|	И НЕ Движения.РасчетПартий
	|	И НЕ Движения.РасчетСебестоимости
	|
	|СГРУППИРОВАТЬ ПО
	|	Движения.Организация,
	|	Движения.Регистратор,
	|	Движения.АналитикаУчетаНоменклатуры.СтатьяКалькуляции
	|
	|ИМЕЮЩИЕ
	|	СУММА(Движения.Количество) = 0
	|";
	
	ИмяПоляОбъекта = "ДокументВыпуска";
	
	ИмяВременнойТаблицы = "ДокументыСНеправильнымиСтатьямиКалькуляции";
	ШаблонТекстаОшибки  = НСтр("ru = 'Обнаружены документы, в которых указаны одинаковые статьи калькуляции для материалов и для побочного выхода по фиксированной стоимости, по организации ""%1"" за период %2.
		|Укажите статью калькуляции с типом затрат ""Возвратные отходы"" для побочного выхода по фиксированной стоимости.';
		|en = 'Documents with specified identical product cost elements for materials and side product at a fixed cost are detected in the ""%1"" company for the %2 period.
		|Specify the product cost element with the ""Recyclable waste"" expense type for the side product at a fixed cost.'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация",  НСтр("ru = 'Организация';
												|en = 'Company'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить(ИмяПоляОбъекта, НСтр("ru = 'Документ';
												|en = 'Document'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("СтатьяКалькуляции", НСтр("ru = 'Статья калькуляции';
													|en = 'Product cost element'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(ИмяВременнойТаблицы,
		ШаблонТекстаОшибки,
		СписокПолей,
		ИмяПоляОбъекта);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(ПараметрыПроверки, ПараметрыРегистрации, ТекстЗапроса);
	
КонецПроцедуры

Процедура ПроверкаПравильностиУказанияГруппПродукцииВПартияхПроизводства(ПараметрыПроверки) Экспорт
	
	ТекстЗапроса = " 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочиеРасходыНЗП.Организация КАК Организация,
	|	ПрочиеРасходыНЗП.Регистратор КАК Документ,
	|	ПрочиеРасходыНЗП.ПартияПроизводства КАК ПартияПроизводства
	|
	|ПОМЕСТИТЬ ПартииСУказаниемГруппПродукции
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНЗП
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ПрочиеРасходыНЗП.ПартияПроизводства
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыАналитическогоУчетаНоменклатуры КАК ГруппыПродукции
	|		ПО ПартияПроизводства.ГруппаПродукции = ГруппыПродукции.Ссылка
	|ГДЕ
	|	ПрочиеРасходыНЗП.Активность
	|	И ПрочиеРасходыНЗП.Организация В(&МассивОрганизаций)
	|	И ПрочиеРасходыНЗП.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ГруппыПродукции.Ссылка ЕСТЬ NULL";
	
	ИмяПоляОбъекта = "Документ";
	
	ИмяВременнойТаблицы = "ПартииСУказаниемГруппПродукции";
	ШаблонТекстаОшибки  = НСтр("ru = 'Обнаружены партии производства, использующие группы продукции, несмотря на отключенную опцию учета по группам продукции в организации ""%1"" за период %2';
								|en = 'Manufactured product groups are disabled in ""%1"" company for period %2 but still there are production lots, in which manufactured product groups are used'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация",  НСтр("ru = 'Организация';
												|en = 'Company'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить(ИмяПоляОбъекта, НСтр("ru = 'Документ';
												|en = 'Document'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ПартияПроизводства", НСтр("ru = 'Партия производства';
													|en = 'Production lot'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(ИмяВременнойТаблицы,
		ШаблонТекстаОшибки,
		СписокПолей,
		ИмяПоляОбъекта);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(ПараметрыПроверки, ПараметрыРегистрации, ТекстЗапроса);
	
КонецПроцедуры

#КонецОбласти

//-- НЕ УТ

#Область НастройкаРаспределенияРасходов

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - см. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_НастройкаРаспределенияРасходов(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.НастройкаРаспределенияРасходов);
	НоваяСтрока.ТекстВыполнить = НСтр("ru = 'Выполнить';
										|en = 'Execute'");
	НоваяСтрока.ТекстПодробнее = ЗакрытиеМесяцаСервер.ТекстПодробнееПоУмолчанию();
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"ЗатратыСервер.Использование_НастройкаРаспределенияРасходов");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ВыполнитьРасчет(
		"ЗатратыСервер.Выполнить_НастройкаРаспределенияРасходов");
	НоваяСтрока.ДействиеПодробнее = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Документы.РаспределениеПрочихЗатрат.Формы.ФормаРабочееМесто.ПолноеИмя());
	// Доп. параметры формы.
	НоваяСтрока.ДействиеПодробнее.ПараметрыФормы.Вставить("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	НоваяСтрока.ДействиеПодробнее.ПараметрыФормы.Вставить("Состояние", Перечисления.СостоянияРаспределенияРасходов.ТребуетсяСформироватьДокумент);
	НоваяСтрока.ВыполняетсяПриПредварительномЗакрытииМесяца = Истина;
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_НастройкаРаспределенияРасходов(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	ЗакрытиеМесяцаСервер.ИнициализироватьЗапрос(Запрос, ПараметрыОбработчика);
	
	ВариантыРаспределения = Новый Массив();
	//++ НЕ УТ
	ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты);
	ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства);
	Если (ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат")) Тогда
		ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат);
	КонецЕсли;
	//-- НЕ УТ
	Если РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22(ПараметрыОбработчика.ПараметрыРасчета.ПериодРегистрации) Тогда
		ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров);
	КонецЕсли;
	
	Если ВариантыРаспределения.Количество() = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Нет данных для распределения расходов.';
				|en = 'No data for cost allocation.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		Возврат;
	
	КонецЕсли;

	ПараметрыЗапроса = Документы.РаспределениеПрочихЗатрат.ОписаниеПараметровЗапросаПолученияДанныхДляРаспределения();
	ПараметрыЗапроса.Состояние = Перечисления.СостоянияРаспределенияРасходов.ТребуетсяСформироватьДокумент;
	ПараметрыЗапроса.ВариантРаспределения = ВариантыРаспределения;
	ПараметрыЗапроса.ИсключитьТранспортныеРасходы = Истина;
	Документы.РаспределениеПрочихЗатрат.ИнициализироватьЗапросПолученияДанныхДляРаспределения(Запрос, ПараметрыЗапроса);
	
	Запрос.Текст = Документы.РаспределениеПрочихЗатрат.ТекстЗапросаДанныеДляРаспределения(, Истина);
	
	Запрос.Выполнить();	
	
	РазмерыВременныхТаблиц = ЗакрытиеМесяцаСервер.РазмерыВременныхТаблиц(Запрос, ПараметрыОбработчика);
	
	Если РазмерыВременныхТаблиц.ВТДанныеДляРаспределения = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Нет данных для распределения расходов.';
				|en = 'No data for cost allocation.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		Возврат;
		
	КонецЕсли;
	
	Если РазмерыВременныхТаблиц.СостояниеРаспределенияРасходов = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Все расходы полностью распределены.';
				|en = 'All expenses have been fully allocated.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Выполнить_НастройкаРаспределенияРасходов(ПараметрыОбработчика) Экспорт
	
	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	
	ВариантыРаспределения = Новый Массив;
	//++ НЕ УТ
	ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты);
	ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства);
	Если (ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат")) Тогда
		ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат);
	КонецЕсли;
	//-- НЕ УТ
	Если РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22(ПараметрыРасчета.ПериодРегистрации) Тогда
		ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров);
	КонецЕсли;
	
	Если ВариантыРаспределения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	СтатьиКРаспределению = Документы.РаспределениеПрочихЗатрат.СтатьиКРаспределению(
		ПараметрыРасчета.ПериодРегистрации,
		ПараметрыРасчета.МассивОрганизаций,
		Новый Массив,
		Перечисления.СостоянияРаспределенияРасходов.ТребуетсяСформироватьДокумент,
		ВариантыРаспределения);
		
	Если СтатьиКРаспределению.Количество() = 0 Тогда // нет данных для распределения
		Возврат;
	КонецЕсли;
	
	СтатьиКРаспределению.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	СтатьиКРаспределению.Колонки.Добавить("ИДСтроки", Новый ОписаниеТипов("Число"));
	СтатьиКРаспределению.ЗаполнитьЗначения(КонецМесяца(ПараметрыРасчета.ПериодРегистрации), "Дата");
	
	ПараметрыРаспределения = Новый Структура("ПараметрыРасходов", СтатьиКРаспределению);
	
	Попытка
		РезультатыФормирования = Документы.РаспределениеПрочихЗатрат.СформироватьДокументы(ПараметрыРаспределения, Неопределено);
	Исключение
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось создать документы распределения за период %1. Необходимость возникла из-за ошибки:
				|%2';
				|en = 'Cannot generate allocation document for the period %1. It is needed due to the error:
				|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
			РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
			ПараметрыОбработчика,
			ТекстОшибки);
		
	КонецПопытки;
	
	Для Каждого РезультатПоОрганизации Из РезультатыФормирования Цикл
		
		ДетализацияФормирования = РезультатПоОрганизации.Значение;
		
		Если Не ДетализацияФормирования.ОписаниеОшибок.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ОписаниеОшибки Из ДетализацияФормирования.ОписаниеОшибок Цикл
			ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
				ПараметрыОбработчика,
				ОписаниеОшибки.ТекстОшибки,
				РезультатПоОрганизации.Ключ,
				,
				,
				ОписаниеОшибки.СтатьяРасходов);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверки состояния системы, относящиеся к этапу.

Процедура ОписаниеПроверок_НастройкаРаспределенияРасходов(ТаблицаПроверок) Экспорт
	
	// Настройка распределения расходов.
	ОписаниеПроверки = ЗакрытиеМесяцаСервер.ДобавитьОписаниеНовойПроверки(ТаблицаПроверок,
		"НеВыполненаНастройкаРаспределенияРасходов",
		Перечисления.ОперацииЗакрытияМесяца.НастройкаРаспределенияРасходов,
		Перечисления.МоментЗапускаПроверкиОперацииЗакрытияМесяца.ДоИПослеРасчета,
		"ЗатратыСервер.ПроверкаНеобходимостиНастройкиРаспределенияРасходов");
	
	ЗакрытиеМесяцаСервер.ЗаполнитьПредставлениеНовойПроверки(ОписаниеПроверки,
		НСтр("ru = 'Не выполненные настройки распределения расходов';
			|en = 'Not executed cost allocation settings'", ОбщегоНазначения.КодОсновногоЯзыка()),
		НСтр("ru = 'Все расходы должны быть распределены.';
			|en = 'All expenses should be allocated.'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
КонецПроцедуры

// Проверка необходимости настройки распределения расходов.
//
// Параметры:
//	ПараметрыПроверки - см. АудитСостоянияСистемы.ИнициализироватьПараметрыПроверки
//
Процедура ПроверкаНеобходимостиНастройкиРаспределенияРасходов(ПараметрыПроверки) Экспорт
	
	Если НЕ ЗакрытиеМесяцаСервер.ПроверкаВыполняетсяМеханизмомЗакрытияМесяца(ПараметрыПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПроверки.ДополнительныеПараметры.АвтоматическоеТестирование Тогда
		Возврат;
	КонецЕсли;
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", 			НСтр("ru = 'Организация';
														|en = 'Company'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Подразделение", 			НСтр("ru = 'Подразделение';
															|en = 'Business unit'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("НаправлениеДеятельности", НСтр("ru = 'Направление деятельности';
														|en = 'Line of business'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("СтатьяРасходов", 			НСтр("ru = 'Статья расходов';
															|en = 'Expense item'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("АналитикаРасходов", 		НСтр("ru = 'Аналитика расходов';
															|en = 'Expense dimension'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(
		"СостояниеРаспределенияРасходов",
		НСтр("ru = 'Требуется сформировать документы распределения расходов по организации ""%1"" в периоде %2';
			|en = 'Generate cost allocation documents for the ""%1"" company in the %2 period'", ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(
	 	ПараметрыПроверки,
		ПараметрыРегистрации);
		
КонецПроцедуры

#КонецОбласти

#Область НастройкаРаспределенияРасходовВручную

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - см. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_НастройкаРаспределенияРасходовВручную(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.НастройкаРаспределенияРасходовВручную);
	НоваяСтрока.ВыполняетсяВручную = Истина;
	НоваяСтрока.ТекстВыполнить = НСтр("ru = 'Ввести';
										|en = 'Enter'");
	НоваяСтрока.ТекстПодробнее = ЗакрытиеМесяцаСервер.ТекстПодробнееПоУмолчанию();
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"ЗатратыСервер.Использование_НастройкаРаспределенияРасходовВручную");
	НоваяСтрока.ДействиеВыполнить = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Документы.РаспределениеПрочихЗатрат.Формы.ФормаРабочееМесто.ПолноеИмя());
	// Доп. параметры формы.
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("Состояние", Перечисления.СостоянияРаспределенияРасходов.ТребуетсяРучнойВводДокумента);

	НоваяСтрока.ДействиеПодробнее = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Документы.РаспределениеПрочихЗатрат.Формы.ФормаРабочееМесто.ПолноеИмя());
	// Доп. параметры формы.
	НоваяСтрока.ДействиеПодробнее.ПараметрыФормы.Вставить("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	НоваяСтрока.ДействиеПодробнее.ПараметрыФормы.Вставить("Состояние", Перечисления.СостоянияРаспределенияРасходов.ТребуетсяРучнойВводДокумента);
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_НастройкаРаспределенияРасходовВручную(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	ЗакрытиеМесяцаСервер.ИнициализироватьЗапрос(Запрос, ПараметрыОбработчика);
	
	ВариантыРаспределения = Новый Массив();
	//++ НЕ УТ
	ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты);
	ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства);
	Если (ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат")) Тогда
		ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат);
	КонецЕсли;
	//-- НЕ УТ
	Если РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22(ПараметрыОбработчика.ПараметрыРасчета.ПериодРегистрации) Тогда
		ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров);
	КонецЕсли;
	
	Если ВариантыРаспределения.Количество() = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Нет данных для распределения расходов.';
				|en = 'No data for cost allocation.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		Возврат;
	
	КонецЕсли;

	ПараметрыЗапроса = Документы.РаспределениеПрочихЗатрат.ОписаниеПараметровЗапросаПолученияДанныхДляРаспределения();
	ПараметрыЗапроса.Состояние = Перечисления.СостоянияРаспределенияРасходов.ТребуетсяРучнойВводДокумента;
	ПараметрыЗапроса.ВариантРаспределения = ВариантыРаспределения;
	ПараметрыЗапроса.ИсключитьТранспортныеРасходы = Истина;
	Документы.РаспределениеПрочихЗатрат.ИнициализироватьЗапросПолученияДанныхДляРаспределения(Запрос, ПараметрыЗапроса);
	
	Запрос.Текст = Документы.РаспределениеПрочихЗатрат.ТекстЗапросаДанныеДляРаспределения(, Истина);
	
	Запрос.Выполнить();	
	
	РазмерыВременныхТаблиц = ЗакрытиеМесяцаСервер.РазмерыВременныхТаблиц(Запрос, ПараметрыОбработчика);
	
	Если РазмерыВременныхТаблиц.ВТДанныеДляРаспределения = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Нет данных для распределения расходов.';
				|en = 'No data for cost allocation.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		Возврат;
		
	КонецЕсли;
	
	Если РазмерыВременныхТаблиц.СостояниеРаспределенияРасходов = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Все производственные расходы полностью распределены по статьям калькуляции.';
				|en = 'All production expenses are completely allocated to product cost elements.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;
	
КонецПроцедуры

// Проверки состояния системы, относящиеся к этапу.

Процедура ОписаниеПроверок_НастройкаРаспределенияРасходовВручную(ТаблицаПроверок) Экспорт
	
	// Настройка распределения расходов.
	ОписаниеПроверки = ЗакрытиеМесяцаСервер.ДобавитьОписаниеНовойПроверки(ТаблицаПроверок,
		"НеВыполненаНастройкаРаспределенияРасходовВручную",
		Перечисления.ОперацииЗакрытияМесяца.НастройкаРаспределенияРасходовВручную,
		Перечисления.МоментЗапускаПроверкиОперацииЗакрытияМесяца.ДоРасчета,
		"ЗатратыСервер.ПроверкаНеобходимостиНастройкиРаспределенияРасходовВручную");
	
	ЗакрытиеМесяцаСервер.ЗаполнитьПредставлениеНовойПроверки(ОписаниеПроверки,
		НСтр("ru = 'Не внесены настройки распределения расходов, требующие ручной ввод';
			|en = 'Expense allocation settings that require manual entry have not been made'", ОбщегоНазначения.КодОсновногоЯзыка()),
		НСтр("ru = 'Все производственные расходы должны быть полностью распределены';
			|en = 'All production costs must be fully allocated'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
КонецПроцедуры

Процедура ПроверкаНеобходимостиНастройкиРаспределенияРасходовВручную(ПараметрыПроверки) Экспорт
	
	Если НЕ ЗакрытиеМесяцаСервер.ПроверкаВыполняетсяМеханизмомЗакрытияМесяца(ПараметрыПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", 			НСтр("ru = 'Организация';
														|en = 'Company'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Подразделение", 			НСтр("ru = 'Подразделение';
															|en = 'Business unit'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("НаправлениеДеятельности", НСтр("ru = 'Направление деятельности';
														|en = 'Line of business'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("СтатьяРасходов", 			НСтр("ru = 'Статья расходов';
															|en = 'Expense item'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("АналитикаРасходов", 		НСтр("ru = 'Аналитика расходов';
															|en = 'Expense dimension'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(
		"СостояниеРаспределенияРасходов",
		НСтр("ru = 'Обнаружены статьи расходов, требующие ручной настройки распределения, по организации ""%1"" на конец периода %2';
			|en = 'Expense items were detected that require manual allocation configuration for the ""%1"" company as of the end of %2 period'", ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(
	 	ПараметрыПроверки,
		ПараметрыРегистрации);
		
КонецПроцедуры

#КонецОбласти

//++ НЕ УТ

#Область РаспределениеМатериаловИРаботНаСебестоимостьПродукции22

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - см. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_РаспределениеМатериаловИРаботНаСебестоимостьПродукции22(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.РаспределениеМатериаловИРаботНаСебестоимостьПродукции22);
	НоваяСтрока.ВыполняетсяВручную = Истина;
	НоваяСтрока.ДействиеОформление = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"ЗатратыСервер.Оформление_РаспределениеМатериаловИРаботНаСебестоимостьПродукции22");
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"ЗатратыСервер.Использование_РаспределениеМатериаловИРаботНаСебестоимостьПродукции22");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Документы.РаспределениеПроизводственныхЗатрат.Формы.ФормаРаспределениеМатериаловИРабот.ПолноеИмя());
	// Доп. параметры формы.
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("Состояние",     		     		"ТребуетсяРаспределить");
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("Подразделение", 		     		Справочники.СтруктураПредприятия.ПустаяСсылка());
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("ОформитьПроизводствоБезЗаказов", Ложь);
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_РаспределениеМатериаловИРаботНаСебестоимостьПродукции22(ПараметрыОбработчика) Экспорт
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство") Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеОтключено(
			ПараметрыОбработчика,
			НСтр("ru = 'Учет производственных операций не ведется';
				|en = 'Production operation accounting is not kept'", ОбщегоНазначения.КодОсновногоЯзыка()));
			
		Возврат;
		
	КонецЕсли;
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	НастройкиПроизводства = ПроизводствоСервер.НастройкиПодсистемыПроизводство();
	
	Если НЕ НастройкиПроизводства.ИспользуетсяПроизводство22 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Не используется управление производством (версия 2.2)';
				|en = 'Production management, version 2.2 is not used'", ОбщегоНазначения.КодОсновногоЯзыка()));
			
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ЗакрытиеМесяцаСервер.ИнициализироватьЗапрос(Запрос, ПараметрыОбработчика);
	
	Запрос.Текст = Документы.РаспределениеПроизводственныхЗатрат.ТекстЗапросаМатериаловИРаботВКладовых(Истина);
	
	// Доп. параметры запроса.
	Запрос.УстановитьПараметр("ВсеДвижения",             Истина);
	Запрос.УстановитьПараметр("НачалоПериода",  	     Запрос.Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода",  	     Запрос.Параметры.КонецПериода);
	Запрос.УстановитьПараметр("ГраницаОкончаниеПериода", Запрос.Параметры.ГраницаКонецПериода);
	Запрос.УстановитьПараметр("ВсеОрганизации",	         Ложь);
	Запрос.УстановитьПараметр("Организации",       	     Запрос.Параметры.МассивОрганизаций);
	Запрос.УстановитьПараметр("ВсеПодразделения",  	     Истина);
	Запрос.УстановитьПараметр("Подразделения",     	     Новый Массив);
	Запрос.УстановитьПараметр("ВсеТипыНоменклатуры",     Истина);
	Запрос.УстановитьПараметр("ТипНоменклатуры",         Неопределено);
	Запрос.УстановитьПараметр("ВсеАналитики",	           Истина);
	Запрос.УстановитьПараметр("АналитикаУчетаНоменклатуры",Неопределено);
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДД.Организация
	|ПОМЕСТИТЬ ДвиженияМатериаловВПроизводстве
	|ИЗ
	|	РегистрНакопления.МатериалыИРаботыВПроизводстве КАК ДД
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|	И ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Активность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатериалыИРаботы.Организация,
	|	МатериалыИРаботы.Подразделение,
	|	МатериалыИРаботы.Номенклатура,
	|	МатериалыИРаботы.Характеристика,
	|	МатериалыИРаботы.Серия,
	|	МатериалыИРаботы.Распределить КАК Количество
	|ПОМЕСТИТЬ ВТНераспределенныеМатериалыИРаботы
	|ИЗ
	|	МатериалыИРаботы КАК МатериалыИРаботы
	|ГДЕ
	|	МатериалыИРаботы.Распределить > 0
	|	И МатериалыИРаботы.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МатериалыИРаботы.Организация,
	|	МатериалыИРаботы.Подразделение,
	|	МатериалыИРаботы.Номенклатура,
	|	МатериалыИРаботы.Характеристика,
	|	МатериалыИРаботы.Серия,
	|	МатериалыИРаботы.Распределить КАК Количество
	|ИЗ
	|	МатериалыИРаботы КАК МатериалыИРаботы
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияМатериаловВПроизводстве КАК ДвиженияМатериаловВПроизводстве
	|	ПО МатериалыИРаботы.Организация = ДвиженияМатериаловВПроизводстве.Организация
	|ГДЕ
	|	МатериалыИРаботы.Распределить > 0
	|	И МатериалыИРаботы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|	И ДвиженияМатериаловВПроизводстве.Организация ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатериалыИРаботы.Организация
	|ПОМЕСТИТЬ ВТРаспределенныеМатериалыИРаботы
	|ИЗ
	|	МатериалыИРаботы КАК МатериалыИРаботы
	|ГДЕ
	|	МатериалыИРаботы.Распределено > 0";
	
	Запрос.Выполнить();
	
	РазмерыВременныхТаблиц = ЗакрытиеМесяцаСервер.РазмерыВременныхТаблиц(Запрос, ПараметрыОбработчика);
	
	Если РазмерыВременныхТаблиц.ВТНераспределенныеМатериалыИРаботы = 0
	 И РазмерыВременныхТаблиц.ВТРаспределенныеМатериалыИРаботы = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Нет материалов и работ для распределения на этапы производства';
				|en = 'No materials or works to allocate to production stages'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;
	
КонецПроцедуры



// Оформление операции в закрытии месяца.
// 
// Параметры:
// 	ПараметрыОбработчика - см. Обработки.ОперацииЗакрытияМесяца.ИнициализироватьПараметрыОбработчикаЭтапа
Процедура Оформление_РаспределениеМатериаловИРаботНаСебестоимостьПродукции22(ПараметрыОбработчика) Экспорт
	
	НастройкиПроизводства = ПроизводствоСервер.НастройкиПодсистемыПроизводство();
	
	Если НЕ (НастройкиПроизводства.ИспользуетсяПроизводство21 И НастройкиПроизводства.ИспользуетсяПроизводство22) Тогда
		ПараметрыОбработчика.ДанныеЭтапа.Наименование = НСтр("ru = 'Распределение материалов и работ на себестоимость продукции';
															|en = 'Material and labor allocation to product cost'");
	КонецЕсли;
	
	ПараметрыОбработчика.ДанныеЭтапа.ТекстВыполнить = НСтр("ru = 'Распределить';
															|en = 'Allocate'");
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика);
	
КонецПроцедуры

// Проверки состояния системы, относящиеся к этапу.

Процедура ОписаниеПроверок_РаспределениеМатериаловИРаботНаСебестоимостьПродукции22(ТаблицаПроверок) Экспорт
	
	// Распределение материалов и работ на себестоимость продукции (2.2).
	ОписаниеПроверки = ЗакрытиеМесяцаСервер.ДобавитьОписаниеНовойПроверки(ТаблицаПроверок,
		"НеРаспределеныМатериалыИРаботыНаСебестоимостьПродукции22",
		Перечисления.ОперацииЗакрытияМесяца.РаспределениеМатериаловИРаботНаСебестоимостьПродукции22,
		Перечисления.МоментЗапускаПроверкиОперацииЗакрытияМесяца.ДоИПослеРасчета,
		"ЗатратыСервер.ПроверкаНеобходимостиРаспределенияМатериаловИРаботНаСебестоимостьПродукции22");
	
	ЗакрытиеМесяцаСервер.ЗаполнитьПредставлениеНовойПроверки(ОписаниеПроверки,
		НСтр("ru = 'Не распределенные материалы (работы) на этапы производства';
			|en = 'Non-allocated materials (works) to production stages'", ОбщегоНазначения.КодОсновногоЯзыка()),
		НСтр("ru = 'Должно быть оформлено распределение всех материалов и работ на этапы производства документами ""Распределение материалов и работ"".';
			|en = 'Allocation of all materials and works to production stages should be registered with the ""Allocation of materials and works"" documents.'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
КонецПроцедуры

Процедура ПроверкаНеобходимостиРаспределенияМатериаловИРаботНаСебестоимостьПродукции22(ПараметрыПроверки) Экспорт
	
	Если НЕ ЗакрытиеМесяцаСервер.ПроверкаВыполняетсяМеханизмомЗакрытияМесяца(ПараметрыПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", 	НСтр("ru = 'Организация';
												|en = 'Company'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Подразделение", 	НСтр("ru = 'Подразделение';
													|en = 'Business unit'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Номенклатура", 	НСтр("ru = 'Номенклатура';
													|en = 'Items'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Характеристика", 	НСтр("ru = 'Характеристика';
													|en = 'Variant'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Серия", 			НСтр("ru = 'Серия';
													|en = 'Batch'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Количество",		НСтр("ru = 'Количество';
													|en = 'Quantity'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(
		"ВТНераспределенныеМатериалыИРаботы",
		НСтр("ru = 'Обнаружены не распределенные на этапы производства материалы (работы) организации ""%1"" на конец периода %2';
			|en = 'Materials (works) not allocated for production stages are detected for the ""%1"" company as of the end of %2 period'", ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(
	 	ПараметрыПроверки,
		ПараметрыРегистрации);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - см. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции);
	НоваяСтрока.ВыполняетсяВручную = Истина;
	НоваяСтрока.ТекстВыполнить = НСтр("ru = 'Настроить';
										|en = 'Customize'");
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"ЗатратыСервер.Использование_НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Справочники.ПравилаРаспределенияРасходов.Формы.ФормаСпискаВручную.ПолноеИмя());
	// Доп. параметры формы.
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("ТолькоНезаполненные", Истина);
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	ЗакрытиеМесяцаСервер.ИнициализироватьЗапрос(Запрос, ПараметрыОбработчика);
	ПараметрыЗапроса = Документы.РаспределениеПрочихЗатрат.ОписаниеПараметровЗапросаПолученияДанныхДляРаспределения();
	Документы.РаспределениеПрочихЗатрат.ИнициализироватьЗапросПолученияДанныхДляРаспределения(Запрос, ПараметрыЗапроса);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТИспользуемыеПоказатели
	|ИЗ
	|	Документ.РаспределениеПрочихЗатрат КАК ДД
	|ГДЕ
	|	ДД.Проведен
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Организация В (&МассивОрганизаций)
	|	И ДД.НазначениеНастройкиРаспределения В (
	|		ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеСтатейРасходовПоЭтапамПроизводства),
	|		ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеСтатейРасходовПоПодразделениям)
	|	)
	|	И ДД.БазаРаспределенияПоПодразделениям В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении)
	|	)";
	
	Запрос.Выполнить();	
	
	Если ЗакрытиеМесяцаСервер.РазмерВременнойТаблицы(Запрос, "ВТИспользуемыеПоказатели", ПараметрыОбработчика) = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Нет данных для распределения расходов.';
				|en = 'No data for cost allocation.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		Возврат;
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТНекорректныеПоказатели
	|ИЗ
	|	ВТИспользуемыеПоказатели КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаРаспределенияРасходов КАК Показатели
	|		ПО Показатели.Ссылка = Т.Показатель
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходов КАК ЗначенияЕжемесячно
	|		ПО Показатели.Ссылка = ЗначенияЕжемесячно.Показатель
	|		И (НАЧАЛОПЕРИОДА(ЗначенияЕжемесячно.Период, МЕСЯЦ) = &НачалоПериода)
	|ГДЕ
	|	Показатели.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно)
	|	И Показатели.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеСтатейРасходовПоПодразделениям)
	|	И ЗначенияЕжемесячно.Показатель ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Показатель
	|ИЗ
	|	ВТИспользуемыеПоказатели КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаРаспределенияРасходов КАК Показатели
	|		ПО Показатели.Ссылка = Т.Показатель
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходов.СрезПоследних(&КонецПериода,) КАК ЗначенияПриИзменении
	|		ПО Показатели.Ссылка = ЗначенияПриИзменении.Показатель
	|ГДЕ
	|	Показатели.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении)
	|	И Показатели.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеСтатейРасходовПоПодразделениям)
	|	И ЗначенияПриИзменении.Показатель ЕСТЬ NULL";
	
	Запрос.Выполнить();
	
	Если ЗакрытиеМесяцаСервер.РазмерВременнойТаблицы(Запрос, "ВТНекорректныеПоказатели", ПараметрыОбработчика) = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Все показатели распределения расходов настроены корректно.';
				|en = 'All cost allocation indicators are configured correctly.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;
	
КонецПроцедуры

// Проверки состояния системы, относящиеся к этапу.

Процедура ОписаниеПроверок_НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции(ТаблицаПроверок) Экспорт
	
	// Настройка показателей для распределения расходов на себестоимость продукции.
	ОписаниеПроверки = ЗакрытиеМесяцаСервер.ДобавитьОписаниеНовойПроверки(ТаблицаПроверок,
		"НеВыполненаНастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции",
		Перечисления.ОперацииЗакрытияМесяца.НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции,
		Перечисления.МоментЗапускаПроверкиОперацииЗакрытияМесяца.ДоИПослеРасчета,
		"ЗатратыСервер.ПроверкаНеобходимостиНастройкиПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции");
	
	ЗакрытиеМесяцаСервер.ЗаполнитьПредставлениеНовойПроверки(ОписаниеПроверки,
		НСтр("ru = 'Не заданные значения показателей распределения расходов';
			|en = 'Values of cost allocation indicators are not specified'", ОбщегоНазначения.КодОсновногоЯзыка()),
		НСтр("ru = 'Для показателей с базами распределения ""Вводится ежемесячно"" и ""Вводится при изменении"" должны быть заполнены значения в рассчитываемом периоде.';
			|en = 'Values in the calculated period should be calculated for indicators with the ""Entered monthly"" and ""Entered on change"" allocation bases.'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
КонецПроцедуры

Процедура ПроверкаНеобходимостиНастройкиПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции(ПараметрыПроверки) Экспорт
	
	Если НЕ ЗакрытиеМесяцаСервер.ПроверкаВыполняетсяМеханизмомЗакрытияМесяца(ПараметрыПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", НСтр("ru = 'Организация';
											|en = 'Company'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Показатель", 	НСтр("ru = 'Показатель';
												|en = 'Indicator'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(
		"ВТНекорректныеПоказатели",
		НСтр("ru = 'Обнаружены показатели, значения которых не заданы в периоде %2';
			|en = 'Indicators detected whose values were not specified in %2 period'", ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей,
		"Показатель");
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(
	 	ПараметрыПроверки,
		ПараметрыРегистрации);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - см. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	Если НЕ (ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат")) Тогда
		Возврат
	КонецЕсли;
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ);
	НоваяСтрока.ВыполняетсяВручную = Истина;
	НоваяСтрока.ТекстВыполнить = НСтр("ru = 'Настроить';
										|en = 'Customize'");
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"ЗатратыСервер.Использование_НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Справочники.ПравилаРаспределенияРасходов.Формы.ФормаСпискаВручную.ПолноеИмя());
	// Доп. параметры формы.
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("ТолькоНезаполненные", Истина);
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("НазначениеПравила", Перечисления.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаОВЗ);
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	ЗакрытиеМесяцаСервер.ИнициализироватьЗапрос(Запрос, ПараметрыОбработчика);
	ПараметрыЗапроса = Документы.РаспределениеПрочихЗатрат.ОписаниеПараметровЗапросаПолученияДанныхДляРаспределения();
	Документы.РаспределениеПрочихЗатрат.ИнициализироватьЗапросПолученияДанныхДляРаспределения(Запрос, ПараметрыЗапроса);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТИспользуемыеПоказатели
	|ИЗ
	|	Документ.РаспределениеПрочихЗатрат КАК ДД
	|ГДЕ
	|	ДД.Проведен
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Организация В (&МассивОрганизаций)
	|	И ДД.НазначениеНастройкиРаспределения = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаОВЗ)
	|	И ДД.БазаРаспределенияПоПодразделениям В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении)
	|	)";
	
	Запрос.Выполнить();	
	
	Если ЗакрытиеМесяцаСервер.РазмерВременнойТаблицы(Запрос, "ВТИспользуемыеПоказатели", ПараметрыОбработчика) = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Нет данных для распределения расходов.';
				|en = 'No data for cost allocation.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		Возврат;
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТНекорректныеПоказатели
	|ИЗ
	|	ВТИспользуемыеПоказатели КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаРаспределенияРасходов КАК Показатели
	|		ПО Показатели.Ссылка = Т.Показатель
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходовНаОВЗ КАК ЗначенияЕжемесячно
	|		ПО Показатели.Ссылка = ЗначенияЕжемесячно.Показатель
	|		И (НАЧАЛОПЕРИОДА(ЗначенияЕжемесячно.Период, МЕСЯЦ) = &НачалоПериода)
	|ГДЕ
	|	Показатели.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно)
	|	И Показатели.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаОВЗ)
	|	И ЗначенияЕжемесячно.Показатель ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Показатель
	|ИЗ
	|	ВТИспользуемыеПоказатели КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаРаспределенияРасходов КАК Показатели
	|		ПО Показатели.Ссылка = Т.Показатель
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходовНаОВЗ.СрезПоследних(&КонецПериода,) КАК ЗначенияПриИзменении
	|		ПО Показатели.Ссылка = ЗначенияПриИзменении.Показатель
	|ГДЕ
	|	Показатели.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении)
	|	И Показатели.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаОВЗ)
	|	И ЗначенияПриИзменении.Показатель ЕСТЬ NULL";
	
	Запрос.Выполнить();
	
	Если ЗакрытиеМесяцаСервер.РазмерВременнойТаблицы(Запрос, "ВТНекорректныеПоказатели", ПараметрыОбработчика) = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru = 'Все показатели распределения расходов настроены корректно.';
				|en = 'All cost allocation indicators are configured correctly.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;
	
КонецПроцедуры

// Проверки состояния системы, относящиеся к этапу.

Процедура ОписаниеПроверок_НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ(ТаблицаПроверок) Экспорт
	
	Если НЕ (ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат")) Тогда
		Возврат
	КонецЕсли;
	
	// Настройка показателей для распределения расходов на себестоимость продукции.
	ОписаниеПроверки = ЗакрытиеМесяцаСервер.ДобавитьОписаниеНовойПроверки(ТаблицаПроверок,
		"НеВыполненаНастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ",
		Перечисления.ОперацииЗакрытияМесяца.НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ,
		Перечисления.МоментЗапускаПроверкиОперацииЗакрытияМесяца.ДоИПослеРасчета,
		"ЗатратыСервер.ПроверкаНеобходимостиНастройкиПоказателейДляРаспределенияРасходовМеждуОВЗ");
	
	ЗакрытиеМесяцаСервер.ЗаполнитьПредставлениеНовойПроверки(ОписаниеПроверки,
		НСтр("ru = 'Не заданные значения показателей распределения расходов';
			|en = 'Values of cost allocation indicators are not specified'", ОбщегоНазначения.КодОсновногоЯзыка()),
		НСтр("ru = 'Для показателей с базами распределения ""Вводится ежемесячно"" и ""Вводится при изменении"" должны быть заполнены значения в рассчитываемом периоде.';
			|en = 'Values in the calculated period should be calculated for indicators with the ""Entered monthly"" and ""Entered on change"" allocation bases.'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
КонецПроцедуры

Процедура ПроверкаНеобходимостиНастройкиПоказателейДляРаспределенияРасходовМеждуОВЗ(ПараметрыПроверки) Экспорт
	
	Если НЕ ЗакрытиеМесяцаСервер.ПроверкаВыполняетсяМеханизмомЗакрытияМесяца(ПараметрыПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", НСтр("ru = 'Организация';
											|en = 'Company'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Показатель", 	НСтр("ru = 'Показатель';
												|en = 'Indicator'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(
		"ВТНекорректныеПоказатели",
		НСтр("ru = 'Обнаружены показатели, значения которых не заданы в периоде %2';
			|en = 'Indicators detected whose values were not specified in %2 period'", ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей,
		,
		Метаданные.РегистрыСведений.ЗначенияПоказателейДляРаспределенияРасходовНаОВЗ.ПолноеИмя());
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(
	 	ПараметрыПроверки,
		ПараметрыРегистрации);
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаСоответствияОрганизацияПодразделениеДаннымОВЗ

Процедура ПроверкаСоответствияОрганизацияПодразделениеДаннымОВЗ(ПараметрыПроверки) Экспорт
	
	ТекстЗапроса = РасчетСебестоимостиПостатейныеЗатраты.ТекстВТпоОВЗ() + 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочиеРасходы.Регистратор КАК Документ,
	|	ПрочиеРасходы.Организация,
	|	ПрочиеРасходы.Подразделение,
	|	ПрочиеРасходы.СтатьяРасходов,
	|	ВтОВЗ.ОВЗ КАК ОВЗ,
	|	ВтОВЗ.ОВЗ КАК ОрганизацияОВЗ,
	|	ВтОВЗ.ОВЗ КАК ПодразделениеОВЗ
	|ПОМЕСТИТЬ НеСоответствияОрганизацияПодразделениеДаннымОВЗ
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ПрочиеРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОВЗ КАК ВтОВЗ
	|		ПО ПрочиеРасходы.АналитикаРасходов = ВтОВЗ.ОВЗ
	|ГДЕ
	|	ПрочиеРасходы.Организация В (&МассивОрганизаций)
	|	И ПрочиеРасходы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ПрочиеРасходы.Организация <> ВтОВЗ.Организация
	|	ИЛИ ПрочиеРасходы.Подразделение <> ВтОВЗ.Подразделение)
	|	И ПрочиеРасходы.Активность";
	
	ИмяПоляОбъекта = "Документ";
	
	ИмяВременнойТаблицы = "НеСоответствияОрганизацияПодразделениеДаннымОВЗ";
	ШаблонТекстаОшибки  = НСтр("ru = 'В расходах организации ""%1"" за период %2 обнаружено несоответствие пары организация/подразделение в первичном документе и в настройке объекта возникновения затрат';
								|en = 'In the expenses of the company ""%1"" for the period %2, a mismatch was found between the company/business unit pair in the source document and in cost center settings'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить(ИмяПоляОбъекта,	НСтр("ru = 'Документ';
												|en = 'Document'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ОВЗ",				НСтр("ru = 'Объект возникновения затрат';
													|en = 'Cost center'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Организация",		НСтр("ru = 'Организация (док.)';
													|en = 'Company (doc.)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ОрганизацияОВЗ",	НСтр("ru = 'Организация (ОВЗ)';
													|en = 'Company (cost center)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Подразделение",	НСтр("ru = 'Подразделение (док.)';
													|en = 'Business unit (doc.)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ПодразделениеОВЗ",НСтр("ru = 'Подразделение (ОВЗ)';
												|en = 'Business unit (cost center)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(ИмяВременнойТаблицы,
																									ШаблонТекстаОшибки,
																									СписокПолей,
																									ИмяПоляОбъекта);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(ПараметрыПроверки, ПараметрыРегистрации, ТекстЗапроса);
	
КонецПроцедуры

#КонецОбласти

//-- НЕ УТ
#КонецОбласти

#Область ОбработчикиПроверкиПриЗаписи

//++ НЕ УТ
Процедура ПроверкаПриЗаписиПрочиеРасходы(Регистратор, Отказ) Экспорт
	
	#Область ТекстПроверкиПодразделенияДляПроизводственнойСтатьи
	ТекстПроверкиПодразделенияДляПроизводственнойСтатьи = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	1 КАК КодОшибки,
	|	ДД.Организация КАК Параметр2,
	|	ДД.Подразделение КАК Параметр3,
	|	ДД.НаправлениеДеятельности КАК Параметр4,
	|	ДД.СтатьяРасходов КАК Параметр5,
	|	ДД.АналитикаРасходов КАК Параметр6,
	|	НЕОПРЕДЕЛЕНО КАК Параметр7,
	|	НЕОПРЕДЕЛЕНО КАК Параметр8,
	|	НЕОПРЕДЕЛЕНО КАК Параметр9
	|ИЗ РегистрНакопления.ПрочиеРасходы КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПроизводственныеСтатьи КАК Статьи
	|	ПО ДД.СтатьяРасходов = Статьи.СтатьяРасхода
	|ГДЕ ДД.Регистратор = &Регистратор И ДД.Активность
	|	И ДД.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|";
	#КонецОбласти
	
	#Область ТекстПроверкиПартияПрошлогоПериода
	ТекстПроверкиПартияПрошлогоПериода = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	2 КАК КодОшибки,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	Партии.Документ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ РегистрНакопления.ПрочиеРасходы КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатьиНаСебестоимостьПроизводства КАК Статьи
	|	ПО ДД.СтатьяРасходов = Статьи.СтатьяРасхода
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ПартииПроизводства КАК Партии
	|	ПО ДД.АналитикаРасходов = Партии.Ссылка
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ПроизводствоБезЗаказа КАК Док
	|	ПО Партии.Документ = Док.Ссылка
	|ГДЕ ДД.Регистратор = &Регистратор И ДД.Активность
	|	И НАЧАЛОПЕРИОДА(ДД.Период, МЕСЯЦ) > НАЧАЛОПЕРИОДА(Док.Дата, МЕСЯЦ)
	|";
	#КонецОбласти

	#Область ТекстПроверкиОрганизацияПодразделениеОВЗ
	ТекстПроверкиОрганизацияПодразделениеОВЗ = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	3 КАК КодОшибки,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ РегистрНакопления.ПрочиеРасходы КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатьиНаОВЗ КАК Статьи
	|	ПО ДД.СтатьяРасходов = Статьи.СтатьяРасхода
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ОбъектыВозникновенияЗатрат КАК ОВЗ
	|	ПО ДД.АналитикаРасходов = ОВЗ.Ссылка
	|ГДЕ ДД.Регистратор = &Регистратор И ДД.Активность
	|	И (ДД.Организация <> ОВЗ.Организация ИЛИ ДД.Подразделение <> ОВЗ.Подразделение)
	|";
	#КонецОбласти
	
	ТекстыПроверок = Новый Массив();
	ТекстыПроверок.Добавить(ТекстПроверкиПодразделенияДляПроизводственнойСтатьи);
	ТекстыПроверок.Добавить(ТекстПроверкиПартияПрошлогоПериода);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат") Тогда
		ТекстыПроверок.Добавить(ТекстПроверкиОрганизацияПодразделениеОВЗ);
	КонецЕсли;
	
	ТекстыОшибок = Новый Соответствие();
	ТекстыОшибок.Вставить(1, НСтр("ru = 'Для производственной статьи расходов ""%5"" требуется указать подразделения.';
									|en = 'Please specify business unit for the production expense item ""%5"".'"));
	ТекстыОшибок.Вставить(2, НСтр("ru = 'Для статьи расходов ""%5"" в аналитике указана партия прошлого периода ""%6"". Требуется указать партию текущего или будущего периода.';
									|en = 'The dimension indicates the previous period lot ""%6"" for expense item ""%5"". Indicate the current or future period lot.'"));
	ТекстыОшибок.Вставить(3, НСтр("ru = 'Организация или подразделение объекта возникновения затрат ""%6"" не совпадают с данными документа';
									|en = 'A company or business unit of cost center ""%6"" does not match document data'"));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст = "ВЫБРАТЬ 
	|	Статьи.Ссылка КАК СтатьяРасхода
	|ПОМЕСТИТЬ ПроизводственныеСтатьи
	|ИЗ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|ГДЕ
	|	Статьи.ВариантРаспределенияРасходовУпр В (&ВариантыРаспределения)
	|	ИЛИ Статьи.ВариантРаспределенияРасходовРегл В (&ВариантыРаспределения)
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРасхода;
	|	
	|ВЫБРАТЬ 
	|	Статьи.Ссылка КАК СтатьяРасхода
	|ПОМЕСТИТЬ СтатьиНаОВЗ
	|ИЗ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|ГДЕ
	|	Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат)
	|	ИЛИ Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат)
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРасхода;
	|
	|ВЫБРАТЬ 
	|	Статьи.Ссылка КАК СтатьяРасхода
	|ПОМЕСТИТЬ СтатьиНаСебестоимостьПроизводства
	|ИЗ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|ГДЕ
	|	Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства)
	|	ИЛИ Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства)
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРасхода;
	|";
	
	Запрос.Текст = Запрос.Текст + СтрСоединить(ТекстыПроверок, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("ВариантыРаспределения", ПроизводствоСерверПовтИсп.ПолучитьПроизводственныеВариантыРаспределения());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстыОшибок.Получить(Выборка.КодОшибки),
			Регистратор,
			Выборка.Параметр2,
			Выборка.Параметр3,
			Выборка.Параметр4,
			Выборка.Параметр5,
			Выборка.Параметр6,
			Выборка.Параметр7,
			Выборка.Параметр8,
			Выборка.Параметр9);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Регистратор,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры
//-- НЕ УТ

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ НЕ УТ
//++ Устарело_Производство21

#Область БлокировкаПриОбновленииИБ

Процедура ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ПредставлениеОперации)
	
	ВходящиеДанные = Новый Соответствие;
	ВходящиеДанные.Вставить(Метаданные.Документы.ВыпускПродукции);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.РаспоряженияНаСписаниеПоНормативам);
	
	ЗакрытиеМесяцаСервер.ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ВходящиеДанные, ПредставлениеОперации);
	
КонецПроцедуры

#КонецОбласти

//-- Устарело_Производство21
//-- НЕ УТ

#КонецОбласти

